[{"thread": {"domain_rank": 14253, "replies_count": 0, "url": "http://omgili.com/ri/jHIAmI4hxg8X9DygGHC3AwY4hlzDy6AT_WSyFbpC8Lfq1rbsBmb3bIjKwQWtmHXHgvuRntlXIAsA4oJ._q0dSieAbz4qbyhYH0xOXOGUMDjplVQVkXilyw3BJe1jBQxybkAvlYJ0pXSlea37zfZp8ZZHVsdFd6pZ", "title": "Charities regulator investigates leading gay rights NGO", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://www.breakingnews.ie/rss/bn_ireland_rss.aspx", "spam_score": 0.0, "section_title": "Ireland: BreakingNews.ie", "site": "irishexaminer.com", "site_full": "www.irishexaminer.com", "performance_score": 0, "uuid": "395adee98c53dde8f06619b97debdb996caa00f7", "published": "2017-04-17T11:24:31.000+03:00", "site_categories": [], "country": "IE", "title_full": "Charities regulator investigates leading gay rights NGO", "participants_count": 1, "main_image": "/remote/media.central.ie/media/images/g/GayCoupleExam130515_large.jpg?width=600&s=bn-786040"}, "url": "http://omgili.com/ri/jHIAmI4hxg8X9DygGHC3AwY4hlzDy6AT_WSyFbpC8Lfq1rbsBmb3bIjKwQWtmHXHgvuRntlXIAsA4oJ._q0dSieAbz4qbyhYH0xOXOGUMDjplVQVkXilyw3BJe1jBQxybkAvlYJ0pXSlea37zfZp8ZZHVsdFd6pZ", "title": "Charities regulator investigates leading gay rights NGO", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:24:31.000+03:00", "language": "english", "entities": {"locations": [{"name": "ireland", "sentiment": "none"}], "persons": [{"name": "glen", "sentiment": "negative"}, {"name": "joyce fegan", "sentiment": "none"}, {"name": "duggan", "sentiment": "none"}, {"name": "áine duggan", "sentiment": "none"}], "organizations": [{"name": "charities regulator", "sentiment": "none"}, {"name": "lesbian equality network", "sentiment": "none"}, {"name": "ngo", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "395adee98c53dde8f06619b97debdb996caa00f7", "published": "2017-04-17T11:24:31.000+03:00", "author": "BreakingNews.ie", "text": "Ireland Home \nThe Charities Regulator is investigating Glen, the Gay and Lesbian Network, as the NGO puts “new financial procedures” in place, \nGlen, which aims to help shape national policy for lesbian, gay, bisexual, trans, and intersex (LGBTI) people in Ireland, is co-operating with the regulator following its own internal review. \nIn a statement issued by the board of Glen, the group confirmed the regulator was examining the governance of the network. \n“The board of the Gay and Lesbian Equality Network confirms that we have received a request from the Charities Regulator for information regarding the governance of the organisation,” said the statement. \n“This arises from a request to the regulator for guidance following an internal review.” \nGlen was a leading campaigner for marriage equality during the 2015 referendum. \nThe statement also said that the request to the regulator for guidance was done on the instruction of Glen’s board. \n“The request was made on the instructions of the board of Glen, which is fully co-operating with the regulator,” it stated. \n“The process is ongoing and we will work with the regulator to implement any recommended changes in our procedures.” \nThe internal review of the NGO is understood to have shown up various issues of a financial nature. \nThese issues were alluded to in the board’s statement as the NGO receives State funding, which comes with stringent obligations. \n“The board and staff of Glen have always been mindful of our statutory obligations,” said the board’s statement. \n“The board is satisfied that all grants received have been used for the intended purpose and has no reason to suspect there has been any misappropriation of funds. \n“Notwithstanding this, we have also put in place new financial procedures to enhance our administrative systems, including the appointment of specialist accountants.” \nGlen’s recently appointed executive director, Áine Duggan, has decided to step down from her post, according to the board. \nIt is understood that Ms Duggan brought a number of irregularities at the NGO to the attention of her board. \nShe then recommended that the issues be brought to the attention of the Charities Regulator. \nIn the statement from Glen’s board yesterday, the NGO indicated that Ms Duggan had decided to resign from her role but acknowledged her contribution to the internal review. \nAn interim executive director will now be appointed following Ms Duggan’s departure. \nThe board said that, despite recent social progress such as the marriage equality referendum, when it comes to equality there is still a need for Glen. \n“Notwithstanding the result of the marriage-equality referendum and progressive social change in recent years, there is still a need for a well-resourced, ambitious national organisation and our focus in the coming months will be the ongoing development of Glen,” said the statement. \nGlen was founded in 1988 with the purpose of securing legislative changes that would bring about equality for the LGBTI population in Ireland. \nSome of its significant achievements include campaigning for the decriminalisation of homosexuality. \nThis article first appeared in the Irish Examiner. "}]