[{"entities": {"locations": [{"name": "singapore", "sentiment": "none"}, {"name": "singapore  proct", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "asia pacific region", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "p&g", "sentiment": "negative"}, {"name": "p&g asia pacific", "sentiment": "none"}, {"name": "edb", "sentiment": "none"}, {"name": "& gamble", "sentiment": "none"}, {"name": "medium enterprises", "sentiment": "none"}, {"name": "singapore economic development board", "sentiment": "none"}, {"name": "p&g malaysia", "sentiment": "none"}], "persons": [{"name": "vivienne tay", "sentiment": "negative"}, {"name": "marc pritchard", "sentiment": "none"}, {"name": "beh", "sentiment": "none"}, {"name": "suranjan", "sentiment": "none"}, {"name": "beh swan gin", "sentiment": "none"}, {"name": "magesvaran suranjan", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.marketing-interactive.com", "site_section": "http://www.marketing-interactive.com/feed/?post_type=trending", "domain_rank": 31759, "replies_count": 0, "country": "SG", "section_title": "Marketing Interactive", "title": "What P&G’s US$100m digital innovation centre means for Singapore", "title_full": "What P&G’s US$100m digital innovation centre means for Singapore", "published": "2017-04-19T08:38:04.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg.87ohzHzuPF9QQrdnO1var7U9okhzBS5c7Lt1pAuM_ViF5VPy0GBpYs47gl7vKuYAMFoNtV2Hqdfo3EfAxhTl7yyARe7bDBhYWm3JgFKB96i3eWJSU7NCQp_MiE5bbBow-", "site": "marketing-interactive.com", "main_image": "http://images.marketing-interactive.com.s3.amazonaws.com/wp-content/uploads/2017/04/PG-700x420.jpg", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "0b57d5599bffbfd44dfb10ec9e04eed163420e08", "site_type": "news"}, "title": "What P&G’s US$100m digital innovation centre means for Singapore", "published": "2017-04-19T08:38:04.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg.87ohzHzuPF9QQrdnO1var7U9okhzBS5c7Lt1pAuM_ViF5VPy0GBpYs47gl7vKuYAMFoNtV2Hqdfo3EfAxhTl7yyARe7bDBhYWm3JgFKB96i3eWJSU7NCQp_MiE5bbBow-", "author": "Vivienne Tay", "crawled": "2017-04-19T08:38:04.000+03:00", "language": "english", "text": "in Singapore by Vivienne Tay What P&G’s US$100m digital innovation centre means for Singapore \nProcter & Gamble (P&G) has launched its first digital innovation centre in Singapore. This new centre, which is the first outside of the US, is called E-Center and was created in partnership with the Singapore Economic Development Board (EDB). \nThe new centre will see an investment of over US$100 million over the next five years. P&G also said in a statement that the launch reaffirms its commitment to Singapore, and aims to strengthen Singapore’s standing as a leading digital and e-commerce hub in the world. \n“Singapore has been an important and strategic market for P&G, and will continue to be a key focus market for P&G. It is home to our Asia Pacific headquarters, two manufacturing sites in Tuas, and the Singapore Innovation Center,” Nicolas Defauw, P&G Asia Pacific vice president for finance & accounting, said. \nHe added that the launch of the E-Center kicks off its 30 th year anniversary in Singapore, and is in line with its commitment to grow its presence in Singapore and Asia Pacific. \nMeanwhile, Magesvaran Suranjan, P&G Asia Pacific president, said P&G has deep ties with Singapore and the local community, and its partnerships with various enterprises and institutions here have been “instrumental to its success in the region”. \nAccording to a statement, the new centre will be pivotal to its undertaking of end-to-end digital innovation across three core areas. These are e-business, e-analytics and supply chain management. \nThe e-business unit aims to translate digital strategies into scalable plans for the region, and to leverage new digital channels to innovate and improve business models.The e-Business pillar will translate brand strategies into plans scalable for the region. It will work as a brand command center which leverages digital solutions to combine business data and consumer insights real-time. A dedicated e-Business team in Singapore has also been formed to lead end-to-end innovation across all product categories. \nThis will also culminate in the formation of a Consumer Experience Center – which is led by SK-II brand division. The Consumer Experience Center provides a real-time overview of the state of business, and what P&G consumers are saying. \nAnother area of focus for the new centre is on e-analytics. The E-Center will also leverage predictive analytics and big data to optimise product distribution and marketing strategy. It will leverage on predictive analytics and big data to optimise product distribution and marketing strategies across Asia Pacific. This includes in-store analytics which involves an image recognition algorithm to drive more granular data that P&G uses to identify key opportunities in-store, while cutting down on cost. \nIt will also utilise neighborhood analytics which sees P&G combining maps with demographics data (e.g. population density, age, ethnicity), stores in the neighborhood (e.g. distance between stores), and internal store data to establish the characteristics of each neighborhood. This data is used to determine the potential reach and sales growth of each neighborhood to prioritise store distribution. \nIn the area of supply chain management, the E-Center will focus on transforming P&G’s supply chain end-to-end. This is in hopes of greater accuracy, visibility and a more efficient processes. The focus follows statements made by Marc Pritchard, P&G’s chief brand officer, where he said the company will be reviewing all of its agency contracts this year in a bid to drive a more cleaner media supply chain and transparent digital measurement. \nIn his statements, he called the state of the media supply chain “murky at best” and “fraudulent at worst”. He as such, demanded for better advertising to drive growth. He added that this would happen only if enabled by media transparency to drive a “clean and productive” media supply chain and “invest the time and money” into better advertising for growth. \n(Read also: P&G Malaysia to adopt Media Rating Council viewability standards ) \nWith the launch, P&G will be training 40 employees in the first year to undertake digital-related roles in these three capability areas. Through the E-Center, P&G will also expand its partnerships with local Small and Medium Enterprises (SMEs) and start-ups to strengthen digital capabilities and co-develop new digital solutions. \nAccording to Beh Swan Gin, chairman of EDB, the new launch will create new jobs in fields such as data analytics that are aligned with Singapore’s efforts to strengthen the country’s digital capabilities. \n“We are pleased that P&G has chosen to establish its first E-Center outside of the US, in Singapore. Through digital innovation in supply chain management, e-Analytics and e-Business, the centre will drive transformation of P&G’s operations in the region,” EDB’s Beh added. \n“We are delighted to be able to contribute to building Singapore’s digital innovation capabilities through our E-Center and, in parallel, our second Leadership College to equip SMEs with relevant skills and knowledge required to tap burgeoning opportunities in the e-Commerce and digital space,” Suranjan said.", "external_links": [], "highlightTitle": "", "uuid": "0b57d5599bffbfd44dfb10ec9e04eed163420e08", "highlightText": "", "rating": null}]