[{"rating": null, "external_links": [], "crawled": "2017-04-16T08:42:01.000+03:00", "author": "CrystalBee (noreply@blogger.com)", "entities": {"persons": [{"name": "wren levi", "sentiment": "none"}, {"name": "helenkay dimon", "sentiment": "none"}, {"name": "helen", "sentiment": "none"}, {"name": "kay dimon", "sentiment": "none"}, {"name": "emery finn", "sentiment": "none"}, {"name": "emery", "sentiment": "none"}, {"name": "wren", "sentiment": "none"}], "locations": [{"name": "earth", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "b&n", "sentiment": "none"}, {"name": "books-a-million", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "cosmo", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "text": "\"I should kidnap you more often.\" - Wren Levi\n\nThe Fixer \nSeries: Games People Play #1\nAuthor: HelenKay Dimon\nPublisher: Avon Books\nRelease Date: December 27, 2016\nSource: Publisher for Review\n\nBuy Links: Amazon - B&N - iTunes  - Kobo  - Google Play \nBooks-A-Million - IndieBound \nAdd to Goodreads \n\nHe’s known only as Wren. A wealthy, dangerously secretive man, he specializes in making problems disappear. A professional fixer, Wren hides a dark past, but his privacy is shattered when Emery Finn seeks him out—and what she wants from him is very personal. \n\nSome people disappear against their will. Emery’s job is to find them and bring closure. Wren is the only person who can help solve Emery’s own personal mystery: the long-ago disappearance of her cousin. Just tracking down the sexy, brooding Wren is difficult enough. Resisting her body’s response to him will prove completely impossible.\n\nAnonymity is essential to Wren’s success, yet drawn by Emery’s loyalty and sensuality, he’s pulled out of the shadows. But her digging is getting noticed by the wrong people. And as the clues start to point to someone terrifyingly close, Wren will have to put his haunted past aside to protect the woman he loves.\n\n\n\nI feel like I'm a bit weird, but it is rare for me to marathon a series, especially romantic suspense. I will most likely do a blog post about this, but it all stems from a series that I read in the past and it left me in a fog of \"what the heck just happened?\" Ever since, there's never been a series that has made me want to devour all the books in record time. Why am I saying this? Well, that flew out the window when I finished The Fixer . The minute I put it down, I immediately wanted the next book. In fact, if all of the books were out, I would have spent the week reading the entire series. That is how much I flipping loved this book. I wanted to forget all my hang-ups about marathons and hibernate until I finished them. It's a good thing there is a bit of a wait or my family would have to send out a search and rescue team. Oh, can I request Wren? He can find me any day of the week and twice on Sunday... \nOkay, I fear that I've gone way off point now... \nI am a relatively new-ish fan of HelenKay Dimon, but she's been on my \"need to read\" list for sometime now. After finishing The Fixer , she's now an auto-buy for me and a new favorite romantic suspense author. HelenKay's writing style is phenomenal. I loved the mixture of intensity and lighthearted moments. I love that Wren is a whole bag of goodness. He's sexy, but adorably clueless. He's total alpha with a bit of awkwardness, especially when it comes to Emery. I loved that he's all take charge, but knows Emery could easily kick his ass if he ticks her off. Emery is tenacious. She's determined to find the truth about her cousin and will go to the end of the Earth to get justice. She will go toe-to-toe with anyone that dares step in her way. You'd think these two characters would butt-heads, right? They do, but in the sexiest way. Three words... Suit. Strip. Scene. Two more words... Hell. Yes! I can go on about what I loved with The Fixer , but trust me, if you are a fan of romantic suspense books that make you laugh and swoon while keeping you guessing, then you will love this book.  \n\nHelenKay Dimon is a divorce lawyer-turned-romance author. After dedicating years to helping people terminate relationships she now writes romance novels full time. Her books have earned praise, appeared on bestseller lists, won numerous awards and twice been named Red-Hot Reads and excerpted in Cosmo. She sometimes writes erotic romance, sometimes writes romantic suspense and sometimes writes contemporary romance. But no matter what she's writing her books are always filled with smart banter and sexy times, and a HEA is guaranteed. \nWebsite - Facebook - Twitter - Instagram  - Pinterest \nComing Soon ", "url": "http://omgili.com/ri/jHIAmI4hxg.ByjJNnkI0dgJ2xZTjPZPerbEJRLr4DSRGNl32r6VzXw2HP9lX8l5LGCo1pxBZbatYJBSLRaUoHvAgTHjG7XA6AHsUFmagBO74KzEavFI8.A--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T08:42:01.000+03:00", "language": "english", "title": "Review: The Fixer (Games People Play #1) by HelenKay Dimon", "thread": {"title_full": "Review: The Fixer (Games People Play #1) by HelenKay Dimon", "site_full": "www.crystalblogsbooks.com", "site": "crystalblogsbooks.com", "site_section": "http://www.crystalblogsbooks.com/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "", "section_title": "Crystal Blogs Books", "url": "http://omgili.com/ri/jHIAmI4hxg.ByjJNnkI0dgJ2xZTjPZPerbEJRLr4DSRGNl32r6VzXw2HP9lX8l5LGCo1pxBZbatYJBSLRaUoHvAgTHjG7XA6AHsUFmagBO74KzEavFI8.A--", "published": "2017-04-16T08:42:01.000+03:00", "title": "Review: The Fixer (Games People Play #1) by HelenKay Dimon", "uuid": "51cd6a9147539d5364fb44cee8c8f23d6075c6c8", "main_image": null}, "uuid": "51cd6a9147539d5364fb44cee8c8f23d6075c6c8", "ord_in_thread": 0}]