[{"entities": {"persons": [{"sentiment": "none", "name": "jason watkins"}, {"sentiment": "none", "name": "jason"}], "organizations": [{"sentiment": "negative", "name": "daily news"}, {"sentiment": "none", "name": "unique business evolution"}, {"sentiment": "none", "name": "cube"}], "locations": [{"sentiment": "none", "name": "wanaka"}]}, "text": "April 18,   Comments Off on The CUBE Launches Business Mentors Initiative \nPress Release – CUBE \nIt was announced today that the Centre of Unique Business Evolution (CUBE) has launched a Business Mentoring initiative for the Upper Clutha community. The free initiative is open to all start-ups and businesses and the CUBE will match participants with … The CUBE Launches Business Mentors Initiative \nIt was announced today that the Centre of Unique Business Evolution (CUBE) has launched a Business Mentoring initiative for the Upper Clutha community. The free initiative is open to all start-ups and businesses and the CUBE will match participants with experienced business people that can act as a sounding board for people’s ideas. \nJason Watkins, Business Development Manager of the CUBE says “this business mentoring initiative has been in the making for some months and I have been absolutely blown away by the level of interest shown by potential mentors once they had heard about our plan to offer business mentoring for our community”. There are almost 20 mentors in the pool that Jason has assembled and they come with a broad range of experience and expertise in business. Jason commented “we have always thought that Wanaka was a place that talent comes to live and the mentor pool is a reflection of this and we are very lucky to have so many exceptional business people volunteering their time to become mentors”. \nPeople wanting to be considered to have a business mentor are asked to register their interest online via the CUBE website ( www.cubewanaka.co.nz ). Applicants circumstances and requirements will be reviewed and assuming there is a suitable mentor available at the time, a match is found. Jason says “this mentor initiative has a high degree of flexibility for both parties (the mentee and the mentor) and this will hopefully ensure we get the best matches possible and that the mentoring engagement benefits are maximised”. \nJason encouraged anyone involved in a start-up or trading business to visit the CUBE website and see if having a mentor could help them with their business endeavours. “From my experience, many people in business I meet, often talk about how it would be great to run their ideas past someone who is independent and unbiased (not necessarily family and friends) and this is where the real value of mentoring lies”. \nThe CUBE is excited to develop this latest initiative in support of the local business community and believe it is a fantastic addition to it’s current offerings. Jason commented “it’s a fundamental objective of the CUBE to assist in the capability development of the business community and we do this by offering business support initiatives. We know that the development of capability within local businesses is a long-term undertaking. However, the development we see from people and businesses through our other initiatives like the Cell and Co.Starters tells us people are actively seeking help and are appreciative of the support the CUBE provides”. \nENDS", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "0372171b2d9124a4d88d01a2c7146d1722b78e5e", "rating": null, "highlightTitle": "", "title": "The CUBE Launches Business Mentors Initiative", "thread": {"country": "NZ", "site": "scoop.co.nz", "replies_count": 0, "title_full": "The CUBE Launches Business Mentors Initiative", "site_categories": [], "performance_score": 0, "section_title": "Community Scoop", "domain_rank": 64392, "uuid": "0372171b2d9124a4d88d01a2c7146d1722b78e5e", "main_image": "", "site_type": "blogs", "title": "The CUBE Launches Business Mentors Initiative", "spam_score": 0.0, "site_section": "http://community.scoop.co.nz/feed/", "url": "http://omgili.com/ri/0xd.sZhj5je.krt0vaog65xY1BeqTy6wOb3ikznrn6_fMdy2uwB9Ma902L_giSr04YsJTg5ZXnWPH_X7ZzHx8VgwNnhhy4Ma7sAtvd30khb0RECzaxV.Kg--", "participants_count": 1, "site_full": "community.scoop.co.nz", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T01:01:00.000+03:00"}, "crawled": "2017-04-18T11:26:40.000+03:00", "url": "http://omgili.com/ri/0xd.sZhj5je.krt0vaog65xY1BeqTy6wOb3ikznrn6_fMdy2uwB9Ma902L_giSr04YsJTg5ZXnWPH_X7ZzHx8VgwNnhhy4Ma7sAtvd30khb0RECzaxV.Kg--", "highlightText": "", "published": "2017-04-18T01:01:00.000+03:00", "author": "ScoopBlogPush"}]