[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:27:43.000+03:00", "author": "Fuseworks Media", "entities": {"persons": [{"name": "nelson", "sentiment": "none"}, {"name": "april clark", "sentiment": "none"}, {"name": "georgina griffiths", "sentiment": "none"}, {"name": "cyclone cook", "sentiment": "none"}], "locations": [{"name": "new zealand", "sentiment": "none"}, {"name": "bay of plenty", "sentiment": "none"}, {"name": "whitianga", "sentiment": "none"}, {"name": "whakatane", "sentiment": "none"}, {"name": "south island", "sentiment": "none"}, {"name": "north island", "sentiment": "none"}, {"name": "taranaki", "sentiment": "none"}], "organizations": [{"name": "metservice", "sentiment": "none"}, {"name": "metservice tv", "sentiment": "none"}, {"name": "metservice", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "text": "Fuseworks Media Sunday, 16 April, 2017 - 15:51 \nIn the wake of last week, the weather looking ahead is a lot closer to \"normal\" for New Zealand autumn. A low to the west of Taranaki is expected to track east tomorrow, bringing showers and possible hail for a time to some North Island and northern South Island areas. Further south a cold front and southerlies bring cloud and scattered rain to the east coast today before breaking to fine tomorrow, though a few showers linger in the south as another, weaker cold front moves northward. \nThe first half of April has been a wet one with two major systems crossing New Zealand. The remnants of Cyclone Debbie affected a widespread area of the North Island early this month and the latest combination of a slow moving low in the Tasman sea with the short sharp hit from Cyclone Cook has led to above average rainfall for a lot of regions. \nA quick look at the cumulative rainfall, most areas north of Bay of Plenty along the east coast have received over double their monthly averages. Whakatane has recorded 267mm of rain so far this month (average rainfall for the whole of the month of April is 117mm) and Whitianga 338mm (April average is 168mm) which are both the highest on record for the month of April since 1991. This last week the South Island didn’t get off ‘scot free’ either with Nelson getting an unusual 153mm already this month (about triple their April average). More can be found on the week that was and the impacts of Cyclone Cook on our blog http://info.metraweather.com/e/60812/CycloneCookSummary/cpjlvd/526802411. \nIt does look as if a more regular weather pattern of predominating westerlies will be the recipe for the later part of April as Georgina Griffiths predicted in our rural monthly outlook (available at http://info.metraweather.com/e/60812/MonthlyOutlook/cpjltn/526802411). \"Though showers are expected for those hard hit areas of Bay of Plenty over the next couple of days, with isolated thunderstorms possible, a ridge pushing onto the country on Tuesday marks a more settled weather pattern for the area and generally the country\" said April Clark, meteorologist at Metservice. \nMean sea level pressure and rain fall chart for midnight Monday, showing the ridge (and more settled weather) building over New Zealand. \nOfficial Severe Weather Watches and Warnings are reviewed and re-issued by MetService at least every twelve hours, and more often if necessary. To get the most up to date information on severe weather around the country, or any other forecasts, see metservice.com or on mobile devices at m.metservice.com. You can also follow our updates on MetService TV, at MetService New Zealand on Facebook, @metservice and @MetServiceWARN on Twitter and at blog.metservice.com \nMetService issues Warnings, Watches and Outlooks for severe weather over New Zealand. \nWarnings are about taking action when severe weather is imminent or is occurring. They are issued only when required. \nRecommendation: ACT \nWatches are about being alert when severe weather is possible, but not sufficiently imminent or certain for a Warning to be issued. They are issued only when required. \nRecommendation: BE READY \nOutlooks are about looking ahead, providing advance information on possible future Watches and/or Warnings. They are issued routinely once or twice a day. \nRecommendation: PLAN \nAll articles and comments on Voxy.co.nz have been submitted by our community of users. Please notify us through our contact form if you believe an item on this site breaches our community guidelines .", "url": "http://omgili.com/ri/jHIAmI4hxg88VvdhBjvnvJumLNPK9fDe2B.3e99XzNLQ2FOn9VNRsw--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:27:43.000+03:00", "language": "english", "title": "Back to 'normal' Autumn weather pattern", "thread": {"title_full": "Back to 'normal' Autumn weather pattern", "site_full": "www.voxy.co.nz", "site": "voxy.co.nz", "site_section": "http://www.voxy.co.nz/taxonomy/term/1/all/feed", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "NZ", "section_title": "Voxy.co.nz - National", "url": "http://omgili.com/ri/jHIAmI4hxg88VvdhBjvnvJumLNPK9fDe2B.3e99XzNLQ2FOn9VNRsw--", "published": "2017-04-16T09:27:43.000+03:00", "title": "Back to 'normal' Autumn weather pattern", "uuid": "4d952f390dac2845b650202c7cc3d78dafa0fa0d", "main_image": ""}, "uuid": "4d952f390dac2845b650202c7cc3d78dafa0fa0d", "ord_in_thread": 0}]