[{"entities": {"persons": [{"sentiment": "negative", "name": "mike penc"}, {"sentiment": "none", "name": "donald trump"}, {"sentiment": "none", "name": "david lawder"}, {"sentiment": "none", "name": "abe"}, {"sentiment": "none", "name": "victor smith"}, {"sentiment": "none", "name": "kiyoshi takenaka"}, {"sentiment": "none", "name": "wilbur ross"}, {"sentiment": "none", "name": "hiroshige seko"}, {"sentiment": "none", "name": "pence"}, {"sentiment": "none", "name": "tetsushi kajimoto"}, {"sentiment": "none", "name": "trump"}, {"sentiment": "none", "name": "barack obama"}, {"sentiment": "none", "name": "shinzo abe"}, {"sentiment": "none", "name": "paul tait"}, {"sentiment": "none", "name": "taro aso"}, {"sentiment": "none", "name": "hyunjoo jin"}, {"sentiment": "none", "name": "linda sieg"}, {"sentiment": "none", "name": "toni reinhold"}, {"sentiment": "none", "name": "ross"}, {"sentiment": "none", "name": "aso"}, {"sentiment": "none", "name": "leika kihara"}], "organizations": [{"sentiment": "none", "name": "u.s. commerce"}, {"sentiment": "none", "name": "fta"}, {"sentiment": "none", "name": "treasury department"}, {"sentiment": "none", "name": "tpp"}, {"sentiment": "none", "name": "korea automobile manufacturers association"}, {"sentiment": "none", "name": "subaru"}, {"sentiment": "none", "name": "toyota"}, {"sentiment": "none", "name": "white house"}, {"sentiment": "none", "name": "u.s. treasury department"}, {"sentiment": "none", "name": "honda"}, {"sentiment": "none", "name": "trump"}], "locations": [{"sentiment": "none", "name": "tokyo"}, {"sentiment": "none", "name": "u.s."}, {"sentiment": "none", "name": "japan"}, {"sentiment": "none", "name": "indiana"}, {"sentiment": "none", "name": "united states"}, {"sentiment": "none", "name": "seoul"}, {"sentiment": "none", "name": "washington"}, {"sentiment": "none", "name": "south"}, {"sentiment": "none", "name": "white house"}, {"sentiment": "none", "name": "indiana"}, {"sentiment": "none", "name": "washington"}, {"sentiment": "none", "name": "north korea"}, {"sentiment": "none", "name": "south korea"}, {"sentiment": "none", "name": "tokyo"}, {"sentiment": "none", "name": "asia"}, {"sentiment": "none", "name": "seoul"}, {"sentiment": "none", "name": "china"}, {"sentiment": "none", "name": "jakarta"}, {"sentiment": "none", "name": "america"}, {"sentiment": "none", "name": "north"}, {"sentiment": "none", "name": "australia"}, {"sentiment": "none", "name": "sydney"}]}, "text": "Start Your Email Marketing, Create, Send & Track your Results‎ \nTOKYO: U.S. Vice President Mike Pence kicked off talks with Japan on Tuesday the White House hopes will open doors for U.S. goods and attract infrastructure investment, after seeking to reassure Washington’s key ally amid rising tensions over North Korea. \nPence first joined a working lunch with Prime Minister Shinzo Abe before meeting Deputy Prime Minister Taro Aso for economic talks that the vice president said he hoped would yield a framework for further dialogue. \nEarlier, U.S. Commerce Secretary Wilbur Ross met Japan’s trade minister, Hiroshige Seko. Ross, seen as more hardline on trade, told reporters Washington was eager to increase trade ties with Tokyo through a two-way agreement. \nPence landed in Tokyo from South Korea after a trip that included a visit to the heavily fortified border separating the North and South. He described the U.S.-Japan alliance as the “cornerstone” of regional security. \nPence’s 10-day tour of Asia is aimed at emphasizing that U.S. President Donald Trump wants to boost U.S. trade in the region even though Trump has abandoned the 12-nation Trans-Pacific Partnership (TPP) trade pact. \nAdvocates for the TPP, negotiated by former President Barack Obama and supported by Abe, said it would have opened markets for American exports. U.S. business groups supported the deal but U.S. labor unions argued it would hurt American workers. \nTrump campaigned for office on an “America First” platform, saying he would boost U.S. manufacturing jobs and shrink the country’s trade deficit with countries like Japan. \nTrump also vowed to renegotiate existing regional trade deals to focus on bilateral agreements. Tokyo is wary of a two-way free trade agreement (FTA), fearing it would boost pressure to open up politically sensitive sectors such as agriculture. \n“It’s a little bit early to say just what forms things will take but we are certainly eager to increase our trade relationships with Japan and to do so in the form of an agreement,” Ross said when asked about a possible FTA. \nTRADE IMBALANCES \nJapan had a US$69 billion trade surplus with the United States last year, the U.S. Treasury Department said, expressing concern over what it called the “persistence” of the imbalance. \nJapanese officials counter that Tokyo accounts for a much smaller chunk of America’s deficit than in the past, while China’s imbalance is much bigger. \nTrump has complained that Japan keeps its currency artificially low, although a Treasury Department report last week did not label Japan a currency manipulator. The issue was not expected to be raised in talks on Tuesday. \nPence said in Seoul earlier on Tuesday the Trump administration would review and reform a 5-year-old free trade agreement with South Korea. \nThe Korea Automobile Manufacturers Association expressed concern about any review of the pact, which removed tariffs on auto trade between the two countries. \nTrump and Abe agreed in February to have Pence and Aso, who is also Japan’s finance minister, open an economic dialogue. The two sides were expected to agree on principles and a process for further detailed discussions between ministries. \n“Obviously, the first high-level talk is not going to have an immediate resolution of anything but I think we have a reasonable path forward,” Ross said. \nAso told reporters before the talks he would not discuss any bilateral free trade deal with Pence. The White House adviser said Tuesday’s talks would not prescribe a free-trade deal but talks might eventually lead to such negotiations. \nINDIANA TIES \nPence developed ties with Japanese business and political leaders as governor of Indiana, a state that is home to Subaru , Honda and Toyota plants, and about 260 Japanese companies employing about 60,000 residents. \n“To some extent, we want to do for the United States what we did for Indiana,” the White House adviser said. \nIndiana is the top U.S. state for per-capita foreign direct investment from Japan, including higher-technology and better-paying manufacturing jobs, said Victor Smith, Pence’s commerce secretary when he led the state. \nThe Trump administration wants to attract more foreign direct investment, hoping to lure some with a US$1 trillion plan to rebuild U.S. roads, bridges and other infrastructure. \nPence will take that message to upcoming stops this week in Jakarta and Sydney. While no immediate announcements are expected from Tokyo, the White House expects a “handful” of investment announcements while Pence is in Australia at the weekend, the adviser said. \nHe is due to meet corporate leaders at each of his stops to reassure businesses that trade in the United States is worth their while. \n“Part of the trip is the very big symbolism of listening,” a White House adviser said. “We’re not pivoting away from the region.” \n(Additional writing by Linda Sieg; Additional reporting by Kiyoshi Takenaka, Leika Kihara and Tetsushi Kajimoto in TOKYO, Hyunjoo Jin in SEOUL and David Lawder in WASHINGTON; Editing by Toni Reinhold and Paul Tait)", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "0a3b1efd96d821ae58e8d8080a9760a3d065df20", "rating": null, "highlightTitle": "", "title": "Pence kicks off Japan talks, seeking to boost trade", "thread": {"country": "MY", "site": "channelnewsasia.com", "replies_count": 0, "title_full": "Pence kicks off Japan talks, seeking to boost trade", "site_categories": [], "performance_score": 0, "section_title": "sme.org.my » News", "domain_rank": 6036, "uuid": "0a3b1efd96d821ae58e8d8080a9760a3d065df20", "main_image": "http://sme.org.my/cms/wp-content/uploads/2017/04/u-s-vice-president-mike-pence-meets-with-japan-s-prime-minister.jpg", "site_type": "news", "title": "Pence kicks off Japan talks, seeking to boost trade", "spam_score": 0.0, "site_section": "http://sme.org.my/category/news/feed", "url": "http://omgili.com/ri/jHIAmI4hxg90XV3OsZ1yecjVXH0razWUF0fjqN7wiOIWP6Kcasjb1Pdv7IdMGMIRGbV4NpwbsKZZJrX3GXqCyJkJWfJTaa9g.5H679ub_C80TaAr90RG2avLl_L1jrdvfc.wVwA0_b7VbUcwnjMD5LOwN_FItY_eR_.Jw.UVpbo-", "participants_count": 1, "site_full": "www.channelnewsasia.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T06:25:00.000+03:00"}, "crawled": "2017-04-18T11:26:54.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg90XV3OsZ1yecjVXH0razWUF0fjqN7wiOIWP6Kcasjb1Pdv7IdMGMIRGbV4NpwbsKZZJrX3GXqCyJkJWfJTaa9g.5H679ub_C80TaAr90RG2avLl_L1jrdvfc.wVwA0_b7VbUcwnjMD5LOwN_FItY_eR_.Jw.UVpbo-", "highlightText": "", "published": "2017-04-18T06:25:00.000+03:00", "author": "Channel News Asia"}]