[{"entities": {"locations": [{"name": "pennsylvania", "sentiment": "none"}, {"name": "erie", "sentiment": "none"}, {"name": "mcdonald's", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "erie county", "sentiment": "none"}, {"name": "san jose", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "pennsylvania state police", "sentiment": "none"}, {"name": "reuters  erie", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}], "persons": [{"name": "steve stephens", "sentiment": "none"}, {"name": "william teper jr", "sentiment": "none"}, {"name": "teper", "sentiment": "none"}, {"name": "godwin", "sentiment": "none"}, {"name": "stephens", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}, {"name": "robert godwin sr", "sentiment": "none"}, {"name": "robby miller", "sentiment": "none"}, {"name": "brenda haymon", "sentiment": "none"}, {"name": "beech brook", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.thestar.com.my", "site_section": "http://www.thestar.com.my/RSS/Editors-Choice/Tech", "domain_rank": 4704, "replies_count": 0, "country": "MY", "section_title": "The Star Online Tech Highlights", "title": "Suspect in Facebook video murder kills self in Pennsylvania: police", "title_full": "Suspect in Facebook video murder kills self in Pennsylvania: police", "published": "2017-04-19T08:38:59.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg.uirYnf46ccUom_FcwAk17HFImDKMcjHiFsVFU.9am2Wfu3do.sYJocbljYcxZsC.EvK0WENnxVz233Wdd9vKvAceY6LtqCQ5sXaneO8t6OaA_gON9IMvFVIxkec0TrvYL1CdNQTN3bqatYALEeL90", "site": "thestar.com.my", "main_image": "http://www.thestar.com.my/~/media/online/2017/04/19/05/21/dcx_doc6uk5sb8sertf6i40lb1.ashx/", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 0, "performance_score": 0, "spam_score": 0.0, "uuid": "c9b54fc0b36e8b1ae2679013c3e9f3450c2f42e2", "site_type": "news"}, "title": "Suspect in Facebook video murder kills self in Pennsylvania: police", "published": "2017-04-19T08:38:59.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg.uirYnf46ccUom_FcwAk17HFImDKMcjHiFsVFU.9am2Wfu3do.sYJocbljYcxZsC.EvK0WENnxVz233Wdd9vKvAceY6LtqCQ5sXaneO8t6OaA_gON9IMvFVIxkec0TrvYL1CdNQTN3bqatYALEeL90", "author": "", "crawled": "2017-04-19T08:38:59.000+03:00", "language": "english", "text": "  1:25 PM Suspect in Facebook video murder kills self in Pennsylvania: police A coroner examining the car of a fugitive, who police said posted a video of himself on Facebook killing an elderly man in Cleveland, after he shot and killed himself following a brief police pursuit in Erie, Pennsylvania. — Reuters \nERIE, Pennsylvania: A murder suspect who police said posted a video on Facebook of the killing of a Cleveland man fatally shot himself after a \"brief pursuit\" by Pennsylvania State Police officers on April 18, police said. \nSteve Stephens was accused of shooting Robert Godwin Sr, 74, on a sidewalk on April 16 before fleeing in a car and uploading a video of the murder to Facebook, becoming the focus of a nationwide manhunt. \nPennsylvania State Police officers found Stephens in Erie County, Pennsylvania, after getting a tip around 11am local time from a \"concerned citizen\" who saw Stephens at a McDonald's, Major William Teper Jr of the Pennsylvania State Police told a news conference on Tuesday afternoon. Local media said an employee at the restaurant's drive-through window called police. \nStephens had left the restaurant but stopped briefly when officers located his car nearby. He sped away, and police then hit his car with their vehicle, causing him to lose control and spin out, at which point Stephens shot himself, Teper said. \nStephens, who had no prior criminal record, was not suspected in any other killings, Cleveland officials said. Stephens said in a separate video on Facebook on Sunday that he had already killed a dozen others. \nThe shooting marked the latest video clip of a violent crime to turn up on Facebook, raising questions about how the world's biggest social media network moderates content. \nThe company will do all it can to prevent content like Stephens' post, chief executive Mark Zuckerberg told Facebook's annual conference for software developers on Tuesday in San Jose, California. \nFacebook on April 17 said it would review how it monitors violent footage and other objectionable material in response to the killing after Stephens' post was visible on the social media site for about two hours. \nStephens is not believed to have known Godwin, a retired foundry worker who media reports said spent Easter Sunday morning with his son and daughter-in-law before he was killed. \nBeech Brook, a behavioural health facility in a Cleveland suburb where Stephens had worked since 2008, said in a statement on Tuesday that Stephens had cleared an extensive background check. \nIn interviews, some of Godwin's relatives forgave his killer. \n\"I forgive him because we are all sinners,\" Robby Miller, Godwin's son, said in an interview with CNN. \nOthers were less sympathetic. \n\"All I can say is that I wish he had gone down in a hail of 100 bullets,\" Godwin's daughter, Brenda Haymon, told CNN. \"I wish it had gone down like that instead of him shooting himself.\" — Reuters <>", "external_links": [], "highlightTitle": "", "uuid": "c9b54fc0b36e8b1ae2679013c3e9f3450c2f42e2", "highlightText": "", "rating": null}]