[{"rating": null, 
"external_links": [], 
"crawled": "2017-04-16T09:04:16.000+03:00", 
"author": "Vivian Chong", 
"entities": {"persons": [{"name": "chai chun boon", "sentiment": "negative"}, {"name": "zeehan zahari", "sentiment": "negative"}, {"name": "– pict", "sentiment": "neutral"}, {"name": "angus short ribs", "sentiment": "none"}, {"name": "choo choy may", "sentiment": "none"}, {"name": "wildfish", "sentiment": "none"}, {"name": "earl grey", "sentiment": "none"}, {"name": "vivian chong", "sentiment": "none"}, {"name": "zeehan", "sentiment": "none"}, {"name": "foie gras brûlée", "sentiment": "none"}, {"name": "chai", "sentiment": "none"}, {"name": "mark arunsaphai", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "melaka", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "ampang", "sentiment": "none"}, {"name": "kuala lumpur", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "grampians", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "paleo", "sentiment": "none"}, {"name": "mediterranean", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "kuala lumpur", "sentiment": "none"}, {"name": "jalan tun sambanthan", "sentiment": "none"}, {"name": "kl sentral", "sentiment": "none"}, {"name": "laos", "sentiment": "none"}], "organizations": [{"name": "royal mail hotel", "sentiment": "none"}, {"name": "copper salmon ceviche", "sentiment": "none"}, {"name": "foie gras brûlée", "sentiment": "none"}, {"name": "dct international hotel & business management school", "sentiment": "none"}, {"name": "copper", "sentiment": "none"}, {"name": "menara shell", "sentiment": "none"}]}, 
"text": "Print Article \nChef Chai Chun Boon and Zeehan Zahari are the husband-wife team behind Copper. – Pictures by Choo Choy May KUALA LUMPUR, April 16 — With its distinct amber sheen and soft metallic finish, there is no denying that copper is one good-looking metal. It has been around for centuries and used as cookware for as long — and continues to be favoured by chefs — making it traditional yet modern, an enduring classic that speaks of sophistication. But it’s not “elitist” like silver or gold; copper is approachable. \nIt is these qualities that inspired Chai Chun Boon and his wife Zeehan Zahari to name their restaurant Copper, which opened in January 2015 at Menara Shell, in the KL Sentral area. Conceived as a chic, casual restaurant where diners can feel at home and yet have a fancy meal and impress guests, the modern European menu reflects Chai’s vast experiences. \nIn the 12 or so years since graduating from DCT International Hotel & Business Management School in Switzerland, he has racked up an illustrious résumé cutting his teeth in the kitchens of 2- and 3-Michelin star restaurants in Spain and the Netherlands, and stints in Shanghai and Singapore. \nA delightful yuzu-pepper sauce accompanies the Wild Caught Wildfish (left). A pork-free restaurant, Copper serves alcohol-free wines from Belgium (right) For Copper, Chai doesn’t focus on any particular cuisine but presents a smörgåsbord of European flavours with a strong Mediterranean profile. \nEmphasising freshness, their set lunches are built around the best produce they can source for the day. About 80 per cent of their ingredients, including sauces and breads, are made in-house. \nThey make it a point to source locally wherever they can, like the hibiscus that adorns their Valrhona Chocolate Mousse with aerated chocolate, savoury chips, and marinated berries. The edible flowers are from a friend’s conservatory in Ampang. \nAngus Short Ribs with foie gras-sherry potatoes raviolis, white beans and a Parmesan churro Chai also favours the use of a Pira charcoal oven, using it to add flavour and body to everything from appetisers all the way to desserts. Their Pira Spiced Pineapple dessert, served with an Earl Grey granita, salted pineapple, meringue, vanilla espuma and dill is a fine showcase of not only the charcoal oven’s versatility but also Chai’s. \nHis forte, Zeehan reveals, is taste. “If he doesn’t make it fine, he makes it taste good!” and when devising a recipe, Chai starts with the flavours, textures, and colours. The presentation is secondary. \nYou can see that in appetisers like the bravas, featuring crispy potato wedges, battered jalapeños and onion rings with a spicy Spanish paprika dip. Simple yet highly satisfying, it’s very easy to keep going at it! \nSpätzle, a soft egg noodle, is served with the beef stew Chai prefers not to have any signatures but there is a stand-out dish that has been on the menu from the beginning, and it’s one that the couple themselves like too — the Foie Gras Brûlée. If you love goose liver, this is not to be missed: A silky pâté topped with thin slices of pickled green apples bathed in a balsamic reduction, flavoured with sea salt, and garnished with savoury nuts. \nBreak off pieces of the grilled toast that’s served on the side and dip it in, making sure to scoop up a bit of everything. Altogether, it’s a symphony of flavours (umami, savoury, and sweet) and textures (mousse-like, crunchy, and crusty). \nCopper’s menu is not extensive but changes every few months and includes daily specials, so even regulars haven’t had a chance to get bored with their offerings. “We encourage people to share our food, so come in a group of four of more,” Chai offers as a tip. \nThe tomato dip in the Salmon Ceviche references the jellies that feature in Laotian cuisine The Valrhona Chocolate Mousse is garnished with edible hibiscus sourced from a conservatory in Ampang “You can order more small plates and fewer mains. That way, you get to try a better variety of our dishes.” \nHe also obliges off-menu requests and does a lot of customisation to fit diners’ palates and dietary needs. “Some of our regulars come three to four times a month,” says Zeehan, “and some are on specific diets, like Paleo. We tweak the dishes for them. We’re a small set-up so it’s easy to customise. I think that actually gives us an edge — the fact that we’re always willing to do off-menu items.” \nIt also means that Chai and his team get to flex their culinary muscles beyond their usual offerings. Catering is another avenue for them to do that. “We usually do canapés when catering for events, and we try not to repeat the items,” Zeehan shares. “As we get to plan ahead, the team can do even more amazing stuff.” \nYou won’t want to stop popping these battered bites into your mouth! The daily specials that do well are eventually incorporated into the menu and the next cycle will see hearty fare like the Pot au Feu, a stew of beef offal served with German spätzle (a soft, short egg noodle), mushrooms, and fried red onions. \nThe stew is richly flavoured, its thick sauce cooked to a slightly gelatinous consistency, with different cuts swimming in it — cheeks, brisket, tongue, tendon and tripe among them. \nAnother good meaty option is the Angus Short Ribs that are glazed in shallot jus, served with foie gras-sherry potato raviolis over white beans, and a coiled Parmesan churro that lends textural balance to the tender meat. \nCopper Salmon Ceviche was partly inspired by Laotian cuisine On the seafood front, the Wild Caught White Fish poached in oil is a melt-in-the-mouth delight paired with curried cauliflower, semi-frozen marinated grapes, charcoal emulsion, and a yuzu -pepper sauce with herb oil. The grapes are partially frozen to hold their shape and to contrast the hot protein. \nOne of Chai’s newest recipes is the Copper Salmon Ceviche, a photogenic dish of salmon cubes in an Asian dressing flavoured with chilli, garlic, lime and gula Melaka, and tiny dollops of tomato dip. It’s refreshing and appetising, a dance of zesty, tangy, spicy flavours across the tongue. \nA week earlier, Chai had collaborated with chef Mark Arunsaphai in the Laos: Beyond Borders event, where they presented an eight-course degustation menu that saw Laotian cuisine being presented on a contemporary platform for the first time. “I was partly inspired by what I came to know of Laotian cuisine,” Chai reveals. “They use jellies as dips, and I’ve incorporated a tomato dip into this dish.” \nThe Foie Gras Brûlée has been on their menu from the beginning Such creative get-togethers with other chefs is what stokes Chai’s fire. He will be collaborating with Table & Apron for a special menu slated for end of April, and hopes to work with a mixologist next. “We don’t serve wine at Copper, so it will be a challenge for the mixologist!” Chai says with a laugh. \nCurrently, they serve the Vintense range of non-alcoholic wines from Belgium and an interesting variety of mocktails (try the Wicked Ginger for a lovely punch of heat with a refreshing citrus base). \nSince opening in 2015, Copper’s popularity has grown through word of mouth Chai and Zeehan are also hoping to build an indoor garden at their restaurant, and already have a space set aside for it but are having trouble sourcing the right expertise for it. Their vision is motivated by the Royal Mail Hotel in Grampians, about four hours from Melbourne, which has an organic kitchen garden that grew what Chai considers “the best vegetables.” \nHe recalls carrots of all shapes and sizes that you can pluck right out of the ground but as soon as you did, they start to lose flavour. Having a similar set-up is “a very faraway dream” but an indoor vegetable and herb garden might be more achievable. \nIn the meantime, his focus is on constantly improving what Copper has to offer. His experiences around Asia and Europe has put him in good stead where culinary repertoire is concerned, but running his own restaurant has been a steep learning curve for both him and Zeehan. \nCopper was conceived as a casual restaurant where diners could feel comfortable yet have a fancy meal “Just because I have experience doesn’t mean that I am right or that everyone will like what I like. Malaysians have very tricky palates... our Chinese customers are particularly discerning,” Chai reveals, “so they’re my benchmark: If we can please them, we can please most people!” \nPerfection, he says, is a goal but not a reality. Judging from the number of repeat customers and glowing reviews, Copper is as close to perfection as it gets where Kuala Lumpur’s European cuisine scene is concerned. \nCopper is at Level 5C (ii), Menara Shell, 211 Jalan Tun Sambanthan, Kuala Lumpur \nOpens 11.30am-4pm, Mon-Fri; 6.30pm-10pm, Tue-Sat; closed Sun \nTel +603 2380 4737 \nFacebook/Instagram copperbyFAV \nVivian Chong can’t say no to foie gras and has adopted the Foie Gras Brûlée as her ultimate comfort food. http://thisbunnyhops.com/", 
"url": "http://omgili.com/ri/jHIAmI4hxg.IN.dxT4AmEhxKyiJpGT4U5Bb_XdMd_CzWdgGLCRnMmSQiDmxaeyW2JftZyum30ltguQO6eN1oNa9Rbi2vMV.2BlJlW_wC3NVFTTkvbLVtxGCrzwiVkypPsrt4pV_Lcknx9tD7LSbLfBOKIN1KcQKF", 
"highlightText": "", 
"highlightTitle": "", 
"published": "2017-04-16T08:50:00.000+03:00", 
"language": "english", 
"title": "Copper: A modern European dining spot that deserves more attention", 
"thread": {"title_full": "Copper: A modern European dining spot that deserves more attention", 
			"site_full": "www.themalaymailonline.com", 
			"site": "themalaymailonline.com", 
			"site_section": "http://www.themalaymailonline.com/feed/rss/eat-drink\r", 
			"performance_score": 0, 
			"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, 
			"participants_count": 1, 
			"site_type": "news", 
			"spam_score": 0.0, 
			"domain_rank": 19647, 
			"replies_count": 0, 
			"site_categories": [], 
			"country": "MY", 
			"section_title": "Malay Mail Online | Eat/Drink", 
			"url": "http://omgili.com/ri/jHIAmI4hxg.IN.dxT4AmEhxKyiJpGT4U5Bb_XdMd_CzWdgGLCRnMmSQiDmxaeyW2JftZyum30ltguQO6eN1oNa9Rbi2vMV.2BlJlW_wC3NVFTTkvbLVtxGCrzwiVkypPsrt4pV_Lcknx9tD7LSbLfBOKIN1KcQKF", 
			"published": "2017-04-16T08:50:00.000+03:00", 
			"title": "Copper: A modern European dining spot that deserves more attention", 
			"uuid": "f0c8fd19d219d4a0d027679258ac5ea6ab3ee926", 
			"main_image": "http://www.themalaymailonline.com/uploads/articles/Crave/2017/Copper01.jpg"}, 
"uuid": "f0c8fd19d219d4a0d027679258ac5ea6ab3ee926", 
"ord_in_thread": 0}]