[{"entities": {"persons": [], "organizations": [], "locations": []}, "text": "The Latest on U.S. Vice President Mike Pence's trip to Asia (all times local): \n___ \n4:40 p.m. \nJapan and the U.S. have outlined a path forward for economic talks between the countries. \nThe announcement followed an inaugural meeting Tuesday of the U.S.-Japan Economic Dialogue in Tokyo chaired by visiting U.S. Vice President Mike Pence and Japanese Deputy Prime Minister Taro Aso. \nIt said the dialogue would focus on three areas: trade and investment rules and issues, cooperation in macroeconomic policy and specific industry sectors. \nThe dialogue was set up by President Donald Trump and Japanese Prime Minister Shinzo Abe during the Japanese leader's visit to the U.S. in February. \n___ \n3:40 p.m. \nU.S. Vice President Mike Pence and Japanese Deputy Prime Minister Taro Aso are kicking off a new U.S.-Japan economic dialogue that was launched during Prime Minister Shinzo Abe's meeting with President Donald Trump in the U.S. in February. \nAs talks began Tuesday, Aso said the U.S.-Japan alliance has underpinned peace and prosperity in the Asia-Pacific region and that trade friction with the U.S. has given way to an \"age of cooperation.\" \nPence said Trump sees the talks as a way to improve business ties with Japan and is hoping for quick results. The discussions are to focus on economic and structural policy and trade and investment strategies aimed at strengthening both countries' economies. \n___ \n2:15 p.m. \nU.S. Vice President Mike Pence and Japanese leaders have begun talks expected to focus largely on trade with America's anchor ally in the region, though tensions with North Korea loomed large. \nPence reassured Prime Minister Shinzo Abe on Tuesday that the U.S. considers its alliance with Japan to be a cornerstone of security in the region. \nPence said, \"We appreciate the challenging times in which the people of Japan live with increasing provocations from across the Sea of Japan.\" \nHe also said, \"We are with you 100 percent,\" adding that the U.S. always seeks peace. \nAbe said Japan hoped for peaceful dialogue with Pyongyang, \"but at the same time, dialogue for the sake of dialogue is valueless and it is necessary for us to exercise pressure North Korea so that it comes forward and engages in this serious dialogue.\" \nPence was having lunch with Abe at the prime minister's official residence after arriving in Japan earlier in the day for the second stop of a 10-day Asia tour. \n___ \n12:15 p.m. \nU.S. Vice President Mike Pence has arrived in Japan for the second stop of a 10-day Asia tour. \nHis plane touched down Tuesday at the U.S. military's Atsugi base outside Tokyo. \nThe focus of his trip is expected to shift in Japan to trade. North Korea's nuclear and missile development dominated the agenda on his first stop in South Korea. \nPence told business leaders before leaving Seoul that the Trump administration is reviewing all trade agreements as part of its \"America First\" policy. \nWhite House officials say the meetings in Tokyo are meant to forge a framework for future discussions after the U.S. withdrew from a Pacific Rim trade pact.", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "00371dd156eac6dc3892b2934a7e96ae3e124353", "rating": null, "highlightTitle": "", "title": "The Latest: Japan and US set framework for economic talks", "thread": {"country": "US", "site": "miamiherald.com", "replies_count": 0, "title_full": "The Latest: Japan and US set framework for economic talks", "site_categories": [], "performance_score": 0, "section_title": "Breaking News, Sports, Weather & More | MiamiHerald.com &", "domain_rank": 6650, "uuid": "00371dd156eac6dc3892b2934a7e96ae3e124353", "main_image": "", "site_type": "news", "title": "The Latest: Japan and US set framework for economic talks", "spam_score": 0.0, "site_section": "http://www.miamiherald.com/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "url": "http://omgili.com/ri/jHIAmI4hxg_7bQuofQBLDI6rpdkH5tfofR9aBp5x5012DhkquFsss.aMeA8txljiNG.as3trWqnB3Hqdb8e_lg--", "participants_count": 1, "site_full": "www.miamiherald.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:25:08.000+03:00"}, "crawled": "2017-04-18T11:25:08.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_7bQuofQBLDI6rpdkH5tfofR9aBp5x5012DhkquFsss.aMeA8txljiNG.as3trWqnB3Hqdb8e_lg--", "highlightText": "", "published": "2017-04-18T11:25:08.000+03:00", "author": "The Associated Press"}]