[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/.wHSUbtEfZQIc9rTkXFvN2GFke2dg40ljk5Oc0TOBBpHRbiW4yP0eGdBgo8B4gRwztdyKF3SzM8TGXIgbVRAXdVSgavRG4yHB9M4Egu4KhUb.jo1VBqHSAfLbq7n1O2lvr00c7OS.nI327lvGs.LcA--", "title": "TADECO: DAPECOL BANANA FARM DEAL LEGAL, ADVANTAGEOUS TO GOVT", "site_type": "blogs", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "https://durianburgdavao.wordpress.com", "spam_score": 0.0, "section_title": "TADECO: DAPECOL BANANA FARM DEAL LEGAL, ADVANTAGEOUS TO GOVT – THE DURIAN POST BY ROGER \"DURIANBURGDAVAO\" BALANZA", "site": "wordpress.com", "site_full": "durianburgdavao.wordpress.com", "performance_score": 0, "uuid": "03ef40225b6786fd72ca4fd20c6ca174cf9db6be", "published": "2017-04-17T11:27:39.000+03:00", "site_categories": [], "country": "US", "title_full": "TADECO: DAPECOL BANANA FARM DEAL LEGAL, ADVANTAGEOUS TO GOVT", "participants_count": 1, "main_image": null}, "url": "http://omgili.com/ri/.wHSUbtEfZQIc9rTkXFvN2GFke2dg40ljk5Oc0TOBBpHRbiW4yP0eGdBgo8B4gRwztdyKF3SzM8TGXIgbVRAXdVSgavRG4yHB9M4Egu4KhUb.jo1VBqHSAfLbq7n1O2lvr00c7OS.nI327lvGs.LcA--", "title": "TADECO: DAPECOL BANANA FARM DEAL LEGAL, ADVANTAGEOUS TO GOVT", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:27:39.000+03:00", "language": "english", "entities": {"locations": [{"name": "iwahig", "sentiment": "none"}, {"name": "palawan", "sentiment": "none"}, {"name": "tadeco", "sentiment": "none"}, {"name": "valoria", "sentiment": "none"}, {"name": "davao del norte", "sentiment": "none"}, {"name": "iwahig", "sentiment": "none"}], "persons": [{"name": "antonio floirendo", "sentiment": "none"}, {"name": "pantaleon", "sentiment": "none"}, {"name": "tadeco", "sentiment": "none"}, {"name": "alexander n. valoria", "sentiment": "none"}, {"name": "pantaleon alvarez", "sentiment": "none"}, {"name": "tomas", "sentiment": "none"}, {"name": "jr.", "sentiment": "none"}, {"name": "valoria", "sentiment": "none"}, {"name": "dapecol", "sentiment": "none"}, {"name": "benigno s. aquino iii", "sentiment": "none"}, {"name": "alvarez", "sentiment": "none"}], "organizations": [{"name": "penal colony", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "davao penal colony", "sentiment": "none"}, {"name": "iwahig penal colony", "sentiment": "none"}, {"name": "tadeco", "sentiment": "none"}, {"name": "blue ribbon committee", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "tagum development corporation", "sentiment": "none"}, {"name": "jva", "sentiment": "none"}, {"name": "bureau of corrections", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "legislative", "sentiment": "none"}, {"name": "department of justice", "sentiment": "none"}, {"name": "antonio o. floirendo management and investment corp.", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "03ef40225b6786fd72ca4fd20c6ca174cf9db6be", "published": "2017-04-17T11:27:39.000+03:00", "author": "durianburgdavao", "text": "BUCOR TO REPLICATE TADECO-DAPECOL JVA IN IWAHIG PENAL COLONY BY ROGER M. BALANZA\nDue to its success as a rehabilitation program for prisoners, the Bureau of Corrections (BuCor) is planning to adopt for implementation in Iwahig Penal Colony in Palawan, its Joint Venture Agreement (JVA) with Tagum Development Corporation (Tadeco). The JVA involves about 5,300 hectares of the Davao Penal Colony (Dapecol) in Sto. Tomas town in Davao del Norte that Tadeco developed into a banana plantation. The 25-year deal is primarily aimed at the rehabilitation of the inmates with Tadeco hiring out Dapecol prisoners as farm hands paid with minimum wage. “This rehabilitation program has been found to be very successful by BuCor, to the extent that the latter has even requested Tadeco to replicate the JVA program to its penal colony in Iwahig, Palawan,” said Tadeco in a statement. In response to the BuCor request, in a report in BusinessMirror, Alexander N. Valoria, president and CEO of the Antonio O. Floirendo Management and Investment Corp. (Anflocor), said Tadeco has sent two missions to look into the situation in Iwahig. Tadeco is yet to propose its recommendations to start the project, said Valoria as a resolution was filed in the House of Representatives questioning the Tadeco-BuCor JVA. House Speaker Pantaleon Alvarez has filed House Resolution 867 to investigate the allegedly “grossly disadvantageous” 25-year “lease contract” signed by BuCor and Tadeco. Reports say that Alvarez’s motive in filing the resolution was his ongoing spat with Rep. Antonio Floirendo, Jr., top honcho of the Tadeco banana empire. READ MORE PANTALEON ALVAREZ In separate statements, Tadeco and Valoria disputed Alvarez’s claim, saying the Tadeco-BuCor deal, a JVA and not a lease contract, is “legal and advantageous to the government.” The JVA was first signed in 1956 and was last reviewed by Congress in 2012. “The JVA has been reviewed, and found to be advantageous to the government numerous times by the Executive and the Legislative departments in past administrations,” Tadeco said. Tadeco adds that “the most recent review in the 15th Congress in 2012 once again arrived at the same positive conclusion regarding the JVA and its benefits to the government.” Even the “Department of Justice said during the congressional review that the JVA is above board,” Tadeco in its statement further added. For his part, Valoria, in the report in BusinessMirror, said that even former President Benigno S. Aquino III, who was a senator then, “sat at the Blue Ribbon Committee reviewing this agreement.” The bottom line of the JVA, according to Valoria, is “to help the government in providing a good correctional and rehabilitation program for convicts.” Explaining the ground level mechanics of the JVA, Valoria said “prisoners of good standing” are chosen by Dapecol to work in the banana plantation. Valoria said BuCor deploys every day in the Tadeco banana farm about 600 prisoners from its pool of 900 prisoner workers, “as part of the rehabilitation of the prisoners” under the JVA. Valoria said the prisoner workers are paid minimum wage by Tadeco. Many of these prisoners who worked in the Tadeco banana plantation were eventually hired by other plantations after serving their prison terms, said Valoria. "}]