[{"entities": {"organizations": [{"name": "national journalism award for public service", "sentiment": "none"}, {"name": "rocky mountain search & rescue team", "sentiment": "none"}, {"name": "colorado pro chapter of the society of professional journalists", "sentiment": "none"}, {"name": "website twitter facebook goodreads amazon", "sentiment": "none"}, {"name": "colorado high country", "sentiment": "none"}], "locations": [{"name": "rocky mountains", "sentiment": "none"}, {"name": "scarlet springs", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "persons": [{"name": "pamela clare", "sentiment": "none"}, {"name": "ellie meeks", "sentiment": "none"}, {"name": "woodley", "sentiment": "none"}, {"name": "eric", "sentiment": "none"}, {"name": "victoria", "sentiment": "none"}, {"name": "jesse", "sentiment": "none"}, {"name": "jesse moretti", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "lexi", "sentiment": "none"}, {"name": "austin taylor", "sentiment": "none"}, {"name": "eric hawke", "sentiment": "none"}, {"name": "daisy", "sentiment": "none"}, {"name": "lexi jewell", "sentiment": "none"}, {"name": "ellie", "sentiment": "none"}]}, "uuid": "0437b59e6da828efd7d48c97a2586848a049bdaf", "highlightText": "", "title": "Falling Hard - Pamela Clare - Review", "thread": {"site": "blogspot.com", "country": "US", "participants_count": 1, "site_full": "ebookindulgence.blogspot.com", "section_title": "Ebook Indulgence", "uuid": "0437b59e6da828efd7d48c97a2586848a049bdaf", "site_section": "http://ebookindulgence.blogspot.com/", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T21:00:00.000+03:00", "url": "http://omgili.com/ri/j.JM_ertN3IqxwRwnc3a.Pyr7n0t6nSg9NHWWGul47V.0ijaKzYtdzUZTwgxP9Rt8UloMFXwRWidEngNCnybpbSefU.Wfy6Nv7VvuM0FFSq0ZrdgcFqJ9Q--", "title_full": "Falling Hard - Pamela Clare - Review", "title": "Falling Hard - Pamela Clare - Review", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T21:00:00.000+03:00", "url": "http://omgili.com/ri/j.JM_ertN3IqxwRwnc3a.Pyr7n0t6nSg9NHWWGul47V.0ijaKzYtdzUZTwgxP9Rt8UloMFXwRWidEngNCnybpbSefU.Wfy6Nv7VvuM0FFSq0ZrdgcFqJ9Q--", "ord_in_thread": 0, "crawled": "2017-04-16T23:00:16.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Ebook Indulgence (noreply@blogger.com)", "text": "\n\n\n\n\n\n\n\nA war widow alone… Ellie Meeks promised her pilot husband that if anything happened to him, she would live her life to the fullest. Three years later, she is still alone, raising the twins he never met. She has no interest in dating or meeting men—until one snowy night when a stranger helps her get her sick kids safely home. That stranger turns out to be a former Army Ranger and a member of the elite Rocky Mountain Search & Rescue Team. He’s also tall, rugged… and irresistibly sexy. All it takes is one kiss… Jesse Moretti came to Colorado to get Iraq out of his head, using the adrenaline of extreme sports and high-risk mountain rescues to keep his mind off the past. But getting involved with Ellie might be the riskiest thing he’s ever done. It’s not just their explosive chemistry. There’s something about Ellie that gets inside him, opening him to feelings he’s tried hard to ignore. When passion ignites… Ellie feels alive in Jesse’s arms and happier than she ever thought she’d feel again. But their relationship comes at a price for him, and soon Ellie sees that she must help Jesse fight the demons of his past to protect the love of a lifetime—and save the heart of a hero. \n\n\n\nKindle US:  http://bit.ly/FallUS \n\nKindle UK:  http://amzn.to/2legfeL \n\nKindle AU:  http://amzn.to/2ln2s44 \n\nKindle CA:  http://amzn.to/2m499Ys \n\nNook:  http://bit.ly/2lyRuuf \n\niBooks:  http://apple.co/2l05kmu \n\nSmashwords:  http://bit.ly/2kBRHO4 \n\nKobo:  http://bit.ly/FallKobo \n\nPaperback:  http://amzn.to/2mNeaZ6 \n\n\n\n\n\n4.5 Stars \n\nFalling Hard is the third title in the Colorado High Country series, but can easily be read as a standalone.   Although this was my first time reading anything written by Pamela Clare, it will not be my last.  \n\nThe story line is well written and well paced.  I was captivated by Ellie and Jesse's story right from the very first chapter.  Both characters are incredibly endearing.  Ellie is a strong, intelligent, hard working, kind, compassionate and caring.  She's an amazing single mother to her precocious and adorable twins Daisy and Daniel.  \n\nJesse is a protective, sexy, heroic, and sweet hero with a huge heart.  A slightly damaged alpha who is a caretaker underneath his tough guy exterior.  \n\n\nThis is a story of loss, second chances, and finding love again.  It a sweet and steamy blend with moving and emotional heartfelt moments.  Both heartbreaking and heartwarming, you will need the tissues close by.  The emotions felt very realistic and I was enthralled with their story.  \n\nI thoroughly enjoyed watching their relationship develop.  I thoroughly recommend Falling Hard to anyone who enjoys a slow burn, contemporary romance with insta-lust. I look forward to reading more of Pamela Clare's work in the future.  \n\n\n\n\n\n\nBarely Breathing  \n(Colorado High Country #1) \n\nLexi Jewell left Scarlet Springs twelve years ago, vowing never to return to the eccentric Colorado mountain town where she grew up. Now, here she is—over thirty, out of a job and with little choice but to move back in with her father. Lexi knows it’s just a matter of time before she runs into Austin Taylor, her first boyfriend and her first heartbreak. She’s determined to show him she’s over him—until he steps out of a pickup truck and back into her life, looking sexy as hell in his mountain ranger uniform. As far as Austin is concerned, Lexi can turn her snazzy little convertible around and drive back to Chicago. After all, she ripped his teenage heart apart and turned her back on the town he loves. But from the moment he sees her again, he can’t get her out of his mind. Even her smile messes with his head.  When an evening of conversation turns into something else, Lexi and Austin agree to be friends again—with benefits. But as Lexi starts making plans to return to the big city, Austin realizes he’ll lose her a second time unless he can show her that what she’s searching for has been right here all along. Note to readers: This is straight contemporary romance, not romantic suspense. \n\nKindle US:  http://amzn.to/24FQEd9 Kindle AU:  http://bit.ly/1NnOkDd Kindle UK:  http://amzn.to/1rILChz Kindle CA:  http://amzn.to/1TypzAv iBooks:  http://apple.co/1SZOq0T Smashwords:  http://bit.ly/1T6mwWb Nook:  http://bit.ly/21OfDt4 Kobo:  http://bit.ly/1VTk6L2 Amazon Print:  http://amzn.to/1Tkf61R \n\n\nSlow Burn  \n(Colorado High Country #2) \n\nV ictoria Woodley is done with men. Fresh off a dating nightmare, she flies from her home in Chicago to Scarlet Springs to take part in her best friend’s wedding. Who picks her up at the airport? Eric Hawke. Of course. She made a fool of herself over him last time she was here. He’s cocky, charming, and sexy as sin. But the fact that she’s attracted to him is all the proof she needs that he’s bad news. She would ignore him if she could. But he’s the best man, and she’s the maid of honor. She can’t just tell him to jump in a lake—especially not when her lips are locked with his. \nEric isn’t looking for a relationship. Between running the firehouse and volunteering for the county’s search and rescue team, he has enough on his plate. He doesn’t need to get tangled up with a woman from the big city, especially one whose idea of roughing it is going without designer coffee. Yet from the moment he looks into Victoria’s big brown eyes, the attraction he feels is too strong to deny. Faster than he can imagine, the spark of desire that has smoldered between them since the first day they met will flare into full-blown passion.  But can Eric convince Victoria to set aside her doubts and trust him with her heart before their time together runs out? \nKindle US:  http://amzn.to/2dh8HFh Kindle AU:  http://amzn.to/2d60wsa Kindle UK:  http://amzn.to/2d60u3l Kindle CA:  http://amzn.to/2cRy3Wb iBooks:  http://apple.co/2cZqIWi Nook:  http://bit.ly/2cQsnPs Kobo:  http://bit.ly/2dglsB9 Smashwords:  http://bit.ly/2cZp86R Paperback:  http://amzn.to/2m7dB8L \n\n\n\n\nColorado author Pamela Clare began her writing career as a columnist and investigative reporter and eventually became the first woman editor-in-chief of two different newspapers. Along the way, she and her team won numerous state and national honors, including the First Amendment Award and the National Journalism Award for Public Service. This year, she was honored by the Colorado Pro Chapter of the Society of Professional Journalists with their Keeper of the Flame Lifetime Achievement Award for her work. A single mother with two college-aged sons, she writes historical romance and contemporary romantic suspense within view of the beautiful Rocky Mountains. She is a RITA finalist (Surrender, 2006) and a three-time Daphne du Maurier finalist (I-Team series). She loves history, having studied archaeology in college, and has traveled extensively, living for almost three years in Denmark, which feels like home to her. She attributes her love of historical romance with the years she spent visiting ruins and castles in Europe. \n\nWebsite Twitter Facebook Goodreads Amazon "}]