[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:32:20.000+03:00", "author": "Kate Kellaway", "entities": {"persons": [{"name": "roger duvoisin", "sentiment": "none"}, {"name": "john f kennedy", "sentiment": "none"}, {"name": "roald dahl", "sentiment": "none"}, {"name": "du iz tak", "sentiment": "none"}, {"name": "walker", "sentiment": "none"}, {"name": "ryan tubridy", "sentiment": "none"}, {"name": "helen oxenbury", "sentiment": "none"}, {"name": "pj lynch", "sentiment": "none"}, {"name": "jfk", "sentiment": "none"}, {"name": "trunchbull", "sentiment": "none"}, {"name": "penelope", "sentiment": "none"}, {"name": "kennedy", "sentiment": "none"}, {"name": "jory john", "sentiment": "none"}, {"name": "carson ellis", "sentiment": "none"}, {"name": "julia donaldson", "sentiment": "none"}, {"name": "kate kellaway", "sentiment": "none"}, {"name": "patrick", "sentiment": "none"}, {"name": "oxenbury", "sentiment": "none"}, {"name": "david walliams", "sentiment": "none"}, {"name": "alvin tresselt", "sentiment": "none"}, {"name": "lane smith", "sentiment": "none"}, {"name": "harper collins", "sentiment": "none"}, {"name": "emily gravett", "sentiment": "none"}, {"name": "tony ross", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "county wexford", "sentiment": "none"}], "organizations": [{"name": "lynch", "sentiment": "none"}, {"name": "penguin random house", "sentiment": "none"}, {"name": "new york review children’s collection", "sentiment": "none"}, {"name": "house of four seasons", "sentiment": "none"}, {"name": "new york review", "sentiment": "none"}]}, "text": "T his Easter, publishers seem to be overlooking fluffy chicks and chocolate eggs in favour of other celebratory wild​life​. But when I took a look at of Du Iz Tak? by Carson Ellis (Walker £11.99) I wondered at first why anyone would bother to send me a picture book in a foreign language. Then I took a second look. This story is written in “bug language”, an idea that borders on lunacy but is in practice a joy and a quirky triumph. It is enormous fun reading this book aloud and trying to decipher exchanges between talkative insects. The illustrations are as clear as the language is alien. We witness the exuberant construction of a tree – or plant – house that, after a while, sprouts a gladdenboot. A what? A flower, silly. It is a refreshing change from the worthily educational: only the most duty-bound parent could be bugged by this (for ages four and up).\nEvery dog you could imagine is contained within the covetable, cloth-bound pocket book Dogs by Emily Gravett (Two Hoots £7.99). It is a book of contrasts that depends for its success on the wonderful skill and humour of the drawings. These are not fantasy dogs – they are based on shrewd, exact and affectionate observation. When she writes: “I love stroppy dogs… and soppy dogs”, she has a huge frowning boxer and a little fluffy cur with a pink ribbon round its neck. Her barking dog is a tiny tearaway and her non-barking dog looks cowardly and so on – exactly as such dogs do. Even her sleeping dogs you would not want to let lie. A disarming pleasure to read (ages two and up).\nA family’s discussion about how they should paint their home in the country is the delightful context for The House of Four Seasons by Roger Duvoisin (the New York Review Children’s Collection £11.99). This was first published in 1956 and is as fresh as if it had only just been painted, which is very much to the point as it is a book that informs children about colour within the family’s conversation. It would serve as a good model to writers unsure how to structure a picture book, as it comes to a perfect, harmonious conclusion, as pleasingly symmetrical as the house itself with the shutters on its facade (ages four and up).\nThere’s more than a touch of Roald Dahl’s malign exuberance to There’s a Snake in My School! by David Walliams, with illustrations by Tony Ross (Harper Collins £12.99), involving, as it does, a snake that gobbles up a headmistress alive. (Some relative of Miss Trunchbull, perhaps?) This is not one for the faint-hearted, but a story that is told with an energetic confidence that will communicate itself to all its readers. It starts with children bringing their motley pets into school (including a “stupidly cute gerbil”, a “100-year-old tortoise” and a fat cat in a wheelbarrow). Tony Ross can take a bow for lending the story the vitality it deserves, especially in the lavish coils of a snake named Penelope (ages three and up).\nFacebook Twitter Pinterest The construction of an insect plant house introduces the reader to a secret language in Du lz Tak? Photograph: Walker\nA small boy’s rapture at being able to serve President John F Kennedy with a slice of swiss roll is the basis for Patrick and the President by Irish broadcaster Ryan Tubridy, with illustrations by PJ Lynch (Walker £12.99). This is a book that pulls you in against your better judgment. It is the story of President Kennedy’s visit to County Wexford in Ireland in 1963 and what makes it winning is the sense that it is a true story and the tremendous sense of the period brought home in Lynch’s accomplished, emotionally acute illustrations. I particularly like the picture where the boy’s father is steering him in the presidential direction with a plate of cakes – the slightly tense, aspirational expressions of father and son are perfection (ages six and up).\nStarting with a horrified rabbit, The Giant Jumperee by Julia Donaldson, with illustrations by Helen Oxenbury (Penguin £12.99), is a picture book that progresses – a sequence that builds. The rabbit has been startled by a loud broadcast from inside his burrow announcing: “I’m the GIANT JUMPEREE and I’m scary as can be!” One by one, different animals try to get to the bottom of it. What makes the story rise above the crowd is the superlative pictures of the animals by Oxenbury, drawn with marvellous expressiveness. She does not let her marmalade cat metamorphose into a cartoon, but his anxious face can nonetheless be read like a book. There is also a wonderful picture of a terrified elephant, winding his trunk round the branch of a tree for reassurance, and a jubilant and side-splitting conclusion (ages two and up).\nA small philosophy manual for readers of all ages is provided by the wonderfully original Penguin Problems by Jory John, with illustrations by Lane Smith (Walker £11.99). You would not believe how many problems a penguin can have – starting with the obvious one about not being able to fly in spite of being in possession of wings. Enter a sort of guru walrus who (over a whole page) offers jewel-like advice about the importance of seeing that you are in the right place and inhabiting the moment. This is, plausibly, lost on the little penguin but will not be lost on readers. Lane Smith makes his penguins look like worried clones, which adds to the humour of the whole (all ages).\nFinally, another of the New York Review ’s wonderful salvages from the 1950s is The Frog in the Well by Alvin Tresselt, with illustrations by Roger Duvoisin (the New York Review Children’s Collection £11.99). The charm of this book is that the frog is also on a philosophical journey. It is a story about community, while acknowledging that the world is wider than you thought and infinitely more various. The world does not come to an end when you trade familiarity for newness. These are lessons learned by the brilliant, solitary, stunningly green frog who escapes from a dried-up well and finds himself in the wide – and not necessarily frog-unfriendly – world (ages three and up).\n• To order any of the books reviewed for a special price, click on their titles, go to bookshop.theguardian.com or call 0330 333 6846. Free UK p&p over £10, online orders only. Phone orders min. p&p of £1.99\nTopics Picture books Children's book reviews round-up Children and teenagers Julia Donaldson David Walliams Animals reviews Share Reuse this content", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nKr03QKw7q0AdEPD6DvKAEpZRpaIpYyQZ1BdlVfZ2cC8SicvQ1._5NATXjDUoarUCzbzsHe8v0iNUpVC44G9mFet6qll0D42ArocSTRGQy.QSypf2LetB5ouJVL6Yo.14JatPt1h5ynM-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T10:32:20.000+03:00", "language": "english", "title": "Picture books for children reviews – penguins, pythons and presidents", "thread": {"title_full": "Picture books for children reviews – penguins, pythons and presidents", "site_full": "www.theguardian.com", "site": "theguardian.com", "site_section": "http://www.theguardian.com/books/rss", "performance_score": 0, "social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "facebook": {"likes": 44, "shares": 44, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": 170, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Books | The Guardian", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nKr03QKw7q0AdEPD6DvKAEpZRpaIpYyQZ1BdlVfZ2cC8SicvQ1._5NATXjDUoarUCzbzsHe8v0iNUpVC44G9mFet6qll0D42ArocSTRGQy.QSypf2LetB5ouJVL6Yo.14JatPt1h5ynM-", "published": "2017-04-16T10:32:20.000+03:00", "title": "Picture books for children reviews – penguins, pythons and presidents", "uuid": "0457b0fa0982be6f22dba538cdecae7170fc0f5a", "main_image": "https://i.guim.co.uk/img/media/4c9b3b2ede750e257e182a98b0f329c16a943a90/0_0_5480_3289/master/5480.jpg?w=1200&amp;h=630&amp;q=55&amp;auto=format&amp;usm=12&amp;fit=crop&amp;crop=faces%2Centropy&amp;bm=normal&amp;ba=bottom%2Cleft&amp;blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&amp;s=2654c4c7c9bc713f9dae051ed73a0b3e"}, "uuid": "0457b0fa0982be6f22dba538cdecae7170fc0f5a", "ord_in_thread": 0}]