[{"uuid": "05aafea2393960cacc24f53865ab101051aaf2df", "url": "http://omgili.com/ri/7aBdisT0NOq.LjoteJAAKhMXOAZ3T9g78ENejTlChGGAZ4QcwLnp8NzOt4U9YDDDzGmNWHhPxxMM7U4rGsOr.gGJcqXUvFWL", "title": "How to Build an Online Newsroom that Engages Journalists", "author": "Eleonora Israele", "rating": null, "published": "2017-04-18T23:24:10.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "sap", "sentiment": "none"}, {"name": "verizon", "sentiment": "none"}], "locations": [{"name": "venngage", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "persons": [{"name": "fitt", "sentiment": "none"}, {"name": "ilan mochari", "sentiment": "none"}, {"name": "nadya khoja", "sentiment": "none"}, {"name": "joel gross", "sentiment": "none"}, {"name": "khoja", "sentiment": "none"}, {"name": "kissmetrics", "sentiment": "none"}, {"name": "eleonora israele eleonora israele", "sentiment": "none"}, {"name": "mark shapiro", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "05aafea2393960cacc24f53865ab101051aaf2df", "url": "http://omgili.com/ri/7aBdisT0NOq.LjoteJAAKhMXOAZ3T9g78ENejTlChGGAZ4QcwLnp8NzOt4U9YDDDzGmNWHhPxxMM7U4rGsOr.gGJcqXUvFWL", "site_full": "spinsucks.com", "title": "How to Build an Online Newsroom that Engages Journalists", "site_section": "http://spinsucks.com//rss", "domain_rank": null, "published": "2017-04-18T23:24:10.000+03:00", "title_full": "How to Build an Online Newsroom that Engages Journalists", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "Spin Sucks", "site_type": "blogs", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://spinsucks.com/wp-content/uploads/2017/04/Untitled-design-copy-4.png", "site": "spinsucks.com"}, "external_links": [], "language": "english", "text": "Shares 30 \nWe live in the era of viral social media stories and 644 million websites on the internet. \nThat’s why it’s extremely difficult to get stories out to journalists amidst all the noise. \nJournalists have a need for large volumes of information. They need the information to be relevant and trustworthy. You also need to deliver it quickly. The key problem they face is a shortage of time. \nThat makes having an engaging and useful online newsroom mandatory. \nSo, what does your online newsroom look like? \nIs it evolving with the advances in technology to cater to the needs of journalists? \nOr is it just a bulleted list of recent news releases and a mailto form? \nYour online newsroom might need an extreme makeover to help your company’s story stand out. \nHere are a few case studies to guide your mobile newsroom’s design and function. The Importance of Visuals \nIn a case study by Nadya Khoja , VP of Marketing at Venngage, she explains: \nYour brain processes and remembers images 60,000 times faster than words. The simple explanation is images often do a better job of painting a picture—telling a story—than text. Khoja further shares that infographics and original graphics perform the best for about 42 percent of marketers, followed by charts and data visualizations (26 percent), and videos (20 percent). \nThere are various ways to use visuals in a newsroom. \nInfographics translate information that may be difficult to process on its own. \nPictures of an event can trigger an emotional response. \nImages of your product or services in use can create an instant connection with the journalist. \nThe Verizon online newsroom is a great example. \nIt comes across more as an online magazine rather than a newsroom which draws the reader in. Fitt’s Law and Your Online Newsroom \nA frequent complaint of journalists is that they cannot quickly and easily find the public relations contacts on a media website. On many sites it takes a minimum of five clicks to get to the public relations contact page, according to PR Newswire \nIn a case study by Kissmetrics , they found abandon rates increase the more clicks a visitor has to make to find what they’re looking for. \nFitt’s Law states the time required to move your mouse to a target is based on two factors. \nBoth, distance to target and size of the target must be optimized. \nYou can increase your clickthrough rate by making your target bigger. \nThis can mean creating a button instead of a hyperlinked sentence. \nYou must also place it where users will click on it, meaning where their mouse naturally is. \nIf you line up all of your buttons, the mouse moves minimally, and clickthrough rate increases. \nYou can also decrease cancelations by using a smaller button. \nSAP wanted to increase trial downloads of their Crystal Reports software. \nTheir winning design included removing distractions and adding a second clickthrough rate at the bottom of the page. \nAfter the alteration, the download button is clearly differentiated from the rest of the page. What Does This Mean for Your Online Newsroom? \nA lot of your traffic will come from search engine results. \nSo the journalist may not have landed on your media page. \nMake your information easy to find. \nThis includes an easy to spot tab for journalists that links to your contact information and current reports. Remove Barriers Between Journalists and Your Data \nI hate when I click on a website and it asks for my contact information—I immediately leave. \nI can easily find what I’m looking for elsewhere without cluttering my inbox with unwanted email blasts. \nWhile you may want a list of journalists’ emails for future news releases, asking for their information is a definite barrier. \nThis will either get you a fictitious email or they’ll exit your site. \nThey most likely don’t have the time to fill out a form and will delete or ignore random emails. \nSecondly, I hate it when articles or reports are in PDF format. \nReporters need to cut and paste quotations. \nMark Shapiro , a marketing consultant advises helping journalists use your content: \nDo not convert your text content into jpgs and images. Instead, make it easy for journalists to access and ‘borrow’ your content in order to promote your products and services. \nIt helps your site be more SEO friendly. Cut the Industry Jargon \nYou may be using a lot of complicated jargon the average person doesn’t understand. \nThink about who you are writing for and where you want your story to get picked up. \nThis way, you might even be interviewed as an expert for a hot topic in the news. \nIlan Mochari explains in How to Introduce a New (Somewhat Complicated) Product to Consumers how Perfect Fuel, a healthy energy bar, was born. \nThe challenge was to explain the new snack in a familiar way. \nUsing the name ‘fuel’ helped customers associate the chocolate bar with a boost of energy, similar to “Five-Hour Energy.” \nThe same thing applies to news releases. \nIf you’re in the tech industry you may be sending your story to tech reporters. \nHowever, you shouldn’t limit your audience with complicated wording. Optimize Your Online Newsroom for Mobile Speed \nSlow downloads is an obvious problem. \nSixty-four percent of smartphone users expect a page to load in less than four seconds. \nJoel Gross highlights the increasing popularity of Accelerated Mobile Pages (AMP). \nHe states: \nAMPs use simplified HTML code that prioritizes page load speed and readability. While the code required to create these pages is leaner—restricts some formatting and design options—the benefits of a faster, easier, and overall better browsing experience cannot be overstated. \nBy optimizing your mobile site, you elevate the user experience. \nJournalist are more likely to report your story and return for future updates. \nIf you want journalists to share your news, step one is to have a great online newsroom. \nKnow of an exceptional online newsroom? \nShare it in the comments! About Eleonora Israele Eleonora Israele is an analyst at Clutch, where she is responsible for research on marketing software and digital agencies. Clutch is a Washington, D.C.-based research, ratings, and reviews platform for B2B services and software.", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:10.000+03:00"}]