[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/snFTpiOKdJUXJ3yHoypTJ1vGR.dyYLQJZNk_4kdktHcPNElOkMweLFVpdxVuLqLYkAgqJxgGYBbgRXBBmgp2OdNmR5QEmiOYRpNXJ_DMuzc-", "title": "Almost Finished Banging On...", "site_type": "blogs", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://nickybondramblings.blogspot.com/", "spam_score": 0.0, "section_title": "Nicky Bond and Writer's Ramblings", "site": "blogspot.com", "site_full": "nickybondramblings.blogspot.com", "performance_score": 0, "uuid": "05c1be209d2d91c39211297cbe91b724fc8de5c9", "published": "2017-04-17T11:27:34.000+03:00", "site_categories": [], "country": "US", "title_full": "Almost Finished Banging On...", "participants_count": 1, "main_image": null}, "url": "http://omgili.com/ri/snFTpiOKdJUXJ3yHoypTJ1vGR.dyYLQJZNk_4kdktHcPNElOkMweLFVpdxVuLqLYkAgqJxgGYBbgRXBBmgp2OdNmR5QEmiOYRpNXJ_DMuzc-", "title": "Almost Finished Banging On...", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:27:34.000+03:00", "language": "english", "entities": {"locations": [{"name": "south america", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "antarctica", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "arctic", "sentiment": "none"}, {"name": "mauritius", "sentiment": "none"}], "persons": [{"name": "soz", "sentiment": "none"}], "organizations": [{"name": "oxfam", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "05c1be209d2d91c39211297cbe91b724fc8de5c9", "published": "2017-04-17T11:27:34.000+03:00", "author": "Nicky Bond (noreply@blogger.com)", "text": "There will come a time, hopefully in the very near future, when I sit down to write this blog and my thoughts do not immediately turn to the writing, publishing or launch of Carry the Beautiful . Soz guys, but we are not there yet. \n\nYes, I know this is getting tedious. It is for me too. But as this blog has become a record of all the blood, sweat, tears and emotion of the entire 'I want to write a book' dream, I feel the need to share the events of the past week - for posterity only. Definitely not for anyone's interest or public demand. I promise I will shut up about it soon. Probably.  \n\n\n\nRegular readers will know the book came out last week. That means it became available online in paperback and ebook formats. And whilst I knew that wasn't the end, I had assumed it would signal a calm, chilled out period of time whilst I regrouped and got ready for beginning the next project in a month or so. \n\nThis is the exact opposite of what happened. After feeling all jolly at everyone's good wishes on the launch day, the same feelings lurched dramatically into nausea and panic when I realised real people were actually going to be reading the damn thing. After all the build up, I'd forgotten that people other than my family (who have to be nice) will have paid money for a product I provided. \n\nDay by day people sent me photos on Facebook or Twitter of their copies of the book arriving in their homes. Current mates, old friends from years ago, and friends of friends I didn't really know, all commented on Twitter , Facebook  or Instagram  that they had their copies. It was utterly thrilling on the one hand. I'd written a book and people had my book. That is the dream! But on the other hand it was terrifying. I'd written a book and people had my book. That is the nightmare! \n\n\n\n\nAs the week has gone on, I have got used to it and the panicky nausea has been truly tempered by the positive things people have said. At the time of writing I have two 5 Star reviews on Amazon, and two 5 Star reviews on the Carry the Beautiful Facebook page.  The buzz of reading those was amazing. I've also had some lovely emails from my scariest reader - a retired English teacher. She definitely knows my grammar is a bit dodge in places, but she said wonderful things that made me smile. I imagine she is having to turn a blind eye to a lot of my nonsense. \n\nWhilst all this is going on internally, externally I am having fun. I've posted a copy to the British Library  as required. (I am convinced they will just type the details into a database before pulping it, but still.) I've put copies in several Oxfam drop off bins, as well as leaving one on a train I was on. I know my sister is leaving a copy in Mauritius after her holiday, so that's Africa boxed off. A friend in Japan has ordered one so that's Asia taken care of, and Australia is well and truly served by my relatives ordering copies for themselves. I just need to crack on with North and South America, and then global domination is pretty much mine. And the Arctic and Antarctica of course. \n\n\n\nUntil that day, I shall continue to swing between elation and the urge to puke. Whilst I'm doing that, have a lovely week, folks. \n\n\n\n\nSave Save \nSave Save "}]