[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/8HG_hanVOKzMJOKE7lBM6vnUT6x3YgqXr7fJR607lzu0p6TwPKXnEFbcep2nMdj_suVgSeLNYlPhxLxwJMO09rTdn4T9e4Pl_I.JTexY6j0yntA4gl3nPA--", "title": "Filmmaker learns why she endured airport stops for years", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://panow.com/taxonomy/term/25/feed", "spam_score": 0.0, "section_title": "paNOW - World", "site": "panow.com", "site_full": "panow.com", "performance_score": 0, "uuid": "06efeb6fb13f63f0625593cf7c96092e9ca657f5", "published": "2017-04-17T11:25:50.000+03:00", "site_categories": [], "country": "US", "title_full": "Filmmaker learns why she endured airport stops for years", "participants_count": 1, "main_image": ""}, "url": "http://omgili.com/ri/8HG_hanVOKzMJOKE7lBM6vnUT6x3YgqXr7fJR607lzu0p6TwPKXnEFbcep2nMdj_suVgSeLNYlPhxLxwJMO09rTdn4T9e4Pl_I.JTexY6j0yntA4gl3nPA--", "title": "Filmmaker learns why she endured airport stops for years", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:25:50.000+03:00", "language": "english", "entities": {"locations": [{"name": "washington", "sentiment": "none"}, {"name": "oregon", "sentiment": "none"}, {"name": "fort lewis", "sentiment": "none"}, {"name": "fort belvoir", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "john f. kennedy international airport", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "baghdad", "sentiment": "none"}, {"name": "newark", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "west seneca", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "persons": [{"name": "laura", "sentiment": "none"}, {"name": "poitras", "sentiment": "none"}, {"name": "edward snowden", "sentiment": "none"}, {"name": "bruning", "sentiment": "none"}, {"name": "julian assange", "sentiment": "none"}, {"name": "david roustum", "sentiment": "none"}, {"name": "snowden", "sentiment": "none"}, {"name": "lapan", "sentiment": "none"}, {"name": "john bruning", "sentiment": "none"}, {"name": "david lapan", "sentiment": "none"}, {"name": "glenn greenwald", "sentiment": "none"}, {"name": "hussein", "sentiment": "none"}, {"name": "deb riechmann", "sentiment": "none"}], "organizations": [{"name": "army", "sentiment": "none"}, {"name": "wikileaks", "sentiment": "none"}, {"name": "army national guardsman", "sentiment": "none"}, {"name": "national security agency", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "homeland security department", "sentiment": "none"}, {"name": "u.s. army national guard", "sentiment": "none"}, {"name": "customs", "sentiment": "none"}, {"name": "electronic frontier foundation", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "army criminal investigation command", "sentiment": "none"}, {"name": "nsa", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "06efeb6fb13f63f0625593cf7c96092e9ca657f5", "published": "2017-04-17T11:25:50.000+03:00", "author": "The Canadian Press", "text": "Filmmaker learns why she endured airport stops for years April 17, 2017 - 2:15am \nWASHINGTON — Laura Poitras' travel nightmare began more than a decade ago when the award-winning filmmaker started getting detained at airports every time she tried to set foot back in the United States. \nShe was stopped without explanation more than 50 times on foreign travel, and dozens more times on domestic trips, before the extra searches suddenly stopped in 2012. Only now is Poitras beginning to unravel the mystery, which goes back to a bloody day in Baghdad in 2004. \nTime after time, airport authorities searched her baggage, rummaged through her electronics and quizzed her for hours about her trips. \nIn Germany, she was told her name lights up \"like a Christmas tree\" when security officials scan flight rosters. In Austria, she was told her threat score was \"400 out of 400.\" \nAt John F. Kennedy International Airport in New York, her laptop, video camera, footage and cellphone were taken and held for 41 days. In Newark, New Jersey, a security officer threatened to handcuff her for taking notes with a ballpoint pen that he said could be used as a weapon. \n\"I asked for crayons because I thought that would be less threatening to him as a weapon,\" recounted Poitras, whose 2014 documentary film, \"Citizenfour,\" about the National Security Agency leaker Edward Snowden, won an Academy Award. \"He denied me any kind of writing device.\" \nPoitras, 53, knows U.S. government officials are not exactly fans of her politically sensitive work. \n\"Citizenfour\" depicted Poitras and journalist Glenn Greenwald's rendezvous with Snowden in a Hong Kong hotel where he handed over classified material documenting NSA's widespread surveillance program. Her new film, \"Risk,\" is about WikiLeaks founder Julian Assange. \nStill, she never knew why the security delays started in 2006. She unsuccessfully sought answers from the Homeland Security Department. She finally took the government to court, filing a Freedom of Information Act lawsuit in 2015 with help from the Electronic Frontier Foundation, a civil liberties advocacy organization. \nLate last year, as a result of the suit, the government released more than 1,000 pages of documents to Poitras, which she shared with The Associated Press. The documents show for the first time that the U.S. government investigated Poitras on suspicion she might have been involved in an ambush that led to a U.S. soldier's death in Iraq in 2004. \nOn Nov. 20, 2004, Poitras was in Baghdad filming \"My Country, My Country.\" The film depicts Iraqi elections from the perspective of an Iraqi doctor, who criticized the U.S. occupation yet hoped democracy would take root in his homeland. \nMembers of a U.S. Army National Guard unit from Oregon reported seeing a \"white female\" holding a camera on a rooftop just before they were attacked. David Roustum, 22, an Army National Guardsman from West Seneca, New York, was killed. Several troops were wounded. Some guardsmen who saw Poitras suspected she had a heads-up about the attack and didn't share that information with American forces because she wanted to film it. If true, Poitras would have broken U.S. criminal law. \nPoitras called the allegation false and said she didn't film the attack. \n\"There is no ambush footage,\" Poitras told the AP. \"That's the narrative that they created, but it doesn't correspond with any facts.\" \nAfter the attack, a lieutenant colonel, whose name was redacted from documents, reported the woman with a camera to his superiors. No action was taken. \nBut after returning home, the lieutenant colonel was contacted by author John Bruning of Dallas, Oregon, who was interviewing guardsmen for a book about their experiences in Iraq. According to the government's documents, the author learned about the woman filming on the rooftop before the ambush. \nIn an email exchange on Jan. 15, 2006, Poitras confirmed to Bruning that she was filming in the area the day of the attack, but didn't think she could help the author with his research. \n\"I was staying in the house of an Iraqi family I was following so my record of the fighting is from the perspective of the family,\" Poitras wrote to Bruning. \"I did not venture out onto the street that day — didn't seem like it would have been a good idea. So I really don't have a document of what took place on the streets.\" \nBruning told the lieutenant colonel that Poitras was the woman on the rooftop. The lieutenant colonel then informed the U.S. military that she could have been involved. \nIn February 2006, a military police agent from Fort Lewis, Washington, interviewed the lieutenant colonel and the author. \nBruning declined to speak to the AP about Poitras. \nBut in his sworn statement to military investigators, he said he believed Poitras had prior knowledge of the attack. He said Poitras was staying in a pro-Saddam Hussein neighbourhood \"and she was not in fear of her life or being kidnapped at a time when Western journalists were being abducted and executed.\" \nNevertheless, the Army Criminal Investigation Command at Fort Belvoir, Virginia, wrote a two-page letter shortly after to the FBI, saying the Army lacked sufficient evidence to charge Poitras. \nIt said: \"A review by our legal staff of the information developed thus far revealed credible information does not presently exist to believe Ms. Poitras committed a criminal offence ; however, this could quickly change if Ms. Poitras were to be interviewed and admitted she had knowledge of the ambush and refused to notify U.S. forces in order to further her documentary and media interest.\" \nPoitras said she was never interviewed. \nIn May 2006, Army officials sent a summary of their investigation of Poitras to FBI headquarters in Washington. \nThe airport detentions and delays began shortly thereafter. \nDavid Lapan, a Homeland Security Department spokesman, said other agencies control who is flagged as a high-risk traveller . When people are flagged, he said, authorities must \"put them through enhanced screening procedures. This is the reason for Ms. Poitras' repeated referrals to secondary screening.\" The FBI, which had investigated Poitras, declined to comment. \nThe detentions stopped abruptly six years later after a 2012 news article highlighted her travel problems. \nLapan said Poitras was deemed no longer of \"significant interest.\" That allowed Customs in June 2012 to \"discontinue its enhanced screening procedures,\" he said. \nPoitras worries her ordeal will resume. \nShe is seeking more information from the government. A federal judge in Washington ruled late last month the FBI hadn't provided adequate justification for withholding some information. \n\"I don't know if the investigation is ongoing,\" she said. \"I don't know if it was ended or why it was ended.\" \nDeb Riechmann, The Associated Press"}]