[{"entities": {"locations": [{"name": "portland", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "old port", "sentiment": "none"}, {"name": "crescent beach", "sentiment": "none"}, {"name": "cape elizabeth", "sentiment": "none"}, {"name": "casco bay", "sentiment": "none"}, {"name": "portland head light", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "portland museum of art", "sentiment": "none"}], "organizations": [{"name": "children’s museum", "sentiment": "none"}, {"name": "maine department of conservation", "sentiment": "none"}, {"name": "ibs", "sentiment": "none"}, {"name": "new england cottontail", "sentiment": "none"}], "persons": [{"name": "allison tibaldi", "sentiment": "none"}, {"name": "takin", "sentiment": "none"}, {"name": "eva", "sentiment": "none"}, {"name": "winslow homer", "sentiment": "none"}, {"name": "marsden hartley", "sentiment": "none"}, {"name": "edward hopper", "sentiment": "none"}, {"name": "mark", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.takingthekids.com", "site_section": "http://www.takingthekids.com/feed", "domain_rank": null, "replies_count": 0, "country": "US", "section_title": "Taking the Kids", "title": "A Portland, Maine Family Vacation at the Inn by the Sea", "title_full": "A Portland, Maine Family Vacation at the Inn by the Sea", "published": "2017-04-18T22:04:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9SgHoBgrGrgd1DZaNruPsxcbaaYCqM5OdLrXT5nQWW1OqBmLlpYXEDfM._k4XCMiUMSZWcPQZpmGy3tArUP.FNSM_6luElJ7jjA1t2sKZPEhWGPXSWgq_5x7A7R3QhKEk-", "site": "takingthekids.com", "main_image": "", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "09854aa2db4919d06ea2731bd5bdc6c15bba1b94", "site_type": "news"}, "title": "A Portland, Maine Family Vacation at the Inn by the Sea", "published": "2017-04-18T22:04:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9SgHoBgrGrgd1DZaNruPsxcbaaYCqM5OdLrXT5nQWW1OqBmLlpYXEDfM._k4XCMiUMSZWcPQZpmGy3tArUP.FNSM_6luElJ7jjA1t2sKZPEhWGPXSWgq_5x7A7R3QhKEk-", "author": "admin", "crawled": "2017-04-19T08:39:12.000+03:00", "language": "english", "text": "A private boardwalk leads from Inn by the Sea, ME to sandy Crescent Beach \nBy Allison Tibaldi, Taking the Kids correspondent \nThe Inn by the Sea is located on Crescent Beach in Cape Elizabeth, Maine. A private boardwalk leads through a wildlife sanctuary to an idyllic sandy beach, where you’ll see lobster boats and sunsets straight out of an Edward Hopper painting. The storybook setting feels miles away from urbanization. In truth, this serene coastal hotel is only a 15-minute drive from the buzzing art, food and shopping scene of Portland. If you’re looking for a family vacation that combines the best of town and country, the Inn by the Sea should top your list. \nThe Rooms \nThe 61 contemporary rooms include spacious one-and-two-bedroom suites and traditional rooms with fireplaces. The airy feel is enhanced by accents of light-colored textiles, warm wood and local art. Suites have fully-equipped kitchens and sofa beds, making them ideal for multi-generational families. Beach suites have direct views of the beach and Atlantic at Inn by the Sea \nThe Service \nThe more hotels I stay at, the more I’m convinced it’s the human element that makes a property stand out. From the moment we checked in, every employee was helpful and hospitable. When I mentioned to Mark and Eva at the front desk that I wanted to explore the local food scene, they generously offered their insider tips, including detailed maps and menu recommendations. Everyone from the gardener to the waiters to housekeeping went above and beyond our expectations. \nNature programs \nThe Inn by the Sea is serious about sustainability. Nature is a big part of the guest experience and the inn is committed to doing its part to preserve the pristine seaside setting. Eco-initiatives include heating with solar panels and biofuels and collaborating with the Maine Department of Conservation to restore the habitat for the endangered New England Cottontail bunny. You’ll see many of these adorable creatures hopping around the grounds. \nThe inn offers experiential programs to connect visitors with the surroundings. Venture out onto Casco Bay on a working lobster boat, participate in a garden tour, take a guided nature hike or visit the historic Portland Head Light, the oldest lighthouse in Maine. Bug’s Life for kids at IBS \nFor young guests, one of the best programs is a Bug’s Life. Children dress up in insect costumes as a naturalist teaches them about the local eco system from a bug’s point of view. This whimsical approach understands that kids learn best by getting inside an experience. \nThe Pampered Pooch \nIf you’re traveling with the family dog, you won’t find a more welcoming property. Man’s best friend stays free and receives a complimentary water bowl, beach towel, dog blanket and much more. When the sun sets, your pooch will enjoy turn down service complete with handmade doggie treats. If you’re pup is a true diva, he or she may enjoy a massage or supper from the gourmet pet menu. If you don’t have a dog you will probably be in the minority, but never fear; the hotel fosters dogs from a local shelter. They remain at the inn until they are adopted. Be careful to not fall in love with one of the inn’s four-legged friends or you may be taking one home. Portland headlight \nPortland \nIt’s just a quick ride from the inn to vibrant Portland . This city’s food scene wins rave reviews from the culinary crowd. We headed straight to The Holy Donut . Each fried delight is made from top quality ingredients enhanced with Maine mashed potatoes. The potatoes add moisture and a dash of umami that will make your mouth water. Unbeatable varieties include the dark chocolate with sea salt, their most popular flavor, and the traditional maple flavored. \nAfter you’ve been fortified, stroll the Old Port and wander down the many piers. Portland is a wonderfully walkable city, compact and easy to navigate. There are many independently owned shops to browse, some selling Maine-made goods. \nThe Children’s Museum and Theatre of Maine offers a wealth of hands-on exhibits, so make sure to stop by. Interactive workshops include themes like make your own hula-hoop. \nThe Portland Museum of Art has some excellent family programs so check their schedule for kid-friendly offerings. The permanent collection includes some wonderful paintings by Winslow Homer and native son Marsden Hartley.", "external_links": [], "highlightTitle": "", "uuid": "09854aa2db4919d06ea2731bd5bdc6c15bba1b94", "highlightText": "", "rating": null}]