[{"uuid": "09f16e3218495590e8fd6e38c024888c4ce309e2", "url": "http://omgili.com/ri/jHIAmI4hxg.eJXK_yAdfkfr7H0PRDPBQo.EpSYfN1kxb4yVeOJyEeqEOcnrm_qfMrKf2adYfIbzmT3_jBMxSJw0O2SfYwavz9DBKbrCphmMgF0bxqhS..nGSaQ98e5SHrdqf7hveuR3qJOaWAALfEw--", "title": "Here's what's at stake in the UK's June 8 general election", "author": "Tom Rogan, contributor", "rating": null, "published": "2017-04-18T23:24:55.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "eu", "sentiment": "none"}, {"name": "steamboat institute", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "mclaughlin group", "sentiment": "none"}, {"name": "national review", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "washington examiner", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "tom rogan", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "09f16e3218495590e8fd6e38c024888c4ce309e2", "url": "http://omgili.com/ri/jHIAmI4hxg.eJXK_yAdfkfr7H0PRDPBQo.EpSYfN1kxb4yVeOJyEeqEOcnrm_qfMrKf2adYfIbzmT3_jBMxSJw0O2SfYwavz9DBKbrCphmMgF0bxqhS..nGSaQ98e5SHrdqf7hveuR3qJOaWAALfEw--", "site_full": "www.washingtonexaminer.com", "title": "Here's what's at stake in the UK's June 8 general election", "site_section": "http://www.washingtonexaminer.com/section/blog-contributors", "domain_rank": 5216, "published": "2017-04-18T23:24:55.000+03:00", "title_full": "Here's what's at stake in the UK's June 8 general election", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "Blog Contributors Stories", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://cdn.washingtonexaminer.biz/cache/1060x600-ac111a970862a75948e98c47d7e428a0.jpg", "site": "washingtonexaminer.com"}, "external_links": ["http://opportunitylives.com/jeremy-corbyn-bernie-sanders-and-the-mythology-of-socialism", "http://www.nationalreview.com/article/441779/brexit-british-court-overrules-people", "https://twitter.com/tomrtweets", "http://www.nationalreview.com/article/423955/jeremy-corbyn-destroy-us-uk-special-relationship-tom-rogan"], "language": "english", "text": "Until Tuesday, British Prime Minister Theresa May, said the next United Kingdom election wouldn't be held until 2020. This morning, however, she announced an election will be held just a few weeks from now, on June 8. Parliament must affirm May's request in a two-thirds majority vote on Wednesday, but all the major political parties support her decision. She's almost certain to get approval.\nNevertheless, this is a big reversal. So why did May change her mind? For two reasons:\nFirst, May knows that her main opponent, the Labour Party (Britain's left/left-of-center party) is extraordinarily weak. Led by Jeremy Corbyn, an avowed socialist with the charisma of a sloth, Labour is trailing May's Conservative Party by 20 points in the polls. That 20 point difference is significant in the context of opinion polls just before the previous election in June 2015. Those polls showed a dead heat, but the Conservatives won a small majority in Parliament. By holding an election now, while the polls show Labour in a desperate plight, May hopes to win an even larger majority. It's simple opportunism.\nSecond, May wants a democratic mandate for her premiership. Taking office after her predecessor's resignation last summer, May lacks the public's stamp of approval. An election resolves that issue.\nBut it also gives May a stronger hand in her Brexit negotiations with the European Union. Facing those extremely complex and highly-political discussions, May needs to consolidate her political base. European Union leaders want to penalize Britain for its rejection of the EU super-project. They believe that if Britain does not visibly suffer from Brexit, other EU member states might decide to leave.\nRecognizing this external challenge, May wants to be able to expand the EU's greatest vulnerability: its comparative lack of accountability to voters. By holding and winning an election, May can go into EU negotiations with the ability to say, \"If you respect democracy, you must deal with me in good faith.\"\nMay also wants to limit her domestic vulnerability. At home, she faces an alliance of anti-Brexit judicial activists and politicians who are attempting to tie her hands to their agenda. By winning an electoral mandate, May will more easily be able to sideline and ignore these opponents.\nRegardless, while confident, May's Conservative Party won't be taking anything for granted. They know that opinion polls can shift rapidly. As do Labour's campaign strategists. As such, this is likely to be a bitter election. Expect Corbyn to paint May as an ideological extremist with no regard for the poor. Expect May to present Corbyn as a threat to national security. And as usual, expect the British public to largely ignore the campaign.\nStill, this election is of unusual importance to the American people. If nothing else, May values the special relationship and wants continued strong ties with the United States. Conversely, Corbyn detests American power, and would destroy the U.K.-U.S. alliance.\nTom Rogan ( @TomRtweets ) a foreign policy columnist for National Review, a domestic policy columnist for Opportunity Lives, a former panelist on The McLaughlin Group and a senior fellow at the Steamboat Institute.\n ", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:55.000+03:00"}]