[{"uuid": "0b206529fbf86eea182b67edb21d155d03782271", "url": "http://omgili.com/ri/.wHSUbtEfZSJG760cycU4ggVIsmQqh7evJwXdqQ04pjJlXwePNpTjQ--", "title": "Register for the 2017 Crossroads Conference Today", "author": "amywilliams", "rating": null, "published": "2017-04-18T02:14:00.000+03:00", "highlightText": "", "entities": {"organizations": [], "locations": [], "persons": []}, "highlightTitle": "", "thread": {"uuid": "0b206529fbf86eea182b67edb21d155d03782271", "url": "http://omgili.com/ri/.wHSUbtEfZSJG760cycU4ggVIsmQqh7evJwXdqQ04pjJlXwePNpTjQ--", "site_full": "uaatwork.arizona.edu", "title": "Register for the 2017 Crossroads Conference Today", "site_section": "http://uaatwork.arizona.edu/uaatwork.xml", "domain_rank": 4571, "published": "2017-04-18T02:14:00.000+03:00", "title_full": "Register for the 2017 Crossroads Conference Today", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "Subscribe", "site_type": "blogs", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "", "site": "arizona.edu"}, "external_links": [], "language": "english", "text": "Register for the 2017 Crossroads Conference Today Classified Staff Council April 17, 2017 \nUA 2017 Classified Staff Council Crossroads Conference is on May 19 from 8 a.m.-4 p.m. at the JW Marriott Tucson Starr Pass Report and Spa. \nCost of the conference is $80 per attendee. \nRegister today: https://www.regonline.com/registration/Checkin.aspx?EventId=1950912 . \nUpon registration you will be asked to choose which presentation you would like to attend during each of the three sessions. \nA brief description of each presentation follows: Conflict Management Strategies for Success in the Workplace – We face the possibility of clashing styles and values, misunderstanding, miscommunication, and other interpersonal challenges on a daily basis, and these challenges can have serious impacts on both our individual and organizational success and wellbeing. In this engaging workshop you will have the opportunity to improve your competency and confidence in communicating, collaborating and navigating conflict effectively. Communicating Well on a Multi-Generational Campus – Working well together depends in large part upon effective communication. Explore how generational differences can compound poor communication, or how it can inspire and illuminate innovation and creativity. This session will broadly introduce participants to the various generations currently in the workforce and how their views can inhibit or enhance the effective functioning in a workgroup. Groovy Grains – the science behind why we need to make our grains whole. In this session participants will learn the anatomy of a whole grain and what makes it whole. They will also sample whole grains and learn simple ways to incorporate more whole grains into their diets. Cybersecurity and You – Cybersecurity is not something your IT staff can just \"do for you.\" We are all part of the solution. This interactive session will cover current threats and trends, and provide you with tips so that you can protect yourself and your identity, as well as the University's information assets. You will also have a better understanding of what tools and resources are available to protect sensitive information. Yoga – Take the time to slow down and breathe while flowing through yoga poses meant to increase strength, balance and flexibility. Whether you are brand new to yoga or have a regular practice, this session is for you! Desk Exercise – Learn ways to incorporate movement into your day including desk exercises. Engaging in 30 minutes of physical activity daily is important, but more research is showing that sitting all day is counteracting the benefits. This session will equip you with tips and tricks to add more movement into your work day to keep you healthy. Self Defense – Knowing how to protect yourself is a necessary skill. This session will teach basic tactics to prepare you for unsafe situations. Retirement Planning: Explore the Possibilities – This workshop will help you determine your retirement needs and help you invest wisely while protecting what you have accumulated. Learn about the importance of starting early to save for retirement and what is involved in calculating the cost of retirement. We will also review potential sources of retirement income, including your current benefit options, as well as how to evaluate personal savings and investment strategies. Active Shooter Safety Practices – This seminar will empower you with the mindset and practical tools to make the best possible decisions for your day-to-day safety and teach you how to respond during crisis situations. You will learn about a wide range of general safety strategies, and specific best practices to utilize if you find yourself in an active shooter situation. Developing Me – Where do you want to be, and how are you going to get there? No one is as invested in your career as you. Therefore, we must take responsibility for directing our career to get to where we want to go. In this interactive session, we will identify our professional goals and pinpoint the specific actions necessary for us to reach those goals. Legislative Advocacy – UA Government & Community Relations (GCR) represents our university at all levels of government to ensure public support and investment. As a part of that mission, GCR operates a legislative advocacy program, AdvoCats, to bring together the broader community of Wildcats to be advocates for the UA, especially at the Arizona legislature. Come hear from Mike Sistak, the UA's director of advocacy and community engagement, on how the AdvoCats are changing the conversation for our university and how you can be involved. CPR Training – Sarver Heart Center Chest-Compression-Only CPR. If you see someone collapse unexpectedly, this is usually the result of cardiac arrest. Studies have shown that by doing chest compressions only, without mouth-to-mouth breathing, bystanders in-crease the person's chance of survival. Cardiac arrest can happen to anyone, any place, any time, any age, any physical condition, and without any warning. Do YOU know what to do? \n*Tips for better Work-Life Balance has been canceled – This session has been canceled by the presenters, sorry for the inconvenience. If you were registered for this session please go to the website and make another selection: https://www.regonline.com/registration/login.aspx?eventID=1950912&MethodId=0&EventsessionId", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:16.000+03:00"}]