[{"rating": null, "external_links": ["https://www.gannett-cdn.com/-mm-/4af0628c86e1f32fb3e7c98afa805ac4f08ec698/r=84&c=84x84/https/brightcove.hs.llnwd.net/v1/unsecured/media/1578086878/201704/3263/1578086878_5398592924001_5397731957001-vs.jpg", "https://www.gannett-cdn.com/-mm-/ba37a4a5f7bacd9bf35f559662194d7894e27828/r=84&c=84x84/http/bcdownload.gannett.edgesuite.net/asbury/35553589001/201704/3609/35553589001_5396750047001_1618014546001-vs.jpg", "https://www.gannett-cdn.com/-mm-/baa7d5ece890abc8f1f017098398d44043c63dc6/r=84&c=84x84/http/videos.usatoday.net/Brightcove3/29906170001/201704/3625/29906170001_5397351656001_5397329134001-vs.jpg", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/2oM69Um&text=Johnson%27s%20drive%20at%20buzzer%20lifts%20Jazz%20over%20Clippers%20in%20Game%201&via=azcentral", "https://www.gannett-cdn.com/-mm-/baa7d5ece890abc8f1f017098398d44043c63dc6/r=84&c=84x84/http/videos.usatoday.net/Brightcove3/29906170001/201704/3840/29906170001_5399038112001_5398992917001-vs.jpg", "https://www.gannett-cdn.com/-mm-/ba37a4a5f7bacd9bf35f559662194d7894e27828/r=84&c=84x84/http/bcdownload.gannett.edgesuite.net/jacksontn/44862796001/201704/2367/44862796001_5398308910001_5397118469001-vs.jpg", "https://www.gannett-cdn.com/media/2017/04/16/USATODAY/usatsports/b696cd8f0da54a72a5f7e9e3bb633a84.jpg", "https://www.gannett-cdn.com/-mm-/baa7d5ece890abc8f1f017098398d44043c63dc6/r=84&c=84x84/http/videos.usatoday.net/Brightcove3/29906170001/201704/3352/29906170001_5399181882001_5399115274001-vs.jpg", "https://www.gannett-cdn.com/-mm-/172d43bf5da5e8a45765b42aa708208cec8045b3/r=84&c=84x84/http/download.gannett.edgesuite.net/arizonarepublic/brightcove/29901534001/201704/3560/29901534001_5399393430001_5399393454001-vs.jpg", "https://www.gannett-cdn.com/-mm-/baa7d5ece890abc8f1f017098398d44043c63dc6/r=84&c=84x84/http/videos.usatoday.net/Brightcove3/29906170001/201704/455/29906170001_5397429540001_5397412260001-vs.jpg", "https://www.gannett-cdn.com/-mm-/172d43bf5da5e8a45765b42aa708208cec8045b3/r=84&c=84x84/http/download.gannett.edgesuite.net/arizonarepublic/brightcove/29901534001/201704/3839/29901534001_5398297675001_5398296597001-vs.jpg", "https://www.gannett-cdn.com/-mm-/172d43bf5da5e8a45765b42aa708208cec8045b3/r=84&c=84x84/http/download.gannett.edgesuite.net/arizonarepublic/brightcove/29901534001/201704/3304/29901534001_5399393428001_5399385006001-vs.jpg", "https://www.gannett-cdn.com/-mm-/172d43bf5da5e8a45765b42aa708208cec8045b3/r=84&c=84x84/http/download.gannett.edgesuite.net/arizonarepublic/brightcove/29901534001/201704/2488/29901534001_5399899094001_5399881820001-vs.jpg", "https://www.gannett-cdn.com/-mm-/4af0628c86e1f32fb3e7c98afa805ac4f08ec698/r=84&c=84x84/https/brightcove.hs.llnwd.net/v1/unsecured/media/1578086878/201704/945/1578086878_5395790848001_5395772987001-vs.jpg", "https://www.gannett-cdn.com/-mm-/172d43bf5da5e8a45765b42aa708208cec8045b3/r=84&c=84x84/http/download.gannett.edgesuite.net/arizonarepublic/brightcove/29901534001/201704/728/29901534001_5399888744001_5399863454001-vs.jpg", "https://www.gannett-cdn.com/-mm-/172d43bf5da5e8a45765b42aa708208cec8045b3/r=84&c=84x84/http/download.gannett.edgesuite.net/arizonarepublic/brightcove/29901534001/201704/2887/29901534001_5397290188001_5396860904001-vs.jpg", "https://www.gannett-cdn.com/-mm-/baa7d5ece890abc8f1f017098398d44043c63dc6/r=84&c=84x84/http/videos.usatoday.net/Brightcove3/29906170001/201704/95/29906170001_5398863329001_5398574885001-vs.jpg", "https://www.gannett-cdn.com/-mm-/baa7d5ece890abc8f1f017098398d44043c63dc6/r=84&c=84x84/http/videos.usatoday.net/Brightcove3/29906170001/201704/1065/29906170001_5397673316001_5397637814001-vs.jpg", "https://www.gannett-cdn.com/-mm-/172d43bf5da5e8a45765b42aa708208cec8045b3/r=84&c=84x84/http/download.gannett.edgesuite.net/arizonarepublic/brightcove/29901534001/201704/720/29901534001_5399383766001_5399373131001-vs.jpg", "https://www.gannett-cdn.com/-mm-/ba37a4a5f7bacd9bf35f559662194d7894e27828/r=84&c=84x84/http/bcdownload.gannett.edgesuite.net/lansing/41075352001/201704/1457/41075352001_5396768064001_5396756531001-vs.jpg", "https://www.gannett-cdn.com/-mm-/172d43bf5da5e8a45765b42aa708208cec8045b3/r=84&c=84x84/http/download.gannett.edgesuite.net/arizonarepublic/brightcove/29901534001/201704/3015/29901534001_5398223633001_5398220664001-vs.jpg", "https://www.gannett-cdn.com/-mm-/ba37a4a5f7bacd9bf35f559662194d7894e27828/r=84&c=84x84/http/bcdownload.gannett.edgesuite.net/detroitfreep/35547428001/201704/3817/35547428001_5398049694001_5396903342001-vs.jpg", "https://www.gannett-cdn.com/-mm-/baa7d5ece890abc8f1f017098398d44043c63dc6/r=84&c=84x84/http/videos.usatoday.net/Brightcove3/29906170001/201704/2248/29906170001_5398855169001_5398830970001-vs.jpg", "https://www.gannett-cdn.com/-mm-/baa7d5ece890abc8f1f017098398d44043c63dc6/r=84&c=84x84/http/videos.usatoday.net/Brightcove3/29906170001/201704/2297/29906170001_5397962168001_5397940140001-vs.jpg", "https://www.gannett-cdn.com/-mm-/172d43bf5da5e8a45765b42aa708208cec8045b3/r=84&c=84x84/http/download.gannett.edgesuite.net/arizonarepublic/brightcove/29901534001/201704/2887/29901534001_5397290172001_5396860912001-vs.jpg", "https://www.gannett-cdn.com/-mm-/172d43bf5da5e8a45765b42aa708208cec8045b3/r=84&c=84x84/http/download.gannett.edgesuite.net/arizonarepublic/brightcove/29901534001/201704/1713/29901534001_5397656163001_5397616979001-vs.jpg", "https://www.gannett-cdn.com/-mm-/b24332fa2564090debac50d0e979af3558e4e08e/r=299&c=299x168/http/download.gannett.edgesuite.net/arizonarepublic/brightcove/29901534001/201704/40/29901534001_5400029424001_5400013652001-vs.jpg", "https://www.gannett-cdn.com/-mm-/baa7d5ece890abc8f1f017098398d44043c63dc6/r=84&c=84x84/http/videos.usatoday.net/Brightcove3/29906170001/201704/2913/29906170001_5398658051001_5398652425001-vs.jpg", "https://www.gannett-cdn.com/-mm-/172d43bf5da5e8a45765b42aa708208cec8045b3/r=84&c=84x84/http/download.gannett.edgesuite.net/arizonarepublic/brightcove/29901534001/201704/1272/29901534001_5400029406001_5400014442001-vs.jpg", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/2oM69Um&mini=true", "https://www.gannett-cdn.com/-mm-/baa7d5ece890abc8f1f017098398d44043c63dc6/r=84&c=84x84/http/videos.usatoday.net/Brightcove3/29906170001/201704/273/29906170001_5397863006001_5397824391001-vs.jpg", "https://www.gannett-cdn.com/-mm-/9082e554c422d28175cd4e1b0cd144acf566c2cc/c=0-388-3312-4804&r=537&c=0-0-534-712/local/-/media/2017/04/16/USATODAY/usatsports/b696cd8f0da54a72a5f7e9e3bb633a84.jpg", "https://www.gannett-cdn.com/-mm-/01ef438c024eb4ca5d6317d66c99bc9eff77f9c4/r=255x400/local/-/media/2017/04/16/USATODAY/usatsports/b696cd8f0da54a72a5f7e9e3bb633a84.jpg", "https://www.gannett-cdn.com/-mm-/172d43bf5da5e8a45765b42aa708208cec8045b3/r=84&c=84x84/http/download.gannett.edgesuite.net/arizonarepublic/brightcove/29901534001/201704/1247/29901534001_5398030081001_5396828805001-vs.jpg", "https://www.gannett-cdn.com/-mm-/172d43bf5da5e8a45765b42aa708208cec8045b3/r=84&c=84x84/http/download.gannett.edgesuite.net/arizonarepublic/brightcove/29901534001/201704/3608/29901534001_5398880094001_5398830296001-vs.jpg"], "crawled": "2017-04-16T08:31:43.000+03:00", "author": "AP", "entities": {"persons": [], "locations": [], "organizations": []}, "text": "The Utah Jazz's Joe Johnson scores over the Clippers' Jamal Crawford and DeAndre Jordan to win Game 1. (Photo: Robert Hanashiro, USA TODAY Sports)\n705 CONNECT TWEET 4 LINKEDIN 2 COMMENT EMAIL MORE LOS ANGELES (AP) — Joe Johnson has seen a lot in his 16 years in the NBA. So the veteran didn't flinch with the clock ticking down and the game tied.\nAll that experience is why the Utah Jazz brought him in this season.\nIt paid off when Johnson drove the lane and hit a floater at the buzzer, giving the Jazz a 97-95 victory over the Los Angeles Clippers after Utah lost Rudy Gobert 17 seconds into their playoff opener on Saturday night.\n\"I just wanted to get as close as I could to the basket, and it was a good thing it went down,\" Johnson said.\nJohnson, who scored 21 points, was left isolated against Jamal Crawford on the final play. He powered his way inside and lofted a shot over Crawford and DeAndre Jordan that bounced around the rim before falling in. A video review confirmed it was good.\n\"I just try to be patient, get to a sweet spot, and make the right play,\" Johnson said.\nHe's made an NBA-best eight game-winning buzzer-beaters in the past 10 years.\n\"That's what he's been doing all his career,\" Utah's Boris Diaw said. \"So when he gets the ball at the end of the game, we are pretty confident.\"\nThe Jazz were dealt a blow before either team had settled into the game.\nGobert sprained his left knee on the game's first play when he banged knees with Clippers forward Luc Mbah a Moute, leaving the Jazz without their 7-foot-1 center who averaged 14.0 points and 12.8 rebounds during the regular season.\n\"We felt and knew that a lot of people probably were counting us out when he went down, but man, we stuck together,\" Johnson said.\nUtah steadied itself behind Johnson and fellow veteran George Hill, both of whom were brought in to balance the inexperienced Jazz. Johnson finished with 21 points off the bench and Hill added 16 points.\nGordon Hayward had 19 points and 10 rebounds for Utah.\nBlake Griffin scored 26 points and Chris Paul added 25 points and 11 assists for the Clippers, whose seven-game winning streak ended with their first loss since March 26 against Sacramento.\nA driving Paul banked in a floater with 13 seconds to go, tying the game at 95.\nThe Jazz didn't call a timeout.\n\"We just wanted to have it where they couldn't set up on us,\" Hayward said, glancing at Johnson. \"We just wanted to get it and go and let this man go to work.\"\nMaking their first playoff appearance in five years, the Jazz outshot the Clippers and narrowly controlled the paint, owning a 42-40 edge.\nThe teams tied with identical 51-31 records in the regular season. The Clippers earned the No. 4 seed and home court by virtue of winning the season series 3-1.\n\"We fought until the end of the year to get it, and now we've given it right back,\" Clippers coach Doc Rivers said.\nUtah withstood Paul's offensive outburst in the fourth after the Jazz led by eight on Hill's 3-pointer. Paul rattled off 10 straight Los Angeles points, drawing the Clippers to 90-89 on a three-pointer.\nHayward and Johnson scored, keeping the Jazz ahead 94-91. But Johnson lost the ball and Hill fouled Griffin, who made both free throws to get the Clippers to 94-93 with 23 seconds left.\nAfter a timeout by the Jazz, Griffin fouled Derrick Favors, who missed the first and made the second after it hit the rim and went in for a 95-93 lead with 18 seconds left.\n\"We've got to be better,\" Paul said. \"They played harder, they were more physical.\"\nGobert was setting a screen when he and Mbah a Moute made contact and Gobert fell to the court clutching his left leg.\nHe had to be helped off by Diaw and Hill. A team spokesman said X-rays were negative, and Gobert was taken from Staples Center to have a precautionary MRI.\n\"We felt a little bit stunned out there,\" Diaw said, \"but then we regrouped and got back on the horse.\"\nThe matchup between Gobert and Jordan was expected to be a key in the best-of-7 series. Jordan finished with 10 points and 15 rebounds and got called for a technical in the fourth with the Clippers down six.\n\"We have the rule, no fourth-quarter techs, and he got one,\" Rivers said. \"It didn't make a huge difference, but it could have for sure.\"\nUtah outscored the Clippers 16-10 to open the third before Crawford's jumper put Los Angeles ahead 70-68. Hayward singlehandedly outscored the Clippers 6-0 to send the Jazz into the fourth leading 74-70.\nNeither team led by more than six points in the first half. The Clippers were ahead by six when the Jazz outscored them 14-2 in the second quarter to take their own six-point lead. Griffin got stripped under the basket by Hayward, but he hit a 3-pointer and made a layup on the Clippers' next two possessions to key a 14-8 spurt that ended with the half tied 52-all.\nMore NBA:\nJoe Johnson's clutch buzzer-beating game-winner lifts Jazz over Clippers in Game 1\nMRI: Utah's Rudy Gobert suffered hyperextended knee, bone contusion\nCalkins: After fast start, Grizzlies crushed by Spurs in Game 1\nTip-ins Jazz: The last time the teams met in the playoffs was a first-round series in 1996-97, won 3-0 by the Jazz. ... Utah also won the teams' other postseason series 3-2 in 1991-92, which was interrupted by the riots after the Rodney King verdict.\nClippers: Backup G Austin Rivers (strained left hamstring) did some shooting for the first time Saturday since his injury. He's out for at least the first two games of the series. ... Former Clipper Baron Davis shared hugs with the referees from the courtside seat.\nUp next Game 2 is Tuesday night at Staples Center.\nPHOTOS: Best of NBA playoffs first round\nFacebook Twitter Google+ LinkedIn NBA playoffs: Best photos from the first round Fullscreen Post to Facebook Posted! A link has been posted to your Facebook feed.\nAtlanta Hawks forward Paul Millsap (4) and Washington Wizards forward Markieff Morris (right) and forward Otto Porter Jr. (left) fight for a loose ball during the second quarter in game one of the first round of the 2017 NBA Playoffs at Verizon Center. Brad Mills-USA TODAY Sports Fullscreen Washington Wizards center Marcin Gortat (13) dunks the ball as Atlanta Hawks forward Paul Millsap (4) defends during the fourth quarter in game one of the first round of the 2017 NBA Playoffs at Verizon Center. Washington Wizards won 114 - 107. Brad Mills-USA TODAY Sports Fullscreen Atlanta Hawks forward Paul Millsap (4) passes the ball as Washington Wizards center Marcin Gortat (13) looks on during the first quarter in game one of the first round of the 2017 NBA Playoffs at Verizon Center. Brad Mills-USA TODAY Sports Fullscreen The Utah Jazz's Joe Johnson scores over the L.A. Clippers' Jamal Crawford and DeAndre Jordan to win Game 1, 97-95, at Staples Center. Robert Hanashiro, USA TODAY Sports Fullscreen L.A. Clippers center DeAndre Jordan dunks against the Utah Jazz. Robert Hanashiro, USA TODAY Sports Fullscreen Utah Jazz center Rudy Gobert (27) is helped off the court by teammates George Hill (3) and Boris Diaw (33). Robert Hanashiro, USA TODAY Sports Fullscreen Memphis Grizzlies shooting guard Vince Carter dunks the ball against the San Antonio Spurs during the first half in Game 1 of the first round of the 2017 NBA Playoffs. Soobum Im, USA TODAY Sports Fullscreen Memphis Grizzlies center Marc Gasol is defended by San Antonio Spurs center Pau Gasol during the first half in Game 1 of the first round of the 2017 NBA Playoffs. Soobum Im, USA TODAY Sports Fullscreen Milwaukee Bucks forward Giannis Antetokounmpo reacts after a play against Toronto Raptors guard DeMar DeRozan in Game 1 of the first round of the 2017 NBA Playoffs. John E. Sokolowski, USA TODAY Sports Fullscreen Toronto Raptors forward PJ Tucker reacts after making a basket against the Milwaukee Bucks in Game 1 of the first round of the 2017 NBA Playoffs. John E. Sokolowski, USA TODAY Sports Fullscreen Milwaukee Bucks forward Giannis Antetokounmpo controls the ball against Toronto Raptors forward DeMarre Carroll during the first half in Game 1 of the first round of the 2017 NBA Playoffs. John E. Sokolowski, USA TODAY Sports Fullscreen Milwaukee Bucks forward Giannis Antetokounmpo goes up for a dunk as Toronto Raptors center Jonas Valanciunas defends during the first half in Game 1 of the first round of the 2017 NBA Playoffs. John E. Sokolowski, USA TODAY Sports Fullscreen Milwaukee Bucks forward Giannis Antetokounmpo drives to the basket against Toronto Raptors center Jonas Valanciunas during the first half in Game 1 of the first round of the 2017 NBA Playoffs. John E. Sokolowski, USA TODAY Sports Fullscreen A general view of fans gathered in the area outside of the Air Canada Centre known as Jurassic Park prior to Game 1 of the first round of the 2017 NBA Playoffs between the Milwaukee Bucks and Toronto Raptors. John E. Sokolowski, USA TODAY Sports Fullscreen LeBron James (23) reacts after a 109-108 win against the Indiana Pacers in Game 1 of the first round of the 2017 NBA Playoffs. David Richard, USA TODAY Sports Fullscreen Cleveland Cavaliers forward LeBron James (23) reacts after a dunk in the third quarter against the Indiana Pacers in Game 1 of the first round of the 2017 NBA Playoffs. David Richard, USA TODAY Sports Fullscreen Cleveland Cavaliers forward LeBron James (23) dunks in the second quarter against the Indiana Pacers in Game 1 of the first round of the 2017 NBA Playoffs. David Richard, USA TODAY Sports Fullscreen Fans hold signs in the third quarter in Game 1 of the first round of the 2017 NBA Playoffs. David Richard, USA TODAY Sports Fullscreen Indiana Pacers forward Paul George (13) dribbles against Cleveland Cavaliers guard Kyrie Irving (2) in the second quarter in Game 1 of the first round of the 2017 NBA Playoffs. David Richard, USA TODAY Sports Fullscreen Indiana Pacers guard Lance Stephenson (6) drives against Cleveland Cavaliers guard Kyrie Irving (2) in the second quarter in Game 1 of the first round of the 2017 NBA Playoffs. David Richard, USA TODAY Sports Fullscreen Indiana Pacers forward Paul George (13) dribbles against Cleveland Cavaliers forward LeBron James (23) in the second quarter in Game 1 of the first round of the 2017 NBA Playoffs. David Richard, USA TODAY Sports Fullscreen Cleveland Cavaliers forward LeBron James warms up before Game 1 of the first round of the 2017 NBA Playoffs against the Indiana Pacers. David Richard, USA TODAY Sports Fullscreen Like this topic? You may also like these photo galleries: Replay 1 of 22 2 of 22 3 of 22 4 of 22 5 of 22 6 of 22 7 of 22 8 of 22 9 of 22 10 of 22 11 of 22 12 of 22 13 of 22 14 of 22 15 of 22 16 of 22 17 of 22 18 of 22 19 of 22 20 of 22 21 of 22 22 of 22 Autoplay Show Thumbnails Show Captions Last Slide Next Slide", "url": "http://omgili.com/ri/jHIAmI4hxg.aYc74cvbCG02TN.W9XUdU4wj97IAITTsOtaR7o9YCEJZtU2lkLvmN1t0wYsyULi8Bc61ps0IKGkZd7ZhGKkx_d52.yqn.JlVqgyC4qcbccJW.haS102n7g9bAFTtYUFhttErHczS5CIFmPeNsNYW6j1f_iv4nRsg-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T08:31:43.000+03:00", "language": "english", "title": "Johnson's drive at buzzer lifts Jazz over Clippers in Game 1", "thread": {"title_full": "Johnson's drive at buzzer lifts Jazz over Clippers in Game 1", "site_full": "www.azcentral.com", "site": "azcentral.com", "site_section": "http://www.azcentral.com/section/global/nation-now/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "news", "spam_score": 0.0, "domain_rank": 3741, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "azcentral", "url": "http://omgili.com/ri/jHIAmI4hxg.aYc74cvbCG02TN.W9XUdU4wj97IAITTsOtaR7o9YCEJZtU2lkLvmN1t0wYsyULi8Bc61ps0IKGkZd7ZhGKkx_d52.yqn.JlVqgyC4qcbccJW.haS102n7g9bAFTtYUFhttErHczS5CIFmPeNsNYW6j1f_iv4nRsg-", "published": "2017-04-16T08:31:43.000+03:00", "title": "Johnson's drive at buzzer lifts Jazz over Clippers in Game 1", "uuid": "0b57c4a56afd3f30a6e090b335a55056332ef17a", "main_image": "https://www.gannett-cdn.com/-mm-/daaa9c8b72edc7ea2ab4ec6aadf7709744e81e6f/c=0-1664-3312-3527&amp;r=x1683&amp;c=3200x1680/local/-/media/2017/04/16/USATODAY/usatsports/b696cd8f0da54a72a5f7e9e3bb633a84.jpg"}, "uuid": "0b57c4a56afd3f30a6e090b335a55056332ef17a", "ord_in_thread": 0}]