[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:25:04.000+03:00", "author": "David Milner (noreply@blogger.com)", "entities": {"persons": [{"name": "david bowie", "sentiment": "none"}, {"name": "david milner", "sentiment": "none"}, {"name": "ceaucescu", "sentiment": "none"}, {"name": "merdeok", "sentiment": "none"}, {"name": "spooner", "sentiment": "none"}, {"name": "albert hall", "sentiment": "none"}, {"name": "dan quayle", "sentiment": "none"}, {"name": "aston martin", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "romania", "sentiment": "none"}, {"name": "siret", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "albania", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "nudes international", "sentiment": "none"}, {"name": "neasden gazette & bugle", "sentiment": "none"}, {"name": "twitter and facebook", "sentiment": "none"}, {"name": "dollis hill review of books", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "university of westminster", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "fifa", "sentiment": "none"}]}, "text": "\n\n\n\n\n\nIt is with a heavy heart that I write to inform you of The Proprietor's decision to axe The Sunday Items. It has always been the errant child of his newspaper group,  Nudes International, and a constant irritant for its incessant attacks on the American and British politicians who he entertains lavishly, and whose strings he tweaks from time to time. In this era of the new illiberalism he can dispense with The Items at a stroke of his pen, by executive order; and without protest, as we have come to accept far worse incursions into freedom of speech and human rights as part of our daily diet of news.\n\nBack in the day when we started as a niche publication, pulling in at least 6 readers a week, and some of those representing keyboarding errors, we could be safely ignored. Since the dramatic upsurge of interest in the Autumn, peaking at over 2000 views per week, we have clearly been seen as a threat to the transatlantic Establishment, the military-industrial complex, the CIA/FBI, the Freemasons, the patriarchy, the Illuminati and FIFA. It was just a matter of time. Dark threats were uttered by intermediaries that Washington in particular was displeased with The Items' depiction of the President as something less than a blessed intellectual giant, paragon of justice and human rights, and orator second only to Dan Quayle in his grasp of languages and World Geography. When the axe fell last night it came swiftly.\n\nThe Items is dead. Long live The Items! We will continue without the backing of Mr Merdeok, but on a less frequent basis. We will maintain our name and masthead, for brand recognition but will appear on a monthly basis, at most. This is the only alternative to staff cuts, and the Editor rather feels that his body has suffered enough  from the 'slings and arrows of outrageous fortune' without getting cut in half - not even by a conjuror with a promise of restoration.\n\nOther media will cover this development rather differently, of course. They will say that The Editor was preparing to jump before he was pushed. That age and infirmity meant that the human fabric was being stretched too far between his various commitments, and was threatening to rend apart. In short, he was heading for a gravy Earl, as Dr. Spooner might have put it. There may be a kernel of truth in this, in that staff have heard him muttering about 'spending more time with his dogs' recently. It is true that in the last few years, in addition to editing The Items, he has revised (but not finally signed off, a novel), published an autobiography, written 1.95 plays (which he's had no time to promote) and recently begun to re-launch a company he was forced to abandon a few years back through serious illness. His house needs painting inside and out, his garden is a wasteland and his younger daughter alleges neglect.\n\nSomething had to give. Perhaps there is another clue in a recent interview he gave to the Neasden Gazette & Bugle (incorporating the Dollis Hill Review of Books): \"I never meant this blog to be a dialogue or a conversation, but in 63 issues over 15 months, no-one has availed themselves of the Comments section on the blog, not once, not ever. Is there anyone there?  Sometimes it feels like I'm throwing a cocktail sausage around an empty Albert Hall (although I'm aware this image has another connotation). Do Blogspot just make up the numbers? There is no feedback. I'm not bitter, just a little disappointed\", he said, with a slight moistening of his good eye. On the other hand he reported an astonishing breadth of global support for the Items as audience analysis reveals a sprinkling of readers in Thailand, Alaska, Albania, Brazil, Romania, Iraq, Russia, China, and South Africa, to name a few. And that 80% of the total readership come from the US. Nostalgic expats, presumably,\n\nThe Items, like HMS Titanic McArkface (featured last week) has choppy waters to negotiate. It will need your support and loyalty. If you have enjoyed any of it, say so and tell your friends and us. It is not sunk, nor holed below the waterline, it is simply a less frequent ferry to that rather bizarre country of peculiar humour, single-issue politics and embarrassing fits of personal disclosure. We hope you will stay with the ship (enough maritime metaphors. Ed). All issues will be well flagged up on Twitter and Facebook. Who will salute?\n\nThe Editor asks a favour: please communicate either your name or your email address to The Items via facebook chat (to David Milner), or the Items' comments section (at the end). We need proof you exist and an individual channel of communication. Or send something you might like to see 'in print,' text or picture, original or second-hand. Don't make us beg.\n\n\n\n\n\n\n       \n\n\n\n\n\n\n\n\n                                                       \n\n\n\nIn June 1994 I was invited to visit the orphanage in Siret, N.E.Romania (see FESS, chapters  53-5) one of many left behind by the monstrous Ceaucescu dictatorship and their disastrous population- expansion programme. It was a place of such massively insanitary deprivation that the stench of urine and faeces that had soaked into the floor-boards over years, greeted the visitor before entering the building: inside, it was like a hammer blow. Inevitably, back in the UK, I became involved in fund-raising activities, the most successful of which was an annual quiz-night in the University of Westminster, the first one raised £150, the last over £1000. There was a unique chemistry in these events that guaranteed a good night for everyone; there was never a dud one. Good-natured competition, constant banter, humour in the quiz itself, feats of memory and enlightened guesswork or fabrication or cheating, plus alcohol or medicinal cannabinoids, were the vital ingredients in evenings which were by far the most successful social events of the year. On one particularly memorable night, a Professor (whose name escapes me), compèred the evening in full drag. At the end of the evening a brave student challenged him to 'show us your tits', whereupon he reached into his bra with both hands and scattered about 20 odd socks over the audience: the sequence somehow found its way onto 'You've Been Framed', thankfully without attribution.\n\nGoing off at a slight tangent, I have to tell you that academics are are not paid very well. Similarly qualified professionals in medicine and law generally earn at lest 50% more, and even greater sums in business and industry, or local authorities. Academic pensions are proportionately meagre. Discovering the mismatch between income and outgoings in retirement, I decided to busk while selling the Big Issue at the same time. David Bowie made this possible: \"Ch-ch-ch change is 25p\" works for a while, but the sympathetic glances of old students, much richer than I, were unbearable.\n\nThen I had the idea of putting the long experience of quiz nights I had acquired over the years to 'commercial' use by starting a company to produce and distribute quizzes: high quality, innovative, entertaining quizzes that would appeal to many different audiences. When I went 'on the road' to sell them to pubs, it was very successful: could I think about what colour Aston Martin I might order? Not really, because coincidentally I became seriously ill with acute thyrotoxicosis, which I survived, obviously, but not by much. A long period or recovery and convalescence followed, succeeded by the birth of FESS, and a lot of other writing. The quiz business quietly gathered dust, on the shelf.\n\nSomething stirred, just before last Christmas: the realisation that we could deliver the quizzes via a website, which solved a key difficulty of the earlier system. Other ideas for a much wider constituency of audiences emerged: it had always been intended that the quizzes would be made available to the NHS for bedside televisions on a not-for profit basis; in addition we realised it could be supplied to charities and other causes to raise significant income through local groups on a long term basis. In a good way this completes the circle, for the origins of the whole enterprise and the motivation behind it were purely altruistic, for the benefit of the Romanian orphanage.\n\nJust to get an idea of possible demand, I put up Quizmas, the Christmas quiz, on this blog. Despite all the competing demands of television and social life over the holiday, there was an overwhelmingly positive response: nearly 75% of the usual readership 'hit' the quiz.\n\n'Q&A quizmasters' was formed as a limited company in January. There is now a period of several months 'research and development' while we accumulate a catalogue of quizzes, covering not only an all-purpose general knowledge quiz, but also a football quiz for pubs and sports bars, and a Senior Quiz for entertainment and cognitive stimulation in residential care homes, day-centres etc. It has to be stressed that this is simultaneously a commercial enterprise (at a commercial rate of payment), and an aid for charities and other fund-raising bodies at minimal or no cost.\n\nA website is under construction, but a temporary site with the most basic information has just been published at:   www.davidmilner7773.wix.com/qandammq   \n\nThis is not a one-man-band, but it is not an orchestra, either. We are hoping that other people may wish join us, to 'crowd-fund' the enterprise NOT with money, but with assistance, for example, submitting questions (and answers!) If either the commercial or altruistic aspects of the enterprise appeal to you, please get in touch through Facebook chat (Q&A quizmasters) or through the email address on the temporary website. Before there is any revenue stream we cannot pay for these contributions; as that materialises we intend to do so, and for major contributions we will consider offering equity in the company. \n\nCharity quiz-nights operate on the principle of raising money while enjoying yourselves: preparing quizzes operates on the same principle. Do a Good Thing today: have a look at the site and get in touch...\n\n\n\nA quiz company seems like a trivial pursuit in the context of the last 72 hours: the Cuba Crisis meets Groundhog Day as Trump and the North Koreans posture like caricatures of macho narcissists. Sabre-rattling it may be, but the weapons are 20-megaton nuclear warheads: twenty times the explosive force of the bombs which produced these pictures. If you have a God, pray your ass off.\n\n\n\n", "url": "http://omgili.com/ri/DyQaNGXlfMqNazpJK9WGB1wkcOOooQ_ZeFbSlA3oNi1MCfyO3LsJPW4ZDvpdmR.uIzJxho0oV37gQSQvn.RdyCycB8QR6Hdf", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T10:25:04.000+03:00", "language": "english", "title": "#64 POST SCRIPT", "thread": {"title_full": "#64 POST SCRIPT", "site_full": "thestandupchameleon.blogspot.com", "site": "blogspot.com", "site_section": "http://thestandupchameleon.blogspot.com/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "another blog in the wall....THE SUNDAY ITEMS", "url": "http://omgili.com/ri/DyQaNGXlfMqNazpJK9WGB1wkcOOooQ_ZeFbSlA3oNi1MCfyO3LsJPW4ZDvpdmR.uIzJxho0oV37gQSQvn.RdyCycB8QR6Hdf", "published": "2017-04-16T10:25:04.000+03:00", "title": "#64 POST SCRIPT", "uuid": "0c77aa4636ad4224f018ca8fa306fd5675c3b6bc", "main_image": null}, "uuid": "0c77aa4636ad4224f018ca8fa306fd5675c3b6bc", "ord_in_thread": 0}]