[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:29:34.000+03:00", "author": "Stephen Guise", "entities": {"persons": [], "locations": [{"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "united airlines", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "text": "0 Comments \nI admit it. My life isn’t everything I hoped for at this stage. But it’s more than I hoped for in terms of my business, career, finances, freedom, and world impact. \nI’ve done well in business because of certain principles I’ve followed, which I’d like to share here. It will mostly be geared towards writing books (my main business), but the applications are broader than that. \nThese are the nine principles of business I operate by. \nMake every decision for it’s impact in five years, not by today’s impact. I’ve released only four products in the last four years because I don’t really consider the initial book launch to be very important for my business. The launch is important for exposure, but beyond a minimum amount of exposure, I believe the best products will thrive for years on word of mouth advertising. Many people say you can’t rely on word of mouth, and that’s true to some extent, but people are going to talk about what they like. \nIf you do a search of “mini habits” in Google, you’ll see it has been mentioned on dozens of blogs, and I didn’t ask a single person to write about it. They all chose to do it. It’s amazing! \nMake your customer feel like they got the better deal. Many businesses aim to squeeze every possible penny out of customers, and there’s honestly nothing wrong with it (it’s just business). I, however, want customers of my products to feel like they ripped me off. Strategically speaking, that makes them feel somewhat indebted to you because you’ve given them more than you’ve taken. \nThis is the way I feel about Amazon (my favorite company), even though I’ve spent many thousands of dollars on their site and services. Their customer service, offerings, and overall experience is so beyond what I’ve experienced elsewhere that I don’t even consider giving other companies my money. \nDon’t create products to make money, create products to solve real problems. This is controversial, because you can definitely make money by trying to make money directly. Personally, I think you can make more money long term by focusing on solving real problems (when combined with the other strategies I’ll mention). Maybe I’m just lucky, but this is what’s worked for me. I think book readers are perceptive and can tell the intent of the author, and it’s obviously better to give the impression that you’re really trying to add value to their lives. \nCreate unique products in popular categories. Don’t copy anything unless it’s a process, tactics, and strategies. There are a lot of things you should copy. For example, I’ve copied the model of giving something away as an incentive for people to sign up to my email list. I’ve copied the idea of using a pop up to drive email subscriptions (because they work). In my book, I’ve copied the idea of advertising my other products in the beginning and end of the book. These are tactical moves to increase my number of subscribers, views, and sales. I use Scrivener because I saw other authors use it successfully. \nMy products’ content, however, is unique. You will find some similar ideas in other books, but on the whole, my books are only comparable to those who have copied me . To create unique products, look for gaps . \nI look for gaps in the market where my ideas and skills can fit. When you look for gaps in the market, you are automatically trying not to copy anyone else. A gap in the market means there’s a currently unmet need, and if you copied someone else, you wouldn’t be meeting that need. \nDo your research. You can research many different things: your market, relevant science, similar products, and more. This basically means to be prepared. When you do more research than most, you’ll have the knowledge to create a superior product than most. Mini Habits for Weight Loss took me 1.5 years of daily work to research and write. \nPrioritize the customer experience. Whatever your product or service, it helps to imagine yourself as the customer. What does the experience with your product feel like? For this reason, I add humor to my books, often in unexpected places. Especially since my books cover scientific topics, it’s extremely important for me to make my books entertaining and not a long lecture. \nNever cheat. Many people in the book business will compromise their integrity to gain reviews. Not me. I have never and will never pay or trade or ask for a positive review of any of my books. I even guarantee that on each of my books’ pages on Amazon. \nIf you’re cheating, it means you don’t believe in your product, which means you shouldn’t be in business in the first place. \nName your products wisely. I like to coin terms for my products because it makes them easier to remember and tell others about. If you tell someone about Mini Habits , they’ll be able to find me and my books with a simple Google search. If I had written a book called “Habit Formation Tips,” they would more likely forget the name or confuse it with another book. \nCoining terms like “mini habits” or “imperfectionist” comes with some risk. People aren’t going to search for your made up name before they know about it. Products that rely heavily on search engines to get initial customers might be harmed by having an unexpected name. That’s where generic but descriptive titles have an edge. If “Habit Formation Tips” was my book name, people probably search for that exact phrase in Google and might stumble upon it. \nIt comes down to risk and reward. Because I coined the term “mini habits” and it did so well, I now have a brand . Brands are the best way to establish and build trust with consumers. The mini habits brand is extremely valuable because it’s well-liked by many. \nBuild trust and protect it above all else. I spent so much time on Mini Habits for Weight Loss because it is a part of that brand, and I knew it would either continue to build trust in the brand or harm it. Every person who has read both books has said that Mini Habits for Weight Loss was worth reading on top of the original Mini Habits book. That exemplifies everything I’ve said. If it was basically the same as the first book but with a few weight loss mini habits tacked on, I would have made some money just from the success of the first book, but it would have damaged trust in me and the Mini Habits brand. \nLook at United Airlines to see the importance of trust. Their recent fiasco in which they forcefully removed a passenger has already cost them more than a billion dollars in stock value. Even worse, I’ve seen something that’s much scarier for them—several of my friends on Facebook vowed to never fly with them again . They’re not the only ones. Here are just a couple comments by people on a Youtube news video about the event (notice the high amount of upvotes). \nThis was one small event in 90 years of their company’s existence, but because it damaged their trustworthiness, it will hurt their business permanently unless they can regain consumer’s trust. That could take a long time. It’s much easier to maintain trust than to try to recoup it once you’ve lost it. Conclusion \nI believe the best thing a business can do is create and build trust with its customers. That’s what I strive to do, and that alone with a long-term perspective are the driving forces behind all of my business philosophies.", "url": "http://omgili.com/ri/7aBdisT0NOrGjhmuRPu61mLlIaP0Z6gXcV_8XKLBLEQi5DtoVD.I_bU2A6wIZMTC3GdIMJqRT.1N5bZBYKIQtQ--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T10:18:00.000+03:00", "language": "english", "title": "My 9 Principles of Business Success", "thread": {"title_full": "My 9 Principles of Business Success", "site_full": "stephenguise.com", "site": "stephenguise.com", "site_section": "http://deepexistence.com/feed/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Stephen Guise", "url": "http://omgili.com/ri/7aBdisT0NOrGjhmuRPu61mLlIaP0Z6gXcV_8XKLBLEQi5DtoVD.I_bU2A6wIZMTC3GdIMJqRT.1N5bZBYKIQtQ--", "published": "2017-04-16T10:18:00.000+03:00", "title": "My 9 Principles of Business Success", "uuid": "1009fed2f1b051de9f20f5367a3d3a6b9ce7df9e", "main_image": ""}, "uuid": "1009fed2f1b051de9f20f5367a3d3a6b9ce7df9e", "ord_in_thread": 0}]