[{"uuid": "1067f92307a61de674a30172aaac29fd64d8277d", "url": "http://omgili.com/ri/2wGaacqxApuRaje_fKgKW5CHmFGWgnq6F.WB2trjD8UhFM_t2ezm51uXsydq_mFxTvyr.VsBpDSzuiQK0yd9rQ--", "title": "", "author": "Tom 10", "rating": null, "published": "2017-04-18T13:09:00.000+03:00", "highlightText": "", "entities": {"organizations": [], "locations": [], "persons": []}, "highlightTitle": "", "thread": {"uuid": "ac41c445e88a2389a7e78bea1f3ed2d8aa20bb9a", "url": "http://omgili.com/ri/2wGaacqxApuRaje_fKgKW5CHmFGWgnq6F.WB2trjD8UhFM_t2ezm51uXsydq_mFxxQ0PzzwRWoE-", "site_full": "mywriterscircle.com", "title": "What's the difference between \"Review my...\" and \"... Workshop\"?", "site_section": "http://mywriterscircle.com/index.php?board=6.0", "domain_rank": null, "published": "2017-04-18T13:09:00.000+03:00", "title_full": "What's the difference between \"Review my...\" and \"... Workshop\"?", "participants_count": 3, "replies_count": 5, "spam_score": 0.0, "section_title": "The Coffee Shop", "site_type": "discussions", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "", "site": "mywriterscircle.com"}, "external_links": [], "language": "english", "text": "DS -- I can't speak for the prose side of things, but for poetry boards, the distinction has historical roots. RMP was established and served as the home-board for all things poetry. In the early days of the site, there seems to have been some growing pains around the issues of critiquing, critiquing severity, author sensitivity, etc. Poetry Workshop was created as a place where poets who weren't concerned about getting their feelers hurt over what might be construed as harsh or unjustified comments and critiques. This presumably facilitated deeper and more forthcoming comments in the Workshop - for the more serious writer and the more serious poetry drafts.\nWhile the posting limitations in the Workshop are one poem per week per poet, RMP allows a poem a day, provided no more than 3 of the author's poems appear on the front page at any one time. Its obvious that poems posted to RMP garner much quicker attention and comment than those posted in the Workshop. Sometimes it feels like Workshop is dead. But the other difference is that non-member surfers have full access to anything posted to RMP, whereas access to poems posted to the Workshop are restricted to members only. This may be of some significance to those considering publication. That is a complex and changing nest of issues which I think should cause a review/reconsideration of the structure of the poetry boards. But I don't see it happening.\nHope this helps.", "ord_in_thread": 4, "crawled": "2017-04-18T23:24:04.000+03:00"}]