[{"entities": {"locations": [{"name": "red heeler", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "d.v.m.", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}], "organizations": [{"name": "state farm", "sentiment": "none"}, {"name": "national dog bite prevention week", "sentiment": "none"}, {"name": "insurance information institute", "sentiment": "none"}, {"name": "alabama veterinary medical association", "sentiment": "none"}, {"name": "national canine research foundation", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "red heeler", "sentiment": "none"}], "persons": [{"name": "beckett", "sentiment": "none"}, {"name": "hal pate", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.enewscourier.com", "site_section": "http://www.enewscourier.com/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=news/local_news,news/local_news/*&f=rss", "domain_rank": null, "replies_count": 0, "country": "US", "section_title": "www.enewscourier.com - RSS Results in news/local_news,news/local_news/* of type article", "title": "Pets and the people who love them for 4/12/17", "title_full": "Pets and the people who love them for 4/12/17", "published": "2017-04-12T17:15:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_JdLe7dvaviWdWLMYM0xC1iS8oJUH8Io7g3BFvMGls9UfDdTKyA6D7Z27QN_Pvb.bJFBEkkwo6JyDIqD.q4uPgSb7pE6bU5KN0hj_8b4oa3fHoKdQbSuZ5W__p4SDj9zJJA11UCVNWzoNc2GcIpOnx9jJbG1x_kHAia71hWIdbQA--", "site": "enewscourier.com", "main_image": "http://bloximages.chicago2.vip.townnews.com/enewscourier.com/content/tncms/assets/v3/editorial/b/84/b8413370-1f0a-11e7-9927-6b6df9493fbd/58ed603fd49c5.image.jpg?resize=500%2C331", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "10ee4a245b5c5a10183eec2bff07d019ec7a5aea", "site_type": "news"}, "title": "Pets and the people who love them for 4/12/17", "published": "2017-04-12T17:15:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_JdLe7dvaviWdWLMYM0xC1iS8oJUH8Io7g3BFvMGls9UfDdTKyA6D7Z27QN_Pvb.bJFBEkkwo6JyDIqD.q4uPgSb7pE6bU5KN0hj_8b4oa3fHoKdQbSuZ5W__p4SDj9zJJA11UCVNWzoNc2GcIpOnx9jJbG1x_kHAia71hWIdbQA--", "author": "The News Courier", "crawled": "2017-04-19T08:39:26.000+03:00", "language": "english", "text": "1 of 2 Courtesy photo \nBeckett is just a baby, and a sweet baby he is. This 4-month-old Red Heeler mix can't wait to snuggle into your arms and into your heart. Courtesy photo \nBlue is actually shiny black and a Lab mix with all the affection and intelligence of that breed. He still has a bit of growing to do but shouldn't be more than a medium-size dog. editor's pick Pets and the people who love them for 4/12/17 The News Courier Apr 12, 2017 Courtesy photo \nBeckett is just a baby, and a sweet baby he is. This 4-month-old Red Heeler mix can't wait to snuggle into your arms and into your heart. Courtesy photo \nBlue is actually shiny black and a Lab mix with all the affection and intelligence of that breed. He still has a bit of growing to do but shouldn't be more than a medium-size dog. \nThe week of April 9-15 has been designated National Dog Bite Prevention Week, and the Alabama Veterinary Medical Association is encouraging all dog owners to be aware of the risks involved with dog bites. \n“Dog bites often happen during everyday activities among children and seniors,” said ALVMA President Hal Pate, D.V.M. “Certain situations can be more conducive to the risk of a dog bite. Protect your family and yourself by being familiar with preventive measures that will minimize the risk.” \nEvery year, more than 4.5 million Americans are bitten by dogs, with more than half of all victims younger than age 14. Each year over 6,000 dog bites are reported in Alabama and many require emergency room visits, with some needing hospitalization. \nMost dog bites affecting young children occur during everyday activities and while interacting with familiar dogs. According to a study completed by State Farm and the Insurance Information Institute, dog bites accounted for more than one-third of all homeowners insurance liability claim dollars paid out in 2015, costing more than $570 million. This same year, more than 28,000 people underwent reconstructive surgery as a result of being bitten by dogs. \nDog owners should review these helpful tips below and always be aware of their surroundings when they are with their dogs. Taking precautions to ensure safety for all involved is the best way to reduce the risk for dog bite accidents. \nDog bite emergencies \nIf you are bitten, here is a checklist of things you should do: \n• If the dog’s owner is present, request proof of rabies vaccination, and get the owner’s name and contact information; \n• Clean the bite wound with soap and water as soon as possible; \n• Consult your doctor immediately or go to the emergency room if it’s after office hours; and \n• Contact the dog’s veterinarian to check vaccination records. \nProtecting your family \nBe cautious around strange dogs and treat your dog with respect. Because children are the most common victims of dog bites, parents and caregivers should: \n• Never leave a baby or small child alone with a dog; \n• Be alert for potentially dangerous situations; \n• Teach children — including toddlers — to be careful around pets; \n• Children must learn not to approach strange dogs or try to pet dogs through fences; and \n• Teach children to ask permission from the dog’s owner before petting the dog. \nTips for owners \n• Carefully select your pet. Puppies should not be obtained on impulse; \n• Make sure your pet is socialized as a young puppy so it feels at ease around people and other animals; \n• Don’t put your dog in a position where it feels threatened or teased; \n• Be calm. Always talk in a quiet voice or whisper — no shouting — and take a “time out” if you feel angry or frustrated; \n• Train your dog. Basic commands help dogs understand what is expected of them and help build a bond of trust between pets and people; \n• Walk and exercise your dog regularly to keep it healthy and provide mental stimulation; \n• Avoid highly excitable games like wrestling or tug of war; \n• Use a leash in public to ensure you are able to control your dog; \n• Keep your dog healthy; \n• Have your dog vaccinated against rabies and other preventable infectious diseases; \n• Parasite control and other health care are important because how your dog feels affects how it behaves; \n• If you have a fenced yard, make sure your gates are secure; and \n• Neuter your pet. According to the National Canine Research Foundation, approximately 92 percent of fatal dog attacks involved male dogs, 94 percent of which were not neutered. Many veterinarians participate in Alabama’s spay/neuter license plate program which offers low-cost spay/neuter services to those who qualify for assistance. This program is funded by the sale of spay/neuter license plates and also by designated funds submitted via a check off box on the Alabama income tax return. For more information visit www.alvma.org . \nTo adopt a dog or cat, please visit The Athens-Limestone Animal Shelter at 1701 U.S. 72 (behind Limestone Veterinary Clinic,) visit the shelter's Facebook or page, or call 256-771-7889. \nEmail questions or story ideas to . Tags", "external_links": [], "highlightTitle": "", "uuid": "10ee4a245b5c5a10183eec2bff07d019ec7a5aea", "highlightText": "", "rating": null}]