[{"entities": {"persons": [{"sentiment": "negative", "name": "hively"}, {"sentiment": "none", "name": "joanna l. grossman"}, {"sentiment": "none", "name": "david j. langum"}, {"sentiment": "none", "name": "diane wood"}, {"sentiment": "none", "name": "obama"}, {"sentiment": "none", "name": "ellen k. solender"}, {"sentiment": "none", "name": "hopkins"}, {"sentiment": "none", "name": "bill clinton"}, {"sentiment": "none", "name": "barack obama"}, {"sentiment": "none", "name": "scalia"}, {"sentiment": "none", "name": "neil gorsuch"}, {"sentiment": "none", "name": "evans"}, {"sentiment": "none", "name": "gillian thomas"}, {"sentiment": "none", "name": "kimberly hively"}, {"sentiment": "none", "name": "oncale"}, {"sentiment": "none", "name": "christiansen"}], "organizations": [{"sentiment": "negative", "name": "federal appeals court"}, {"sentiment": "none", "name": "lambda legal defense & education fund"}, {"sentiment": "none", "name": "congress"}, {"sentiment": "none", "name": "eleventh circuit"}, {"sentiment": "none", "name": "u.s. court of appeals"}, {"sentiment": "none", "name": "supreme court"}, {"sentiment": "none", "name": "ivy tech community college although price waterhouse"}, {"sentiment": "none", "name": "century america"}, {"sentiment": "none", "name": "seventh circuit"}, {"sentiment": "none", "name": "fifth circuit"}, {"sentiment": "none", "name": "georgia regional hospital"}, {"sentiment": "none", "name": "court"}, {"sentiment": "none", "name": "ivy tech"}, {"sentiment": "none", "name": "ivy tech community college"}, {"sentiment": "none", "name": "eeoc"}, {"sentiment": "none", "name": "eastern airlines"}, {"sentiment": "none", "name": "high court"}, {"sentiment": "none", "name": "second circuit"}, {"sentiment": "none", "name": "smu dedman school of law"}, {"sentiment": "none", "name": "american workplace"}, {"sentiment": "none", "name": "princeton university press"}, {"sentiment": "none", "name": "cambridge university press"}, {"sentiment": "none", "name": "omnicom group, inc."}, {"sentiment": "none", "name": "ivy tech"}, {"sentiment": "none", "name": "ninth circuit in desantis v. pacific telephone & telegraph"}], "locations": [{"sentiment": "none", "name": "ulane"}, {"sentiment": "none", "name": "united states"}, {"sentiment": "none", "name": "hively"}, {"sentiment": "none", "name": "america"}, {"sentiment": "none", "name": "oncale"}, {"sentiment": "none", "name": "virginia"}]}, "text": "For the first time, a federal appeals court held squarely that Title VII prohibits discrimination on the basis of sexual orientation. By a vote of 8-3, the Seventh Circuit, sitting en banc , ruled that Kimberly Hively’s lawsuit against Ivy Tech Community College could go forward, giving her the opportunity to prove that she was unlawfully fired because she is a lesbian. This may not sound like a huge victory—just getting permission to start the process over again—but it is. The question whether Title VII protects against LGBT discrimination has been kicked around in federal courts for decades, and no federal appellate court has ever ruled as the Seventh Circuit just did. But as the Seventh Circuit wrote in this new case, Hively v. Ivy Tech Community College , it had “been asked to take a fresh look” given the social and legal developments of those decades, and that is just what it did. The interesting part about the “fresh look,” however, is that the court was able to see what might well have been obvious decades ago—discrimination against people because of sexual orientation is just another species of sex discrimination. Kimberly Hively’s Story Hively is open about her sexual orientation, at work and elsewhere. She took a job as a part-time, adjunct professor at Ivy Tech in the year 2000. She made a significant push to find a full-time position between 2009 and 2014, but her efforts were not successful. In July 2014, her part-time contract was not renewed. She filed a complaint with the EEOC without the help of a lawyer, but she made her point: I have applied for several positions at IVY TECH, fulltime, in the last five years. I believe I am being blocked from fulltime employment without just cause. I believe I am being discriminated against based on my sexual orientation. I believe I have been discriminated against and that my rights under Title VII of the Civil Rights Act were violated.\n\nAnd with that simple factual allegation and assertion about her federal rights, Hively tapped into one of the most important controversies in employment law. At the trial court level, her claim was dismissed for failure to state a claim—even if she could prove her sexual orientation was the reason for the failure to hire her full-time or renew her contract, that conduct did not violate Title VII. As has happened in many recent cases, the court didn’t take a serious look at her claim. It simply referred to a line of prior cases that had squarely rejected the legal theory and deferred to them (as lower courts are bound to do). On appeal, however, the Lambda Legal Defense & Education Fund, one of the premier advocacy groups for LGBT rights in the United States took over her case. And that is where the case got interesting. Title VII and Sexual Orientation Claims: A Troubled History Title VII of the Civil Rights Act of 1964 is the core of federal anti-discrimination law, prohibiting employers with at least fifteen employees from discriminating on the basis of race, color, religion, sex, or national origin. Sexual orientation is not on the list—nor would one to expect it to be specifically identified in a statute drafted when that term was not routinely used. But courts early on were asked to treat claims of sexual orientation discrimination as a form of sex discrimination. It was a simple enough argument—men should not be discriminated against for being attracted to men, when women are not punished for the same thing, and vice versa. But it was roundly rejected. In Ulane v. Eastern Airlines, Inc. (1984), the U.S. Court of Appeals for the Seventh Circuit¾the court that just decided Hively’s claim—rejected such a claim with a simple truism: sex discrimination “implies that it is unlawful to discriminate against women because they are women and against men because they are men.” That opinion typified the superficial level of analysis that federal courts engaged in when asked to decide sexual orientation claims. Another well-known example is from the Ninth Circuit in DeSantis v. Pacific Telephone & Telegraph (1979). But like the Ulane opinion, it lacks much by way of meaningful analysis and found it sufficient to note that Congress did not intend to protect gays and lesbians from discrimination when it enacted Title VII in 1964. The problem with that line of reasoning is that Congress probably did not contemplate many of the things we have come to understand as sex discrimination. The meaning of sex discrimination has developed incrementally and grown to encompass a wide variety of policies, practices, and behaviors that impede workplace equality. This happened as courts (especially the Supreme Court) began to understand the true nature of sex discrimination and its deep connection to equal employment opportunity. (This incrementalism is documented and examined, case by case, decade by decade, by Gillian Thomas in her recent book, Because of Sex: One Law, Ten Cases, and Fifty Years that Changed American Women’s Lives at Work . ) During the decades when federal courts were simply unwilling to interpret Title VII in a way that protected LGBT employees, some stop-gap measures were put in place. President Bill Clinton signed an executive order in 1998, which banned sexual orientation discrimination in the civilian federal workforce; President Barack Obama renewed and extended its scope in 2014. The original order was in response to a long history of explicit discrimination by the federal government, which banned gay and lesbian individuals from civil service jobs. (See the unfortunate relics of that history here .) President Obama also, finally, revoked the “Don’t Ask, Don’t Tell” order in 2011, permitting gay and lesbian individuals to serve openly in the military. Meanwhile, in Congress, advocates spent decades trying to amend Title VII to provide express protection against sexual orientation discrimination (and, in some iterations, against gender identity discrimination, as well). No bill of this type ever made it through both houses of Congress, and efforts eventually stalled. State houses took greater initiative to protect LGBT individuals; many of them now have laws prohibiting LGBT discrimination. Supreme Court Rulings That Reflected a More Nuanced Understanding of Sex Discrimination Although plaintiffs did not prevail when asking courts to rule that Title VII prohibits LGBT discrimination, they did prevail in two cases before the High Court that would seem to portend the same result. They both flow from a simple requirement that actionable sex discrimination must have occurred “because of sex.” First, in Price Waterhouse v. Hopkins (1989), the Supreme Court ruled that reliance on sex-role stereotyping can be an actionable form of employment discrimination. There, the Court held that a woman was a victim of sex discrimination when her employer denied her partnership in an accounting firm at least in part because she was insufficiently “feminine” in the way she dressed and conducted herself. That decision catalyzed sex-stereotyping theory as an independent cause of action under Title VII, and it was quickly put to use by effeminate gay men and masculine lesbians who claimed that the hostility and adversity they experienced was sex, rather than sexual orientation, discrimination. Second, in Oncale v. Sundowner Services (1998), the Court considered a claim of same-sex harassment. The conservative Fifth Circuit ruled that such a claim could never be actionable under Title VII regardless of the facts or circumstances surrounding the discrimination. It just simply could not be “because of sex” if the claim involved one man harassing another. The Supreme Court unanimously reversed, in an opinion written by Justice Scalia. The Court held that the “because of sex” requirement could be met in at least three ways: (i) with evidence of the perpetrator’s homosexuality; (ii) with evidence that the perpetrator in fact targeted only members of one sex; or (iii) with evidence that the harassment took the form of gender-role policing—under the Price Waterhouse ruling—to punish an employee for failing to live up to traditional gender norms. Oncale has both reinforced the use of Price Waterhouse in sexual orientation claims and fueled separate claims for harassment rooted in homosexual desire or gender-targeted bullying. The Ruling in Hively v. Ivy Tech Community College Although Price Waterhouse and Oncale provided some support for LGBT employees who suffered discrimination—as many of them do—they still faced significant obstacles to addressing discrimination. In the initial appeal in Hively’s case, heard by a panel of three judges, the court applied the Seventh Circuit precedent dictating that Title VII should not be construed to cover sexual orientation discrimination. But when the same issue came before the court en banc (eleven judges instead of three), it got a more serious look. The world had changed since the Seventh Circuit had ruled in Ulane in 1984. It changed in obvious social ways—gay and lesbian Americans came out of the closet in droves, and other people became significantly more tolerant and accepting. But the legal landscape also changed. Those two Supreme Court opinions had created a chink in the armor, opening the door to a wide variety, if sometimes a random variety, of LGBT discrimination claims. Perhaps as importantly, the EEOC adjudicated a case in 2015 in which it held, as a matter of agency interpretation, that discrimination against a man because he was gay constituted a form of sex discrimination that violates Title VII. The EEOC’s ruling depended on its view that “[d]iscrimination on the basis of sexual orientation is premised on sex-based preferences, assumptions, expectations, stereotypes, or norms.” There is no way to understand this type of discrimination, the ruling reasons, without reference to a person’s sex. Sexual orientation is, by definition, being attracted to a person of the same sex. The EEOC ruling sparked a second look in many courts, leading several federal district courts, which reached the same conclusion. (Discussion of some of those cases can be found here and here .) The Seventh Circuit’s en banc opinion is refreshingly simple. It concludes that discrimination against an employee because of sexual orientation is a form of unlawful sex discrimination. The court, in an opinion written by Chief Judge Diane Wood, began by stating the obvious: it has no power to amend Title VII to add a protected characteristic to the list. But it does have the power to interpret the words already in the statute, including “sex.” It then correctly rejects the suggestion by Ivy Tech that Congress’s repeated, but failed attempts to amend Title VII to add explicit reference to sexual orientation and/or gender identity discrimination make clear that the statute did not already cover those forms of discrimination. A legislative body’s failure to adopt a law could mean any number of things, some of them diametrically opposed to one another. In this case, Congress could have failed to adopt the proposed laws because legislators deemed it obvious that the statute already prohibited those forms of discrimination—or it could mean the opposite, that the statute did not already prohibit LGBT discrimination and advocates did not have the votes to make the change. The court thus rightly left all evidence on that subject to the side. What it did find relevant was the Supreme Court’s opinion in Oncale —not only because it supported protection for harassment motivated by bias against gay and lesbian workers, but also because of the interpretive guidance the Court provided. Justice Scalia wrote in that opinion that while same-sex harassment “was assuredly not the principal evil Congress was concerned with when it enacted Title VII,” courts are charged with interpreting the words used and prohibiting any type of discrimination “that meets the statutory criteria.” The Hively court noted the long evolution of the meaning of “sex discrimination” in Supreme Court opinions that unfolded over several decades. From a simple rule that employers could not refuse to hire a woman for a particular job came a broad spectrum of prohibitions—discrimination against any subset of women, sexual harassment, harassment based on actual assumptions about longevity rooted in gender, and so on. The court identified two reasons that compelled its conclusion that Title VII prohibits sexual orientation discrimination. First, sexual orientation discrimination, at its core, punishes a woman for being attracted to another woman, when it would not punish a man for being attracted to a woman. This “tried-and-true comparative method” shows the significance of the plaintiff’s sex to the employer’s decision. With respect to Hively’s claim, the court wrote that it is “critical . . . that only the variable of the plaintiff’s sex is allowed to change.” Thus, the court does not ask whether the employer would have failed to hire Hively if she was involved with a man. It asks whether she would have been fired if she had been a man who was involved with a woman. This is exactly what the Supreme Court suggested and validated in Oncale , and what many courts have relied on since. This approach, when applied to sexual orientation claims, also draws on the Supreme Court’s ruling in Price Waterhouse v. Hopkins . As the Hively court wrote, Viewed through the lens of the gender non-conformity line of cases, HIvely represents the ultimate case of failure to confirm to the female stereotype (at least as understood in a place such as modern America, which views heterosexuality as the norm and other forms of sexuality as exceptional): she is not heterosexual . . . . Hively’s claim is no different from the claims brought by women who were rejected for jobs in traditionally male workplaces, such as fire departments, construction, and policing. The employers in those cases were policing the boundaries of what jobs or behaviors they found acceptable for a woman (or in some cases, for a man).\n\nSecond, the court in Hively drew on Loving v. Virginia , in which the Supreme Court held Virginia’s ban on interracial marriage unconstitutional on race discrimination grounds. Virginia could not punish a white person for intimately associating with a black person when it would not have punished a black person for the same thing—and vice versa. Although the Constitution does not regulate the decisions of private employers, this opinion provides a theory of discrimination that is as persuasive in interpreting Title VII as it was in interpreting the Equal Protection Clause. As the court wrote, “[i]t is now accepted that a person who is discriminated against because of the protected characteristic of one with whom she associates is actually being disadvantaged because of her own traits.” This principle had already been accepted in the employment context when employees were punished for interracial relationships; the same principle protects Hively from being discriminated against because she chooses to associate with a person of a particular gender. Conclusion The Hively court did not take its job lightly—it acknowledged contrary authority, and a strong difference of opinion even on the court (the ruling was 8-3). But it was guided by the “logic of the Supreme Court’s decisions, as well as the common-sense reality that it actually impossible to discriminate on the basis of sexual orientation without discriminating on the basis of sex.” It’s just that simple. The en banc ruling in Hively is bound to have an effect. In other recent cases, the Eleventh Circuit, in Evans v. Georgia Regional Hospital , ruled similarly, though it did not hit the nail as squarely on the head. Meanwhile, the Second Circuit, in Christiansen v. Omnicom Group, Inc. , bound by an earlier panel ruling in a case that had said sexual orientation claims were not cognizable in Title VII suits, allowed an LGBT plaintiff to proceed on a gender stereotyping theory of discrimination—an alternative path to the same outcome. Hively may just be at the beginning of the trend, but it also may queue up review by the Supreme Court, which just acquired a ninth justice, Neil Gorsuch, a deeply conservative, pro-business jurist.   \nFollow @JoannaGrossman Joanna L. Grossman, a Justia columnist, is the Ellen K. Solender Endowed Chair in Women and Law at SMU Dedman School of Law. Her most recent book is Nine to Five: How Gender, Sex, and Sexuality Continue to Define the American Workplace (Cambridge University Press 2016). She is the coauthor of Inside the Castle: Law and the Family in 20th Century America (Princeton University Press 2011), co-winner of the 2011 David J. Langum, Sr. Prize for Best Book in American Legal History, and coeditor of several other books. Her columns focus on sex discrimination and family law. ", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "12a0337c7af13b04abd3b6e6144d390dc25d149f", "rating": null, "highlightTitle": "", "title": "Equality for All: Federal Appeals Court Holds in Hively v. Ivy Tech Community College That Title VII Prohibits LGBT Discrimination", "thread": {"country": "US", "site": "justia.com", "replies_count": 0, "title_full": "Equality for All: Federal Appeals Court Holds in Hively v. Ivy Tech Community College That Title VII Prohibits LGBT Discrimination", "site_categories": [], "performance_score": 0, "section_title": "Verdict", "domain_rank": 7260, "uuid": "12a0337c7af13b04abd3b6e6144d390dc25d149f", "main_image": null, "site_type": "blogs", "title": "Equality for All: Federal Appeals Court Holds in Hively v. Ivy Tech Community College That Title VII Prohibits LGBT Discrimination", "spam_score": 0.0, "site_section": "https://verdict.justia.com", "url": "http://omgili.com/ri/.wHSUbtEfZT3000.mRdxmNXwADpsLcOjU0bfu.IJJrgd2ZHLnlewuzkWR0RKH04YuT3t986WdRE-", "participants_count": 1, "site_full": "verdict.justia.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:27:16.000+03:00"}, "crawled": "2017-04-18T11:27:16.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZT3000.mRdxmNXwADpsLcOjU0bfu.IJJrgd2ZHLnlewuzkWR0RKH04YuT3t986WdRE-", "highlightText": "", "published": "2017-04-18T11:27:16.000+03:00", "author": "Joanna L. Grossman"}]