[{"uuid": "12c2a7018ec0453fa2204f894fda07869aa203e2", "url": "http://omgili.com/ri/WOapK6QZrmld9yBEEZ5rn0ftxSnzcMTY91OVW2m_UqTMpATyXC7QkbqKcrVgBe3eKKfej.8uKlT1wT87SyqQDfZIJSqQFbU01pW0A48H.WWPwFooEQDTuVdB8MEc47MVQDZy2satJvEEyHRACJoYuA--", "title": "Review: Love triangle undoes historical epic 'The Promise'", "author": "Review Times", "rating": null, "published": "2017-04-18T23:24:54.000+03:00", "highlightText": "", "entities": {"organizations": [], "locations": [], "persons": []}, "highlightTitle": "", "thread": {"uuid": "12c2a7018ec0453fa2204f894fda07869aa203e2", "url": "http://omgili.com/ri/WOapK6QZrmld9yBEEZ5rn0ftxSnzcMTY91OVW2m_UqTMpATyXC7QkbqKcrVgBe3eKKfej.8uKlT1wT87SyqQDfZIJSqQFbU01pW0A48H.WWPwFooEQDTuVdB8MEc47MVQDZy2satJvEEyHRACJoYuA--", "site_full": "reviewtimes.com", "title": "Review: Love triangle undoes historical epic 'The Promise'", "site_section": "http://reviewtimes.com/feed", "domain_rank": null, "published": "2017-04-18T23:24:54.000+03:00", "title_full": "Review: Love triangle undoes historical epic 'The Promise'", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "Review Times", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://reviewtimes.com/wp-content/uploads/2016/12/mann.jpg", "site": "reviewtimes.com"}, "external_links": [], "language": "english", "text": "By : Review Times Comment: Off The Armenian Genocide is a curiously unexplored moment in our modern history, cinematically speaking. That fact alone makes director and co-writer Terry George’s “ The Promise ” intriguing enough. Historical fiction generally has it over documentaries in inspiring mass interest, especially when actors as appealing as Oscar Isaac, Christian Bale and Charlotte Le Bon are involved. And indeed, “The Promise” is a sprawling and handsome epic set around the extermination of 1.5 million Armenians in Ottoman Turkey. But despite the best of intentions, the film fails to properly explain and contextualize both what led to that disgraceful episode, which Turkey to this day denies, and why it escalated as it did. Instead, “The Promise” chooses to focus in on an unsympathetic love triangle that manages to trivialize the film overall. The goal, as always, is to personalize the events that are too big and too devastating to look at as a whole – to make it about the lives interrupted, cut short and thrown into turmoil because of external forces. Thus we’re given the character Michael Boghosian (Isaac), an Armenian medical student from a small village in Southern Turkey who uses his fiance’s dowry to study modern medicine in Constantinople. Michael isn’t in love with his fiance (Angela Sarafyan), but such is life in Siroun where marriages are arranged and he doesn’t have any other choice. He kisses her goodbye and heads off to the big city, promising to return in just a few years. Constantinople is an oasis of temptation for Michael, who essentially falls for the first woman he sees. The beguiling Ana (Le Bon) is a cosmopolitan beauty and intellectual. She lived in Paris for years. She exudes ethereal confidence. And she’s an Armenian from around his hometown. Ana also happens to be in a long-term relationship with Chris Myers (Bale), an Associated Press reporter who we’re told drinks too much. While Michael is enjoying the city life and lusting after Ana, though, things are devolving around him. It’s 1914 and vague signs of war are emerging. Things go on as normal for a little while – there are German soldiers at the parties now and battleships in the harbor and a heightened sense that some Turks are anti-Armenian. And then Constantinople’s Armenian intellectuals start getting arrested and taken away. To where is unclear. To fight? To prison camps? To be executed? The intention, likely, is to put the viewer on the blurry ground level with Michael and Ana, who see their world turned upside down so suddenly that of course there would be confusion. Explanation and insight is hardly a priority when survival is the goal. But that’s where Bale’s Chris Myers should have been more useful. To the film’s credit, he does take us early on to distant villages to witness townspeople being rounded up and walked through the desert. Women and children are executed without hesitation and, when Chris is spotted in the distance, soldiers take off after him. It’s clear they don’t want people seeing what they’re doing. He chimes in occasionally with helpful exposition as he’s dictating articles, and yet, it’s a wonder whether anyone who knows little about the events will actually be able to track what’s going on in a meaningful way. “The Promise” is infinitely more interested in the triangle, dropping the three leads into convenient situations to heighten the will they/won’t they/can they/should they drama, which, frankly, becomes increasingly unsympathetic as the situation around them becomes more dire. It’s unfair to critique such an utterly sincere film that does contain some riveting action and acting and even might inspire some to learn more about this moment in history, but unfortunately, the story just doesn’t live up to its grand ambitions. “The Promise,” an Open Road Pictures release, is rated PG-13 by the Motion Picture Association of America for “thematic material including war atrocities, violence and disturbing images, and for some sexuality.” Running time: 134 minutes. Two stars out of four. — MPAA Definition of PG-13: Parents strongly cautioned. Some material may be inappropriate for children under 13. —", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:54.000+03:00"}]