[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:20:14.000+03:00", "author": "", "entities": {"persons": [], "locations": [{"name": "el paso", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "davita", "sentiment": "negative"}, {"name": "quality assurance coordinator", "sentiment": "none"}, {"name": "medicare", "sentiment": "none"}, {"name": "cms", "sentiment": "none"}, {"name": "sub-acute care facilities", "sentiment": "none"}, {"name": "microsoft office", "sentiment": "none"}, {"name": "ahsa", "sentiment": "none"}, {"name": "linkedin  davita", "sentiment": "none"}, {"name": "injury prevention and safety training program  assist", "sentiment": "none"}, {"name": "hospital services group", "sentiment": "none"}, {"name": "hipaa", "sentiment": "none"}, {"name": "hsa", "sentiment": "none"}, {"name": "osha", "sentiment": "none"}, {"name": "davita hospital services", "sentiment": "none"}, {"name": "hospital services administrator or group hospital services administrator", "sentiment": "none"}, {"name": "greatest healthcare community the world", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "financial management", "sentiment": "none"}]}, "text": "Home View All Jobs ( 2,596 ) DaVita Assistant Hospital Services Administrator in El Paso , Texas \nThis position typically assists the Hospital Services Administrator or Group Hospital Services Administrator in managing the overall administration of activities associated with services to licensed Acute and Sub-Acute Care Facilities in the Hospital Services Group and for other services rendered off-site and not associated with on-site chronic dialysis clinics. This position provides supervision of professional and non-professional care and coordination of services to licensed acute hospitals and sub-acute facilities that have contracted with DaVita to provide dialysis and other services under the license of the Acute or Sub-Acute Facility \nSUPERVISORY RESPONSIBILITIES: \nPosition has full supervisory responsibility for recruitment, hiring, onboarding, retention, performance development, performance management, teammate relations, team and teammate morale, salary adjustments, and termination of direct reports. Additional roles and responsibilities include program financial management, quality assurance, quality patient care, patient safety advocate, risk management, and other required duties that may arise during the general operations of the programs they oversee and manage. \nESSENTIAL DUTIES AND RESPONSIBILITIES: \nThe following duties and responsibilities generally reflect the expectations of this position but are not intended to be all inclusive. \nFacility/Equipment Management (Assists HSA with): \nEnsure equipment and supplies are maintained to provide quality care and assure the safety of patients and staff \nIdentify and plan prompt corrective action for any issues with building safety or equipment and systems in a standalone Acute facility or partner with hospital staff for safety and emergency preparedness (evacuation) training \nKnow and follow hospital policies \nParticipate in the development and periodic revision of policies and procedures with the Acute Facility Administrator/Regional Operations Director/Medical Director to ensure consistent, efficient and safe operation of the facility as assigned \nFinancial Management (Assists HSA with) : \nParticipate in budget formulation and review concerning personnel and scheduling needs with patient load \nSupervise inventory management including purchasing, product selection and supply usage \nEnsure patient and treatment charge information and other related data are accurate and submitted to the appropriate office in a timely manner \nRisk Management/Quality Assurance Compliance (Assists HSA with): \nComply with DaVita policies and procedures in accordance with state and federal regulations for patient care and services (HIPAA, CMS, OSHA, or other governing agencies) \nComply with state or federal regulations of the Injury Prevention and Safety Training Program \nAssist with the preparation of data summaries for internal audit purposes \nAssist with the creation and implementation of any corrective action needed as a result of internal or external quality assurance, Medicare, OSHA or other governing agencies \nReport and document all teammate injuries according to established policies and procedures \nParticipate in quality assurance program with the Acute Facility Administrator, Regional Operations Director, and Quality Assurance Coordinator according to DaVita policy \nPatient Care Management (Assists HSA and works with Nurse in Charge of Nursing Services on): \nParticipate in and ensure call responsibilities are carried out within the guidelines of the acute contract as allowed by individual state practice regulations \nProvide and oversee nursing, patient care, and technical services for patient treatment and ensure that appropriate adjustments in treatment plans are developed and implemented and meet compliance with state and federal governing agencies as allowed by individual state practice regulations \nMaintain communication and continuity of planned care when patient is transferred to other DaVita facilities \nEnsure placement of policies, procedures and resources to help the patient assume responsibility for his/her own health maintenance \nMaintain open communication with all partners including hospitals, physicians, nurse practitioners and other healthcare professionals regarding patient care \nAdminister policies, procedures and resources to ensure safe, appropriate treatment of patients \nAct as a liaison with patients and hospital in response to complaints and quality issues. \nTeammate Management (Assists HSA with): \nReview and approve time cards of all teammates for payroll \nUnderstand basic wage and hour laws, federal, state and local laws and regulations, Medicare, and legislation affecting employment in dialysis and nursing services \nPlan, organize and supervise the technical and biomedical staff to ensure high quality patient care according to company policy \nDetermine staffing plans that promote the most effective use of all teammates \nDevelop and maintain educational programs to keep teammates up-to-date on nursing practices, universal precautions, worker/patient safety, etc. \nProvide day-to day work direction for nursing, technical, office and biomedical staff \nOversee and/or implement all teammate activity such as hiring, promoting, job performance evaluations, and disciplinary actions with appropriate approval from the Acute Facility Administrator, Regional Operations Director and/or People Services Director/Manager \nMaintain teammate records to include written performance evaluation of all staff; records to be kept in compliance with DaVita policy and any applicable laws \nEvaluate, record and process teammate compensation according to company policy and upon approval by Acute FA and/or Group FA \nUnderstand and communicate DaVita company policies and procedures through the use of written policy manuals or in-service education \nMaintain knowledge of facility emergency management programs and ability to act swiftly, confidently in an emergency \nMaintain familiarity with DaVita programs impacting teammates (including but not limited to: Triple Crown, Nurse Tomorrow, We Are Here, Tuition Reimbursement, etc.) \nOther duties and responsibilities as assigned \nAttend team meetings, phone conferences, and training as needed \nKnow, understand, and follow teammate guidelines, employment policies, and department or company procedures \nHere is what you can expect when you join our Village as an AHSA: \nA community first, company second culture based on Core Values that really matter. \nClinical outcomes consistently ranked above the national average. \nAward-winning education and training across multiple career paths to help you reach your potential. \nPerformance-based rewards based on stellar individual and team contributions. \nA comprehensive benefits package designed to enhance your health, your financial well-being and your future. \nDedication, above all, to caring for patients suffering from chronic kidney failure across the nation. \nMINIMUM QUALIFICATIONS \nEducation, licenses, certifications, and experience required to fulfill the essential duties, include computer skills as required. \nHigh school diploma or equivalent is required \nAssociate’s or Bachelor’s degree in related area is preferred \nActive RN licensure required \nMinimum of 1 year’s healthcare leadership experience required; management experience strongly preferred \nDialysis experience preferred \nIntermediate computer skills in Microsoft Office applications, including Word, Excel, and Outlook, and capability to gain proficiency in DaVita Hospital Services clinical and reporting software systems within 90 days or hire required \nOther qualifications and combinations of skills may be considered at discretion of ROD and/or Divisional Vice President \nJoin us as we pursue our vision \" To Build the Greatest Healthcare Community the World has Ever Seen . \" \nWhy wait? Explore a career with DaVita today. \nGo to http://careers.davita.com/ to learn more or apply. \nTo learn more about our Village and the world of dialysis, click here . \nFollow us on Facebook and LinkedIn \nDaVita is an equal opportunity/affirmative action employer. As such, DaVita makes hiring decisions solely on the basis of qualifications and experience, and without regard to age, race, color, religion, sex, gender identity, sexual orientation, national origin, disability or protected veteran status. \nWe maintain a drug-free workplace and perform pre-employment substance abuse testing and background verification checks. \nDaVita will consider qualified applicants who have criminal histories in a manner consistent with the law.", "url": "http://omgili.com/ri/GiCaV2xJNYtvgtwaNvzsar5gQqIucCW4jkmKPWRJ1c1jw97NoBl1qeWWWNqLzQfBD9uSGx097tku5Wal.Ak7epZD4hD5iJztfS5yOgsVUUmSeh4tg4o1VyW8HaE01K65gR8Qj19nVhM0d2RObwNsIMyVASO_QBCV", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:20:14.000+03:00", "language": "english", "title": "(USA-TX-El Paso) Assistant Hospital Services Administrator", "thread": {"title_full": "(USA-TX-El Paso) Assistant Hospital Services Administrator", "site_full": "jobs.davita.com", "site": "davita.com", "site_section": "http://jobs.davita.com/feed/atom", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "blogs", "spam_score": 0.0, "domain_rank": 37881, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Jobs", "url": "http://omgili.com/ri/GiCaV2xJNYtvgtwaNvzsar5gQqIucCW4jkmKPWRJ1c1jw97NoBl1qeWWWNqLzQfBD9uSGx097tku5Wal.Ak7epZD4hD5iJztfS5yOgsVUUmSeh4tg4o1VyW8HaE01K65gR8Qj19nVhM0d2RObwNsIMyVASO_QBCV", "published": "2017-04-16T09:20:14.000+03:00", "title": "(USA-TX-El Paso) Assistant Hospital Services Administrator", "uuid": "13037f991e6d4633026d55992c74ae407cf9dcf3", "main_image": ""}, "uuid": "13037f991e6d4633026d55992c74ae407cf9dcf3", "ord_in_thread": 0}]