[{"entities": {"locations": [], "organizations": [], "persons": []}, "ord_in_thread": 0, "thread": {"site_full": "www.kait8.com", "site_section": "http://www.kait8.com/global/Category.asp?c=35550&clienttype=rss", "domain_rank": null, "replies_count": 0, "country": "US", "section_title": "KAIT - K8 World News", "title": "Trump administration says Iran complying with nuclear deal", "title_full": "Trump administration says Iran complying with nuclear deal", "published": "2017-04-19T08:39:02.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8XpK2.jt4vJK.E_aw3rN7R_tQza7GDlyEMr9DpbMzQfuTRjIaUMQosjI5BI_YZYgGROmgYDlc7LMpb23xI.XtQJzvu8RgiQhxG82QBcNZd1j8JVxE2fYa1", "site": "kait8.com", "main_image": "", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 0, "performance_score": 0, "spam_score": 0.0, "uuid": "140d09b3d671d5e6e979f94cd046203ca5f39d1d", "site_type": "news"}, "title": "Trump administration says Iran complying with nuclear deal", "published": "2017-04-19T08:39:02.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8XpK2.jt4vJK.E_aw3rN7R_tQza7GDlyEMr9DpbMzQfuTRjIaUMQosjI5BI_YZYgGROmgYDlc7LMpb23xI.XtQJzvu8RgiQhxG82QBcNZd1j8JVxE2fYa1", "author": "", "crawled": "2017-04-19T08:39:02.000+03:00", "language": "english", "text": "Trump administration says Iran complying with nuclear deal 2017-04-19T05:25:39Z By MATTHEW LEEAP Diplomatic Writer \nWASHINGTON (AP) - The Trump administration has notified Congress that Iran is complying with the terms of the 2015 nuclear deal negotiated by former President Barack Obama, and says the U.S. has extended the sanctions relief given to the Islamic republic in exchange for curbs on its atomic program. \nHowever, in a letter sent late Tuesday to House Speaker Paul Ryan, Secretary of State Rex Tillerson said the administration has undertaken a full review of the agreement, known as the Joint Comprehensive Plan of Action. \n\"Iran remains a leading state sponsor of terror, through many platforms and methods,\" Tillerson wrote. He said the National Security Council-led interagency review of the agreement will evaluate whether it \"is vital to the national security interests of the United States.\" \nThe certification of Iran's compliance, which must be sent to Congress every 90 days, is the first issued by the Trump administration. The deadline for this certification was midnight. \nAs a candidate in the 2016 presidential election, Trump was an outspoken critic of the deal but had offered conflicting opinions on whether he would try to scrap it, modify it or keep it in place with more strenuous enforcement. Tuesday's determination suggested that while Trump agreed with findings by the U.N.'s nuclear watchdog, the International Atomic Energy Agency, that Iran is keeping to its end of the bargain, he is looking for another way to ratchet up pressure on Tehran. \nDespite the sanctions relief, Iran remains on the State Department's list of state sponsors of terrorism for its support of anti-Israel groups and is still subject to non-nuclear sanctions, including for human rights abuses and for its backing of Syrian President Bashar Assad's government. \nThe nuclear deal was sealed in Vienna in July 2015 after 18 months of negotiations led by former Secretary of State John Kerry and diplomats from the other four permanent members of the U.N. Security Council - Britain, China, France and Russia - and Germany. Under its terms, Iran agreed to curb its nuclear program, long suspected of being aimed at developing atomic weapons, in return for billions of dollars in sanctions relief. \nOpponents of the deal, including Israel, objected, saying it only delayed Iran's pursuit of nuclear weapons and did not allow for the kind of inspections of its atomic sites that would guarantee it was not cheating. Obama, Kerry and others who negotiated the deal strenuously defended its terms and said the agreement made Israel, the Middle East and the world a safer place. Copyright 2017 The Associated Press.   This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "highlightTitle": "", "uuid": "140d09b3d671d5e6e979f94cd046203ca5f39d1d", "highlightText": "", "rating": null}]