[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:42:05.000+03:00", "author": "Best Restaurant To Eat", "entities": {"persons": [{"name": "ayam pindang", "sentiment": "none"}, {"name": "nasi istimewa rm", "sentiment": "none"}, {"name": "nasi istimewa", "sentiment": "none"}], "locations": [{"name": "starling mall", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "kerabu mangga", "sentiment": "none"}], "organizations": [{"name": "starling mall damansara uptown petaling jaya", "sentiment": "none"}, {"name": "synfull roast chicken", "sentiment": "none"}, {"name": "embassy", "sentiment": "none"}, {"name": "damansara uptown petaling jaya", "sentiment": "none"}, {"name": "embassy cafe facebook", "sentiment": "none"}, {"name": "tempe sambal", "sentiment": "none"}]}, "text": "The Embassy Cafe + Bakery serves Eastern and Western simple, healthy and hearty meals including fine cakes and bread. The Embassy is a family friendly, PORK FREE and WIFI enabled.\nThe Embassy Cafe Address Level 2, The Starling Mall, Jalan SS21/37 Damansara Uptown Petaling Jaya, Malaysia\nThe Embassy Cafe Facebook Inspired by the warmth and gracious hospitality of embassies from around the world, The Embassy café seeks to bring the exciting spirit of the journey, adventure, friendship and comfort through its food and interior space.\nWith a nature theme and the signature usage of lines in the interior design, The Embassy infuses natural clean lines that symbolise the fluidity of time, space and evolution that connects all of us in our daily journey and adventure. The Embassy offers cuisine from East & West that blends a culinary combination of something for everybody on one menu.\nOur review started off with an order of the cool Iced Mocha RM 14.00 which is matched with our breakfast set.\n\nThe Breakfast set that we ordered to taste is the Ambassador’s Big Breakfast  RM 28.00. Our orders came with 2 sunny sides up, toasted sourdough; with 2 pieces of hash brown, beef bacon, chicken bratwurst, mushrooms, grilled tomatoes and baked beans.\n\nNext; we decided to order a salad which is the Oriental Grilled Ribeye Salad RM 24.00. This salad is a little heavy as it comes with streaks of grill rib-eye that is accompanied with fresh leafy greens, tomatoes, cucumber and cilantro served with sesame-soy dressing. A balance salad which can easily be a meal for small eaters.\n\nNext, comes the mains which I ordered the SynFull Roast Chicken for a half chicken portion (RM 35.00). For the smaller eater, you can order the quarter chicken set (RM26.00). You can see that this is a real treat as the skin was a roast to a nice crisp while the meat was still juicy and succulent. We can taste the strong flavor of the spices and herbs marinade that was imbued into the meat. This wholesome meal is served with seasonal vegetables, rosemary butter potatoes and served with a creamy mushroom sauce.\n\nFor those that loves the carbs; can order a pasta which we had is the Carbonara (RM 22.00). For those that loves the cheesy feel of the Carbonara sauce will attest to this dish. The pasta was cooked with a smooth cheesy cream sauce,  mushrooms, Parmesan cheese and topped with beef bacon. I am not a big fan of pasta, but this one hit the right note for me.\n\nOur last main was the Embassy Nasi Istimewa RM 28.00. Here at Embassy, they do provide a number of local delights. Apparently, the recipe of these dishes is from one of the owner’s mothers which she has meticulously trained the chef to cook it at close as possible to her recipe. This Nasi Istimewa is served with the Ayam Pindang together with fried rice, anchovies, Tempe Sambal, fried cabbage, Papadams, Kerabu Mangga and topped with sunny side egg. I would have preferred the dish served with plain white rice, as it will be more tasteful.\n\nBy the time we tasted the last mains, we were too full to even order our dessert.\nThe Embassy Cafe Location Address Map\nhttp://ift.tt/2nQE8vW \nOriginal Post http://ift.tt/2poPtQI ", "url": "http://omgili.com/ri/.wHSUbtEfZTxFew7YS_NZZmNUxHxR9p6t1rOKIEjfSkN0DzSfW.9.EFv4zABCOW54lXr4j1AhpvI6HRON537dC3suTLHjC5jMhhoSPZBWgY..T0XprDfa0G03jGqffewQ7n5.MqTNRk3f6eYsm6jxYt3yCa2EOqGIWHHzdoKbLA-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:42:05.000+03:00", "language": "english", "title": "The Embassy Cafe At The Starling Mall Damansara Uptown Petaling Jaya", "thread": {"title_full": "The Embassy Cafe At The Starling Mall Damansara Uptown Petaling Jaya", "site_full": "bestrestauranttoeat.wordpress.com", "site": "wordpress.com", "site_section": "https://bestrestauranttoeat.wordpress.com", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "The Embassy Cafe At The Starling Mall Damansara Uptown Petaling Jaya – Best Restaurant To Eat – Malaysian Food Blog", "url": "http://omgili.com/ri/.wHSUbtEfZTxFew7YS_NZZmNUxHxR9p6t1rOKIEjfSkN0DzSfW.9.EFv4zABCOW54lXr4j1AhpvI6HRON537dC3suTLHjC5jMhhoSPZBWgY..T0XprDfa0G03jGqffewQ7n5.MqTNRk3f6eYsm6jxYt3yCa2EOqGIWHHzdoKbLA-", "published": "2017-04-16T09:42:05.000+03:00", "title": "The Embassy Cafe At The Starling Mall Damansara Uptown Petaling Jaya", "uuid": "156a7e54db2205ed366bd7ac508d86b65a4b32a5", "main_image": null}, "uuid": "156a7e54db2205ed366bd7ac508d86b65a4b32a5", "ord_in_thread": 0}]