[{"entities": {"organizations": [{"name": "amazon", "sentiment": "none"}], "locations": [], "persons": [{"name": "igor", "sentiment": "none"}, {"name": "baz", "sentiment": "none"}, {"name": "kimba", "sentiment": "none"}]}, "uuid": "17a8ec538c283550caa7a2b01776754c3d79b3bf", "highlightText": "", "title": "THE SUNDAY POST #108", "thread": {"site": "blogspot.com", "country": "US", "participants_count": 1, "site_full": "lalatoadstone.blogspot.com", "section_title": "LA LA IN THE LIBRARY", "uuid": "17a8ec538c283550caa7a2b01776754c3d79b3bf", "site_section": "http://lalatoadstone.blogspot.com/", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T23:48:20.000+03:00", "url": "http://omgili.com/ri/SEMpReyPU44Btp68psc7XOyaXomBYIkWNS3o82SLKk_dTAPBnelUV0gFv6d4b3bx44M0wAZPtSw7SIHI6F.xiWDY7h7m7A0x", "title_full": "THE SUNDAY POST #108", "title": "THE SUNDAY POST #108", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T23:48:20.000+03:00", "url": "http://omgili.com/ri/SEMpReyPU44Btp68psc7XOyaXomBYIkWNS3o82SLKk_dTAPBnelUV0gFv6d4b3bx44M0wAZPtSw7SIHI6F.xiWDY7h7m7A0x", "ord_in_thread": 0, "crawled": "2017-04-16T23:48:20.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "La La in the Library (noreply@blogger.com)", "text": "THE SUNDAY POST NUMBER ONE HUNDRED AND EIGHT\n\n⚫ THE SUNDAY POST   is a weekly wrap-up feature hosted by Kimba at the  CAFFEINATED BOOK REVIEWER . \nTELL ME TUESDAY LAST. NOW. NEXT \nOne post, guess why... I broke my new Kindle! I am waiting for Baz to give me the purchase info because he ordered it with his student two day shipping. I want to try and get them to replace it. I was pulling a label off a storage container and my hand slipped and I bonked it with my elbow, not very hard, and the whole top of the screen is black now. It should not be that easy to damage it, but I am sure they will still tell me it isn't covered because it was my neglect. ▪ ▪ ▪ At first it was semi okay because I could still access things on the bottom of the screen and could reply to comments on my blog, and comment on blogs I could find links for at the bottom of pages. I was even able to play my audiobooks from the bottom half of the library screen, but it did one of the Kindle Fire \"known problems\" and spontaneously shut down and disconnected from the wifi. To reconnect to the wifi I need to access the top of the screen, so now Igor is totally useless. ▪ ▪ ▪ I was expecting to get more blogging done on my laptop because I was off work this week for the holidays, but my boss changed our filing service and I was having to mess around with that and get it up and running for next week. I can only manage sitting at the computer for so long, so blogging will be sporadic until I get a new Kindle. I don't want to buy another one until I see if Amazon will replace the broken one. ▪ ▪ ▪ Thank goodness I have my faithful little grey 1st generation Kindle e-reader to read my ARCs on, and I figured out how to download my audiobooks. for my Audiobook Boom reviews, to my laptop. \nApril had her baby! It is a beautiful healthy boy. There are videos of the birth and first steps on the ANIMAL ADVENTURES Facebook PAGE . The Canniff Curse was in full effect because after watching from five am yesterday (I set an alarm because the vet said labor was to be expected within 24 hours), I ran to the bathroom and back and she had pushed the baby out while I was gone! Then I thought that was okay because I would still be able to see it stand for the first time... nope, I bent over to grab the cord to plug the laptop in and while I was doing this, well, you guessed it. Ha ha.  There were a lot of people complaining about the paid alert app and the baby name voting, but all of it has gone to giraffe conservation, the Animal Adventures charity for people with seriously ill children (their baby daughter has a rare form of epilepsy and they wanted to help others with out of pocket expenses), and funds to build the park's new welcome and education center. These people live very modestly because they put most of their money towards the park and conservation efforts. It was very disheartening to see an article on Mashable saying they had an inside scoop that the baby was dead and everyone was being lied to to keep the money rolling in. They dissuaded a lot of people from contributing to conservation efforts for no reason other than clickbait for their stupid e-zine. I left a nasty comment on Mashable's Twitter celebratory announcement of of the birth. I will never click on a Mashable link again. I hope you will consider the same. \nBOUGHT EBOOKS GOODREADS I follow the author on Twitter and he is a great guy. I have wanted to read one of his books forever, but they never seemed to go on sale. It is still 99 cents today. \nBOOK BLOGGER HOP Do You Include Book Covers? \nTELL ME TUESDAY Last. Now. Next. \nTHE SUNDAY POST Have an extraordinary new week! "}]