[{"entities": {"locations": [{"name": "north carolina", "sentiment": "none"}, {"name": "raleigh", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "holly springs", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "united states.what", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "wisc.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "chesapeake bay", "sentiment": "none"}, {"name": "guatemala", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "kenosha", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "warner", "sentiment": "none"}, {"name": "u.s. department of labor", "sentiment": "none"}, {"name": "kellum seafood", "sentiment": "none"}, {"name": "greenscape inc.", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "snap-on inc", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "afl-cio", "sentiment": "none"}], "persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "neutral"}, {"name": "mcclatchy", "sentiment": "none"}, {"name": "thom tillis", "sentiment": "none"}, {"name": "anna douglasmcclatchy washington bureau", "sentiment": "none"}, {"name": "currin", "sentiment": "none"}, {"name": "reuters/kevin lamarque", "sentiment": "none"}, {"name": "tillis", "sentiment": "none"}, {"name": "kellum", "sentiment": "none"}, {"name": "mark warner", "sentiment": "none"}, {"name": "marybe mcmillan", "sentiment": "none"}, {"name": "daniel currin", "sentiment": "none"}, {"name": "thomas kellum", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.unionleader.com", "site_section": "http://www.unionleader.com/section/?template=RSS?nocache=1?omniture=0", "domain_rank": 41865, "replies_count": 0, "country": "US", "section_title": "All Stories", "title": "Trump gets tough on skilled foreign workers, but what about seasonal carnival, seafood jobs?", "title_full": "Trump gets tough on skilled foreign workers, but what about seasonal carnival, seafood jobs?", "published": "2017-04-19T08:39:18.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_GbzPSD3e8vS.s8ZsXJjqE.9fV0gwUSy_O1LsjUyeuxhrTq5ZQMxrKEYax.hLOTg6mEkd3CPWklbjaLj6G3qsosTXkIkpnkvnjmaIM7iuiZ2kHixzcMxK2", "site": "unionleader.com", "main_image": "/storyimage/UL/20170418/NEWS06/170419267/AR/0/AR-170419267.jpg?q=70?ExactW=600&ExactH=314&imageversion=MainHighlight&q=70", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 0, "performance_score": 0, "spam_score": 0.0, "uuid": "17c59e8fa4b7b45f4aa1d366b0f6ee95affa08b0", "site_type": "news"}, "title": "Trump gets tough on skilled foreign workers, but what about seasonal carnival, seafood jobs?", "published": "2017-04-19T08:39:18.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_GbzPSD3e8vS.s8ZsXJjqE.9fV0gwUSy_O1LsjUyeuxhrTq5ZQMxrKEYax.hLOTg6mEkd3CPWklbjaLj6G3qsosTXkIkpnkvnjmaIM7iuiZ2kHixzcMxK2", "author": "", "crawled": "2017-04-19T08:39:18.000+03:00", "language": "english", "text": "April 18. 2017 10:53PM President Donald Trump speaks before signing an executive order directing federal agencies to recommend changes to a temporary visa program used to bring foreign workers to the United States to fill high-skilled jobs during a visit to the world headquarters of Snap-On Inc, a tool manufacturer in Kenosha, Wisc., on Tuesday. (REUTERS/Kevin Lamarque) Trump gets tough on skilled foreign workers, but what about seasonal carnival, seafood jobs? By Anna DouglasMcClatchy Washington Bureau WASHINGTON — The White House push is on to clamp down on U.S. tech companies hiring foreign workers — but what happens to all those small businesses that need just the opposite, the unskilled labor that keeps carnival rides going and puts oysters and crabs on America’s dinner tables?While high tech gets the attention, the companies relying on low-skill seasonable employees want attention paid to their case to keep a flow of workers coming.“This is the most troubling issue. It keeps me awake at night,” said Thomas Kellum, with Chesapeake Bay’s third-generation family-run Kellum Seafood in Virginia.Kellum has hired seasonal employees from other countries for nearly 20 years under the federal H-2B guest worker program.“We’ve been at times when we didn’t know whether we were going to be operating or not,” Kellum said of the struggle to staff operations when local labor runs out.Kellum’s oyster, softsshell crab and scallop business is one of hundreds nationwide using H-2B visas. The visas are only for guest workers, not for people to live permanently in the United States.What’s in the spotlight, though, are the H-1B visas, which send highly skilled foreign workers into tech jobs and fields such as computer programming and engineering. On Tuesday, President Donald Trump signed an executive order requiring federal officials to review foreign worker programs, specifically targeting H-1B visas but not H-2B.The executive order won’t immediately change guest worker visas but the required agency reviews could result in tougher scrutiny and higher application fees for companies using foreign labor.Meanwhile, blue-collar and seasonal employers say they regularly face domestic labor shortages and are hoping Congress will expand the H-2B program. For years, these businesses have put pressure on their senators and representatives, saying government delays on approving H-2B visas and the high demand for a capped number of foreign employees often create uncertainty.Employers got a break last year from Congress: Lawmakers approved a short-term solution by temporarily allowing returning H-2B workers to not count toward the usual 66,000 annual maximum.Federal law requires companies that hire foreign workers prove they aren’t displacing out-of-work Americans. The two guest-worker programs differ in that H-1B visas are capped at 85,000 and are granted via a lottery system, and they earn higher wages in industries such as engineering and computer programming.Sen. Thom Tillis, R-N.C., is leading an effort to allow U.S. employers to rehire some past H-2B workers without those workers affecting the national annual cap on visas. H-2B employers say the visa program regularly maxes out even as they hunt for seasonal workers.“It’s crucial to our business,” said Daniel Currin, president and CEO of Greenscape Inc., a second-generation family-owned landscaping company in Raleigh, Durham and Holly Springs, N.C.Most jobs at Greenscape are filled by U.S. citizens. But during peak season, usually starting in March or April, Currin’s company needs more workers to perform commercial and large residential contract jobs, he said.This year, the company expects to hire about 35 workers from Mexico and Guatemala, less than one-fifth of his employee headcount. Starting hourly wages for workers are around $12.Before Trump signed the H-1B executive order Tuesday, senior White House officials told reporters that some companies have abused the program, using foreign labor to drive down wages and as a substitute for Americans seeking jobs.The same criticisms have been lobbed in the past at the H-2B guest worker program.Conservatives have pushed back against legislative attempts to expand the program, saying the visas amount to job outsourcing. Liberals and unions have complained that H-2B workers are sometimes exploited and the program threatens American jobs.“We get wrapped around the axle of partisan issues,” Kellum said. “But when you see the devastation in some of these coastal communities, it takes the Democratic and Republican element out of it.”Still, labor unions have been skeptical about the H-2B program and actively oppose the types of changes Tillis hopes to make.“Sen. Tillis is championing a bill that would open the door to increased exploitation of guest workers and would adversely affect wages and working conditions for both American and guest workers,” said MaryBe McMillan, secretary-treasurer for North Carolina’s AFL-CIO.Tillis said that if there were a bipartisan deal to be made on immigration policy — contrary to conservative Republican orthodoxy — he wants it.“I’m gonna put a lot of people out of their comfort zone,” Tillis told constituents last month as he talked about immigration during a telephone town hall.Tillis, who has been working for months to build a bipartisan group of senators to work together on immigration bills, has found Democratic allies to expand the H-2B program.One is Sen. Mark Warner of Virginia, who is co-sponsoring Tillis’ bill to increase the number of temporary foreign workers allowed annually.Tillis and Warner come from two states that fall in the top 10 of those with the most H-2B workers in seasonal industries, according to recent data from the U.S. Department of Labor. The two largest H-2B states are Texas and Florida.From October 2014 to September 2015, there were 3,412 H-2B workers approved in North Carolina, most of whom held landscaping jobs. In neighboring Virginia, 3,484 visas were approved, almost all of them clustered in the landscaping and seafood industries.Warner told McClatchy he hopes to bring more on Democratic senators as co-sponsors of Tillis’ bill.“This is just one piece of a broader challenge,” he said. “And to really solve our immigration problems, we need colleagues on both sides of the aisle who are willing to look at comprehensive immigration reform.”Industries that rely on H-2B visas are showing Tillis gratitude with donations to his 2020 re-election campaign.So far, Tillis has collected more than $30,000 in small donations from those in the outdoor amusement industry, a big user of the H-2B program to staff traveling carnivals, fairs and circuses. Thousands morein donations to Tillis’ campaign come from the seafood industry and companies that help employers find H-2B workers.", "external_links": [], "highlightTitle": "", "uuid": "17c59e8fa4b7b45f4aa1d366b0f6ee95affa08b0", "highlightText": "", "rating": null}]