[{"uuid": "19d46d838be06fa5fc9658a24fdaf84585572c41", "url": "http://omgili.com/ri/jHIAmI4hxg_ZZEJxw_HVLIVMnaJd1bQMlnaaNDSg36OZw3qbPZovHMc.IUObg5lex6hk2O_geUC13B5zC8sZrQNyAs2SdfQ4j_gJAgEJm0S768yShvtly6kU8IAxG.axROR1W.AedWnPTngQ67859Q--", "title": "ONEOK Announces New $2.5 Billion Revolving Credit Facility", "author": "", "rating": null, "published": "2017-04-18T23:24:12.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "billion revolving credit facility oneok", "sentiment": "negative"}, {"name": "oneok", "sentiment": "negative"}, {"name": "mizuho bank , ltd.", "sentiment": "none"}, {"name": "solicitation oneok", "sentiment": "none"}, {"name": "morgan stanley bank", "sentiment": "none"}, {"name": "bank of america, n.a.", "sentiment": "none"}, {"name": "cftc", "sentiment": "none"}, {"name": "ferc", "sentiment": "none"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "barclays bank plc", "sentiment": "none"}, {"name": "jpmorgan chase bank", "sentiment": "none"}, {"name": "oneok partners", "sentiment": "none"}, {"name": "oneok, inc.", "sentiment": "none"}, {"name": "u.s. commodity futures trading commission", "sentiment": "none"}, {"name": "standard & poor", "sentiment": "none"}, {"name": "u.s. environmental protection agency", "sentiment": "none"}, {"name": "oke", "sentiment": "none"}, {"name": "wells fargo bank", "sentiment": "none"}, {"name": "national association", "sentiment": "none"}, {"name": "federal energy regulatory commission", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "citibank", "sentiment": "none"}, {"name": "epa", "sentiment": "none"}, {"name": "national transportation safety board", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}], "locations": [{"name": "middle east", "sentiment": "none"}, {"name": "permian", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "okla.", "sentiment": "none"}, {"name": "rocky mountain", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}], "persons": [{"name": "terry k. spencer", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "19d46d838be06fa5fc9658a24fdaf84585572c41", "url": "http://omgili.com/ri/jHIAmI4hxg_ZZEJxw_HVLIVMnaJd1bQMlnaaNDSg36OZw3qbPZovHMc.IUObg5lex6hk2O_geUC13B5zC8sZrQNyAs2SdfQ4j_gJAgEJm0S768yShvtly6kU8IAxG.axROR1W.AedWnPTngQ67859Q--", "site_full": "www.prnewswire.com", "title": "ONEOK Announces New $2.5 Billion Revolving Credit Facility", "site_section": "http://www.prnewswire.com/rss/rss/usa/kansas-news.rss", "domain_rank": 3190, "published": "2017-04-18T23:24:12.000+03:00", "title_full": "ONEOK Announces New $2.5 Billion Revolving Credit Facility", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "PR Newswire:", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://content.prnewswire.com/images/prn_facebook_sharing_logo.jpg  ", "site": "prnewswire.com"}, "external_links": [], "language": "english", "text": "TULSA, Okla. , April 18, 2017 /PRNewswire/ -- ONEOK, Inc. (NYSE: OKE ) today announced a new $2.5 billion , five-year senior unsecured revolving credit facility, to replace the existing ONEOK and ONEOK Partners, L.P. (NYSE: OKS) credit facilities.\nThe new facility will be available upon the completion of the previously announced merger transaction in which ONEOK will acquire all of the outstanding common units of ONEOK Partners it does not already own and the termination of the existing ONEOK and ONEOK Partners credit facilities. Completion of the transaction is expected to occur in the second quarter of 2017.\nA syndicate of 22 banks, led by Citibank, N.A., Bank of America, N.A., Barclays Bank PLC, JPMorgan Chase Bank, N.A., Mizuho Bank , Ltd., Morgan Stanley Bank, N.A., and Wells Fargo Bank, National Association, committed to ONEOK's new facility.\n\"The high level of interest and quality of participation we received in ONEOK's new credit facility demonstrates the strong support from our bank syndicate group following the announcement of the ONEOK and ONEOK Partners merger transaction,\" said Terry K. Spencer , ONEOK and ONEOK Partners president and chief executive officer. \"The commitments to this facility are another positive step toward moving forward as one standalone company, with a continued focus on executing our long-term strategy.\"\nThe new credit facility will replace the existing $300 million and $2.4 billion revolving credit facilities at ONEOK and ONEOK Partners, respectively. The facility includes options to request an increase in the size of the facility to $3.5 billion and two one-year extensions, subject to lender approvals. The facility will be available for working capital, capital expenditures, acquisitions, the issuance of letters of credit and for other general corporate purposes.\nONEOK, Inc. (pronounced ONE-OAK) (NYSE: OKE ) is the general partner and as of Dec. 31, 2016 , owns 41.2 percent of ONEOK Partners, L.P. (NYSE: OKS), one of the largest publicly traded master limited partnerships, which owns one of the nation's premier natural gas liquids (NGL) systems, connecting NGL supply in the Mid-Continent, Permian and Rocky Mountain regions with key market centers and is a leader in the gathering, processing, storage and transportation of natural gas in the U.S. ONEOK is a FORTUNE 500 company and is included in Standard & Poor's (S&P) 500 Stock Index.\nFor information about ONEOK, Inc., visit the website: www.oneok.com .\nFor the latest news about ONEOK, follow us on Twitter @ONEOKNews .\nThis news release contains certain \"forward-looking statements\" within the meaning of federal securities laws. Words such as \"anticipates\", \"believes,\" \"expects\", \"intends\", \"plans\", \"projects\", \"will\", \"would\", \"should\", \"may\", and similar expressions may be used to identify forward-looking statements. Forward-looking statements are not statements of historical fact and reflect ONEOK's and ONEOK Partners' current views about future events. Such forward-looking statements include, but are not limited to, statements about the benefits of the proposed transaction involving ONEOK and ONEOK Partners, including future financial and operating results, ONEOK's and ONEOK Partners' plans, objectives, expectations and intentions, the expected timing of completion of the transaction, and other statements that are not historical facts, including future results of operations, projected cash flow and liquidity, business strategy, expected synergies or cost savings, and other plans and objectives for future operations. No assurances can be given that the forward-looking statements contained in this news release will occur as projected and actual results may differ materially from those projected.\nForward-looking statements are based on current expectations, estimates and assumptions that involve a number of risks and uncertainties, many of which are beyond our control, and are not guarantees of future results. Accordingly, there are or will be important factors that could cause actual results to differ materially from those indicated in such statements and, therefore, you should not place undue reliance on any such statements and caution must be exercised in relying on forward-looking statements. These risks and uncertainties include, without limitation, the following:\nthe ability to obtain the requisite ONEOK stockholder and ONEOK Partners unitholder approvals relating to the proposed transaction; the risk that ONEOK or ONEOK Partners may be unable to obtain governmental and regulatory approvals required for the proposed transaction, if any, or required governmental and regulatory approvals, if any, may delay the proposed transaction or result in the imposition of conditions that could cause the parties to abandon the proposed transaction; the risk that a condition to closing of the proposed transaction may not be satisfied; the timing to consummate the proposed transaction; the risk that cost savings, tax benefits and any other synergies from the transaction may not be fully realized or may take longer to realize than expected; disruption from the transaction may make it more difficult to maintain relationships with customers, employees or suppliers; the possible diversion of management time on merger-related issues; the impact and outcome of pending and future litigation, including litigation, if any, relating to the proposed transaction; the effects of weather and other natural phenomena, including climate change, on OKE's and/or OKS' operations, demand for OKE's and/or OKS' services and energy prices; competition from other United States and foreign energy suppliers and transporters, as well as alternative forms of energy, including, but not limited to, solar power, wind power, geothermal energy and biofuels such as ethanol and biodiesel; the capital intensive nature of our businesses; the profitability of assets or businesses acquired or constructed by us; our ability to make cost-saving changes in operations; risks of marketing, trading and hedging activities, including the risks of changes in energy prices or the financial condition of our counterparties; the uncertainty of estimates, including accruals and costs of environmental remediation; the timing and extent of changes in energy commodity prices; the effects of changes in governmental policies and regulatory actions, including changes with respect to income and other taxes, pipeline safety, environmental compliance, climate change initiatives and authorized rates of recovery of natural gas and natural gas transportation costs; the impact on drilling and production by factors beyond our control, including the demand for natural gas and crude oil; producers' desire and ability to obtain necessary permits; reserve performance; and capacity constraints on the pipelines that transport crude oil, natural gas and NGLs from producing areas and our facilities; difficulties or delays experienced by trucks, railroads or pipelines in delivering products to or from our terminals or pipelines; changes in demand for the use of natural gas, NGLs and crude oil because of market conditions caused by concerns about climate change; conflicts of interest between OKE, OKS, ONEOK Partners GP, and related parties of OKE, OKS, and ONEOK Partners GP; the impact of unforeseen changes in interest rates, equity markets, inflation rates, economic recession and other external factors over which OKE and OKS have no control, including the effect on pension and postretirement expense and funding resulting from changes in equity and bond market returns; our indebtedness could make us vulnerable to general adverse economic and industry conditions, limit our ability to borrow additional funds and/or place us at competitive disadvantages compared with our competitors that have less debt, or have other adverse consequences; actions by rating agencies concerning the credit ratings of ONEOK and ONEOK Partners; the results of administrative proceedings and litigation, regulatory actions, rule changes and receipt of expected clearances involving any local, state or federal regulatory body, including the Federal Energy Regulatory Commission (FERC), the National Transportation Safety Board, the Pipeline and Hazardous Materials Safety Administration (PHMSA), the U.S. Environmental Protection Agency (EPA) and the U.S. Commodity Futures Trading Commission (CFTC); our ability to access capital at competitive rates or on terms acceptable to us; risks associated with adequate supply to our gathering, processing, fractionation and pipeline facilities, including production declines that outpace new drilling or extended periods of ethane rejection; the risk that material weaknesses or significant deficiencies in our internal controls over financial reporting could emerge or that minor problems could become significant; the impact and outcome of pending and future litigation; the ability to market pipeline capacity on favorable terms, including the effects of: future demand for and prices of natural gas, NGLs and crude oil; competitive conditions in the overall energy market; availability of supplies of Canadian and United States natural gas and crude oil; and availability of additional storage capacity performance of contractual obligations by our customers, service providers, contractors and shippers; the timely receipt of approval by applicable governmental entities for construction and operation of our pipeline and other projects and required regulatory clearances; our ability to acquire all necessary permits, consents or other approvals in a timely manner, to promptly obtain all necessary materials and supplies required for construction, and to construct gathering, processing, storage, fractionation and transportation facilities without labor or contractor problems; the mechanical integrity of facilities operated; demand for our services in the proximity of our facilities; our ability to control operating costs; acts of nature, sabotage, terrorism or other similar acts that cause damage to our facilities or our suppliers' or shippers' facilities; economic climate and growth in the geographic areas in which we do business; the risk of a prolonged slowdown in growth or decline in the United States or international economies, including liquidity risks in United States or foreign credit markets; the impact of recently issued and future accounting updates and other changes in accounting policies; the possibility of future terrorist attacks or the possibility or occurrence of an outbreak of, or changes in, hostilities or changes in the political conditions in the Middle East and elsewhere; the risk of increased costs for insurance premiums, security or other items as a consequence of terrorist attacks; risks associated with pending or possible acquisitions and dispositions, including our ability to finance or integrate any such acquisitions and any regulatory delay or conditions imposed by regulatory bodies in connection with any such acquisitions and dispositions; the impact of uncontracted capacity in our assets being greater or less than expected; the ability to recover operating costs and amounts equivalent to income taxes, costs of property, plant and equipment and regulatory assets in our state and FERC-regulated rates; the composition and quality of the natural gas and NGLs supplied to OKS's gathering system, processed in OKS's plants and transported on OKS's pipelines; the efficiency of our plants in processing natural gas and extracting and fractionating NGLs; the impact of potential impairment charges; the risk inherent in the use of information systems in our respective businesses, implementation of new software and hardware, and the impact on the timeliness of information for financial reporting; our ability to control construction costs and completion schedules of our pipelines and other projects; and the risk factors listed in the reports OKE and OKS have filed and may file with the SEC, which are incorporated by reference. These reports are also available from the sources described below. Forward-looking statements are based on the estimates and opinions of management at the time the statements are made. Neither ONEOK nor ONEOK Partners undertakes any obligation to publicly update any forward-looking statement, whether as a result of new information, future events or otherwise.\nThe foregoing review of important factors should not be construed as exhaustive and should be read in conjunction with the other cautionary statements that are included herein and elsewhere, including the Risk Factors included in the most recent reports on Form 10-K and Form 10-Q and other documents of ONEOK and ONEOK Partners on file with the SEC. ONEOK's and ONEOK Partners' SEC filings are available publicly on the SEC's website at www.sec.gov .\nAdditional Information And Where To Find It\nThis communication is not a solicitation of any vote, approval, or proxy from any ONEOK stockholder or ONEOK Partners unitholder. In connection with the proposed transaction, ONEOK filed with the Securities and Exchange Commission (\"SEC\") a registration statement on Form S-4, which includes a preliminary prospectus of ONEOK and a joint proxy statement of ONEOK and ONEOK Partners. These materials are not yet final and will be amended. Each of ONEOK and ONEOK Partners may also file other documents with the SEC regarding the proposed transaction. ONEOK and OKS will each mail the joint proxy statement/prospectus to their respective stockholders and unitholders. This document is not a substitute for any prospectus, proxy statement or any other document which ONEOK or ONEOK Partners may file with the SEC in connection with the proposed transaction. ONEOK and ONEOK Partners urge investors and their respective stockholders and unitholders to read the registration statement, including the preliminary joint proxy statement/prospectus that is a part of the registration statement, and the definitive joint proxy statement/prospectus, and other relevant materials filed and to be filed with the SEC regarding the proposed transaction when they become available, as well as other documents filed with the SEC, because they contain or will contain important information. You may obtain copies of all documents filed with the SEC regarding this transaction (when they become available), free of charge, at the SEC's website ( www.sec.gov ). You may also obtain these documents, free of charge, from ONEOK's website ( www.oneok.com ) under the tab \"Investors\" and then under the heading \"SEC Filings.\" You may also obtain these documents, free of charge, from ONEOK Partners' website ( www.oneokpartners.com ) under the tab \"Investors\" and then under the heading \"SEC Filings.\"\nParticipants In The Solicitation\nONEOK, ONEOK Partners and their respective directors, executive officers and certain other members of management and employees may be soliciting proxies from ONEOK stockholders and ONEOK Partners unitholders in favor of the proposed transaction and related matters. Information regarding the persons who may, under the rules of the SEC, be deemed participants in the solicitation of ONEOK stockholders and ONEOK Partners unitholders in connection with the proposed transaction are set forth in the preliminary joint proxy statement/prospectus filed with the SEC on March 7, 2017 and will be set forth in the definitive joint proxy statement/prospectus when it becomes available. You can find information about ONEOK's executive officers and directors in its definitive proxy statement filed with the SEC on April 6 , 2017. You can find information about ONEOK Partners' executive officers and directors in its annual report on Form 10-K filed with the SEC on February 28, 2017 . Additional information about ONEOK's executive officers and directors and ONEOK Partners' executive officers and directors can be found in the above-referenced Registration Statement on Form S-4 and the other relevant materials to be filed with the SEC when they become available. You can obtain free copies of these documents from ONEOK and ONEOK Partners using the contact information above.\nAnalyst Contact:\nMegan Patterson\n918-561-5325\nMedia Contact:\nStephanie Higgins\n918-591-5026\n releases/oneok-announces-new-25-billion-revolving-credit-facility-300441320.html\nSOURCE ONEOK, Inc.\nRelated Links\nhttp://www.oneok.com", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:12.000+03:00"}]