[{"uuid": "1a1b98e2e36d25f04b5069a66e4ad7fc46be6fc9", "url": "http://omgili.com/ri/jHIAmI4hxg9y.qs7nIdriRbfPuHikiRpv_aMsM1hOb4Ieg9gbW5Kgn4DhbrycNYMHXCfmIkAww5cHs8KGjZBKRv1CJazAygFr2Gn4YtdmsQ-", "title": "Book Review: The Beast of London", "author": "Amy Cissell", "rating": null, "published": "2017-04-18T23:24:48.000+03:00", "highlightText": "", "entities": {"organizations": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "transylvania", "sentiment": "none"}], "persons": [{"name": "john seward", "sentiment": "none"}, {"name": "abraham van helsing", "sentiment": "none"}, {"name": "jonathan", "sentiment": "none"}, {"name": "clara", "sentiment": "none"}, {"name": "bram stoker", "sentiment": "none"}, {"name": "van helsing", "sentiment": "none"}, {"name": "mina", "sentiment": "none"}, {"name": "jonathan harker", "sentiment": "none"}, {"name": "gabriel", "sentiment": "none"}, {"name": "blurb  mina murray", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "1a1b98e2e36d25f04b5069a66e4ad7fc46be6fc9", "url": "http://omgili.com/ri/jHIAmI4hxg9y.qs7nIdriRbfPuHikiRpv_aMsM1hOb4Ieg9gbW5Kgn4DhbrycNYMHXCfmIkAww5cHs8KGjZBKRv1CJazAygFr2Gn4YtdmsQ-", "site_full": "www.gazellesoncrack.com", "title": "Book Review: The Beast of London", "site_section": "http://www.gazellesoncrack.com/feed", "domain_rank": null, "published": "2017-04-18T23:24:48.000+03:00", "title_full": "Book Review: The Beast of London", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "Amy Cissell", "site_type": "blogs", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://www.gazellesoncrack.com/wp-content/uploads/2017/04/34615862.jpg", "site": "gazellesoncrack.com"}, "external_links": [], "language": "english", "text": "Posted on April 18, 2017 | Leave a comment \nA few weeks ago, I got an email from the author asking if I wanted an advanced copy to read and review. Along with the email, I got the cover and the blurb. \nThe blurb sounded interesting, but I am not going to lie to you, faithful readers. It was the cover that convinced me. I mean, look at this gorgeous thing! \nThe Cover \nRight? RIGHT? \nThat is amazing. Also intriguing? The blurb. I love me some Bram Stoker, and I think we all know how I feel about vampires. A retelling of the Dracula story from Mina’s point of view? There was absolutely no way I was turning that down. \nThe Blurb \nMina Murray once lived an adventurous life, but after a tragedy in the forests of Transylvania, she left it all behind. Now she has settled into a quiet routine as a schoolteacher in London, engaged to the respectable solicitor Jonathan Harker, attempting to fit into the stuffy upper class London society to which he belongs. \nHer dark past comes careening into her present when Jonathan is abducted by a group of vampires from a society ball. Determined to rescue him, she teams up with her former paramour Abraham Van Helsing and his colleague, Scotland Yard Inspector John Seward. \nAs they pursue Jonathan’s abductors from England to the Low Countries and beyond, Mina realizes that Jonathan’s abduction is tied to a larger threat against humanity… \nThe Review \nI had a hard time getting into it in the beginning. The language seemed stilted and didn’t flow very well. It wasn’t until I was about 30% of the way through this (60K word) book that I felt like it came into its own. \nThe backbone of the story is interesting, but the characters didn’t seem very well-developed. It was hard to believe that Jonathan Harker was lovable enough to endure his mother and to mount a full-fledged rescue attempt in the face of almost impossible odds. \nHowever, the world-building was very well done, and by the end, I was buying the forbidden chemistry between Mina and Abe (Van Helsing). There were some fun twists and turns regarding a mysterious stranger and some events that had me wanting to do a little historical research (which is, for me, the hallmark of a good book–I care enough to dig deeper). \nThe ending felt abrupt. I think the book could’ve easily continued on for another 10-20K words (and I would’ve liked more exposition and time spent with the main characters). \nI’m hoping we see more of the intriguing Clara in the next book (which I will definitely be picking up) and learn more about Gabriel’s back story. \nThe Verdict \nA good debut! I’m looking forward to the author’s voice really coming into its own as she moves forward with future works. I’ll definitely be waiting for the second one to come out and give this a solid 3.5 stars. \nThe Disclaimer \nI received an ARC in exchange for an honest review. Share this:", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:48.000+03:00"}]