[{"entities": {"organizations": [{"name": "new york times", "sentiment": "none"}, {"name": "k. bromberg          baseball", "sentiment": "none"}, {"name": "mlb", "sentiment": "none"}, {"name": "paperback               new york times", "sentiment": "none"}, {"name": "b&n", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}, {"name": "amazon author  |  driven group", "sentiment": "none"}, {"name": "wall street journal bestsellers", "sentiment": "none"}], "locations": [{"name": "cal", "sentiment": "none"}], "persons": [{"name": "k.", "sentiment": "none"}, {"name": "easton wylder", "sentiment": "none"}, {"name": "doc dalton", "sentiment": "none"}, {"name": "easton", "sentiment": "none"}, {"name": "dalton", "sentiment": "none"}, {"name": "cal wylder", "sentiment": "none"}, {"name": "doc", "sentiment": "none"}, {"name": "eason", "sentiment": "none"}, {"name": "bromberg", "sentiment": "none"}, {"name": "k. bromberg", "sentiment": "none"}]}, "uuid": "1a57c14336fe02fa3cc4b4ef6b6527b504a9b066", "highlightText": "", "title": "Release Blitz with Review: The Player by K. Bromberg", "thread": {"site": "blogspot.com", "country": "US", "participants_count": 1, "site_full": "smokinhotbookblog.blogspot.com", "section_title": "Smokin' Hot Book Blog", "uuid": "1a57c14336fe02fa3cc4b4ef6b6527b504a9b066", "site_section": "http://smokinhotbookblog.blogspot.com/", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T23:58:45.000+03:00", "url": "http://omgili.com/ri/7aBdisT0NOoML8z2nQJGCxltBM7paHiTIVyAL5Rq6ZQ2eewoyuXf9I65edSa.Wj88PZ11KeAnhPZZU3oSvOASGlSwYxexTyvgBTGMdwGVebkTmBGxHQkSoK_FOrFZDGA", "title_full": "Release Blitz with Review: The Player by K. Bromberg", "title": "Release Blitz with Review: The Player by K. Bromberg", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T23:58:45.000+03:00", "url": "http://omgili.com/ri/7aBdisT0NOoML8z2nQJGCxltBM7paHiTIVyAL5Rq6ZQ2eewoyuXf9I65edSa.Wj88PZ11KeAnhPZZU3oSvOASGlSwYxexTyvgBTGMdwGVebkTmBGxHQkSoK_FOrFZDGA", "ord_in_thread": 0, "crawled": "2017-04-16T23:58:45.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Christie SHBBblogger (noreply@blogger.com)", "text": "  \n\n    \nBaseball has never been sexier in an all-new novel by New York Times Bestselling Author, K. Bromberg. Easton Wylder is baseball royalty. The game is his life. His passion. His everything . So, when an injury threatens to end Easton’s season early, the team calls in renowned physical therapist, Doc Dalton, to oversee his recovery. Except it’s not Doc who greets Easton for his first session, but rather, his daughter, Scout. She may be feisty, athletic, defiant, and gorgeous, but Easton is left questioning whether she has what it takes to help him. Scout Dalton’s out to prove a female can handle the pressure of running the physical therapy regimen of an MLB club. And that proof comes in the form of getting phenom Easton Wylder back on the field. But getting him healthy means being hands-on. And with a man as irresistible as Easton, being hands-on can only lead to one thing, trouble . Because the more she touches him, the more she wants him, and she can’t want him . Not when it’s her job to maintain the club’s best interest, in regards to whether he’s ready to play. But when sparks fly and fine lines are crossed, can they withstand the heat, or is one of them bound to get burned? \niBooks  |  B&N  |  Kobo  |  Paperback           \n  \nNew York Times Bestselling author K. Bromberg writes contemporary novels that contain a mixture of sweet, emotional, a whole lot of sexy, and a little bit of real. She likes to write strong heroines, and damaged heroes who we love to hate and hate to love. A mom of three, she plots her novels in between school runs and soccer practices, more often than not with her laptop in tow. Since publishing her first book in 2013, K. has sold over one million copies of her books and has landed on the New York Times, USA Today, and Wall Street Journal Bestsellers lists over twenty-five times. In April, she’ll release The Player, the first in a two-book sports romance series (The Catch, book 2, will be released late June), with many more already outlined and ready to be written. She loves to hear from her readers so make sure you check her out on social media or sign up for her newsletter to stay up to date on all her latest releases and sales HERE   \n  Website  |  Facebook  |  Twitter  |  Instagram  |  Goodreads  |  Amazon Author  |  Driven Group \n\n\nREVIEW \nI just recently started getting into K. Bromberg's books again and I'm kicking myself for wandering away for so long. This was yet another excellent read by her and I was really impressed with the depth of emotion it was able to evoke. The Player is not your typical fluffy sports romance, but doesn't have an overtly angsty tone either. It was the perfect balance of romance, heat, and witty humor. \n\n\nEaston is the cocky golden boy of baseball, yet not obnoxiously so. He's filled with confidence, and an abundance of energy and magnetism and he isn't afraid to use it to his advantage. What he isn't prepared for is to be assigned to the new trainer who immediately puts him in his place and sees past his star power. After getting injured, the pressure is on for him to return to his position in the time allotted to him, or his career may be in jeopardy. However, no one's expectations are as high as his father, baseball legend Cal Wylder.\n\nEaston and Cal's relationship is one of the main points of conflict. Living in his father's shadow is not a comfortable place to be, and fighting for his father's respect seems to be a losing battle. Though he is gifted at the game, works relentlessly to improve himself, and gives everything he has, he always seems to come up short in his father's eyes. This feeling of inadequacy has leaked into the love of the game until he's started to wonder whether he's playing for the right reasons anymore. \n\nIt’s fucking beautiful. A blessing and a curse. My pleasure and my pain. The only thing I’ve ever known. The only thing I’ve ever wanted to do. \n\n\nI really sympathized with Easton. His father wasn't necessarily mean spirited, but selfish and unable to open up to his son. And it definitely seemed to me that there is more going on underneath the surface with his father that hopefully will come to light in the following book. \n\nScout Dalton is a no nonsense woman who doesn't pull any punches. But Easton has her rattled and running scared very quickly. The instant attraction and desire he makes her feel is overwhelming and unwanted. Her one focus and priority needs to be getting him back in fine physical shape and back in the game. For more reasons than she's willing to share with anyone. Quietly suffering and with no one to turn to, it hasn't been easy to put up the strong front. \n\nBut with Easton, they seem to slide into a natural and comforting dynamic without even trying. Add onto that their passionate, off the charts, combustible heat? Suddenly Eason's game involves a lot more than the one on the field. He's determined to gain Scout's time, her trust, and most importantly, her heart.\n\nI’m putting myself out on a limb for a woman who wants to run, when for the life of me, I’ve never been one to stay. But I’m not going anywhere. \n\n\nI absolutely loved this couple together. Easton was firm and decisive in his resolve to make her his. And Scout was tough, intelligent, and a strong heroine that could hold her own against anyone. I appreciated the lack of unnecessary drama from their secret relationship. I was a little worried that would crop up, but thankfully not. There is a cliffhanger at the end, so be prepared. It wasn't a horribly uncomfortable one, but be aware that everything will be revealed and come to a conclusion in the final installment, The Catch, in June. \n\nIf you love sports romance, this is a must read. The characters are well thought out and engaging, the storyline fast paced and sensual. I'm really looking forward to seeing how this couple finds their HEA in the conclusion. \n\nFOLLOW SMOKIN HOT BOOK BLOG ON:  \n\n\n\n\nView all my reviews "}]