[{"entities": {"locations": [{"name": "california", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}, {"name": "fresno", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "grand canyon national park", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "gmt police", "sentiment": "none"}, {"name": "fresno state university", "sentiment": "none"}, {"name": "breitbart news", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}], "persons": [{"name": "ivanka trump", "sentiment": "none"}, {"name": "steve stephens", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "lars maischak", "sentiment": "none"}, {"name": "george h.w. bush", "sentiment": "none"}, {"name": "maischak", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "jon ossoff", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.newson6.com", "site_section": "http://www.newson6.com/category/13530/national-news?clienttype=rss", "domain_rank": 33730, "replies_count": 0, "country": "US", "section_title": "News On 6 - National - Headline", "title": "California professor on paid leave for anti-Trump tweet", "title_full": "California professor on paid leave for anti-Trump tweet", "published": "2017-04-19T08:25:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_XCqqqI7R4P6K5g4XUY3PUPfsFl4DhiOJHWiGjkmc.1Q8FMC_pWEFnPI9lJiUrFNtITV9avjpN_u_RxMTTVujPF_5tWrFqjM6Gv0Dx0mhrmvjDiGOdD1R4", "site": "newson6.com", "main_image": "", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 0, "performance_score": 0, "spam_score": 0.0, "uuid": "1a687d423a494997b5e322d3255e35225f6f7e35", "site_type": "news"}, "title": "California professor on paid leave for anti-Trump tweet", "published": "2017-04-19T08:25:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_XCqqqI7R4P6K5g4XUY3PUPfsFl4DhiOJHWiGjkmc.1Q8FMC_pWEFnPI9lJiUrFNtITV9avjpN_u_RxMTTVujPF_5tWrFqjM6Gv0Dx0mhrmvjDiGOdD1R4", "author": "", "crawled": "2017-04-19T08:40:13.000+03:00", "language": "english", "text": "California professor on paid leave for anti-Trump tweet - NewsOn6.com - Tulsa, OK - News, Weather, Video and Sports - KOTV.com | California professor on paid leave for anti-Trump tweet Posted:  15  15:16 GMT Lawyers for Arkansas inmates condemned to die Thursday in a planned double execution are claiming they are innocent and one of them says advanced DNA techniques could show he didn't kill a woman in 1993. More >> Lawyers for Arkansas inmates condemned to die Thursday in a planned double execution are claiming they are innocent and one of them says advanced DNA techniques could show he didn't kill a woman in 1993.  15  15:14 GMT An Associated Press examination has revealed federal and state managers made a series of questionable decisions and missteps before and during a crisis at the nation's tallest dam in February. More >> An Associated Press examination has revealed federal and state managers made a series of questionable decisions and missteps before and during a crisis at the nation's tallest dam in February.  07  07:37 GMT Massachusetts prison officials say former NFL star Aaron Hernandez has hanged himself in his cell and pronounced dead at a hospital. More >> Massachusetts prison officials say former NFL star Aaron Hernandez has hanged himself in his cell and pronounced dead at a hospital.  14  14:56 GMT She wasn't in her home state, but U.S. Sen. Elizabeth Warren couldn't have asked for a friendlier audience to launch her book tour. More >> She wasn't in her home state, but U.S. Sen. Elizabeth Warren couldn't have asked for a friendlier audience to launch her book tour.  14  14:52 GMT Ivanka Trump has tried to distance herself from the brand that bears her name, to separate business from politics in her new position at the White House. More >> Ivanka Trump has tried to distance herself from the brand that bears her name, to separate business from politics in her new position at the White House.  14  14:21 GMT A 23-year-old man sues the federal government Tuesday over his deportation to Mexico, saying he was entitled to remain in the United States under a program that shields people who came to the country as young... More >> A 23-year-old man sues the federal government Tuesday over his deportation to Mexico, saying he was entitled to remain in the United States under a program that shields people who came to the country as young children. More >>   Trump   More >> \nSAN FRANCISCO (AP) - Fresno State University in California says an American history professor who tweeted that President Donald Trump \"must hang\" will be on paid leave for the rest of the semester. \nThe university says in a statement Tuesday that professor Lars Maischak has taken a voluntary leave of absence for the remainder of the spring semester. \nMaischak could not immediately be reached for comment. \nLast week, Maischak apologized for tweeting: \"To save American democracy, Trump must hang. The sooner and the higher, the better.\" \nFar-right websites such as Breitbart News highlighted the tweet, sparking angry calls on social media for the professor to be fired. \nThe university declined to say if Maischak would be back to teach in the fall, saying it was continuing to review the case. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. News On 6", "external_links": [], "highlightTitle": "", "uuid": "1a687d423a494997b5e322d3255e35225f6f7e35", "highlightText": "", "rating": null}]