[{"uuid": "1b2443f6cb186170154e9487c90473907ef0a918", "url": "http://omgili.com/ri/jHIAmI4hxg_ovv15pZNA6sLvMlEyBeB37WA9D2mRu97oJHxBI_PSSMeRdtqFWL1Mc.18XgXSpALQ55bEZWk.1kjoRt7tTuhTr28AO41xxKuk4QlzTJcGL1geMgpPZm2fSBYSehPuQFq8WlgrrV39TA--", "title": "Trump targets visa program for highly skilled workers", "author": "Catherine Lucey And Scott Bauer, The Associated Press", "rating": null, "published": "2017-04-18T23:24:51.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "walt disney world", "sentiment": "none"}, {"name": "snap-on", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "howard university", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "university of california", "sentiment": "none"}, {"name": "snap-on inc.", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "mar-a-lago", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "palm beach", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "upper midwest", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "kenosha", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "persons": [{"name": "catherine l", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "sean spicer", "sentiment": "none"}, {"name": "paul wiseman", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "scott bauer", "sentiment": "none"}, {"name": "ronil hira", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "1b2443f6cb186170154e9487c90473907ef0a918", "url": "http://omgili.com/ri/jHIAmI4hxg_ovv15pZNA6sLvMlEyBeB37WA9D2mRu97oJHxBI_PSSMeRdtqFWL1Mc.18XgXSpALQ55bEZWk.1kjoRt7tTuhTr28AO41xxKuk4QlzTJcGL1geMgpPZm2fSBYSehPuQFq8WlgrrV39TA--", "site_full": "www.lakenewsonline.com", "title": "Trump targets visa program for highly skilled workers", "site_section": "http://www.lakenewsonline.com/news/nation-world?template=rss&mime=xml", "domain_rank": null, "published": "2017-04-18T23:24:51.000+03:00", "title_full": "Trump targets visa program for highly skilled workers", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "Nation & World - The Lake News Online", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://www.lakenewsonline.com/storyimage/ZZ/20170418/NEWS/304189973/AR/0/AR-304189973.jpg", "site": "lakenewsonline.com"}, "external_links": [], "language": "english", "text": "Trump targets visas program for highly skilled workers   7:08 AM Apr 18, 2017 at 2:10 PM Catherine Lucey And Scott Bauer,   \nWASHINGTON (AP) \" President Donald Trump heads to the politically important state of Wisconsin Tuesday to sign an order aimed at curbing abuses in a visa program used by technology companies that rely on high-skilled foreign workers. \nThe order, dubbed \"Buy American, Hire American,\" marks a return to the populism Trump seemed to all but abandon with a series of recent reversals on economic policies. \nTrump will sign the directive at the headquarters of tool manufacturer Snap-on Inc. in Kenosha, Wisconsin, a state he narrowly carried in November on the strength of support from white, working class voters. But Trump is currently facing a 41 percent approval in the state. \nTrump is targeting the H-1B visa program, which the White House says undercuts American workers by bringing in large numbers of cheaper, foreign workers, driving down wages. \nThe tech industry has argued that the H-1B program is needed because it encourages students to stay in the U.S. after getting degrees in high-tech specialties \" and they can't always find enough American workers with the skills they need. \nThe order would direct U.S. agencies to propose rules to prevent immigration fraud and abuse in the program. They would also be asked to offer changes so that H-1B visas are awarded to the \"most-skilled or highest-paid applicants,\" said administration officials who spoke on the condition of anonymity despite the president's frequent criticism of the use of anonymous sources. \nThe officials said the order also seeks to strengthen requirements that American-made products be used in certain federal construction projects, as well as in various federal transportation grant-funded projects. The commerce secretary will review how to close loopholes in existing rules and provide recommendations to the president. \nThe order specifically asks the secretary to review waivers of these rules in free-trade agreements. The waivers could be renegotiated or revoked if they are not benefiting the United States. \nTrump's visit to Wisconsin takes him to the congressional district of House Speaker Paul Ryan, who won't be joining the president because he's on a congressional trip visiting NATO countries. \nTrump campaigned on populist promises to stand up to China, which he claimed was manipulating its currency and stealing American jobs, and to eliminate the Export-Import bank, which he billed as wasteful subsidy. In a series of interviews last week, Trump reversed himself on both positions \nAnd while he has long pledged to support American goods and workers, his own business record is mixed. Many Trump-branded products, like clothing, are made overseas. And his businesses have hired foreign workers, including at his Palm Beach club Mar-a-Lago. \nDuring his campaign, Trump said at one point that he supported high-skilled visas, then opposed them. At one debate, he said: \"It's very bad for our workers and it's unfair for our workers. And we should end it.\" \nThe officials said potential changes could be administrative or legislative and could include higher fees for the visas, changing the wage scale for the program or other initiatives. \nCritics say the program has been hijacked by staffing companies that use the visas to recruit foreigners \" often from India \" who will work for less than Americans. The staffing companies then sell their services to corporate clients who use them to outsource tech work. \nEmployers, such as Walt Disney World and the University of California in San Francisco, have laid off tech employees and replaced them with H-1B visa holders. The U.S. workers are sometimes asked to train their replacements to qualify for severance packages. \nRonil Hira, a professor in public policy at Howard University and a critic of the H-1B program, said Trump's planned order is \"better than nothing.\" But he added, \"It's not as aggressive as it needs to be.\" \nTrump has traveled to promote his agenda less than his recent predecessors. White House spokesman Sean Spicer said Trump wanted to visit \"a company that builds American-made tools with American workers.\" \nTrump carried Wisconsin in November by nearly 23,000 votes \" less than 1 percentage point \" making him the first Republican to win the state since 1984. He campaigned on the promise of returning manufacturing jobs that have been lost in Upper Midwest states. \nSnap-on makes hand and power tools, diagnostics software, information and management systems, and shop equipment for use in various industries, including agriculture, the military and aviation. It has eight manufacturing sites in North America and employs about 11,000 people worldwide. \n___ \nAssociated Press writer Paul Wiseman contributed to this report. About Us", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:51.000+03:00"}]