[{"rating": null, "external_links": [], "crawled": "2017-04-16T08:53:26.000+03:00", "author": "P.C. Periodicals", "entities": {"persons": [], "locations": [], "organizations": []}, "text": "Let friends in your social network know what you are reading about Facebook Email More new Windows 10 features P.C. Periodicals More new Windows 10 features P.C. Periodicals Check out this story on thespectrum.com: http://www.thespectrum.com/story/life/features/mesquite/2017/04/15/more-new-windows-10-features/100515968/ Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs More new Windows 10 features George Cox, P.C. Periodicals 7:19 p.m. MT April 15, 2017 George Cox, PC Periodicals 2   \nLast week, I started a review of many of the new features in the Creators Update , including gaming enhancements, app throttling, paint 3D, virtual reality, privacy dashboard, windows update improvements, and Cortana changes. \nHere are a few more new features: \nNight light \nSimply put, this is a night shift mode for Windows 10 that tones down the blue light that emits from a screen. This comes in handy when using a device at night, putting less strain on eyes when reading. \nEbooks \nOne very welcome feature is the ability to read ebook formats like EPUB straight from the Edge web browser. You will be able to customize font sizes, and Cortana will be at hand to assist with word lookups. Creators Update also brings about a dedicated ebook section in the Windows Store. \nEdge additions \nMicrosoft Edge, the web browser, also comes with subtle improvements. There is a new chevron located on the right of tabs that pops open a bar that contains rich visual previews of each tab. This can be scrolled through with touch, touchpad or mouse. Edge also gets a new set aside tabs feature, which basically stashes all open tabs for recollecting later. Another notable change that Microsoft has made is making Flash content click-to-run. \nUsers can also launch InPrivate windows on Edge straight from the jump list in the taskbar. There is support for Microsoft Wallet in Edge, and thanks to the Payment Request API, the browser stores your payment and shipping preferences to make online purchases fast and easy. \nMicrosoft also bills the Edge web browser as a portal for interacting with 3D digital content while wearing a HoloLens headset. \nStart menu folders \nThis might wind up being real useful for heavy users of the Start menu. Starting with the Windows 10 Creators Update, you will be able to drag your Start menu apps on top of each other to create folders that expand when selected. \nBetter theme support \nThe Creators Update packs enhanced options for people that want to customize the look of their PCs. It moves theme control into the Personalization section of the Settings app, and users can now choose theme accents from the entire color spectrum, as opposed to a handful of predefined options. Windows will actually warn you if you choose a color combination that is difficult to read! \nMicrosoft is also offering users the ability to download and buy new themes from the Windows Store, and although the selection is small right now, it is sure to improve as time goes by. \nWindows Defender overhaul \nA complete overhaul. Windows Defender, the default antivirus app part of Windows 10, has received a fresh new coat of paint in the Creators Update that brings with it new scanning options along with reports on the health and performance of your PC. \nDefender also adds a nuclear option. A link to Refresh your PC that reinstalls and updates your computer, wiping most of the applications, but keeping personal files and settings intact. This option was hidden away deep down in Settings previously, but could come in handy if a nasty malware infects your PC. \nHandoff \nThis is the ability to jump from device to device. Apple already has this continuity feature in its ecosystem that lets users pick up where they left off with files on other Apple devices, and now Microsoft is embracing this functionality. Cortana combines with the Action Center here to allow you to switch computers. \nWhen switching devices, quick links to any websites you were browsing in Edge on other PCs will be displayed in the Action Center, along with links to any cloud based documents that you were working on. The functionality is somewhat limited right now, but future improvements are expected. \nDynamic Lock \nThis is something that could benefit business users immensely. Microsoft internally calls this feature Windows Goodbye, and it basically automatically locks your PC when you walk away. Think of Dynamic Lock as the reverse of Windows Hello. \nPower slider \nThis is something that probably not all users will get, as Microsoft has said that it will be working with OEMs to determine the best settings for their customers so that they can ship this new functionality on new Windows 10 PCs. \nThe idea here is to allow users the ability to adjust the power performance of their device, thanks to a new Power Mode slider in the battery section. You will be able to crank it up to full when you need more oomph, or dial it down if you do not need as much computing firepower in order to increase battery life. Again, only select devices will be getting this, but it is a neat little improvement. \nSettings improvements \nThe Setting apps in Windows 10 are now the hub of new additions to the operating system. Creators Update tweaks things around a bit, and shows all devices connected to your PC in one centralized location — from mouse to keyboard to peripherals like the Surface Pen. No longer will you have to scour through various submenus and panels to find all the information on your PC hardware. \nBusiness features \nWhile professionals and enterprise users will find many of the new features in the Creators Update welcome additions, there are a few that specifically cater to the business crowd. Like the ability to block installation of Win32 software programs. \nAnother is streamlined support for virtual private networks, VPNs, that makes it possible to easily activate a connection without opening your network connections. This is, once Windows, knows your VPN credentials. \nThere is also a new Quick Create option that makes it easy to deploy Hyper-V virtual machines. \nAnd this is just a brief summary of the new features! \nGeorge Cox is owner of Computer Diagnostics and Repair in Mesquite. Call him at 702-346-4217. 2   Read or Share this story: http://www.thespectrum.com/story/life/features/mesquite/2017/04/15/more-new-windows-10-features/100515968/ TOP VIDEOS", "url": "http://omgili.com/ri/jHIAmI4hxg8gRtwQDVK6hdv_jDdECSdrHMeq_BbtC1uPVyfp4z95E.25SVWxbDbCFx7kHXR6u.di4eJ5Y6dd00a2WghPNv437TBJ7p0G8kO30DMSD7SdjRYGtGKmTJGZ8T_lQcqN0i3OddUjWE2pNg--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T08:53:26.000+03:00", "language": "english", "title": "More new Windows 10 features", "thread": {"title_full": "More new Windows 10 features", "site_full": "www.thespectrum.com", "site": "thespectrum.com", "site_section": "http://rssfeeds.thespectrum.com/stgeorge/home", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "news", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "GANNETT Syndication Service", "url": "http://omgili.com/ri/jHIAmI4hxg8gRtwQDVK6hdv_jDdECSdrHMeq_BbtC1uPVyfp4z95E.25SVWxbDbCFx7kHXR6u.di4eJ5Y6dd00a2WghPNv437TBJ7p0G8kO30DMSD7SdjRYGtGKmTJGZ8T_lQcqN0i3OddUjWE2pNg--", "published": "2017-04-16T08:53:26.000+03:00", "title": "More new Windows 10 features", "uuid": "1b95a6a398a7a9d95670786ef5fbf57df6062496", "main_image": "https://www.gannett-cdn.com/-mm-/58037f66c5632b6c0b13c0b0d000ed7f886f495e/c=0-94-190-201&amp;r=x633&amp;c=1200x630/local/-/media/2015/06/26/StGeorge/B9317876881Z.1_20150626142959_000_GAQB6KP2F.1-0.png"}, "uuid": "1b95a6a398a7a9d95670786ef5fbf57df6062496", "ord_in_thread": 0}]