[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/t1o2C2H78UcWiXpDIBgZjKP4mmTQiELv3llyrkYSIWwMs6kZc42F6bM8lqk8ZPwafqAmi.lxLPXXZLWX_4McpuIypJliR08p", "title": "Unrisible Irrascible Men (PeraclesPlease)", "site_type": "blogs", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://feeds.feedburner.com/dagblog", "spam_score": 0.0, "section_title": "dagblog", "site": "dagblog.com", "site_full": "dagblog.com", "performance_score": 0, "uuid": "1c251deb046e2d06c78aedb4ee8d7114047fa2d9", "published": "2017-04-17T11:27:24.000+03:00", "site_categories": [], "country": "US", "title_full": "Unrisible Irrascible Men (PeraclesPlease)", "participants_count": 1, "main_image": ""}, "url": "http://omgili.com/ri/t1o2C2H78UcWiXpDIBgZjKP4mmTQiELv3llyrkYSIWwMs6kZc42F6bM8lqk8ZPwafqAmi.lxLPXXZLWX_4McpuIypJliR08p", "title": "Unrisible Irrascible Men (PeraclesPlease)", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:27:24.000+03:00", "language": "english", "entities": {"locations": [{"name": "new york", "sentiment": "none"}, {"name": "pre-wwi america", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "hamilton", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "long island", "sentiment": "none"}, {"name": "roosevelt", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "persons": [{"name": "michael wolraich", "sentiment": "none"}, {"name": "lafollette", "sentiment": "none"}, {"name": "john houseman", "sentiment": "none"}, {"name": "wolraich", "sentiment": "none"}, {"name": "jonathan", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}, {"name": "casey jones", "sentiment": "none"}, {"name": "wilson", "sentiment": "none"}, {"name": "carl sandburg", "sentiment": "none"}, {"name": "taft", "sentiment": "none"}, {"name": "bob lafollette", "sentiment": "none"}, {"name": "teddy roosevelt", "sentiment": "none"}, {"name": "roosevelt", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "congressional", "sentiment": "none"}, {"name": "vanderbilt", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "jp morgan", "sentiment": "none"}, {"name": "lincoln", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "1c251deb046e2d06c78aedb4ee8d7114047fa2d9", "published": "2017-04-17T11:27:24.000+03:00", "author": "PeraclesPlease", "text": "By PeraclesPlease on Mon, 04/17/2017 - 4:20am | Politics , Social Justice \nMichael Wolraich's Unreasonable Men is an engaging exercise in political map making, following the fashions of the times with the entrenched interests of every year. The period in this case is the turn to the 20th century up to pre-WWI America, when her social development lagged significantly behind her economic success, but I found myself wishing for similar vignettes in other ages and historical climes. It's not the most weighty of tomes - finished in 1 day - but I'm not alone in not having time for say Carl Sandburg's 6-volume set on Lincoln - Unreasonable Men is more in the spirit of Hamilton, the Musical - a theater piece you can enjoy and put down, though revert to and contemplate with pleasure. \nUnreasonable Men is a multi-tragedy combined with a soothing but ironic ultimate success - the one we all kind of know about, the America Made Great Yet Again. But the proof is in the details, not in any assured outcomes, and Michael provides those details. Aside from the figures we know or kind of know - Roosevelt, Taft, a bit of Wilson, J.P. Morgan, Vanderbilt and early cro-Rockefeller clan - there are the Congressional and business characters usually well forgotten after their period shelf-life. And this part of the tale is the most worth remembering - the bipartisan logjam of entrenched power controlling the sausage making. There are no accidents in this factory - it's a well-run machine producing an exact product to specification, whatever the occasion. There's an assuredness to the actors' certainty of what is and what should be, born in the conceit of the scientific marvels of the late 19th Century driving progress with seemingly no brakes. But like Casey Jones' famous locomotive, speed and haste portend more than a safe arrival, and America's trains built on fealty to the robber barons is soon to come apart at the seams. \nTo not give away the good parts, the core issue at play is America's tariff system, the sole serious means for government to raise money at that time and the playing field for most that was corrupt. But the book highlights the increasing political and personal divides in the new century - the conquest of the West completed, the people turning to more basic and mundane but fragmented wants. Nothing unites a country like a shared goal, and nothing divides it like that goal completed. \nAt the heart of this book's heroic journey is Bob LaFollette, a quixotic character from then \"out west\" Wisconsin who discovers somewhat early on that he wants to help people, and doesn't seem that intent on playing the game as intended. He's not a grand chess master - his play seems to look 2-3 steps ahead where most people see only the gotcha enticements of 1 - but his playing is good enough to keep him going into the big leagues. If this were a novel - and you have to keep pinching yourself to remind that it's not - there'd be one primary evil foil. But in the pattern of America's shifting alliances, characters like Roosevelt provide a powerful ally and enemy at once, just as the Senate and House and party leaders provide a palpable enough villain. Even JP Morgan's appearance is more benign than malignant, though it serves to show part of what's wrong with this supremely patronistic system. While LaFollette is billed as the \"won't take no for an answer\" type, he's surprisingly reasonable in his ambitions - focused on digestible mouthfuls moreso than swallowing the whole hog, but insistent on those mouthfuls, along with (at least in retrospect) attuned to obvious needs rather than unhinged demands, and that reasonableness in a time of undistributed plenty and seemingly unbreakable agreements makes him a dark horse to root for. He's not a Mr. Deeds Goes to Washington type in the sense that this isn't a movie - his ardor and persuasion has to be carried across his rise as Congressman, Governor, Senator and short-lived Presidential aspirant against real foes and obstacles. \nLincoln Steffens and the budding socially conscious news media (in contrast to the Hearst/Pulitzer-style yellow journalism of the previous decade) provide a useful messaging outlet in those telegraph-and-sparse-telephone days, and it's heartening to see them skeptically persuaded rather than bought by the growing populist furor, even though the press plays its usual fickle role between strings pulled from behind the set and the drive for sensation from the (as Michael helpfully defines) \"muck rakers\". \nAside from the political foils, the backdrop is the collegiate setting of the well-heeled - the Long Island clan we know from high school's The Great Gatsby, but a step earlier in its development - when that wealth was created amidst the self-assurance of the rail and coal and electricity boom and land grabs out West, when train and ocean travel became the connective tissue of that generation's jet set - and indeed, half of the book mentions this or that character off on an enviable 6-week to 3-month vacation. Wolraich's description isn't roman-à-clef - it's more utilitarian, a bit like mug shots or quick snaps to identify the usual suspects - but it's sufficient to get us involved and identified with a scene we thought we knew enough about, but was much more involved and transformational than that overlooked in Civics class (and at last we get some inside skinny on those 4 turn-of-the-century amendments that snuck in after a 40 year drought). \nThese are not smiling people - they're earnest and hard-charging in that Teddy Roosevelt we do likely glimpse, my way or the highway, but even there, Wolraich's descriptions and dredged out historical references bring more nuance and understanding to the well-trod character, and that nuance makes Roosevelt's role in this tragedy much less predictable and more engaging as the plot develops. There are some gaps in the mosaic - New York's sweatshops and the 1911 Triangle Shirtwaist fire would have fit in well with the budding outrage that drove the new \"progressivism\" that LaFollette introduced, while women, even the suffragettes, play a quite minor role as was usual for the time - but the book foremost is about Washington and its inner workings and how that changed - not any particular piece to the puzzle. \nAnd in that regard, Unreasonable Men is instructive as well as retrospective - a reminder that the wheels can come off at any time, not just with the big wars, but the tense moments of the Panic of 1907, and how the most prepared can take advantage of these shock points in history. It's also ultimately optimistic in its outlook, how the system eventually won - at least in values the progressive left would acclaim - even as most of the players go down in defeat. In the original 1972 movie Rollerball, John Houseman proclaims, \"no man is bigger than the game itself, Jonathan\" - and as this chapter of America unfolds, the game, not the house, is the winner. Well done, Wolraich - bully. \nDisclaimer - aside from blogging with (& occasionally fighting with) Wolraich, this is an unsolicited review from a purchased version of the book. Topics:"}]