[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:18:36.000+03:00", "author": "Nightdragon (noreply@blogger.com)", "entities": {"persons": [{"name": "jerry williams", "sentiment": "none"}, {"name": "saddam hussein", "sentiment": "none"}, {"name": "betsy devos", "sentiment": "none"}, {"name": "matt damon", "sentiment": "none"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "james comey", "sentiment": "none"}, {"name": "assad", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}, {"name": "gloria", "sentiment": "none"}, {"name": "devos", "sentiment": "none"}, {"name": "laura ingraham", "sentiment": "none"}, {"name": "bush", "sentiment": "none"}, {"name": "jared kushner", "sentiment": "none"}, {"name": "nunes", "sentiment": "none"}, {"name": "george soros", "sentiment": "none"}, {"name": "dubya bush", "sentiment": "none"}, {"name": "jared", "sentiment": "none"}, {"name": "hitler", "sentiment": "none"}, {"name": "adam schiff", "sentiment": "none"}, {"name": "jeff sessions", "sentiment": "none"}, {"name": "susan rice", "sentiment": "none"}, {"name": "damon", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "dubya", "sentiment": "none"}, {"name": "mayer brown", "sentiment": "none"}, {"name": "nicky haley", "sentiment": "none"}, {"name": "ivanka", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}, {"name": "john kerry", "sentiment": "none"}, {"name": "john kelly", "sentiment": "none"}, {"name": "archie bunker", "sentiment": "none"}, {"name": "sean spicer", "sentiment": "none"}, {"name": "mike", "sentiment": "none"}, {"name": "neil gorsuch", "sentiment": "none"}, {"name": "barry", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "lai", "sentiment": "none"}, {"name": "devan nunes", "sentiment": "none"}, {"name": "spicer", "sentiment": "none"}, {"name": "michelle bachmann-like", "sentiment": "none"}], "locations": [{"name": "afghanistan", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "vatican city", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "rio de janiero", "sentiment": "none"}, {"name": "middle eastern", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "idlib", "sentiment": "none"}, {"name": "aleppo", "sentiment": "none"}, {"name": "afganistan", "sentiment": "none"}, {"name": "u.s.a.", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "peshawar public school", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "f.b.i.", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "moab", "sentiment": "none"}, {"name": "house permanent select committee on intelligence", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "white house press", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}, {"name": "homeland security", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "taliban", "sentiment": "none"}, {"name": "standard and poor", "sentiment": "none"}, {"name": "department of homeland security", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "wall st.", "sentiment": "none"}, {"name": "beslan school", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "text": "I guess we can now call them the Trumpbots. \nThe people for whom the great Jerry Williams used to say, \"they're out there!\" The ones who could listen to Trump announce that he was going to declare himself king of the universe with George Soros as his deputy and say, \"U ... yeah. Sure! Well done, Mr. President! America First!\" \nThe ones who apparently are so firmly attached to the President's caboose that they absolutely cannot hear anything that doesn't blindly support their guy. Trump's been doing a lot lately that makes me wonder how America will be made great again, but these folks don't want to know. \nEven the Obamabots, at least during his first term, were willing to call out the Dear Leader. Remember in 2011 when Matt Damon was asked about him, to which the Mass-hole actor sadly shook his head, sighed and replied, \"Not a fan.\" The Obama butt-kissers, including Damon, soon stepped back into line during his second administration—after all, what could they possibly have not liked?—but when Barry failed to completely bring the hammer of soft socialist dictatorship down on the \"bitter clingers\" before 2012, they spoke up. I've said it before and I'll say it again, at least you know where you are with the Left. \nThe Trumpbots, however? Stick your fingers in your ears, a blindfold over your eyes and use your mouth only to shout down the \"alt-right\" when it rightly expresses concern over the path down which your man is headed. Just sit there like dopes, praise everything he does and question nothing. That's brilliant, folks. What a gang of geniuses. We should be inclined to leave democracy in your hands? \nTrump is infinitely better than Hillary the Pantsuit. We have Jeff Sessions as Attorney General and Neil Gorsuch on the Supreme Court. The coal industry has been given a new lease on life and some bureaucratic red tape has been cut. Some jobs have been created and the economy has responded with an uptick. Hell, if this keeps up, Standard and Poor's may give the U.S. back its AAA credit rating. Things are okay. There are green shoots springing up from the decaying matter of the last eight years. \nBut, listen to me, fellow Trumpsters: You knew the deal. You were aware that he had to be held to his word—by us . You cannot allow yourselves to be so taken in by his aura that you will not question him because you think that's unpatriotic. You have to question those you support. Or else, you risk supporting a cult of personality and nothing more. \nFifteen years ago, I was totally taken in by the rah-rah jingoism of the Iraq War. Saddam Hussein was a bad dude, he had weapons of mass destruction, and, if we searched hard enough, there was probably a link to 9/11 with his regime as well. We had to free the Iraqi people and bestow Jeffersonian democracy on them. Bush, Bush, U.S.A., U.S.A.! I ate that shit up—hook, line and sinker. And now? Oh, what kind of fool was I? \nI now loathe the neocons who brought us that war (among so many others). I despise the jingoistic yellow journalism behind \"Remember the Maine\" and the My Lai massacre. Another conspiracy by the internationalists to keep us mired  in a conflict that keeps the war machine churning. As for Dubya, I now cringe at the thought of ever having had that idiot's back. He was just another tool of the global establishment. He promised us in 2000 to keep out of foreign entanglements, and then dropped us in two of them. There was some justification for action in Afghanistan albeit, but we should have got out once we shot every Taliban member out of that tree they were in, and not get bogged down like the Soviets circa 1979. \nBush voters did not hold him to account. In fact, they put him in for a second term. Granted, his opposition was Pepé Le Pew, a.k.a. John Kerry. Still, the \"U.S.A! U.S.A!\" chants started getting old; obscene, in fact, given the flag-draped coffins that started to multiply. \nThe lesson we should all have learned? Fight only when we're attacked. Have a massive, well-trained military with plenty of air and sea power on reserve for times when it is genuinely required to defend the homeland. Let's try living as a nation of peace for once and leave the rest of the world to it. \nA great place to start is to recognize that avenging the babies of the \"sarin\" gas attack in Syria is not going to save the whole world. Children die everywhere, it's a grim fact of life. From a metaphysical standpoint, death is death. Why don't we lob a few Tomahawk missiles at Vatican City for the Children's Crusade of 1212? Even better, what about declaring war on the police force of Rio de Janiero for the 1993 Candelaria child massacre ? Hey, the deaths of sixty young 'uns still need avenging, don'tcha know! Don't you care about the children ? \nIn fact, among the worst contemporary massacres involving children are the Beslan School attack in 2004 which killed 156 children, the 2014 Peshawar Public School attack in Pakistan that killed 100 children, the Baghlani-jadid factory massacre in Afganistan in 2007 that took out 61 children, and the attack on the Yazidi community in Iraq by ISIS last year and by al-Qaeda in 2007, death toll numbers for which have not been provided but are thought to have wiped out scores of children. All of these attacks committed by ...? Yep, radical Islamists. And we attack Assad's secular regime and take a hard line against Russia, the nuclear superpower we were promised vastly improved relations with by the new President. \nSo, people, I don't want to hear any more about \"the children\". I'm sorry to say it, but it's immaterial. And here's the thing: I'm still waiting for the proof that Assad committed the gas attack in Idlib province, and that the gas was even sarin. If you look at the health workers tending to the children after the attack, you will see that they're only wearing gloves and dust masks. Those alone would not have saved them from the effects of sarin—just sayin'.  Were the more scientifically agile among us not supposed to notice this? \nBy the way, a car bomb exploded west of Aleppo on Saturday, killing 24 people who were being moved as part of the \"Syrian swap,\" arranged by the Syrian government and the opposition to evacuate people from towns and cities that have been besieged for years. I suppose Assad whipped this up too, even though suicide bombings are the hallmark of Islamic terrorists in the Middle East? Who's your next bomb going to hit, Mr. President? I certainly hope it'll take out more than just 94 ISIS militants as with your MOAB strike in Afghanistan. Now, 940— then we're talking business. \nBut enough about that. Let's have a quick review of some of the other bewildering moves by Trump lately and the wackiness of his administration, discounting the previous health care and travel ban disasters: \n\nHe has reversed his position on the Import-Export bank, one the biggest corporate welfare rackets operating, in which only the biggest companies benefit. (And we all need Facebook and Google and Amazon to be even more powerful than they already are, don't we?) NATO, that anachronism, was declared by Trump to be \"no longer obsolete\". China will not be declared a currency manipulator. This, despite Trump having talked about this since the 1980s. Chief advisor Steve Bannon was publicly dressed down by Trump while Jared Kushner is seemingly taking the lead in almost every committee meeting. James Comey won't be persuaded to step down as head of the F.B.I. and will not pursue \"locking her up,\" that is, throwing Hillary Clinton in prison where she belongs. And if he won't put Hillary away, Susan Rice probably won't be doing the perp walk anytime soon as well. White House Press Secretary Sean Spicer embarrasses himself and the educational reputation of the United States by claiming that \"Ashad\" is worse than Hitler because the Nazi leader did not use chemical weapons. When asked to clarify this by a member of the press, Spicer noted that indeed Hitler brought gas into \"the Holocaust center,\" but not deliver chemical attacks from a plane. This bumbling idiot is the best Trump can do for his White House Press Secretary, especially when he could have Laura Ingraham in that role? Nicky Haley, our ambassador to the United Nations, as Michelle Bachmann-like a boob as you can get, says that ISIS is \"obviously\" the problem, but justifies regime change in Syria [ OK, so I lied about \"enough of that\" ]. Trump has nominated a partner at Mayer Brown, a global legal services provider including advising on trade and visas and work placement for migrants, and former Dubya Bush administration member as Secretary of State Rex Tillerson's number 2 guy at the State Department. Education Secretary Betsy DeVos told illegal alien students that they \"should not be concerned\" about losing in-state tuition. In saying this, DeVos parroted Homeland Security leader John Kelly who said last month that, \"the least of my worries right now is anyone who falls under the general category of DACA\" and also \"the least of my worries are undocumented illegal aliens who are living lives.\" On that subject, the Department of Homeland Security has suspended its sanctuary cities list, alleging the inaccuracy of some of the data used to produce it. In other words, the threat to pull federal funding from municipalities sheltering illegal law-breakers, if that's not a redundancy, is being challenged and, as always, the principled position is taking a back seat to social justice radicalism. So they had to ... uh, you know, \"suspend the list\". Where are the tax cuts Americans were promised? When will the tax plan Trump laid out during his candidacy be implemented? When will that wall start getting built? When will Trump call that quisling Paul Ryan out for betraying conservative principles by not crafting a budget that will include tax cuts and funding for the border wall? \nIncidentally, dear reader, remember how I recently asked  if Devan Nunes, the House Permanent Select Committee on Intelligence chairman, would recuse himself regarding the investigation into whether the Obama administration spied on Trump, for which evidence was found and he was excoriated by the Democrats and the media for not first going to Democrat hack Adam Schiff with it? Let me claim to have been among the first to foresee this. I wrote the entry April 2, and Nunes recused himself on April 6. I called it, mes amis . I called it. \nI'll tell you what. Maybe we've been snookered here, Trump fans. Did this dude just pull the mother of all arts of the deal on us? If Donald Trump is the Archie Bunker that the nation's deplorables elected, he's been spending too much time listening to Mike and Gloria, in this case, Jared and Ivanka, than following the desires of the base that got him where he is. \nThis president needs to start listening to us now and put a halt to all the reversals and policy shifts that he and his cabinet have been engaging in. And he needs you , my dear little Trumpsters, to hold him to account. \nDon't be a Trumpbot. Support the original Trump message of \"America First\". Call me crazy, but cozying up to the Wall St. crowd, calling for Middle Eastern regime change and stalling action on illegals is not the nationalist, American citizens über alles protocol that I voted for. ", "url": "http://omgili.com/ri/snFTpiOKdJV5Qwb7RST8GpCFcJvotyfTOCxmO2pjJ2X8dIQiCAwOljZMEmv0nJ2xRI7IQXL8Pg6_oCzSM1lj_rZw0zaIUwnTk.5w1SJCZZqLkStTvpncoQ--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:18:36.000+03:00", "language": "english", "title": "Trumpsters need to resist their transformation into Trumpbots", "thread": {"title_full": "Trumpsters need to resist their transformation into Trumpbots", "site_full": "nitpickingnightdragon.blogspot.com", "site": "blogspot.com", "site_section": "http://nitpickingnightdragon.blogspot.com/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Nitpickings of a Nightdragon", "url": "http://omgili.com/ri/snFTpiOKdJV5Qwb7RST8GpCFcJvotyfTOCxmO2pjJ2X8dIQiCAwOljZMEmv0nJ2xRI7IQXL8Pg6_oCzSM1lj_rZw0zaIUwnTk.5w1SJCZZqLkStTvpncoQ--", "published": "2017-04-16T09:18:36.000+03:00", "title": "Trumpsters need to resist their transformation into Trumpbots", "uuid": "1ca4e69f40a0876517b2bb7cf801e2fd7ee36383", "main_image": null}, "uuid": "1ca4e69f40a0876517b2bb7cf801e2fd7ee36383", "ord_in_thread": 0}]