[{"entities": {"locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "bering sea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "korean peninsula", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "seoul national cemetery", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "trump administration states planned parenthood", "sentiment": "none"}, {"name": "army", "sentiment": "none"}, {"name": "u.s. forces korea", "sentiment": "none"}, {"name": "u.s. army garrison yongsan", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "bronze star", "sentiment": "none"}, {"name": "u.s. army", "sentiment": "none"}, {"name": "air force", "sentiment": "none"}], "persons": [{"name": "karen pence", "sentiment": "negative"}, {"name": "mike pence", "sentiment": "negative"}, {"name": "vincent brooks", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mike pence calls", "sentiment": "none"}, {"name": "edward", "sentiment": "none"}, {"name": "pence", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.yahoo.com", "site_section": "https://www.yahoo.com/news/", "domain_rank": 5, "replies_count": 0, "country": "US", "section_title": "Yahoo News - Latest News &amp; Headlines", "title": "Mike Pence Calls North Korea’s Failed Missile Launch A “Provocation”", "title_full": "Mike Pence Calls North Korea’s Failed Missile Launch A “Provocation”", "published": "2017-04-17T18:32:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZQCR4GWh90giXQcOEADWgFJ1D8ylZJ6mP_19.FmtbKbGl7AebxjRub2BFSzDcm9PEWB6lFVVGYegYGR4WG7sm75", "site": "yahoo.com", "main_image": "https://s.yimg.com/uu/api/res/1.2/6uihe7nxf11p6yBG3KMWbg--/aD00Mjc7dz02NDA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/homerun/vibe_128/94ed14ffb60dee876bb24f2e1bee032f", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 2, "comments": 0, "likes": 2}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.011, "uuid": "1ea2519c9db8a61cd8b0814e5021316a607c4965", "site_type": "news"}, "title": "Mike Pence Calls North Korea’s Failed Missile Launch A “Provocation”", "published": "2017-04-17T18:32:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZQCR4GWh90giXQcOEADWgFJ1D8ylZJ6mP_19.FmtbKbGl7AebxjRub2BFSzDcm9PEWB6lFVVGYegYGR4WG7sm75", "author": "Associate Press", "crawled": "2017-04-19T08:38:05.000+03:00", "language": "english", "text": "By Associate Press U.S. Vice President Mike Pence, accompanied by wife Karen Pence, said Sunday that North Korea’s “provocation” underscored the risks faced by American and South Korean service members, hours after the North conducted a failed missile launch shortly before Pence’s arrival.\nREAD: Trump Administration States Planned Parenthood’s Funding Will Remain Intact Under One Condition\nPence landed in South Korea at the start of a 10-day trip to Asia and was quickly confronted with the stakes facing the United States as Pyongyang seeks to flex its muscles around the birth anniversary of the country’s late founder and advance the regime’s nuclear and missile capabilities.\nWhile Pence was aboard Air Force Two flying over the Bering Sea, a North Korean missile exploded during launch on Sunday, U.S. and South Korean officials said, representing a high-profile failure that came as a powerful U.S. aircraft supercarrier approaches the Korean Peninsula.\nAfter arriving in Seoul, the vice president placed a wreath at Seoul National Cemetery and then worshipped with military personnel at an Easter church service at the U.S. Army Garrison Yongsan. During a fellowship meal after the services, he said the tensions on the Korean peninsula had put into sharp focus the importance of the joint U.S.-South Korean mission.\n“This morning’s provocation from the North is just the latest reminder of the risks each one of you face every day in the defense of the freedom of the people of South Korea and the defense of America in this part of the world,” said Pence, who was introduced by Army Gen. Vincent Brooks, commander of U.S. Forces Korea. “Your willingness to step forward, to serve, to stand firm without fear, inspires the nation and inspires the world.”\nPence told the military members that he had spoken twice with President Donald Trump during the day.\nPence said that under Trump’s leadership, “our resolve has never been stronger, our commitment to this historic alliance with the courageous people of South Korea has never been stronger and with your help and God’s help, freedom will ever prevail on this peninsula.”\nTrump has suggested that the U.S. will take a tougher stance against North Korea, telling reporters last week: “North Korea is a problem. The problem will be taken care of.” He has repeatedly said if China, North Korea’s dominant trading partner, is unwilling to do more to pressure the North, the U.S. might take the matter into its own hands.\nAlong with the deployment of the Naval aircraft carrier and other vessels into waters off the Korean Peninsula, thousands of U.S. and South Korean troops, tanks and other weaponry were also deployed last month in their biggest-ever joint military exercises. That led North Korea to issue routine threats of attacks on its rivals if they show signs of aggression.\nA White House foreign policy adviser told reporters aboard Air Force Two that the type of missile that North Korea tried to fire on Sunday was medium-range, and that it exploded about 4 to 5 seconds after it was launched.\nAccording to the adviser, the test had been expected and the U.S. had good intelligence both before and after the launch. The adviser, who spoke on condition of anonymity to discuss the administration’s initial understanding of the launch, said there was no expected response from the Trump administration because there was no need for the U.S. to reinforce the failure.\nThe official said that had it been a nuclear test, “other actions would have been taken by the U.S.”\nNorth Korea has conducted five nuclear tests, including two last year. Recent satellite imagery suggests the country could conduct another underground nuclear test at any time.\nDespite North Korea’s provocations, U.S. officials have said that the U.S. doesn’t intend to use military force against North Korea in response to either a nuclear test or a missile launch.\nAfter a two-month policy review, officials settled on a policy dubbed “maximum pressure and engagement,” U.S. officials said Friday. The administration’s immediate emphasis, the officials said, will be on increasing pressure on Pyongyang with the help of Beijing.\nThe officials weren’t authorized to speak publicly on the results of the policy review and requested anonymity.\nPence will be tasked with explaining the policy in meetings with leaders in South Korea and Japan at the start of his trip, which will also include stops in Indonesia and Australia. He will also aim to reassure allies in South Korea and Japan that the U.S. will take appropriate steps to defend them against North Korean aggression.\nPence’s first trip to South Korea carries personal meaning as well. He noted to the soldiers that his late father, Edward, served in the U.S. Army during the Korean War and was awarded the Bronze Star on April 15, 1953 — 64 years to the day of the vice president’s departure for South Korea. Pence displays in his office his father’s Bronze Star and a photograph of his father receiving the honor.\nREAD: Arkansas Judge Blocks State’s Plan To Execute Eight Inmates Over An 11-Day Period\nThis article was originally published on Death & Taxes .\nThis post Mike Pence Calls North Korea’s Failed Missile Launch A “Provocation” first appeared on Vibe .", "external_links": ["http://www.vibe.com/2017/04/mike-pence-north-koreas-failed-missile-launch/?utm_source=yahoo&amp;utm_medium=syndication&quot;", "http://www.vibe.com/2017/04/mike-pence-north-koreas-failed-missile-launch/?utm_source=yahoo&utm_medium=syndication", "http://www.vibe.com/2017/04/arkansas-judge-blocks-execution-of-eight-inmates/?utm_source=yahoo&amp;utm_medium=syndication&quot;", "http://www.deathandtaxesmag.com/326341/mike-pence-north-korea-missile-provocation/?utm_source=yahoo&utm_medium=syndication", "http://www.vibe.com/2017/04/arkansas-judge-blocks-execution-of-eight-inmates/?utm_source=yahoo&utm_medium=syndication", "http://www.vibe.com/2017/03/donald-trump-defund-planned-parenthood-abortion/?utm_source=yahoo&utm_medium=syndication", "http://www.deathandtaxesmag.com/326341/mike-pence-north-korea-missile-provocation/?utm_source=yahoo&amp;utm_medium=syndication&quot;", "http://www.vibe.com/2017/03/donald-trump-defund-planned-parenthood-abortion/?utm_source=yahoo&amp;utm_medium=syndication&quot;"], "highlightTitle": "", "uuid": "1ea2519c9db8a61cd8b0814e5021316a607c4965", "highlightText": "", "rating": null}]