[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:25:08.000+03:00", "author": "Miranda Sawyer", "entities": {"persons": [{"name": "mohamed", "sentiment": "none"}, {"name": "corden met barlow", "sentiment": "none"}, {"name": "young", "sentiment": "none"}, {"name": "grayson perry", "sentiment": "none"}, {"name": "michael palin", "sentiment": "none"}, {"name": "oliver james", "sentiment": "none"}, {"name": "pinterest hashi mohamed", "sentiment": "none"}, {"name": "hashi mohamed", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "tony hall", "sentiment": "none"}, {"name": "michael sandel", "sentiment": "none"}, {"name": "toby young", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}, {"name": "tom sutcliffe", "sentiment": "none"}, {"name": "hall", "sentiment": "none"}, {"name": "jan morris", "sentiment": "none"}, {"name": "naomi alderman", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "somalia", "sentiment": "none"}], "organizations": [{"name": "meritocracy | television & radio", "sentiment": "neutral"}, {"name": "facebook twitter", "sentiment": "none"}, {"name": "bbc  mohamed", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "facebook share", "sentiment": "none"}, {"name": "observer radio", "sentiment": "none"}, {"name": "bbc toby young", "sentiment": "none"}, {"name": "facebook twitter pinterest toby young", "sentiment": "none"}]}, "text": "Saturday Review (Radio 4)\nAdventures in Social Mobility (Radio 4) | iPlayer\nThe Rise and Fall of the Meritocracy (Radio 4) | iPlayer\nThere has been a lot of social media distress at the demise of Radio 4’s Saturday Review . Its replacement – a selection of Front Row highlights – is not cutting it for the show’s many fans, who enjoy Saturday Review ’s round-table-many-voices format, the contributors’ insights and the exemplary presentation skills of Tom Sutcliffe. It does seem sad. Since Tony Hall took over at the head of the BBC, there has been a Corporation shunt away from a journalistic approach to culture towards a practitioner justification of it. Right from the start, Hall said he wanted to “showcase more of the incredible talent that this country has to offer” – which is great, except showcasing is all we get. The Review Show is no more. Night Waves went years ago. The Culture Show was decommissioned. And now, bye bye Saturday Review .\nInstead, the BBC offers us programmes where we witness art (beautifully shot performances or festivals; easy-watching shows on painting or pop), or we witness artists talking to other artists. Such shows are entertaining but they are not analytical. Whether it’s Grayson Perry chatting to Naomi Alderman on Radio 4 (great), Michael Palin meeting Jan Morris (not bad) or When Corden Met Barlow (hmm), it’s all celebration and celebrity. No critique. No debate. No argument. Ah, well. The arts have always been subject to whimsical trends within the BBC. Perhaps this is just the one we are in at the moment.\nFacebook Twitter Pinterest Hashi Mohamed, presenter of Adventures in Social Mobility. Photograph: Shaista Chishty\nWe are also, apparently, in a moment of meritocracy, and last week Radio 4 offered us two programmes on the subject. Toby Young’s The Rise and Fall of the Meritocracy , which I’ll come to, and Hashi Mohamed’s Adventures in Social Mobility . Mohamed came to the UK from Somalia when he was nine. He grew up in a three-bedroomed house that had 18 people in it, scored fairly average GCSEs, but then turned himself around in his early 20s to become a beautifully spoken, successful barrister. His story is inspiring but, as he admitted, it’s also atypical. “Does my story say something about upward mobility,” he wondered, “or the barriers to it?”\nThis programme offered insight into the difficulties that ordinary people must overcome in order to succeed. It’s not just the grades – the grades are achievable – it’s what one contributor called a “cultural connectedness”. If you join a law chambers, you may well stay there for years (I didn’t know this), so when you’re being considered for pupillage, your interviewer is thinking: “Do I want this person as my colleague for the rest of my professional life?” No wonder they stick with what or who they know.\nMohamed encouraged young people from outsider backgrounds to tell their stories to get on. But, said one, revealing too much of myself would make me feel vulnerable. (You note that the elite don’t have to do this.) And what if your story is less striking than Mohamed’s? Would anyone care? Should the ordinary person change to fit in, or the professions change to fit the ordinary person?\nFacebook Twitter Pinterest Toby Young. Photograph: BBC\nMohamed’s programme packed a lot in. Toby Young’s didn’t get quite so much, but it tried. He took the premise of meritocracy (a term coined by his dad, Michael , who was a Labour peer) and told us it did the opposite of what we think it does. Instead of allowing clever working-class people to progress, it keeps the elite up there. Young believes that if you are born to privilege then not only does your environment push you towards success but, also, your brains do. Your elite genes mean you are cleverer.\nThis is not an argument that everyone agrees with, and many of his contributors, including Oliver James and Michael Sandel , took him to task. Perhaps it was my addled liberal brain, but I couldn’t quite work out where Young stood within his analysis. He predicted that “the disenfranchised masses” would boil over and “the liberal world order will be swept away”. (Hence Brexit and Trump.) But, other than “readjustment”, he didn’t offer many alternative ideas.\nTopics Radio The Observer Radio 4 BBC Toby Young reviews Reuse this content", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nvb.iEnU1.6mdBzJ.0eU5XIwDMQ_LflCoaSkmaviUetUmKXpruxmm18ZmhuYRtJ.kRrbozFjXj73WzMz9_UrYqeyJOjJvhVjbrjubPqtLKu1usyKbMcxzcU.xvF1eFcgv", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:25:08.000+03:00", "language": "english", "title": "The week in radio: Saturday Review; Adventures in Social Mobility; The Rise and Fall of the Meritocracy | Television & radio | The Guardian", "thread": {"title_full": "The week in radio: Saturday Review; Adventures in Social Mobility; The Rise and Fall of the Meritocracy | Television & radio | The Guardian", "site_full": "www.theguardian.com", "site": "theguardian.com", "site_section": "http://www.theguardian.com/media/bbc/rss", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "news", "spam_score": 0.0, "domain_rank": 170, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "BBC | The Guardian", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nvb.iEnU1.6mdBzJ.0eU5XIwDMQ_LflCoaSkmaviUetUmKXpruxmm18ZmhuYRtJ.kRrbozFjXj73WzMz9_UrYqeyJOjJvhVjbrjubPqtLKu1usyKbMcxzcU.xvF1eFcgv", "published": "2017-04-16T09:25:08.000+03:00", "title": "The week in radio: Saturday Review; Adventures in Social Mobility; The Rise and Fall of the Meritocracy | Television & radio | The Guardian", "uuid": "1fafee373f227c2c2f5e02f3a3a421d64f081697", "main_image": "https://i.guim.co.uk/img/media/e0c87b5dc1057bb45369c873b7f9e3d6cff25889/323_550_3157_1894/master/3157.jpg?w=1200&amp;h=630&amp;q=55&amp;auto=format&amp;usm=12&amp;fit=crop&amp;crop=faces%2Centropy&amp;bm=normal&amp;ba=bottom%2Cleft&amp;blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&amp;s=ec8db77a55453189a83079c4baa94705"}, "uuid": "1fafee373f227c2c2f5e02f3a3a421d64f081697", "ord_in_thread": 0}]