[{"entities": {"organizations": [{"name": "penn station stampede", "sentiment": "none"}, {"name": "new york post", "sentiment": "none"}, {"name": "wikileaks", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "post", "sentiment": "none"}, {"name": "facebook tweet", "sentiment": "none"}, {"name": "time", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "trump budget", "sentiment": "none"}, {"name": "trump hotel", "sentiment": "none"}, {"name": "facebook page reveals about domestic violence trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "top court", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "popular girls", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "dnc", "sentiment": "none"}, {"name": "cia", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "doed’s office of civil rights", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "san bernardino shooter", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "china warns u.s.", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "hudson river the new york", "sentiment": "none"}], "persons": [{"name": "steve bannon", "sentiment": "negative"}, {"name": "joshua roberts/@darth/reuters steve bannon", "sentiment": "neutral"}, {"name": "lucifer", "sentiment": "none"}, {"name": "emmerich", "sentiment": "none"}, {"name": "mike pompeo", "sentiment": "none"}, {"name": "anne catherine emmerich", "sentiment": "none"}, {"name": "kushner", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bannon", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "jared kushner", "sentiment": "none"}, {"name": "jared", "sentiment": "none"}, {"name": "christ", "sentiment": "none"}, {"name": "gary", "sentiment": "none"}, {"name": "adolf hitler", "sentiment": "none"}, {"name": "gary cohn", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "mel gibson", "sentiment": "none"}, {"name": "jesus christ", "sentiment": "none"}, {"name": "stephen miller", "sentiment": "none"}, {"name": "dubya", "sentiment": "none"}, {"name": "ivanka", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "cohn", "sentiment": "none"}, {"name": "sheila abdus-salaam", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "elizabeth warren", "sentiment": "none"}, {"name": "richard spencer", "sentiment": "none"}, {"name": "bill o’reilly", "sentiment": "none"}, {"name": "paul lepage", "sentiment": "none"}]}, "uuid": "20c39b19c8749fe25117f87e40b7453cd335edc7", "highlightText": "", "title": "Steve Bannon’s Biblical Fall", "thread": {"site": "nymag.com", "country": "US", "participants_count": 1, "site_full": "nymag.com", "section_title": "NYMag - Politics, Entertainment, Fashion, Restaurants &amp; NY", "uuid": "20c39b19c8749fe25117f87e40b7453cd335edc7", "site_section": "http://nymag.com/", "domain_rank": 1627, "main_image": "http://pixel.nymag.com/imgs/daily/intelligencer/2017/04/16/16-bannon-thorns.w1200.h630.jpg", "performance_score": 7, "published": "2017-04-16T21:41:00.000+03:00", "url": "http://omgili.com/ri/snFTpiOKdJX_Q.Hl4wZ3hP2nZo8dvp7hnjxfgg93aGXMe1Gpo2olc7JKhIzLyBqDT48nuq2cws0QnZ11gUj4wobks5ii9pv8m8auRsV3NT8-", "title_full": "Steve Bannon’s Biblical Fall", "title": "Steve Bannon’s Biblical Fall", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 793, "shares": 793, "comments": 1}, "pinterest": {"shares": 1}, "gplus": {"shares": 6}, "vk": {"shares": 0}, "linkedin": {"shares": 1}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T21:41:00.000+03:00", "url": "http://omgili.com/ri/snFTpiOKdJX_Q.Hl4wZ3hP2nZo8dvp7hnjxfgg93aGXMe1Gpo2olc7JKhIzLyBqDT48nuq2cws0QnZ11gUj4wobks5ii9pv8m8auRsV3NT8-", "ord_in_thread": 0, "crawled": "2017-04-16T23:17:07.000+03:00", "rating": null, "external_links": ["https://www.nytimes.com/2017/04/15/opinion/sunday/steve-bannon-was-doomed.html", "http://thehill.com/homenews/administration/327588-bannon-ready-for-wh-gun-fight-report", "http://www.thedailybeast.com/articles/2017/02/09/steve-bannon-wanted-mel-gibson-for-his-movie-about-nazis-abortion-mutants.html", "http://www.politico.com/magazine/story/2017/04/donald-trump-steve-bannon-breitbart-215026", "http://www.facebook.com/sharer/sharer.php?u=http://nymag.com/daily/intelligencer/2017/04/steve-bannons-biblical-fall.html%3Fmid%3Dfb-share-di", "http://www.vulture.com/2017/04/survivor-contestant-outed-another-as-transgender.html", "https://twitter.com/share?text=Steve%20Bannon%E2%80%99s%20Biblical%20Fall&url=http://nymag.com/daily/intelligencer/2017/04/steve-bannons-biblical-fall.html%3Fmid%3Dtwitter-share-di&via=intelligencer"], "highlightTitle": "", "author": "", "text": "Frown of thorns. Photo: Joshua Roberts/@Darth/Reuters Steve Bannon is a devout Catholic who believes in the resurrection of Jesus Christ. But it’s the story of Christ’s descent into hell that occupies his mind most this Easter weekend.\nThe embattled chief strategist to President Donald Trump is a student of Blessed Anne Catherine Emmerich, a 19th-century nun and German mystic whose visions, documented in The Dolorous Passion of Our Lord Jesus Christ , served as inspiration for The Passion of the Christ, the 2003 film by Mel Gibson (who, incidentally, Bannon once reportedly tried to work with on a movie about, among other things, Adolf Hitler and eugenics).\nIn that book, in a chapter favored by Bannon, this is how Emmerich describes hell: “All in this dreary abode tends to fill the mind with horror; not a word of comfort is heard or a consoling idea admitted; the one tremendous thought, that the justice of an all-powerful God inflicts on the damned nothing but what they have fully deserved, is the absorbing tremendous conviction which weighs down each heart.” Those poor souls in hell are notable not for their misfortune, but for their deservedness. (Coincidentally, I’m sure, Emmerich also predicts that Lucifer will be “unchained for a time fifty or sixty years before the year of Christ 2000”; Trump was born fifty-four years before, in 1946.)\nLikewise in the White House, where Bannon has endured a cinematic and enthusiastically documented fall in recent weeks, there is a sense that he made his own dismal fate. “All of his problems today are of his own making,” one source with knowledge of the latest West Wing drama told me of Bannon. “Whether Bannon is gone or not is an open question. Whether he’s neutered? He’s neutered. There was a time he had influence. His influence has waned.”\nMedia reports have not been subtle in characterizing Bannon’s political future. The New York Times branded him “ doomed ” while Politico planned his funeral (while also predicting a “revenge saga”). But as with all things Trump, the truth may be at once less and more predictable than that. “You’re always up and down with Trump,” another source said. “There’s always gonna be a favorite.”\nTrump is dissatisfied and looking to assign blame for a first 100 days in office defined by humiliation and defeat, according to half a dozen sources I’ve spoken to in recent days. At any given moment, what irks him might be the death of the health-care bill, or the early misstep on the travel ban, or, perhaps most painfully of all, the old media chatter that Bannon is, in the words of Time , “the great manipulator.” Trump attempted to dispel the latter perception last week in a remark to the New York Post, denying Bannon credit for the election victory against Hillary Clinton (“I’m my own strategist”). “There was obviously residual lagging effects for all the press that Steve got,” another source said. Trump mentioned to the Post an ominous threat to “straighten out” tensions between Bannon and the presumably untouchable Jared Kushner. Bannon also might be paying the price for press Trump believes, accurately or not, Bannon engineered: “He thinks Steve was leaking against Jared and Ivanka,” the source said. “If I was trying to fuck Steve? That’s what I would do.”\nWhite House sources tell me the ideological split with Kushner is real but not quite the point — Bannon’s primary “ gunfight ” is with economic adviser Gary Cohn, a longtime Democrat whose influence has ballooned as Bannon has fallen out of favor with the president. The Goldman Sachs alums — Bannon was an investment banker there in the ’80s, Cohn was the COO until earlier this year — can comfortably “shoot the shit,” but mutual suspicion looms beneath the superficial friendliness. “Look, in all honesty? Steve has said things to me about Gary,” a source close to Bannon told me. “He’s never said one thing to me derogatory about Jared.”\n“The president has started his love affair with Gary,” another source said, “Gary’s not aware of this: That love affair will end abruptly. Gary Cohn will step on a landmine.”\nMany sources believe Bannon’s “fatal mistake” was choosing to stay out of early, top-tier hiring disputes, focusing instead on his big picture, anti-globalist agenda. But now Bannon stands alone — a self-styled radical seated at the table with ideological opponents Kushner and Cohn, who haven’t similarly been blamed for the turmoil of the first 100 days. Even White House senior adviser Stephen Miller, a natural ally to Bannon, has been working more closely with Kushner recently, a source said.\nAnother administration official close to Bannon added, “He’s an intellectual messiah, right? There’s a little bit of a messianic, I’m gonna cure all the ills of the United States — him and Trump are like that together. But what I do think is he’s realizing [that] he needs more allies.”\nFor his part, Bannon appears to be abiding, if nervously — with the official divulging that he’d been “rocked” by his abrupt change in status with the president, and the uncertainty he now faces.\nTrump is, for instance, both prone to nostalgia — recently calling a former aide in the middle of the night to ask his advice on a Tweet — and also deeply unsentimental. “You could play golf with this guy for 40 years, have a heart attack on the ninth hole, he’ll pick up a new golf partner on the tenth hole like nothing happened. He doesn’t give a shit, okay? Doesn’t mean he doesn’t like you,” the official said, adding, “What happens with all these guys is they get very confident in their relationship with Trump and then Trump blasts them. As soon as you think you’re in Trump’s good graces and you start to be at ease and take that for granted, that’s when you get annihilated.”\nBut fittingly, given the holiday, in this week’s carnage was a miracle of sorts for Bannon. The president, according to multiple sources, has been distracted at least a bit by the military strikes in Syria and Afghanistan as well as his needling of North Korea. “He’s always been enamored of the generals,” a source close to him said. “The more medals you’re wearing on your chest, the more he likes you — that’s a danger.” For someone trying to keep a low profile in the White House, it might seem like welcome cover.\nTags: steve bannon politics donald trump trump administration early and often Steve Bannon’s Biblical Fall Share on Facebook Tweet this Story Top Stories Reagan Manipulated Television. Trump Is Controlled by It. The Duke Lacrosse Scandal and the Birth of the Alt-Right Donald Trump Is Just George W. Bush But Racist Most Viewed Stories Girls Series-Finale Recap: I Got It Nice of Melania to Remind Donald What to Do During the National Anthem Melissa McCarthy Wasn’t ‘Live From New York’ on Saturday Night Live This Weekend Alex Jones Is Just ‘Playing a Character,’ According to His Lawyer The Woman Texting Someone Else While Her Fiancé Is Away Reagan Manipulated Television. Trump Is Controlled by It. Every Episode of Girls , Ranked President John Tyler’s Grandson, Harrison Tyler, on Still Being Alive After Her Sugar Sphinx, Kara Walker Is a Whole Different Kind of Public Figure Let’s Talk About the Girls Series Finale Most Popular Video On Daily Intelligencer How Much Does Donald Trump Hate His Job? Latest News from Daily Intelligencer 5:37 p.m. Confederate Flag Issue Making a Comeback in South Carolina Special Election A GOP candidate is attacking rivals for voting to remove the Dixie flag from the Statehouse grounds.\n5:34 p.m. North Korea Accuses U.S. of Provoking ‘Dangerous Situation’ “A dangerous situation in which thermonuclear war could break out at any moment.”\n4:53 p.m. Trump Is Making the GOP Heinously Unpopular Again A new poll finds that Americans like the Republican Party a lot less when it’s in power.\n4:52 p.m. Uber May Be Forced to Allow Tipping in Its App in NYC You may be able to give a five-star review, and tip a dollar or two, at the end of an Uber ride in the near future.\n12:35 p.m. Russian State TV Declares Trump ‘More Impulsive’ Than Kim Jong-un “Ivanka already convinced Trump to bomb Assad, what if she convinces him to bomb Kim?” a Russian newscaster laments.\n12:28 p.m. ICE Arrests Are Up in Trump’s First Weeks in Office Attempted border crossings are also down by as much as 70 percent.\n12:11 p.m. It’s White-Knuckle Time in Georgia for Tomorrow’s Red-Hot Special Election Can Democrat Jon Ossoff steal a seat from the Republicans? It’s looking like a coin toss.\n11:28 a.m. Melania Trump Had to Remind Donald What to Do During the National Anthem The president needed a little nudge during the Easter Egg Roll festivities.\n10:13 a.m. Pro-Trump Group Launches Ads to Bolster Trumpcare Supporters America First Policies will spend $3 million on boosting supporters of the president’s health-care law, as Trump tries to revive it on Capitol Hill.\n4:03 a.m. Manhunt Under Way for Suspect Who Posted Video of Fatal Shooting on Facebook The search for Steve Stephens, who is accused of randomly targeting an elderly man, has expanded to five states.\n2:21 a.m. Pence Declares End to ‘Strategic Patience’ After N. Korea’s Failed Missile Test A U.S. military response isn’t expected, though experts were alarmed by the regime’s apparent missile advancements.\n12:03 a.m. Alex Jones Is Just ‘Playing a Character,’ According to His Lawyer The conspiracy goes deeper than we thought.\nYesterday at 9:00 p.m. Reagan Manipulated Television. Trump Is Controlled by It. Cable news will shape what he does today, which will shape what airs tonight, which …\nYesterday at 6:51 p.m. United Employees Can No Longer Displace Boarded Passengers It’s one of the most obviously needed corporate policy changes in history, but the damage to the company may already be done.\nYesterday at 4:54 p.m. Erdoğan Declares Victory in Referendum Granting Him Vast New Powers Over Turkey Voters in Turkey narrowly approved enormous changes to the country’s government, though opposition parties are contesting the results.\nYesterday at 1:41 p.m. Steve Bannon’s Biblical Fall The White House chief strategist is being described as “doomed.” Is there a resurrection in his future?\n4/15/2017 at 3:12 p.m. Federal Judge Blocks Arkansas’s Execution Spree The state will appeal the ruling, but may not be able to get its controversial execution schedule back on track.\n4/15/2017 at 12:30 p.m. The Problem With Trump’s Attempt to Scare North Korea “The history books will say: ‘How could they not have known? How could they not have known these were North Korea’s thoughts?’”\n4/15/2017 at 11:22 a.m. False Gunfire Report Triggers Penn Station Stampede, Injuring 16 The sound of a police Taser sparked a mass panic during Friday night’s commute.\n4/14/2017 at 5:36 p.m. China Warns U.S. and North Korea That ‘No One Will Win’ If War Comes “We urge all sides to no longer engage in mutual provocation and threats,” China’s foreign minister said on Friday."}]