[{"entities": {"organizations": [{"name": "padres", "sentiment": "negative"}, {"name": "braves", "sentiment": "negative"}, {"name": "triple-a el paso", "sentiment": "none"}, {"name": "post", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "atlanta braves", "sentiment": "none"}, {"name": "suntrust", "sentiment": "none"}, {"name": "san diego padres", "sentiment": "none"}, {"name": "facebook colon", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}], "locations": [{"name": "adonis garcia", "sentiment": "none"}, {"name": "el paso", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "phillips", "sentiment": "none"}], "persons": [{"name": "bartolo colon", "sentiment": "negative"}, {"name": "swanson", "sentiment": "none"}, {"name": "yangervis solarte", "sentiment": "none"}, {"name": "inciarte", "sentiment": "none"}, {"name": "flowers", "sentiment": "none"}, {"name": "phillips", "sentiment": "none"}, {"name": "jaime garcia", "sentiment": "none"}, {"name": "tyler flowers", "sentiment": "none"}, {"name": "quackenbush", "sentiment": "none"}, {"name": "matt kemp", "sentiment": "none"}, {"name": "brandon phillips", "sentiment": "none"}, {"name": "johan camargo", "sentiment": "none"}, {"name": "jered weaver", "sentiment": "none"}, {"name": "cahill", "sentiment": "none"}, {"name": "ryan schimpf", "sentiment": "none"}, {"name": "dansby swanson", "sentiment": "none"}, {"name": "zach lee", "sentiment": "none"}, {"name": "trevor cahill", "sentiment": "none"}, {"name": "freddie freeman", "sentiment": "none"}, {"name": "schimpf", "sentiment": "none"}, {"name": "christian bethancourt", "sentiment": "none"}, {"name": "hunter renfroe", "sentiment": "none"}, {"name": "nick markakis", "sentiment": "none"}, {"name": "ender inciarte", "sentiment": "none"}, {"name": "kevin quackenbush", "sentiment": "none"}]}, "uuid": "20d331d052853ca633f01ca3aabbf703558f64c5", "highlightText": "", "title": "Colon dominant over 7 innings as Braves beat Padres 9-2", "thread": {"site": "usatoday.com", "country": "US", "participants_count": 1, "site_full": "www.usatoday.com", "section_title": "GANNETT Syndication Service", "uuid": "20d331d052853ca633f01ca3aabbf703558f64c5", "site_section": "http://rssfeeds.wfmynews2.com/_/20/109971996/all-nationnow", "domain_rank": 313, "main_image": "https://www.gannett-cdn.com/-mm-/413654cd6d51bfba0f3a9422e4992975145290d3/c=0-852-2828-2443&amp;r=x633&amp;c=1200x630/local/-/media/2017/04/16/USATODAY/usatsports/f2e75d4b48f349b38b9dee4215042f6d.jpg", "performance_score": 0, "published": "2017-04-16T23:44:30.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZRj2zBbblOpDMyw6x8xfg10zzPvdu6r7sPbZ1qrFayeGh8wdUP8dbe7LwiD_fUcEf2mSwW9PhkL1OVpxd32otkCefys3EokBNWHtb1a_9OO2ycxvOTbIDra.tJJjJNW.8wfGIJZnxevuA6VEdxwGpow", "title_full": "Colon dominant over 7 innings as Braves beat Padres 9-2", "title": "Colon dominant over 7 innings as Braves beat Padres 9-2", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 20, "shares": 20, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T23:44:30.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZRj2zBbblOpDMyw6x8xfg10zzPvdu6r7sPbZ1qrFayeGh8wdUP8dbe7LwiD_fUcEf2mSwW9PhkL1OVpxd32otkCefys3EokBNWHtb1a_9OO2ycxvOTbIDra.tJJjJNW.8wfGIJZnxevuA6VEdxwGpow", "ord_in_thread": 0, "crawled": "2017-04-16T23:44:30.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "AP", "text": "Let friends in your social network know what you are reading about Facebook Email Colon dominant over 7 innings as Braves beat Padres 9-2 Bartolo Colon allowed only hit in seven dominant innings, Brandon Phillips drove in three runs with three hits and the Atlanta Braves beat the San Diego Padres 9-2 on Sunday for their fourth straight win Post to Facebook Colon dominant over 7 innings as Braves beat Padres 9-2 Bartolo Colon allowed only hit in seven dominant innings, Brandon Phillips drove in three runs with three hits and the Atlanta Braves beat the San Diego Padres 9-2 on Sunday for their fourth straight win Check out this story on USATODAY.com: http://usat.ly/2ogEGHz Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Nation's Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Colon dominant over 7 innings as Braves beat Padres 9-2 AP Published 4:26 p.m. ET April 16, 2017 | Updated 16 hours ago San Diego Padres first baseman Wil Myers (4) falls back from a pitch as he bats in the sixth inning of a baseball game against the Atlanta Braves Sunday, April 16, 2017, in Atlanta. Atlanta won 9-2. (AP Photo/John Bazemore) (Photo: The Associated Press) 18 CONNECT COMMENT EMAIL MORE \nATLANTA (AP) — Bartolo Colon was having too much fun in his home debut with the Braves to be bothered by a home run in the second inning. \nHe had no reason to worry. \nColon allowed only a hit in seven dominant innings, Brandon Phillips drove in three runs with three hits and Atlanta beat the San Diego Padres 9-2 on Sunday for its fourth straight win. \n\"I've always tried to pitch relaxed and be in a good place when it's my turn,\" Colon said through a translator. \"Like I tell everybody, the day it's my turn to pitch is the happiest day of the week for me. I love it. I was just trying to be relaxed and have a good time out there.\" \nColon (1-1) overpowered the Padres as he showed why he was given a $12.5 million, one-year contract in November. \n\"He's probably experienced anything and more than all the rest of us in this clubhouse,\" said manager Brian Snitker. \"Nothing bothers him. ... It's refreshing to watch. I love being around the guy.\" \nRyan Schimpf's homer in the second was the only hit allowed by the 43-year-old Colon. The right-hander allowed only one more baserunner — a leadoff walk to Schimpf in the fifth before Hunter Renfroe hit into a double play. Colon had six strikeouts. \n\"It's nice having him on our side,\" said Freddie Freeman. \"If he gives up one, that's usually all they're going to get.\" \nManager Andy Green said Padres hitters were \"way too passive\" and took too many fastballs against Colon. \n\"Once you let Bartolo get deep in the count, he starts pitches that look like strikes that really aren't,\" Green said. \nThe Padres led 1-0 until Tyler Flowers' single drove in Phillips and Adonis Garcia in the fifth. Phillips' one-out single was the first hit allowed by Trevor Cahill (0-2). \nPhillips had a two-run single in the sixth and a run-scoring single in the eighth. Ender Inciarte hit his fourth homer in the seventh. \nA review lasting only 58 seconds reversed the ruling on the field that Atlanta's Dansby Swanson was safe on his grounder to second base in the sixth. Inciarte and Freddie Freeman, who reached on an intentional walk, scored on Phillips' two-out single up that middle that knocked Cahill out of the game. \nPadres left fielder Travis Jankowski may have saved a homer with his catch at the wall of a drive hit by Jace Peterson in the seventh. \nTRAINER'S ROOM \nPadres: RHP Kevin Quackenbush was optioned to Triple-A El Paso to clear a roster spot for Cahill. Quackenbush pitched a scoreless inning against the Braves on Friday in his only appearance after being recalled from El Paso. \nBraves: Flowers left the game with a right hamstring strain and is day to day, according to Snitker. ... OF Matt Kemp (right hamstring tightness) can come off the 10-day DL on Tuesday. \nCAHILL OFF DL \nCahill, who was activated from the 10-day disabled list before the game, allowed four runs on four hits and three walks in 5 2-3 innings. He went on the DL with a lower back strain on April 6. \n\"The back wasn't an issue and I didn't think about it,\" Cahill said. \"I was just trying to match Bartolo out there. They got to me in the later innings, but I felt good.\" \nCahill was hurt by three wild pitches that helped the Braves score two runs in the fifth. \nSTREAKING \nNick Markakis stretched his hitting streak to 10 games with a double off Zach Lee that drove in Freeman from first in the eighth. \nJohan Camargo added a run-scoring single off Christian Bethancourt, who began his career with Atlanta as a catcher, for his first major league hit. \nBOOM OR BUST \nSchimpf, hitting .152, has three homers. He has only two other hits in 33 at-bats. \nUP NEXT \nPadres: RHP Jered Weaver (0-1) will make his third start of the season, all on the road, on Monday night. \nBraves: LHP Jaime Garcia (0-1) is 2-1 with a 2.52 ERA in six career starts against the Padres. \n___ \nMore AP baseball: https://apnews.com/tag/MLBbaseball 18 CONNECT COMMENT EMAIL MORE \nCopyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}]