[{"entities": {"organizations": [{"name": "information science", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "multicultural review", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "haiti", "sentiment": "none"}, {"name": "santiago", "sentiment": "none"}, {"name": "puerto rico", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}, {"name": "jamaica", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}], "persons": [{"name": "lyn", "sentiment": "none"}, {"name": "lyn miller-lachmann lyn", "sentiment": "none"}, {"name": "robert cormier", "sentiment": "none"}, {"name": "s.e. hinton", "sentiment": "none"}, {"name": "jim bishop", "sentiment": "none"}, {"name": "walter lord", "sentiment": "none"}]}, "uuid": "235c34d513e97a8cfed98c142ef716dcfbb167df", "highlightText": "", "title": "We Are The People: Lyn Miller-Lachmann", "thread": {"site": "wordpress.com", "country": "US", "participants_count": 1, "site_full": "campbele.wordpress.com", "section_title": "We Are The People: Lyn Miller-Lachmann – Crazy QuiltEdi", "uuid": "235c34d513e97a8cfed98c142ef716dcfbb167df", "site_section": "https://campbele.wordpress.com", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T23:18:36.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZTupZHcepF_YkQTO1TZpkwfbJ5Hv1mWFKHf0S4E6IDBj_V74l3bzy4KvIxz3B79bkfbr758g6ySWpeBKrMxMjQ7UfIcFzG4frM-", "title_full": "We Are The People: Lyn Miller-Lachmann", "title": "We Are The People: Lyn Miller-Lachmann", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T23:18:36.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZTupZHcepF_YkQTO1TZpkwfbJ5Hv1mWFKHf0S4E6IDBj_V74l3bzy4KvIxz3B79bkfbr758g6ySWpeBKrMxMjQ7UfIcFzG4frM-", "ord_in_thread": 0, "crawled": "2017-04-16T23:18:36.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Edi", "text": "Lyn has been with the We Are the People project since its inception. I really enjoy working with Lyn, she has such a vast knowledge of the publishing industry which she gladly shares. Lyn is truly one of the kindest people I know. She has a degree in Library and Information Science; is fluent in Portuguese and Spanish after living in Chile and Portugal; was the editor of the journal Multicultural Review and is an avid lego hobbyist. She is the author of . Rogue; Surviving Santiago; and edited Once Upon a Cuento. She blogs at Pirate Tree Blog as well as at her self named own blog . Connect with Lyn on Twitter ( @ LMillerLachmann ) or Facebook (www.facebook.com/lyn.millerlachmann).\nLyn, do you have a favorite reading genre?\nGrowing up, I was a big fan of nonfiction, and I still read a lot of nonfiction for adults. But as an author of books for teens, I like to read and write historical and contemporary realistic fiction. I’m supposed to be working on a contemporary middle grade novel right now, so I’m reading more middle grade these days. \nFor whom do you think the WTP list is meant?\nThe list is for everyone! It’s important for young readers to see themselves in books and to know that books and reading are for them. I teach creative writing to ninth graders whose families come from Haiti, Jamaica, Puerto Rico, and Pakistan, and it means a lot to them to see not only stories from the places where their families originated but also authors whose backgrounds are similar to theirs. They come to believe that they too can become writers, and since I told them writers had to read a lot, they’ve now cleaned out my classroom library. \nAt the same time, young people need windows to other cultures if they are to become good citizens of the world. We’ve seen the result of ignorance and intolerance in both the U.S. and the U.K., and it will be our young people, with their open minds and open hearts, who can reverse that. For young people who live in communities, especially rural communities, where everyone shares a similar background, books are the principal means of portraying the wider world. \nWhat are some of the first books you read that excited you about reading?\nI was a misfit throughout my school years, and I connected with the bullied and rejected characters of S.E. Hinton’s The Outsiders, who created their own community in the face of their exclusion. Robert Cormier’s The Chocolate War was another story that portrayed the individual standing up to a powerful and corrupt society. Otherwise, most of my reading was nonfiction about cataclysmic events from the past. Among my favorites were the minurte-by-minute historical narratives like Jim Bishop’s The Day Lincoln Was Shot and Walter Lord’s account of the sinking of the Titanic, A Night to Remember. I think I liked them so much because they read like fiction. \nLyn, do you still read entirely in print or will you read ebooks or audiobooks?\nI read mostly in print, which I prefer because I can then share books I like with others. However, I read ebooks when I’m in Portugal because books are heavy and I have to save my luggage weight for dictionaries I need for my translation work and books I find in Portugal that I’d like to translate into English. I used to listen to audiobooks on long drives when I had a car, but now that I live in New York City, I don’t drive anymore and I don’t listen to audiobooks either. \nWhat did you do to excite your own children about reading?\nMy husband and I read to our children every night, even when they were in middle school. They went through a rebellious phase when they refused to read, but both of them are now enthusiastic readers. "}]