[{"rating": null, "external_links": [], "crawled": "2017-04-16T08:40:13.000+03:00", "author": "AP", "entities": {"persons": [{"name": "getzlaf", "sentiment": "negative"}, {"name": "ryan getzlaf", "sentiment": "negative"}, {"name": "john gibson", "sentiment": "none"}, {"name": "mikael backlund", "sentiment": "none"}, {"name": "sean monahan", "sentiment": "none"}, {"name": "jakob silfverberg", "sentiment": "none"}, {"name": "rickard rakell", "sentiment": "none"}, {"name": "carlson", "sentiment": "none"}, {"name": "bouma", "sentiment": "none"}, {"name": "lance bouma", "sentiment": "none"}, {"name": "brian elliott", "sentiment": "none"}], "locations": [{"name": "anaheim", "sentiment": "none"}, {"name": "anaheim", "sentiment": "none"}, {"name": "calgary", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "ducks", "sentiment": "negative"}, {"name": "nhl", "sentiment": "none"}, {"name": "anaheim", "sentiment": "none"}, {"name": "anaheim ducks", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "honda center", "sentiment": "none"}, {"name": "calgary flames", "sentiment": "none"}, {"name": "facebook getzlaf", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "text": "Let friends in your social network know what you are reading about Facebook Email Ducks down Flames at home for 29th straight time Anaheim has a 2-0 series lead as it continued its Honda Center dominance against Calgary with a late 3-2 victory. Post to Facebook Ducks down Flames at home for 29th straight time Anaheim has a 2-0 series lead as it continued its Honda Center dominance against Calgary with a late 3-2 victory. Check out this story on USATODAY.com: http://usat.ly/2ofpjyW Cancel Send A link has been sent to your friend's email address. Posted!   Join the Nation's Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Ducks down Flames at home for 29th straight time AP Published 1:34 a.m. ET April 16, 2017 | Updated 1:48 a.m. ET April 16, 2017 Anaheim Ducks center Ryan Getzlaf (15) is congratulated by left wing Jakob Silfverberg (33) after scoring a goal against the Calgary Flames during the third period of Game 2. (Photo: Gary A. Vasquez, USA TODAY Sports) 447 CONNECT COMMENT EMAIL MORE \nANAHEIM, Calif. (AP) — Ryan Getzlaf scored the tiebreaking power-play goal with 4:46 to play on a bizarre deflection off Lance Bouma’s skate, and the Anaheim Ducks beat the Calgary Flames 3-2 Saturday night to take a 2-0 lead in their first-round playoff series. \nGetzlaf’s attempted pass across the high slot banked off Bouma’s foot and somehow arched through the air and past Calgary’s Brian Elliott for the Anaheim captain’s second goal of the series. \nJakob Silfverberg and Rickard Rakell scored first-period goals and John Gibson made 35 saves in the Ducks’ 29th consecutive victory over the Flames at Honda Center since April 25, 2006, extending the longest such streak in NHL history. \nMikael Backlund scored a short-handed goal and Sean Monahan had a power-play goal for the Flames. \nGame 3 is Monday in Calgary. \nElliott stopped 26 shots for Calgary, which rallied from an early two-goal deficit and repeatedly threatened to take the lead before that heartbreaking bounce on Getzlaf’s winner. \nThey still haven’t won a regular-season game in Orange County since 2004, but the young Flames are headed back to Alberta with concrete knowledge they can play anywhere with the five-time Pacific Division champion Ducks. \nStill, the Anaheim crowd serenaded the Flames with its now-familiar chant: “You can’t win here!” \nPlaying without injured top defensemen Cam Fowler and Sami Vatanen, the Ducks survived a shaky second period with a strong third and more of their usual veteran poise. Anaheim hasn’t lost in regulation in 16 consecutive games since March 10. \nSilfverberg and Rakell scored for the second straight game, following up their goals in Anaheim’s 3-2 win in Game 1 with goals in the opening seven minutes of the rematch. \nThe Ducks started quickly again, with Silfverberg beating Elliott just 3:21 into Game 2 with his silky wrist shot. Silfverberg went goalless in Anaheim’s seven-game loss to Nashville in the first round last season. \nRakell then doubled the lead when Getzlaf’s pass took a funny bounce and allowed Rakell to wrap a shot underneath Elliott. \nAnaheim had a chance to seize control late in the first when Flames rookie Matthew Tkachuk took a double minor for high-sticking, but Backlund capitalized on a turnover and scored on a short-handed breakaway. \nThe Flames evened it in the second when Monahan cashed in a pass from Johnny Gaudreau for his second goal of the series. \nCalgary nearly went ahead moments later when the puck slipped underneath Gibson during a physical scrum in the crease, but video review confirmed the on-ice call of no goal, infuriating Flames coach Glen Gulutzan. \nNOTES: Vatanen was a late scratch with an upper-body injury after participating in the pregame skate. Korbinian Holzer made his NHL playoff debut at late notice. The German veteran hadn’t played a postseason game since 2014 with the AHL’s Toronto Marlies, and he hadn’t played for Anaheim since April 4 after flying home late in the regular season for a personal matter. … Chad Johnson was Elliott’s backup. He hadn’t suited up since leaving the Flames’ game at Anaheim on April 4 after just a few minutes with a lower-body injury. … Ducks F Nick Ritchie made his Stanley Cup playoff debut. The bruising power forward was suspended for the opener after punching Chicago’s Michal Rozsival in Anaheim’s penultimate regular-season game. Facebook Posted!   April 16: Penguins center Jake Guentzel (59) and center Sidney Crosby (87) celebrate Guentzel's game winner during overtime in Game 3 of their first-round series at Nationwide Arena in Columbus. Pittsburgh won 5-4 in overtime, overcoming a 3-1 first-period deficit, to take a 3-0 lead in the series. Russell LaBounty, USA TODAY Sports Fullscreen Game 3: The Blues celebrate a goal by Jaden Schwartz as Wild defenseman Jonas Brodin, right, looks on during the second period in Game 3 of their first-round playoff series at Scottrade Center in St. Louis. The Blues won 3-1 to take a 3-0 lead in the series. Jeff Curry, USA TODAY Sports Fullscreen Game 3: Oilers goalie Cam Talbot catches a puck in the air against the Sharks during the third period of Game 3 of their first-round playoff series at SAP Center at San Jose. Edmonton won 1-0 to take a 2-1 lead in the series. John Hefti, USA TODAY Sports Fullscreen Game 3: Canadiens right wing Alexander Radulov celebrates his goal against the Rangers during the third period in Game 3 of their first-round playoff series at Madison Square Garden in New York. The Canadiens won 3-1 to take a 2-1 lead in the series. Adam Hunger, USA TODAY Sports Fullscreen Game 2: Anaheim Ducks center Andrew Cogliano (7) moves in for a shot on goal against Calgary Flames center Sean Monahan (23) and goalie Brian Elliott (1) during the second period of the Ducks' 3-2 win. Anaheim won its 29th straight home game against Calgary and holds a 2-0 lead in the series. Gary A. Vasquez, USA TODAY Sports Fullscreen Game 2: Toronto Maple Leafs forward Kasperi Kapanen (28) celebrates after scoring the game-winning goal in double overtime against the Washington Capitals. The goal gave the Maple Leafs a 4-3 win, and tied the series up 1-1 as it heads to Toronto. Geoff Burke, USA TODAY Sports Fullscreen Games 2: Nashville Predators defenseman Roman Josi (59) shoots on Chicago Blackhawks goalie Corey Crawford (50) during the second period of Nashville's 5-0 win. Chicago has yet to score in the series as it heads to Nashville with the Predators up 2-0. Dennis Wierzbicki, USA TODAY Sports Game 2: Ottawa Senators forward Clarke MacArthur (16) celebrates his goal, his first since 2015, against the Boston Bruins in the second period. Ottawa would rally from a 3-1 deficit to win 4-3 in overtime, leveling the series at 1-1. Marc DesRosiers, USA TODAY Sports Game 2: Edmonton Oilers forward Connor McDavid (97) celebrates a short-handed goal in the third period, his first playoff goal, against the San Jose Sharks. Edmonton won 2-0, its first playoff win since 2006, to even its series 1-1. Perry Nelson, USA TODAY Sports Game 2: Pittsburgh Penguins center Sidney Crosby (87) scores a goal against Columbus Blue Jackets goalie Sergei Bobrovsky (72) during the first period. Crosby had three points in Pittsburgh's 4-1 win, which gave the Penguins a 2-0 series lead. Charles LeClaire, USA TODAY Sports Game 2: Montreal Canadiens forward Alexander Radulov (47) reacts with teammates, including goalie Carey Price, after scoring the winning goal during the overtime period. Montreal rallied late to force OT, where it won 4-3 to tie the series up 1-1. Eric Bolte, USA TODAY Sports Game 2: St Louis Blues goalie Jake Allen (34) jumps over Minnesota Wild forward Charlie Coyle (3) in the third period. Allen was strong again as the Blues picked up another 2-1 win to take a 2-0 series lead. Brad Rempel, USA TODAY Sports Game 1: Capitals wing Justin Williams (14) scuffles with Maple Leafs defenseman Connor Carrick (8) during the first period in Washington. Williams scored two goals to help the Capitals rally for a 3-2 overtime win. Geoff Burke, USA TODAY Sports Game 1: Officials try to separate Flames wing Troy Brouwer (36) from Ducks center Nate Thompson (44) during a third-period scrum in Anaheim. Thompson and the Ducks held on to win 3-2. Gary A. Vasquez, USA TODAY Sports Game 1: Predators goalie Pekka Rinne stops a shot during the third period against the Blackhawks in Chicago. Rinne made 29 saves for a 1-0 shutout victory. Kamil Krzaczynski, USA TODAY Sports Game 1: Minnesota Wild defenseman Jared Spurgeon and goalie Devan Dubnyk look on after St. Louis Blues defenseman Joel Edmundson scored the game-winning goal in overtime. St. Louis goalie Jake Allen made 51 saves in the Blues' 2-1 win. Brace Hemmelgarn, USA TODAY Sports Game 1: The San Jose Sharks celebrate an overtime goal by forward Melker Karlsson (68) against the Edmonton Oilers. The Sharks won 3-2. Perry Nelson, USA TODAY Sports Game 1: Pittsburgh Penguins forward Nick Bonino (13) reacts after scoring a goal past Columbus Blue Jackets goalie Sergei Bobrovsky (72) during the second period of the Penguins' 3-1 win. Charles LeClaire, USA TODAY Sports Game 1: Boston Bruins forward David Pastranak (88) collides with Ottawa Senators goalie Craig Anderson (41) during the Bruins' 2-1 victory. Marc DesRosiers, USA TODAY Sports Game 1: New York Rangers defenseman Marc Staal (18) reacts after teammate Michael Grabner (not pictured) scores an empty-net goal during the third period. The Rangers won 2-0. Eric Bolte, USA TODAY Sports Like this topic? You may also like these photo galleries: Replay", "url": "http://omgili.com/ri/.wHSUbtEfZRj2zBbblOpDMyw6x8xfg10zzPvdu6r7sPhMDEg7G7hKfFsbuUts_Fa.Cl7rHrqCBAQajav5qyx4adAHWAYLqmL4EDpk.jql.OlAdmOK3IXfDWDJ_v7dERKNGGGyHmkyQAAwWIsPck37X6Lwfz0Xj57", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T08:40:13.000+03:00", "language": "english", "title": "Getzlaf's good bounce sends Ducks past Flames again, 3-2", "thread": {"title_full": "Getzlaf's good bounce sends Ducks past Flames again, 3-2", "site_full": "www.usatoday.com", "site": "usatoday.com", "site_section": "http://rssfeeds.usatoday.com/_/20/109991218/all-nationnow", "performance_score": 4, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 451, "shares": 451, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "news", "spam_score": 0.0, "domain_rank": 313, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "GANNETT Syndication Service", "url": "http://omgili.com/ri/.wHSUbtEfZRj2zBbblOpDMyw6x8xfg10zzPvdu6r7sPhMDEg7G7hKfFsbuUts_Fa.Cl7rHrqCBAQajav5qyx4adAHWAYLqmL4EDpk.jql.OlAdmOK3IXfDWDJ_v7dERKNGGGyHmkyQAAwWIsPck37X6Lwfz0Xj57", "published": "2017-04-16T08:40:13.000+03:00", "title": "Getzlaf's good bounce sends Ducks past Flames again, 3-2", "uuid": "296f841c96b6026436588e6833f51aee126be859", "main_image": "https://www.gannett-cdn.com/-mm-/0ec5addd48b8b0e9e319d1d213481cff29711230/c=0-160-4412-2642&amp;r=x1683&amp;c=3200x1680/local/-/media/2017/04/16/USATODAY/usatsports/f80de5786e6d414f9cb2a597cb49f285.jpg"}, "uuid": "296f841c96b6026436588e6833f51aee126be859", "ord_in_thread": 0}]