[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:19:31.000+03:00", "author": "Fandom Pilipinas (noreply@blogger.com)", "entities": {"persons": [{"name": "aquil", "sentiment": "none"}, {"name": "amihan", "sentiment": "none"}, {"name": "asval", "sentiment": "none"}, {"name": "danaya", "sentiment": "none"}, {"name": "ybrahim", "sentiment": "none"}, {"name": "nakba", "sentiment": "none"}, {"name": "hitano", "sentiment": "none"}, {"name": "banak", "sentiment": "none"}, {"name": "etheria", "sentiment": "none"}, {"name": "imaw", "sentiment": "none"}, {"name": "memfes", "sentiment": "none"}, {"name": "hagorn", "sentiment": "none"}, {"name": "emre", "sentiment": "none"}, {"name": "hathor", "sentiment": "none"}, {"name": "avria", "sentiment": "none"}, {"name": "amarro", "sentiment": "none"}, {"name": "bathalumang haliya", "sentiment": "none"}, {"name": "lilasari", "sentiment": "none"}, {"name": "deshna", "sentiment": "none"}, {"name": "adjantao", "sentiment": "none"}, {"name": "alena", "sentiment": "none"}, {"name": "paopao", "sentiment": "none"}, {"name": "muyak", "sentiment": "none"}, {"name": "manik", "sentiment": "none"}, {"name": "haliya", "sentiment": "none"}, {"name": "luna", "sentiment": "none"}, {"name": "gunikars", "sentiment": "none"}, {"name": "muros", "sentiment": "none"}, {"name": "fandom pilipinas", "sentiment": "none"}, {"name": "ariana", "sentiment": "none"}, {"name": "pirena", "sentiment": "none"}], "locations": [{"name": "encantadia", "sentiment": "none"}, {"name": "asval", "sentiment": "none"}, {"name": "adjantao", "sentiment": "none"}, {"name": "danaya", "sentiment": "none"}, {"name": "adamya", "sentiment": "none"}, {"name": "capade", "sentiment": "none"}, {"name": "andora", "sentiment": "none"}, {"name": "etheria", "sentiment": "none"}, {"name": "hathoria", "sentiment": "none"}, {"name": "haliya", "sentiment": "none"}, {"name": "memfes", "sentiment": "none"}, {"name": "hagorn", "sentiment": "none"}, {"name": "hathor", "sentiment": "none"}, {"name": "avria", "sentiment": "none"}, {"name": "lireo", "sentiment": "none"}, {"name": "pirena", "sentiment": "none"}], "organizations": [{"name": "nfcc", "sentiment": "none"}, {"name": "lilasari", "sentiment": "none"}, {"name": "cassiopeia", "sentiment": "none"}, {"name": "spring of truth", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "avria", "sentiment": "none"}]}, "text": "Source by:  (WP:NFCC#4) , Fair use,  Link , GMA Network Another week, another recap! Lets go and check this week's recap and review of  Encantadia. \n\nQuests \nIn Etheria, as Ybrahim taunts Asval being  a coward, Danaya wanted peace. Avria said that it wouldn't happen because of  the lack of trust from both sides. In Lireo, Paopao told the others that Cassiopeia is with Emre helping him with his quest and the leaders except Pirena are now in Etheria, Muyak said that the gems will be demanded as a part of it. Aquil said that maybe they are already know what they are doing. Back in Etheria, Danaya told Avria that the gems are not going to be used against each other and Avria told her that if they have give it to her. Danaya presents her the earth gem as a sign of peace. In the gates of Hathoria, Amarro told Pirena the abilities of Avria that he knew, but Pirena said that she knew those as well. Then, Amarro told Pirena about the Golden Hourglass which can made a person holding it travels back, as Avria used it to gather all of her soldiers. Pirena asked where it is as it is revealed that she was going to use it to get back in time, in Capade. Back in Etheria, Ybrahim questioned the move of Danaya but she told him to let her give it. Then, Avria takes the earth gem. After that, she also asked for the other gems, a hesitant Alena offered hers, if they promised that she will gave them peace. Avria said that she think of it and all the battles are stopped. Back in the gates of Etheria, Amarro told Pirena that Avria had the golden hourglass and they don't know where it is. Then, LilaSari asked Pirena where her daughter is, and she told that she is in Adjantao where Hagorn keeps her there. LilaSari thanked her and they went on to Adjantao. Pirena muttered an apology for not telling LilaSari the truth after they left. Back in Etheria, Hagorn told Asval that the Diwatas are planning something, as they are not giving up a gem easily and they are not fools. Back in Lireo, as the others are now in the council room, Danaya told them that there will be peace in Encantadia as she gives up the earth gem. Ybrahim questioned this and the others are upset. Then, she asked everyone to leave, where leaders remain. Danaya told Alena to use the power of the water gem so no one can hear what they are about to discuss. Then, it is revealed that Danaya gave Avria a fake earth gem, as Danaya ordered the gem to generate a fake copy of it. Ybrahim apologized and Imaw said that Avria may learn of this sooner. Danaya told them that by the time that she realized it, Devas are now reconquered by Emre and Cassiopeia. Back in Etheria, Pirena appeared and asked the Hathor soldiers to tell Hagorn that she was there. Then, the Hathor soldiers took her to a place where she is safe. Then, as Asval agreed what Hagorn said, the Hathor soldier went to whisper Hagorn something, Hagorn said that he will be going somewhere and Asval asked him where, Hagorn said to him that he is in no position to know all his whereabouts. Back in Lireo, Ybrahim crumpled the Etherian symbol in his hands. Ariana arrives and engaged in a conversation. Then, Alena heard it and after Ybrahim leave, Alena asked Ariana if she has feelings for Ybrahim. Then, as Ariana seemed to worry, Alena said not to, but she encourage her to make Ybrahim fell in love with her. In the outskirts of Etheria, Hagorn arrive and met Pirena. She asked told him that she mislead Amarro and LilaSari in finding Deshna. Then, she asked him to for help to enter Etheria. Hagorn doesn't want to help her, but Pirena said that she will help LilaSari to get Deshna from him. Back in Etheria, Asval told Avria about his doubts on the earth gem. Avria asked an Etherian soldier to approach her and used the earth gem against him to proved that it was real. Back in Lireo, Danaya thanked the real earth gem to bestow a little power on the fake one. Danaya wished and prayed that Cassiopeia and Emre may finish their quest quickly so that they can go on to the next step against Etherians. Back in Etheria, Hagorn leads a Hathor soldier that turns out to be Pirena. She thanked him and Hagorn leaves, then Pirena transformed in to an Etherian soldier.  \nIn the outskirts, Emre told Cassiopeia about Haliya, the goddess of the moon. Emre also said that Haliya tends to bathe on the Spring of Truth. In Lireo, as Aquil approached Danaya, she remind him not to approach her. Then, Alena saw it and then asked Danaya to give the throne to her. Danaya thanked her for that and said that she wanted to defeat Etheria under her rule first. In Etheria, the soldiers bowed to Avria, on of that is Pirena, as an Etherian soldier. Then, Avria is watching the gems in her hand and told herself that there is two left. She also said that she will go back in time to change the past, where Etheria has been defeated by the three kingdoms, as she was planning to reverse it. Back in the outskirts, Emre and Cassiopeia kept appearing in the same place. Then, Ether appears together with Etherian soldiers. They engaged in a fight and they defeated the soldiers. Then, Emre was angry at Ether where the bathaluman said that he will not reconquer Devas and Ether attacked them. Back in Etheria, Pirena saw Avria passing by and then found the location of the golden hourglass, which is in her room. She attempt to take it but a powerful enchantment had been placed in it in which she easily removed and it alerts Avria. Then, the enchantment activated again, and Pirena was unable to touch the golden hourglass again. Avria rushed and ordered to capture the person who attempt to get the golden hourglass and Avria leaves. In the outskirts of Etheria, Pirena escaped and tells herself that she will try to get the golden hourglass again. Back in Etheria, Asval and Andora is still searching for the person who attempt to get the golden hourglass. Hagorn on the other hand, examines where the golden hourglass was placed. Back in the outskirts, in order to prevent Ether to know their actions, Emre and Cassiopeia speaked to each other using their minds. Meanwhile, Ether is observing them not too far away and tells that the two are staring and thought that they are falling for each other. Then she realized that they are speaking with each other using their minds, much to her dismay. Back in Lireo, as Alena waits for Pirena, Muros said that she will not be coming back at the moment as she is in rift with Danaya. Alena was sad about the misunderstanding and told them to rest. Then, the Gunikars arrived and Memfes said that she must return to Adamya and Memfes leaves after kissing her hand. Back in the outskirts, Ether faced Emre and bounds him into the tree. In the Spring of Truth, Cassiopeia arrives and waits for Haliya. In Adamya, Alena arrived and Banak and Nakba told her that Memfes captured some of the Adamyans. In the gates of Hathoria, Luna told Hagorn that Pirena was there. Hagorn slaps her and told her that Avria knows that it is her who tried to get the golden hourglass. Pirena apologized telling him that it had an alarm. Luna asked him what is it and Hagorn told her that it is used to time travel. Pirena also said that she will intend to use it in order to go back to time that the new gem keepers are in Capade. As Hagorn told her not to enter Etheria for the time being, Pirena said that she will try and try to get the golden hourglass. Luna told Pirena that she will help, which made Hagorn angry. And Pirena asked her younger sister if she was ready. \n\nIn Adamya, Alena called Memfes to show. Memfes appears and Alena asked him why he hold the Adamyans. Memfes said that he will let go of the Adamyans he captured until she agreed to marry him. Then, Alena refused. Memfes said that she will learn how to love him and Alena used her powers and hit Memfes. When she realized it, she apologized to him and Memfes said that she will love him soon. Alena used again her powers and Memfes leaves. In Etheria, Avria carried the golden hourglass and Asval asked her where she had been. Avria replied that she went done something and they will learn it when they are ready to introduced themselves to them. On the other hand, Hagorn is nearby and saw what happened. In the outskirts of Etheria, Pirena and Luna arrived. Luna asked her why they didn't enter the palace already. Pirena said that Avria will know. Luna warned her to about using her again as a bait. Then, Hitano arrived and offered help. Pirena and Luna instructed him to mislead the soldiers by running. Hitano agrees, and then Etherian soldiers followed him. In the Spring of Truth, a woman sings, and it is revealed that the said woman is Bathalumang Haliya. Cassiopeia said that she is probably the bathaluman because she sensed different in her. When Cassiopeia was about to approached her, the bathaluman stops her and leaves. Cassiopeia asked her to remain as they needed her help to regain Devas. Then, a voice told Cassiopeia that Haliya is shy and thats why she resides in the moon. Cassiopeia ordered him to show. Back in Etheria, Pirena and Luna entered the palace, but hides when Asval and Andora arrives. Then, Asval and Andora tell Avria that they captured an intruder, which is Hitano. Then, they interrogate him. Hitano said that he was lurking nearby, but Asval accused him. Andora asked Avria if she wants Hitano to be punished, but Hitano reminded her of his status as an Ivtre. Then, Avria doesn't want to have the Diwatas a reason not to give the water gem to her. So she ordered to release Hitano and then, Hitano leaves. Back in the Spring of Truth, Cassiopeia ordered him to show up and told him that she needed to know everything about Haliya. Then he showed up and it is revealed that he's a creature from the said spring. Back in Etheria, the alarm activates again which cause dismay to Avria. Pirena and Luna appeared at Avria's room, only to find out that the golden hourglass was not there then Avria summoned his soldiers to go to her room to find out who again tried to steal the golden hourglass and then she leaves. In Lireo, Hitano told Danaya about the doings of Pirena and Luna. Then, Danaya told Muros to call Imaw. Back in Etheria, Avria as well as Asval and Andora found out that the golden hourglass was stolen from them and they believe that the Diwatas are behind this. In the gates of Hathoria, Pirena and Luna arrives. Pirena was angry that the golden hourglass was not in its place and Luna told her that it may be hidden somewhere because she tried to get it before. Pirena intends to get the golden hourglass in any way possible and then leaves. Back in Lireo, as Ariana was doing her training, Ybrahim thinks of Amihan. Then, Manik arrives telling him that his she is beautiful and when he asked him, Manik said that he and Ariana are bethrothed on their custom and then Ybrahim leaves. On the other hand, Imaw shows using his balintataw that Pirena tried to get the golden hourglass and she knows the reason behind this and she also said that it would disturbed the temporary peace between Etheria and the kingdoms. Back in Etheria, Avria ordered a soldier to send a letter to Lireo, then Pirena appeared and frankly said that she wants the golden hourglass. Avria said that it was being stolen from her and Pirena didn't believe it. Then, Danaya arrives and apologized to Avria what Pirena did. Avria said that they leave and both Sang'gres leave. Back in Lireo, Alena is still angry with Memfes and she bolted out her powers in the palace. Muros and Hitano rushed thinking that they had enemies and then Hitano told her to follow Danaya because of Pirena. Back in the outskirts of Etheria, Danaya confronted Pirena about the golden hourglass. Back in Etheria, Avria is watching them through her balintataw and realizes that the golden hourglass is not with the diwatas. Back in the gates of Hathoria, Hagorn held the golden hourglass.\n\nREVIEW \n\nA new character, and a new plot. This made this week's episode exciting. Also, it is revealed that Haliya is the shy one and the golden hourglass, which another thing, aside from the gems that they are going to seek. For now, let's wait for next week's episodes to come.\n\nRating: 8/10 \nIf you want to see all the recaps of your favorite TV shows, follow us Fandom Pilipinas on our  Facebook  and  Twitter  accounts. ", "url": "http://omgili.com/ri/jHIAmI4hxg9pTGWPYs.F.1VKI5erHwXZsJ9bZMneUgnRk8gQbu.OWghSBYqBTKzgKMRBBugmMmHvAnO2MJCvzrPuA8DSobUn02CA_vpXFobhefJdcD84QQ--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:19:31.000+03:00", "language": "english", "title": "Encantadia: April 10-12, 2017 (Recap and Review)", "thread": {"title_full": "Encantadia: April 10-12, 2017 (Recap and Review)", "site_full": "www.fandompilipinas.com", "site": "fandompilipinas.com", "site_section": "http://www.fandompilipinas.com/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Fandom Pilipinas - The Philippines' Next Fandom Destination", "url": "http://omgili.com/ri/jHIAmI4hxg9pTGWPYs.F.1VKI5erHwXZsJ9bZMneUgnRk8gQbu.OWghSBYqBTKzgKMRBBugmMmHvAnO2MJCvzrPuA8DSobUn02CA_vpXFobhefJdcD84QQ--", "published": "2017-04-16T11:19:31.000+03:00", "title": "Encantadia: April 10-12, 2017 (Recap and Review)", "uuid": "2dd44eacaff1adaed55a9f35325a2ed28688188f", "main_image": null}, "uuid": "2dd44eacaff1adaed55a9f35325a2ed28688188f", "ord_in_thread": 0}]