[{"entities": {"organizations": [{"name": "speedy reds", "sentiment": "none"}, {"name": "cardinals", "sentiment": "none"}, {"name": "reds", "sentiment": "none"}, {"name": "twins", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "major league baseball", "sentiment": "none"}, {"name": "brewers", "sentiment": "none"}], "locations": [{"name": "milwaukee", "sentiment": "none"}, {"name": "great american ball park", "sentiment": "none"}, {"name": "cincinnati", "sentiment": "none"}, {"name": "cincinnati", "sentiment": "none"}], "persons": [{"name": "braun", "sentiment": "negative"}, {"name": "peralta", "sentiment": "negative"}, {"name": "peralta braun", "sentiment": "negative"}, {"name": "travis sha", "sentiment": "negative"}, {"name": "shaw", "sentiment": "negative"}, {"name": "ryan braun", "sentiment": "negative"}, {"name": "franklin", "sentiment": "none"}, {"name": "billy hamilton", "sentiment": "none"}, {"name": "eric thames", "sentiment": "none"}, {"name": "travis shaw", "sentiment": "none"}, {"name": "adam duvall", "sentiment": "none"}, {"name": "nick franklin", "sentiment": "none"}, {"name": "eugenio suarez", "sentiment": "none"}, {"name": "romano", "sentiment": "none"}, {"name": "thames", "sentiment": "none"}, {"name": "wily peralta", "sentiment": "none"}, {"name": "sal romano", "sentiment": "none"}, {"name": "aaron boone", "sentiment": "none"}, {"name": "hamilton", "sentiment": "none"}, {"name": "tim adleman", "sentiment": "none"}, {"name": "andrew call", "sentiment": "none"}, {"name": "mark sheldon", "sentiment": "none"}]}, "uuid": "31153623a1e062a473ceebc8320dc0f282349683", "highlightText": "", "title": "Brewers hit 3 homers to back Peralta vs. Reds | MLB.com", "thread": {"site": "mlb.com", "country": "US", "participants_count": 0, "site_full": "m.mlb.com", "section_title": "", "uuid": "31153623a1e062a473ceebc8320dc0f282349683", "site_section": "", "domain_rank": 627, "main_image": "http://m.mlb.com/assets/images/7/8/4/224693784/cuts/shaw1280_xw9sfg0w_5cac4nhc.jpg", "performance_score": 0, "published": "2017-04-16T23:50:18.000+03:00", "url": "http://omgili.com/ri/2wGaacqxApu4zzP7PPoEbhznJzHBkWYGpkHGDPr5lkhvMnTYvdmwPKPojmcabNSir3tVpB5TPrOi_B17.Jnu.SmJWnNHODG3sWS2q4srGtkbsOBxe9f3gg--", "title_full": "Brewers hit 3 homers to back Peralta vs. Reds | MLB.com", "title": "Brewers hit 3 homers to back Peralta vs. Reds | MLB.com", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.672, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T23:50:18.000+03:00", "url": "http://omgili.com/ri/2wGaacqxApu4zzP7PPoEbhznJzHBkWYGpkHGDPr5lkhvMnTYvdmwPKPojmcabNSir3tVpB5TPrOi_B17.Jnu.SmJWnNHODG3sWS2q4srGtkbsOBxe9f3gg--", "ord_in_thread": 0, "crawled": "2017-04-16T23:50:18.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Mark Sheldon", "text": "Braun, Shaw, Thames homer to back Peralta Braun, Shaw go back to back 0:28 Ryan Braun and Travis Shaw hit back to back homers off Sal Romano in the 3rd inning, giving the Brewers a 3-0 lead By Mark Sheldon and Andrew Call / MLB.com | + 0 COMMENTS \nCINCINNATI -- The Brewers cooled off the Reds' hot start by taking three of four games in their series. Sunday's 4-2 victory over Cincinnati in the finale was powered by three home runs, including another long ball by Eric Thames . \n\"I can't remember a time in my career where a guy hit five home runs in a single series,\" Milwaukee outfielder Ryan Braun said. \"We're seeing a really, really impressive hitter starting to emerge.\" Thames' solo homer MIL@CIN: Thames mashes a solo home run to right field Eric Thames drives a solo home run to right field for his fifth long ball of the series, extending the Brewers' lead to 4-2 in the 7th Full Game Coverage \nMilwaukee spoiled the big league debut of Reds starter Sal Romano and took a 3-0 lead in the top of the third inning with back-to-back homers with one out. First, Braun hit a two-run shot to right field before Travis Shaw hit a booming shot near the top of the right field sun deck. \n• Braun continues Cincy dominance \nRomano was finished after three innings . He allowed three runs (two earned), three hits, four walks, and had two strikeouts and a hit batter. He threw 82 pitches in that short span, only 39 for strikes. Brewers starter Wily Peralta delivered a quality start with two earned runs and three hits allowed over six innings. Peralta walked three and struck out one. Peralta gets Cozart looking MIL@CIN: Peralta records first strikeout of the day Wily Peralta ends the 2nd inning by setting down Zack Cozart on strikes, picking up his first strikeout of the game \nCincinnati got back into the game after Adam Duvall 's two-out walk against Peralta in the fourth inning. Eugenio Suarez followed by hitting a first-pitch hanging slider for a two-run homer. Thames provided some space when he led off the seventh with a homer to right field against Tim Adleman . \nThe Brewers' bullpen provided three scoreless innings, including a perfect ninth from Neftali Feliz for his fourth save. After a 7-2 start, the Reds head into Monday's off day with an 8-5 record. The Brewers are back over .500 at 7-6. Feliz closes the door with a K MIL@CIN: Feliz gets Cozart looking to earn the save Neftali Feliz strikes out Zack Cozart to close out the Brewers' 4-2 win over the Reds, picking up his fourth save of the year \n\"We're 8-5 and we haven't pitched well,\" Reds manager Bryan Price said. \"From the starting perspective, we have guys here that I believe that can pitch well and can do a good job. We're not going to endure six innings a night out of the bullpen.\" \nMOMENTS THAT MATTERED Reds won't miss Thames: Thames left town after having slugged five homers in the four-game series against the Reds, something that's been done only one other time at Great American Ball Park. Aaron Boone did it for Cincinnati from May 5-8, 2003, vs. the Cardinals. According to Statcast™ , Thames' latest drive carried 423 feet with an exit velocity of 103 mph and a launch angle of 29 degrees. \"That guy ... I heard he had a cult following in Korea, I'd imagine very shortly he'll have a cult following in Milwaukee as well,\" Price said. \"That was very, very impressive.\" \nHamilton robbed Franklin: With two outs in the top of the sixth and a runner on first base, Nick Franklin hit a long drive to center field. Speedy Reds center fielder Billy Hamilton made a long run and stretched his glove for a great over-the-shoulder catch as he fell to the warning track -- saving extra bases and a run. According to Statcast™, it was a four-star catch as the catch probability on the play was 32 percent. Hamilton extends for great grab MIL@CIN: Hamilton takes away a hit at the track Billy Hamilton gets a great read on Nick Franklin's deep fly ball to center field in the 6th and makes a great catch at the warning track \n\"That's one of the ones where you come in you're like, 'I don't know what just happened.' It found a way into my glove,\" Hamilton said. \"You just have to smile about it and keep on going. That was a fun one.\" More > \nQUOTABLE \"He's been on fire, man.\"-- Peralta on Thames \nREPLAY REVIEW With Tucker Barnhart on first base in the bottom of the fifth inning, Adleman tried to sacrifice bunt. Catcher Manny Pina quickly gathered the ball and fired to Orlando Arcia covering second base. Barnhart came in without sliding and was called out before Adleman beat the throw to first base. The Reds challenged the call at second base, believing Arcia pulled his foot off of the bag. Upon review, the replay official determined that the call stands because it could not be definitively determined that the fielder's foot was off the base when the ball contacted the interior of his glove. \nWHAT'S NEXT Brewers: Milwaukee opens a three-game series against the Cubs on Monday night at 7:10 p.m. CT at Wrigley Field. Chase Anderson (1-0, 0.69) will start for Milwaukee against John Lackey (1-1, 3.00). The teams concluded a three-game series just eight days ago, Chicago winning twice. \nReds: Play resumes Tuesday at 7:10 p.m. ET against the Orioles with Bronson Arroyo making his third start. Arroyo's comeback campaign is off to a rocky start with a 9.90 ERA and 0-2 record but he threw 80 pitches over six innings in his last start, a 5-1 loss to the Brewers. \nWatch every out-of-market regular-season game live on MLB.TV . has covered the Reds for MLB.com since 2006, and previously covered the Twins from 2001-05. Follow him on Twitter @m_sheldon and Facebook and listen to his podcast . Andrew Call is a contributor to MLB.com. This  "}]