[{"entities": {"persons": [{"sentiment": "none", "name": "ritchen"}, {"sentiment": "none", "name": "ravet"}, {"sentiment": "none", "name": "sashi kadam"}], "organizations": [{"sentiment": "none", "name": "specifications wall - internal & external exquisitely"}, {"sentiment": "none", "name": "near sentosa resorts & water"}, {"sentiment": "none", "name": "ravet supreme luxury"}, {"sentiment": "none", "name": "cable tv"}, {"sentiment": "none", "name": "bhk"}, {"sentiment": "none", "name": "buchade kimaya associates rcc"}, {"sentiment": "none", "name": "frp"}, {"sentiment": "none", "name": "ac points"}, {"sentiment": "none", "name": "d.y. patil college of architecture"}, {"sentiment": "none", "name": "prime designers pvt. ltd"}, {"sentiment": "none", "name": "kms indira institute of management 4.5 rms j.s.p.m college of engineering xion mall - aditya birla hospital symbiosis institute of management bigbazaar slide"}, {"sentiment": "none", "name": "jaguar"}, {"sentiment": "none", "name": "rm aditya birla hospital"}], "locations": [{"sentiment": "none", "name": "ravet"}, {"sentiment": "none", "name": "bangalore bypass road"}, {"sentiment": "none", "name": "pune"}, {"sentiment": "none", "name": "mumbai"}]}, "text": "2 BHK Flat in Ravet | Specification Glamoria 0 Flag Flag as Inappropriate \nPlease select the category that most closely reflects your concern about the presentation, so that we can review it and determine whether it violates our Terms of Use or isn't appropriate for all viewers. Submit Embed this comment into your blog: Comment URL: LAMORIA A world of splendid living Slide 2 1 l Slide 3 LAMORI A A world of splendid living Glamoria a unique combination of luxury and comfort cocooned in stylish apartments at the urbanest suburb of the city. Ravet. Its indigenous design and modern architecture will give you a lifestyle that you have always desired. Crafted to perfection. this project lies in the heart of western Pune having proximity to integral parts of the city including essential and upmarRet lifestyle landmarRs. Encounter a glamorous vicinity with the benefits of serene environment and plethora of amenities. PROJECT HIGHLIGHTS ·10'2 BHK Themed Apartments Under Your Budget Conveniently placed in the prime location of Ravet Supreme Luxury with a magnificent Lifestyle ·Modern architecture and Plush interiors Comfortable features that upgrades your splendor quotient Slide 4 Specifications Wall - Internal & External Exquisitely finished Internal wall plastered and painted with oil bond distemper Imported quality semi acrylic paints on External walls State-of- the- Art Ceramic tiles from floor to ceiling or up to 7ft height POP in living room in all apartments DOOR Designer Main entrance door with Waterproof plywood frames and commercial flush doors Good quality waterproof plywood frames with commercial flush doors and bathroom marble frame with FRP doors in all bedrooms Imported Powder coated aluminium frame with fixed glass sliding doors and SS glass railings for all terrace doors KITCHEN Imported Polished granite Ritchen counter top Stainless steel sink Provision for Exhaust fan WINDOWS Magnificent and superior quality Powder coated aluminium framed sliding windows with mosquito net and M. S. Safety grills BATHROOMS Designer bathrooms in all apartments Exhaust fan provision for rejuvenating and refreshing scent in your boutique themed bathrooms ELECTRICAL Concealed wiring with anchor switches and fancy circuit breaRers The apartment comes with Cable TV. Telephone and AC Points for latest advancement appliances TERRACE Wooden finish flooring in master bedroom Magnificent and richly looRing Glass- wall for terrace Provision for washing machine electric point FLOOR Living room. dining room. bedroom and Ritchen with 24\" x 24\" vitrified tiles SAFETY State of the art fire fighting system in common areas FITTINGS C.P. fittings of Jaguar. Hindware or equivalent quality Myriad Amenities Designer POP False Ceiling in living area Inverter bacRup provision Video door phone Intercom facility Solar water heater system Designer entrance gate Fully accessible Wi-Fi provision Comfortable and secured Kids Play Area Magnificent Garden Lush green and refreshing ground with Chinese Grass Ample ParRing space • Path Way Slide 5 AppuGhar Location Proximity D-mart 3.5 KMs D.Y. Patil College of Architecture 4 Km Appu Ghar 5 Rm Aditya Birla Hospital 9 Kms Indira Institute of Management 4.5 Rms J.S.P.M College of Engineering Xion Mall - Aditya Birla Hospital Symbiosis Institute of Management BigBazaar Slide 6 Location Map Architect Arch ManiR Buchade Kimaya Associates RCC Consultant Mr. Sashi Kadam 30 Prime Designers Pvt. Ltd. Near Sentosa Resorts & Water park, Mumbai- Bangalore Bypass Road, Ravet, Pune 7620 472 472 I info@glamoria.in www.glamoria.in I Follow us on The content of this brochure are purely conceptual and have no legal bindings on us. Developers reserve the right to amend the layout plans, number of floors & units, elevation, color scheme, specifications and amenities etc. without notice \nby glamoria | Modified: 13 minutes ago \nLanguage: English | Topic: Real Estate Summary: Glamoria is a project in ravet where you will get all mordern specification Exquisitely finished internal wall, Designer main entrance, magnificent and superior quality window, imported polished granite kitchen, etc.", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "32169dfce11b83ec6bfafb09eba7b21043fb5730", "rating": null, "highlightTitle": "", "title": "2 BHK Flat in Ravet | Specification Glamoria", "thread": {"country": "US", "site": "slideboom.com", "replies_count": 0, "title_full": "2 BHK Flat in Ravet | Specification Glamoria", "site_categories": [], "performance_score": 0, "section_title": "Latest Presentations", "domain_rank": 14826, "uuid": "32169dfce11b83ec6bfafb09eba7b21043fb5730", "main_image": "", "site_type": "blogs", "title": "2 BHK Flat in Ravet | Specification Glamoria", "spam_score": 0.0, "site_section": "http://www.slideboom.com/rss/latest_presentations.xml", "url": "http://omgili.com/ri/jHIAmI4hxg9YzcRC9uJoIph4LNQkMW6e75FqEy9fKBeNnYQPSg2iqjFXnZAvI1dS", "participants_count": 1, "site_full": "www.slideboom.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:26:21.000+03:00"}, "crawled": "2017-04-18T11:26:21.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9YzcRC9uJoIph4LNQkMW6e75FqEy9fKBeNnYQPSg2iqjFXnZAvI1dS", "highlightText": "", "published": "2017-04-18T11:26:21.000+03:00", "author": "glamoria"}]