[{"entities": {"persons": [{"sentiment": "none", "name": "lugbara"}], "organizations": [{"sentiment": "none", "name": "child protection programme"}, {"sentiment": "none", "name": "emergency response"}, {"sentiment": "none", "name": "child protection"}, {"sentiment": "none", "name": "red cross"}, {"sentiment": "none", "name": "plan international uganda"}, {"sentiment": "none", "name": "un child protection"}], "locations": [{"sentiment": "none", "name": "us"}, {"sentiment": "none", "name": "americas"}, {"sentiment": "none", "name": "aringa"}, {"sentiment": "none", "name": "asia"}, {"sentiment": "none", "name": "africa"}, {"sentiment": "none", "name": "uganda"}, {"sentiment": "none", "name": "uncrc"}]}, "text": "Reports to: Emergency Response Manager About US: Plan International was founded over 75 years ago and it is one of the oldest and largest children’s development organizations (non-profit / INGOs) in the world. We work in 50 developing countries across Africa, Asia and the Americas to promote child rights and lift millions of children out of poverty. Plan's vision is of a world in which all children realize their full potential in societies that respect people's rights and dignity. Plan is independent, with no religious, political or governmental affiliations. Job Summary: The Child Protection in Emergency Specialist will be mainly responsible for assessment, response analysis, design and implementation of the child protection components of Plan International Uganda’s emergency response. The incumbent will need to coordinate with other Emergency Response team members and Plan International Uganda staff, especially in implementation management of health, education and other relevant technical sectors, to ensure a rapid, proportionate and effective response. The jobholder will also be responsible for responding to immediate child protection issues with simultaneous consideration of longer term needs and possible scenarios. Depending on the situation the specialist may need to take a very active role in technical co-ordination, support and advocacy with the country specific child protection clusters and other stakeholders and technical agencies relevant to the sector.   Assessment: Provides sectoral leadership and expertise in the assessment Conducts initial rapid assessment of current situation in collaboration with local specialists and affected population; determine priorities and immediate activities and resources Keenly reviews, assesses and updates the child protection situation in areas affected by emergency, including, but not limited to (depending on the context) the forms of violence, exploitation and abuse in relation to sexual violence, HIV/AIDS, children associated with fighting forces, separated children, child trafficking and other relevant circumstances affecting child vulnerability to violence, exploitation and abuse) Highlights protection issues requiring a response – both immediate (less than 2 months) and medium term and make recommendations on specific Plan International actions required. Ensure core commitments to children are taken into consideration. Represents Plan International Uganda to child and other protection clusters, stakeholders and Governmental and non – Governmental agencies for the purposes of the protection aspects of the assessment. Assesses in – country resources, human, material and financial for response with relevant staff and agencies and assist in capacity building of national staff. Identifies potential partnerships to implement recommendations, assess potential partners where available or make recommendations on how to fill gaps. Programme Design: Defines aims and objectives of the overall child protection programme. Work in liaison with national and International Child Protection actors, maps current institutional response capacities – including conducting a child protection specific 3Ws. Work in close collaboration with Child Protection actors, develops a realistic evidence-based, Child Protection programme plan, including both programmatic and advocacy activities (results oriented). Designs most appropriate child protection interventions based on the outcomes of assessments and the context. Responsible for ensuring that issues of gender, education, Disaster Risk Reduction and conflict sensitivity are factored into the programme design. Responsible for ensuring that Plan International guidelines and UN Child Protection cluster standards are considered and any departures documented. Works in close collaboration with other programmes specialists to ensure that emergency interventions build upon each other and link in to longer term programming. Develops a Child Protection Programme plan, concept papers and proposals in respect of the above. Response Management and Implementation: Works closely with the relevant implementation manager(s) to ensure that the implementation of relevant activities are planned and implemented in a phased and prioritised manner in full consultation and co-ordination with all relevant agencies i.e. governmental and non – governmental. Offers technical guidance to Plan International Uganda for effective planning, implementation and monitoring of agreed child protection plans, including the psychosocial recovery (care) and assistance (legal and social) to vulnerable children and their families. Makes frequent field visits to all affected response areas to monitor implementation of activities, identifies opportunities and constraints and proposes adjustments needed, including additional staffing or staff training or other. Designs and develops appropriate surveillance, monitoring and evaluation systems for child protection interventions. Provides support in the monitoring and reporting of child protection concerns and violations of child rights commitments embodied in the UNCRC, resolution 1612 and other legal instruments. Responsible for ensuring early and rigorous implementation of quality and accountability mechanisms. Response Reporting & Evaluation: Evaluates the implementation of Plan International Child Protection activities and draft recommendations for improved programme design. The jobholder will also draft child protection interventions reports to serve as standalone deliverables or to be included in larger emergency response for both donor and internal purposes. Information and Coordination: Provides regular updates to Emergency Response Manager and emergency team on progress, priorities and constraints – verbally and in writing on an agreed frequency. Engages and follows up with relevant implementation manager(s) Represents Plan International Uganda and non – governmental groups as needed and agreed with the team leader. Provides support in the implementation of and represent Plan International Uganda in child protection coordination mechanisms, including any relevant cluster. Updates and reports on sectoral activities/strategies to donors and other stakeholders. Human Resources and Administration: Coordinates and/or implements training and briefing of Plan International Uganda staff, partners and other key stakeholders on child protection and/or related issues.   ideal candidate for the Plan International Child Protection in Emergency Specialist career opportunity should hold a Bachelor’s degree in Law, International Law, Political Science or a related field with good knowledge of International Refugee, Human Rights and Humanitarian Law. At least five years (of which at least 3 in the field) of progressively responsible professional experience in child protection, humanitarian affairs, human rights and related fields. Previous experience with participatory approaches to protection, emergency preparedness, crisis/emergency relief management or other related areas. Prior experience in the country of potential assignment is an asset. All protection specialists will have a good knowledge and understanding of DO NO HARM principles and established international child protection standards (especially UNCRC). Work style: Is well planned and organised even within a fluid working environment and has a capacity for initiative and decision making with competent analytical and problem solving skills. Extensive knowledge of Plan International Uganda policies and procedures, sphere and the Red Cross/ NGO code of conduct. Requires general finance, administration, information management and telecommunication skills and proficiency in information technology/ computer skills. Integrity: Works with trustworthiness and integrity and has a clear commitment to Plan International Uganda’s core values and humanitarian principles. Resilience/Adaptability and flexibility: Ability to operate effectively under extreme circumstances including stress, high security risks and harsh living conditions. Works and lives with a flexible, adaptable and resilient manner. Awareness and sensitivity of self and others: Demonstrates awareness and sensitivity to gender and diversity. Have experience and the ability to live and work in diverse cultural contexts in a culturally appropriate manner. Has a capacity to make accurate self – assessment particularly in high stress and high security contexts. People skills: Ability to work independently and as a team player who demonstrates leadership and is able to support and train local and international staff and also able to work with disaster affected communities in a sensitive and participatory manner. Communication skills: Well developed written and oral communication skills. Able to communicate clearly and sensitively with internal and external stakeholders as a representative of Plan International Uganda. This includes effective negotiation and representation skills. Fluency in English. Multiple language skills desirable. Fluent with the local language specifically Lugbara, Aringa and Dinka Behavioural Competencies: Strive for lasting impact: Shows commitment and understanding to always act in the best interest of the child and respect to human rights. Promotes a culture of learning and sharing. Demonstrates a high degree of confidentiality. Open and Accountable: Holds self accountable for making decisions, managing resources efficiently, achieving and role modelling Plan International values, striving for lasting impact Honest, encourages openness and transparency; demonstrates highest levels of integrity, capacity to include and empower others. Works Well Together: Comfortable working with others, as part of a team or as a team leader. Builds and maintains effective relationships, with their team, colleagues, members and external partners and supporters; approachable, good listener, easy to talk to. Values diversity and sees it as a source of competitive strength. Develops and encourages new and innovative solutions. Thinks strategically, reflects about achievements and recognises people’s contribution. Inclusive and Empowering: Demonstrates commitment to working with vulnerable children and promoting equality for girls How to Apply: All suitably qualified candidates should send their letters of application, together with updated CVs, contact telephone numbers, copies of relevant certificates, names and contact details of three references plus salary history and send to: Ag. Country Human Resources Manager, Plan Uganda Email to: uganda.recruitment@plan-international.org Deadline: 21 st April 2017 NB: Please consider your application unsuccessful in case you do not hear from us by 31 st July 2017  ", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "333fc80320a5162d2d210b453a7497de9335df3a", "rating": null, "highlightTitle": "", "title": "Child Protection in Emergency Specialist Career Placement - Plan International", "thread": {"country": "US", "site": "theugandanjobline.com", "replies_count": 0, "title_full": "Child Protection in Emergency Specialist Career Placement - Plan International", "site_categories": [], "performance_score": 0, "section_title": "Ugandan Jobline Jobs - The Best Uganda Jobs", "domain_rank": null, "uuid": "333fc80320a5162d2d210b453a7497de9335df3a", "main_image": "", "site_type": "blogs", "title": "Child Protection in Emergency Specialist Career Placement - Plan International", "spam_score": 0.0, "site_section": "http://www.theugandanjobline.com/rss.xml", "url": "http://omgili.com/ri/jHIAmI4hxg.4KstJGths78ND3ZCzwB68c_F3PKW0jLNwYCkWJKpNktxACM3KcCQK8RTS6eB5ll7vZCZCHmq9AbeNWdw7zDGSrJLIyCKxNtxYln2Y.CSPN3eUxR3XCy8TvNS0PfHD6KOcl4AuZErTvPpLKseuaT8q15fSoTIEJdA-", "participants_count": 1, "site_full": "www.theugandanjobline.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:25:35.000+03:00"}, "crawled": "2017-04-18T11:25:35.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg.4KstJGths78ND3ZCzwB68c_F3PKW0jLNwYCkWJKpNktxACM3KcCQK8RTS6eB5ll7vZCZCHmq9AbeNWdw7zDGSrJLIyCKxNtxYln2Y.CSPN3eUxR3XCy8TvNS0PfHD6KOcl4AuZErTvPpLKseuaT8q15fSoTIEJdA-", "highlightText": "", "published": "2017-04-18T11:25:35.000+03:00", "author": "noreply@blogger.com (Ugandan Jobline)"}]