[{"entities": {"organizations": [{"name": "nasdaq", "sentiment": "none"}, {"name": "rf culbertson and associates", "sentiment": "none"}, {"name": "gm", "sentiment": "none"}, {"name": "paas", "sentiment": "none"}, {"name": "npr", "sentiment": "none"}, {"name": "rothschild bank", "sentiment": "none"}, {"name": "general motors", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "wto", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "real estate", "sentiment": "none"}, {"name": "ira", "sentiment": "none"}, {"name": "autonation", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "united nations monetary and financial conference", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "rothschild", "sentiment": "none"}], "locations": [{"name": "barrons", "sentiment": "none"}, {"name": "n. korea", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "bretton woods", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "mount washington hotel", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "new hampshire", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "mt. everest", "sentiment": "none"}], "persons": [{"name": "bob", "sentiment": "none"}, {"name": "nixon", "sentiment": "none"}, {"name": "n. korea", "sentiment": "none"}, {"name": "r.f. culbertson", "sentiment": "none"}, {"name": "lefsetz", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "culbertson", "sentiment": "none"}, {"name": "mike jackson", "sentiment": "none"}, {"name": "forrester", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "suzy welch", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "uncle sam", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "-        paas", "sentiment": "none"}, {"name": "mike", "sentiment": "none"}, {"name": "russell", "sentiment": "none"}, {"name": "yuans", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}, {"name": "welch", "sentiment": "none"}, {"name": "david brancaccio", "sentiment": "none"}]}, "uuid": "348d4757f95a2a9c4a185a2a6c92d8156b4b9e9f", "highlightText": "", "title": "This Week in Barrons - 4-16-2017", "thread": {"site": "blogspot.com", "country": "US", "participants_count": 1, "site_full": "rfcfinancialnews.blogspot.com", "section_title": "RF's Financial News", "uuid": "348d4757f95a2a9c4a185a2a6c92d8156b4b9e9f", "site_section": "http://rfcfinancialnews.blogspot.com/", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T20:33:00.000+03:00", "url": "http://omgili.com/ri/WOapK6QZrml7RTrRjrWsBX7wuNx2COoOy4dtdyrkFSXZzzzVsShmhW_kawy2VHNy82im1J_0Eu9E1.dhGkEGzdKdZpFOAvM6tU4rXoEHwDz3NRQQ1Zh_fA--", "title_full": "This Week in Barrons - 4-16-2017", "title": "This Week in Barrons - 4-16-2017", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T20:33:00.000+03:00", "url": "http://omgili.com/ri/WOapK6QZrml7RTrRjrWsBX7wuNx2COoOy4dtdyrkFSXZzzzVsShmhW_kawy2VHNy82im1J_0Eu9E1.dhGkEGzdKdZpFOAvM6tU4rXoEHwDz3NRQQ1Zh_fA--", "ord_in_thread": 0, "crawled": "2017-04-16T22:33:39.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "R.F. Culbertson (noreply@blogger.com)", "text": "This Week in Barrons – 4-16-2017 : \n\n\n“Now I know what target practice felt like before 9/11.” … Bob Lefsetz \nWhy does everybody hate us?    We brought this dislike onto ourselves.    In the 1950’s, we hosted the United Nations Monetary and Financial Conference – called the Bretton Woods Conference.   It was a gathering of 730 delegates (from all 44 allied nations) at the Mount Washington Hotel, situated in Bretton Woods, New Hampshire.   Its focus was to regulate the international monetary and financial order after the conclusion of World War II.   It was at that conference that the world decided to use the U.S. dollar as its global reserve currency.    In the 1960’s, the global leaders saw the U.S. trying to support both domestic social programs, and fight communism abroad.   They realized that we couldn't afford to do both.   They saw the value of all of those ‘dollars’ that they had amassed starting to decline, and began exchanging them for physical gold.  By the end of the 60’s, the gold for dollars’ exchange had turned into a waterfall.   President Nixon watched as the U.S. gold supply declined rapidly, and in 1971 decided to close the gold window – ‘defaulting on the world’.   When Nixon shut the gold window down, he screwed every nation on the planet.   After all, we had implicitly guaranteed Governments the right to exchange paper dollars for gold – and we went back on our word.  The minute we did that, every nation asked the same question: \"What’s backing the U.S. dollar?\"  And our answer was: “Nothing but hopes, dreams, and the ability to raise taxes on the middle class.”   In the 1970’s, we found that nations no longer wanted our dollars, especially knowing that we could print more of them on a whim – so they found other ways to exchange them for more tangible assets.   To fight this inflationary problem, the U.S. created the ‘petro-dollar’.   We had OPEC sign a treaty that guaranteed their defense as long as they would only sell oil in U.S. dollars.   Since every nation needed oil, and oil could only be purchased using dollars – that still forced nations to hold U.S. dollars.   To further confound nations, we controlled the only certified, electronic currency exchange system - ‘SWIFT’.   If a country would protest too much, the U.S. would simply turn the ‘SWIFT’ system off for that country.   The U.S. even made a pact with ‘Rothschild based’ central banks.   It seems (back then) if you had a ‘Rothschild based’ central bank, you were often forced to take loans you didn't need, at rates you couldn't afford, and in return – give your country’s resources in exchange.   If your country didn't have a Rothschild central bank – you were on the hit list.  For example: Libya (no Rothschild bank) wanted to exchange gold for their oil – their leader was overthrown and killed.   Iraq (no Rothschild Bank) stopped taking dollars for oil – their leader was overthrown.   Syria (no Rothschild Bank) is taking Euro's, Yuans and gold in exchange for their oil – I wonder what’s going to happen to them?    Fast forward to today, and we find the U.S. watching Russia and China set up foreign exchange banks utilizing Rubles and Yuans, re-establishing the old ‘silk road’ of trade, and excluding the U.S. dollar.   The U.S. knows that the days of being the global reserve currency are coming to an end.   When that goes away, a lot of our financial power goes with it, and will cause us to focus on our military superiority.   So, the game plan since the mid 1990's has been to topple foreign governments, and install U.S. friendly leaders who are good with bribe money in exchange for their country’s resources.    Over in N. Korea, there's little doubt that something is going to happen, and it’s my guess is that we will be going in and taking out the N. Korean leadership.  I think the reason that 150K Chinese are lined up on the N. Korean border is because when the U.S. does make its move, the Chinese will advance and install their own leader.  I don't think the U.S. wants to redevelop N. Korea, we just want Kim out of there, and we’ll let the Chinese mop up the mess.  \n\n\n\n\n\n“Robots Ate My Job” … David Brancaccio of NPR \n   So, if we’re ramping up for war, where are the jobs?   I mean, if we’re so ‘in control’ of the world, why are we losing so many high-paying jobs?   After all, our labor force participation rate is at its lowest point in over 30 years with almost 100m people being kicked out of the workforce.   Just this week a WTO spokesperson shed some light on that when he said: “8 out of every 10 of the jobs lost in the past 5 years – were eliminated by robots and technology.”   From stand-up comedians in Pennsylvania to blue-collar workers in Indiana, from grocery store clerks in California to an Internet retailer in Arkansas – robots are eating our jobs.    Robotic technology is advancing at an exponential rate.   To visualize what exponential means: if I put a single grain of rice on the first square of a chessboard and double it on every square thereafter.   By the end of the board, I would have a mountain of rice higher than Mt. Everest.   An untold bounty is waiting for people with the advanced robotic skills to take advantage of these developments – but what about the rest of us?   Labor market experts have argued for years that while technology destroys jobs – it ultimately replaces them with more and better jobs.   But this time, many economists are worried about ‘technological unemployment.’   Technologies such as Ai, BI, and robotics will eliminate between 10 and 25M jobs by 2025.   We could be witness to the second ‘industrial revolution’ impacting: employment distribution, shopping patterns, social interactions, manufacturing priorities, and city planning.   Forrester predicts at least 10 million jobs will be lost as a direct result of the robotic revolution, and only 1 new job will be created for every 15 lost.      How did we go from boom to bust so quickly?   The truth is always in the numbers.   In the 1960’s, 70’s and 80’s, to completely pay for the average home, car, and a 4-year education – it took about 4 years’ worth of wages.   That is to say, if you put all of your wages toward only those 3 major items – it would take 4 years to pay them off.   In the 1990’s, that number jumped to a little under 5 years, and in the 2000’s it took 5.25 years for a complete payoff.   But in the post 2010 era, it now takes over 6.25 years’ worth of wages (and climbing) to pay off the average home, car, and 4-year education.   And ‘to add insult to injury’ within the past 10 years, a new player: ‘Healthcare’ is quickly eclipsing the price of an automobile in our lives.   So, in a nutshell we have gone from boom to bust due to over-spending and not managing our costs – specifically on education and healthcare.   Imagine if you were born in the 80’s and had children, you could very well be looking at your children’s college education as a nightmare instead of a blessing.    The bigger problem is: Uncle Sam is no better off.   He’s broke and asking the question – How do I avoid bankruptcy?   He has his eye on John Q. Public’s $3T hidden in IRA’s and personal retirement accounts.   With an economy drowning in debt as we are, a $3T jump start is a great alternative to war.    I wanted to end by wishing everyone a Happy Easter.   No matter how you celebrate the day, please enjoy it and share it with those people most important to you.   Easter serves to remind me that the precious time we have with our loved ones diminishes day by day – so allow today be one that you will remember. \n\nThe Market:    Mike Jackson (the CEO of AutoNation – the largest automobile retailer) took aim at Tesla this week saying that Tesla’s market cap surpassing that of General Motors’ is \"either one of the greatest Ponzi schemes of all time, or is going to magically work out.\"   Tesla produced only a fraction of the 10m cars GM made last year.   Tesla has only had two profitable quarters in its history as a public company, while GM earned more than $9B last year alone.   Mike went on to say: “What would impress me about Tesla would be selling vehicles at a profit.   Giving away vehicles at below what it costs you to make them is not very exciting.   And if they can’t make money selling $100,000 cars, I’m very skeptical that moving down to the $35,000 price range with the Model 3 will make them any more profitable.”   Mike went on to point out that consumers keep trending toward less fuel-efficient trucks and SUVs, and our proliferation of hydraulic fracking means that affordable gasoline is here to stay.   Therefore, \"If OPEC was ever again to try a boycott, we could simply tell them to ‘get fracked.’”    I was also taken by an interview that Mrs. Suzy Welch gave on CNBC where she said: \"If there's one thing I wish I had known about business in my 20s, it's that there is this huge, important, powerful, invisible economy out there – that I refer to as the Favor Economy.   It's about putting yourself out on a limb for somebody else with no expectation for immediate payback.   For instance, offering yourself as a reference, placing a call to help someone land a job, or working a weekend or holiday so others can be with their families.   Essentially, its currency is performing small acts of kindness and generosity as a way of life.   The problem is, during college, you hear a lot of messages telling you that success is a zero-sum game — that for you to win, others have to lose.   You hit the work world not sure how much you should be helping others.   Then after a few years of working, most people wake up and realize that likeability and teamwork matter, often more than talent.”   Mrs. Welch urges people to start their careers knowing that the Favor Economy is there, and understand that you're a player in it.  Either you participate, which is good, or you don't, which is definitely going to hold you back.  Her advice was: “The more we help, the more successful we will become.\"  \n\n\n   Very simply, the NASDAQ is down as of late because Apple can NOT buy back its own stock.  Looking at the market capitalization of the top S&P companies: (a) Apple $743B, (b) Google $574B, (c) Microsoft $506B, (d) Amazon $430B, and (e) Facebook $408B – over 20% of the entire stock market’s net worth lies in our top 10 names.  Apple alone is larger than the entire Utilities sector, the Real Estate sector, the Materials sector, and the Telecommunications sector.  Apple is 5 TIMES the size of the top 3 U.S. automakers combined.  Some people think that Target is a competitor of Amazon.  Target’s net worth is $29.6B, and Amazon increased that much in seven days.  Remember, when you invest in an S&P 500 index fund – over 20% of your money is going into the top 10 names.    In market-land, could this be the vaunted correction that has been hiding in the wings for so long?  Maybe, but we've seen this movie so many times before that it has become a game of ‘Chicken Little’.   The market starts to roll over, people start to panic, and then (out of the blue) it roars higher.  Technically the market is in trouble.   The S&P, the DOW, the Russell (IWM), the Financials (XLF), the Semi's (SMH), and others are all below their 50-day moving averages.  But for the bulls, there's one last glimmer of hope.   Using the DOW as an example: -        On March 27 th , the low of the day was 20,412 – then it reversed its slide and ended the day at 20,550.  On Thursday, the DOW closed at 20,453 – above the March 27 th intraday low. -        The S&P on March 27 th , hit an intraday low of 2,322 before reversing.   We closed Thursday at 2,328 – above that March 27 th intraday low.     On Monday, we could see those intraday lows hold support and get a bounce.  As I write this, April 15 th in N. Korea has passed.  Speculation was that N. Korea was going to test a nuclear weapon on the 15 th , which would have started an invasion.  Maybe Trump's ability to get the Chinese involved worked, and avoided war.  If the market decides that this is great news, those intraday lows may hold, and we will see a market bounce on Monday.  However, if this is correction time, the next stops down would probably be 2,300 and then at 2,280 on the S&P.  So, one good headline and we could be in bounce mode – and one bad one and the slide continues lower.  Have a blessed holiday! \n\nTips: \n\n   Donald Trump's presidency is the best thing to happen to the gold market in years.  Everything Trump has done over the past week has been positive for gold. The Syrian airbase strike, increasing tensions with North Korea, and his comments on the U.S. dollar – have all caused gold prices to swell nearly 3% in the past five days alone.  This is a trend we can expect to continue.  Increasing geopolitical tensions between the U.S. and the entire world will no doubt boil into a military conflict somewhere.  But geopolitical instability is just one of the catalysts preparing to launch gold prices into the stratosphere.  In a Wall Street Journal interview, President Trump signaled that he was also prepared to wage a currency war.  Trump is only 84 days into his presidency – a mere 6% of his 4-year term.  He has plenty of time to make more political enemies via Twitter.    In terms of silver, the 50-day moving average just recently crossed the 100-day moving average, and it seems as if the 200-day moving average has just started a new bullish trend.   If silver trades above the 200-day for a few sessions, that reinforces a bullish shift that I could certainly get behind.    I’m looking at a couple mining plays (PAAS, GDXJ) that have weak historical correlation with the S&P 500, and therefore present a potential long opportunity going forward.   I also like a couple slightly higher negative correlations to the S&P that include bonds (TLT), and the emerging markets ETF (EEM).    I’m watching: -        GS (Goldman Sachs) – they have earnings on Tuesday and should move higher.   Therefore, selling the April 21 st -220 / + 217.5 Put Credit Spread and buying the +222.50 / -230 Call Debit Spread should work nicely. -        PAAS (a silver miner) – could use a rest, but buying the July out-of-the-money +20 / -22 Call Debit Spread should work as long as SLV remains above its 200-day moving average. -        GDXJ (a Junior Miner ETF) – should stay contained over the next month – so selling a May Strangle -   -33 Put / -44 Call could work nicely. \nTo follow me on Twitter.com and on StockTwits.com to get my daily thoughts and trades – my handle is: taylorpamm.  \nPlease be safe out there! \nDisclaimer: Expressed thoughts proffered within the BARRONS REPORT, a Private and free weekly economic newsletter, are those of noted entrepreneur, professor and author, R.F. Culbertson, contributing sources and those he interviews.  You can learn more and get your free subscription by visiting: < http://rfcfinancialnews.blogspot.com>. \nPlease write to Mr. Culbertson at: < rfc@culbertsons.com > to inform him of any reproductions, including when and where copy will be reproduced. You may use in complete form or, if quoting in brief, reference < http://rfcfinancialnews.blogspot.com/ >. \nIf you'd like to view RF's actual stock trades - and see more of his thoughts - please feel free to sign up as a Twitter follower -  \"taylorpamm\" is the handle. \nIf you'd like to see RF in action - teaching people about investing - please feel free to view the TED talk that he gave on Fearless Investing: https://www.youtube.com/watch?v=K2Z9I_6ciH0 \nCreativity = https://youtu.be/n2QiPSe_dKk Investing =  https://youtu.be/zIIlk6DlSOM Marketing =  https://youtu.be/p0wWGdOfYXI Sales =  https://youtu.be/blKw0zb6SZk Startup Incinerator = https://youtu.be/ieR6vzCFldI \nTo unsubscribe please refer to the bottom of the email. \nViews expressed are provided for information purposes only and should not be construed in any way as an offer, an endorsement, or inducement to invest and is not in any way a testimony of, or associated with Mr. Culbertson's other firms or associations.  Mr. Culbertson and related parties are not registered and licensed brokers.  This message may contain information that is confidential or privileged and is intended only for the individual or entity named above and does not constitute an offer for or advice about any alternative investment product. Such advice can only be made when accompanied by a prospectus or similar offering document.  Past performance is not indicative of future performance. Please make sure to review important disclosures at the end of each article. \nNote: Joining BARRONS REPORT is not an offering for any investment. It represents only the opinions of RF Culbertson and Associates. \nPAST RESULTS ARE NOT INDICATIVE OF FUTURE RESULTS. THERE IS RISK OF LOSS AS WELL AS THE OPPORTUNITY FOR GAIN WHEN INVESTING IN MANAGED FUNDS. WHEN CONSIDERING ALTERNATIVE INVESTMENTS (INCLUDING HEDGE FUNDS) AN INVESTOR SHOULD CONSIDER VARIOUS RISKS INCLUDING THE FACT THAT SOME PRODUCTS AND OTHER SPECULATIVE INVESTMENT PRACTICES MAY INCREASE RISK OF INVESTMENT LOSS; MAY NOT BE SUBJECT TO THE SAME REGULATORY REQUIREMENTS AS MUTUAL FUNDS, OFTEN CHARGE HIGH FEES, AND IN MANY CASES THE UNDERLYING INVESTMENTS ARE NOT TRANSPARENT AND ARE KNOWN ONLY TO THE INVESTMENT MANAGER. \nAlternative investment performance can be volatile. An investor could lose all or a substantial amount of his or her investment. Often, alternative investment fund and account managers have total trading authority over their funds or accounts; the use of a single advisor applying generally similar trading programs could mean lack of diversification and, consequently, higher risk. There is often no secondary market for an investor's interest in alternative investments, and none is expected to develop. \nAll material presented herein is believed to be reliable but we cannot attest to its accuracy. Opinions expressed in these reports may change without prior notice. Culbertson and/or the staff may or may not have investments in any funds cited above. \nRemember the Blog: < http://rfcfinancialnews.blogspot.com/>  Until next week – be safe. \nR.F. Culbertson \n\n< mailto:rfc@culbertsons.com > < http://rfcfinancialnews.blogspot.com> \n\n"}]