[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:31:35.000+03:00", "author": "Clare Stone (noreply@blogger.com)", "entities": {"persons": [{"name": "ann", "sentiment": "none"}, {"name": "carolyn arnold wednesday catch-up clare", "sentiment": "none"}, {"name": "christopher golden", "sentiment": "none"}, {"name": "sarah lotz", "sentiment": "none"}, {"name": "becky albertalli", "sentiment": "none"}, {"name": "claudia gray", "sentiment": "none"}, {"name": "erin kelly", "sentiment": "none"}, {"name": "clare", "sentiment": "none"}, {"name": "marina fiorato", "sentiment": "none"}, {"name": "lizzie borden", "sentiment": "none"}, {"name": "rosalyn eves", "sentiment": "none"}, {"name": "l.d. goffigan", "sentiment": "none"}, {"name": "mary kubica", "sentiment": "none"}, {"name": "simon", "sentiment": "none"}, {"name": "amanda reynolds", "sentiment": "none"}, {"name": "christopher fowler", "sentiment": "none"}, {"name": "michelle zink", "sentiment": "none"}, {"name": "meagan spooner", "sentiment": "none"}, {"name": "tynga", "sentiment": "none"}, {"name": "netgalley", "sentiment": "none"}, {"name": "cherie priest", "sentiment": "none"}, {"name": "anna", "sentiment": "none"}], "locations": [{"name": "white road", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "none"}, {"name": "facebook  and  instagram", "sentiment": "none"}, {"name": "arc", "sentiment": "none"}, {"name": "homo sapiens agenda", "sentiment": "none"}]}, "text": "The Sunday Post is a weekly meme hosted at  Caffeinated Book Reviewer ,  it's a chance to post a recap on the past week, show the books we have received and share what we plan for the coming week. Stacking the Shelves is hosted by  Tynga's Reviews  and the aim is to show our newest books and to see what everyone else received for review, borrowed from libraries, bought in bookshops or downloaded on to their e-reader. As always you can click on any of the pictures to be taken to the Goodreads page for that book if you're interested in finding out more about it or click the title to go to the review. \n\nThis week we started our link-up; Monday Highlights! I really enjoyed it - thank you to everyone who joined in and we will be doing it again tomorrow. If you would like to take part you can just share a link to your favourite recent blog post (one you are proud of or enjoyed making) and we can visit. We're hoping it will encourage new blog discoveries and also give us an opportunity to interact more with blogs we do follow! \n\nThis post is slightly late going up today because yesterday we went to the zoo! And apparently it exhausted me so much I overslept! It was a lot of fun and our little brother got to do the Keeper for a Day experience which he loves so that was exciting! \nFilms of the Week: I'm honestly still recovering from my Chronicles of Lizzie Borden binge but I've been trying to watch the recommended shows/films on Netflix. So far I haven't found anything that's really caught my interest so if you have any suggestions let me know!  \nLast Week on the Blog: Monday Highlights #1  Ann Reviews: Remnants by Carolyn Arnold Wednesday Catch-Up Clare Reviews: Defy the Stars by Claudia Gray Friday Reads Spring Into Horror TBR and Goals Clare Reviews: The Beast of London by L.D. Goffigan \nBooks We Got This Week: Ann: \nPromises I Made by Michelle Zink: Clare ordered this for me a month ago because I loved the first book and it's taken a while to arrive! But I am very excited to read it! \nClare: \nArarat by Christopher Golden:  Received for review from Headline, I am SO excited for this and it arrived just in time for Spring Into Horror as well so I'll definitely be reading this in the next couple of weeks!! Every Last Lie by Mary Kubica:  Thank you to HQ and Netgalley for this one! I'm really excited for it (my love affair with thrillers continues) but its not released until the end of July so will have to hold off for a bit! Close to Me by Amanda Reynolds: I recently took part in a blog tour for this book and the publisher was kind enough to send me a copy for review! This will again be perfect for Spring Into Horror (lining up SO many good reads). \nCrimson & Bone by Marina Fiorato:  Many thanks to the publisher for sending me a copy of this! Marina Fiorato is probably my favourite Historical Fiction writer so I am super excited for this! \nThe White Road by Sarah Lotz: I am so excited for this you wouldn't believe it! The publisher sent me an ARC for review and it just sounds exactly my kind of book! Will definitely be reading this for Spring Into Horror as well! \nThe Wages of Sin by Kaite Welsh:  This is one I've been wanting for a while so I was thrilled to get it on Netgalley!  \nMaplecroft by Cherie Priest: Ever since watching The Lizzie Borden Chronicles I've been on a big Lizzie Borden kick - this was the best looking of all the Lizzie Borden books I found so I am excited for it!  \nThe Upside of Unrequited by Becky Albertalli: For a swift change in tone (seriously so much horror/thrillers this week) - this looks like a cute and fun contemporary. I adored Simon vs the Homo Sapiens Agenda so I am looking forward to this! \nHunted by Meagan Spooner: Beauty and the Beast retelling. Plus it's got amazing reviews so far!  \nReading Update: Clare: \nBlood Rose Rebellion by Rosalyn Eves: 2 stars, I had quite a lot of problems with this throughout - it's a very American view of Hungary and of England (although I am sure Rosalyn Eves did her best) so there are quite a few misrepresentations and generalisations which is always frustrating. But mostly - I just didn't like Anna. Her decision making was childish and nonsensical and although she had some character growth it wasn't enough to make me like her.  Defy the Stars by Claudia Gray: 3 stars, Just kind of underwhelming. I didn't dislike it but I didn't really care about any of the characters either which made me feel a little heartless. My review of this is already up! The Beast of London by L.D. Goffigan: 4.5 stars, So very good. Atmospheric, great characters an intriguing mystery! Just everything I was hoping for! My review for this went up yesterday!  \n\nNext Week on the Blog: Monday Highlights #2 Top Ten Tropes That Make Me Insta-Buy!! Wednesday Catch-Up Clare Reviews: He Said/She Said by Erin Kelly Friday Reads Clare Reviews: Wild Chamber by Christopher Fowler \n\nYou can also find us on Goodreads ( Ann  and  Clare ),  Facebook  and  Instagram  to keep up with what we are reading. ", "url": "http://omgili.com/ri/t1o2C2H78Ufa1r9BzUhCjtB8wZzZgAt6nm6slk8AowLvWr4BGBNhdk07E3dxr0X9WbGVLFTEHjxVU28191Rhm9uGzkDOTi5G", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T10:31:35.000+03:00", "language": "english", "title": "Sunday Post 16th April 2017", "thread": {"title_full": "Sunday Post 16th April 2017", "site_full": "dualreads.blogspot.com", "site": "blogspot.com", "site_section": "http://dualreads.blogspot.com/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Dual Reads", "url": "http://omgili.com/ri/t1o2C2H78Ufa1r9BzUhCjtB8wZzZgAt6nm6slk8AowLvWr4BGBNhdk07E3dxr0X9WbGVLFTEHjxVU28191Rhm9uGzkDOTi5G", "published": "2017-04-16T10:31:35.000+03:00", "title": "Sunday Post 16th April 2017", "uuid": "38edb09415b791b0372cc8b726412169c21402c6", "main_image": null}, "uuid": "38edb09415b791b0372cc8b726412169c21402c6", "ord_in_thread": 0}]