[{"thread": {"domain_rank": 26790, "replies_count": 0, "url": "http://omgili.com/ri/GiCaV2xJNYuP96UyaXJdIYhHub0.vLOhpq6zx5rQ.HvWJyW07DZkhzz0e6yWCBv2NR.w3GIyBl2dJK4YU2HlM0G7XinNjatnPoDbITUSs6E.kDKNUWF80iPaEIq5L6P3T.cz5.qeDbLmA9XQV026VA3SkXoxTHtA", "title": "North Korea tops Pence’s agenda during four-nation Asia trip", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://jacksonville.com:80/rss.xml", "spam_score": 0.0, "section_title": "Jacksonville News, Sports and Entertainment | jacksonville.com", "site": "jacksonville.com", "site_full": "jacksonville.com", "performance_score": 0, "uuid": "3915c1cd39a0ad0b78ca8f17b2ec5dd98f734b6e", "published": "2017-04-17T10:46:00.000+03:00", "site_categories": [], "country": "US", "title_full": "North Korea tops Pence’s agenda during four-nation Asia trip", "participants_count": 1, "main_image": "http://jacksonville.com/sites/default/files/field/image/2095253_web0_LEAD_APTOPIXSouthKoreaUSPenceKorea.jpg"}, "url": "http://omgili.com/ri/GiCaV2xJNYuP96UyaXJdIYhHub0.vLOhpq6zx5rQ.HvWJyW07DZkhzz0e6yWCBv2NR.w3GIyBl2dJK4YU2HlM0G7XinNjatnPoDbITUSs6E.kDKNUWF80iPaEIq5L6P3T.cz5.qeDbLmA9XQV026VA3SkXoxTHtA", "title": "North Korea tops Pence’s agenda during four-nation Asia trip", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:23:24.000+03:00", "language": "english", "entities": {"locations": [{"name": "asia", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "koreas", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "pence", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "jakarta", "sentiment": "none"}, {"name": "korean peninsula", "sentiment": "none"}, {"name": "panmunjom", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "persons": [{"name": "pence", "sentiment": "negative"}, {"name": "xi jinping", "sentiment": "none"}, {"name": "moon jae-in", "sentiment": "none"}, {"name": "kim il sung", "sentiment": "none"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "moon", "sentiment": "none"}, {"name": "yang jiechi", "sentiment": "none"}, {"name": "ahn cheol-soo", "sentiment": "none"}, {"name": "wang yi", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "park geun-hye", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "kent boydston", "sentiment": "none"}], "organizations": [{"name": "washington post", "sentiment": "negative"}, {"name": "global times", "sentiment": "none"}, {"name": "peterson institute for international economics", "sentiment": "none"}, {"name": "thaad", "sentiment": "none"}, {"name": "u.n. security council", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "u.s. navy", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}, {"name": "air force", "sentiment": "none"}, {"name": "korean people’s army", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "3915c1cd39a0ad0b78ca8f17b2ec5dd98f734b6e", "published": "2017-04-17T10:46:00.000+03:00", "author": "newsengin", "text": "Posted April 16, 2017 10:56 pm | Updated 10:57 pm By The Washington Post North Korea tops Pence’s agenda during four-nation Asia trip \nU.S. Vice President Mike Pence arrives at the border village of Panmunjom in the Demilitarized Zone (DMZ) which has separated the two Koreas since the Korean War, South Korea, Monday, April 17, 2017. (Associated Press) \nTOKYO - The United States did not need to respond to North Korea’s latest missile launch because it was a failure, the White House said Sunday, as Vice President Mike Pence arrived in Seoul on the first leg of a four-country trip to Asia. \nAs Pence was departing from Alaska - a day after a huge military parade in Pyongyang - North Korea launched a ballistic missile that exploded within a few seconds. \nSee Also \nNorth Korea had been expected to do something provocative to mark the most important day on the regime’s calendar, the April 15 anniversary of founder Kim Il Sung’s birthday. \nTensions in the region had been running high amid expectations of a nuclear test or a missile launch, with President Trump vowing to “properly deal with” North Korea if China would not. \nBut a White House foreign policy adviser traveling with Pence said that the United States did not need to take action “to reinforce their failure.” North Korea has fired numerous medium-range missiles, as Sunday’s appeared to be, so one more made little difference. \n“If it had been a nuclear test, then other actions would have been taken from the U.S.,” the adviser told reporters on the vice president’s plane. \nSome analysts were puzzled by this. \n“I’m not sure why failed missile tests, which are still banned by the U.N. Security Council, are considered less provocative,” said Kent Boydston, a North Korea-focused research analyst at the Peterson Institute for International Economics. “The North Koreans know they may fail, but they improve their capabilities each time.” \nIndeed, while the latest missile exploded soon after launch, experts say North Korea is able to learn from its mistakes and hone its technology. It had repeated failures with other missiles, including the medium-range Musudan and a submarine-launched ballistic missile, before successfully firing both. \nPence made a surprise visit to the demilitarized zone separating North and South Korea on Monday, one day after Kim’s regime launched the missile. \nNorth Korea’s behavior will be the focus of Pence’s trip to Asia, with a senior administration official saying the vice president would be discussing “the belligerency of North Korea” at every stop. \nAfter stopping in Seoul, Pence is to travel to Tokyo; Jakarta, Indonesia; and Sydney. \nNorth Korea’s missiles are a particularly complicated issue in South Korea. \nThe conservative government of former president Park Geun-hye, who was removed from office last month after her impeachment in December, had agreed to deploy the Terminal High Altitude Area Defense, or THAAD, antimissile system to defend against North Korea’s rockets. \nSouth Korea made this decision last July after much equivocation. China strongly objects to the THAAD battery - in particular its radar system, which Beijing worries will be used to peer into China. \nBeijing has made its unhappiness known with a wide economic boycott that includes K-pop concerts, toilet-seat imports and tour group travel to South Korea. \nNow, South Korea is heading toward a snap presidential election May 9 to replace Park, and the THAAD system is a core issue. \nMoon Jae-in, the progressive candidate who had been leading in the polls, has promised to review the previous government’s decision to host THAAD. Apparently sensing a worsening political environment, the U.S. military sped up the deployment to try to get everything in place before the election. \nBut now Moon faces a strong challenge from a more centrist candidate, Ahn Cheol-soo, who has said that he will respect the Park administration’s agreement with the United States. \n“It’s a critical point for the defense of South Korea in recognizing it’s not an offensive weapon. It’s there to prevent rockets slamming from the North Koreans,” an American official said while previewing Pence’s trip. \nThe complicating factor here is China. It wants the missile battery gone, and the United States wants China to crack down on North Korea. Although Trump had a cordial summit with his Chinese counterpart, Xi Jinping, in Florida this month, the North Korea issue threatens to drive a wedge between them. \nChina on Friday warned that “storm clouds” were gathering. \nForeign Minister Wang Yi urged the United States and North Korea not to push their recriminations to a point of no return and allow war to break out on the peninsula. \nOn Sunday, China’s top diplomat, Yang Jiechi, spoke to Secretary of State Rex Tillerson by telephone, and the two “exchanged views on the current situation on the Korean Peninsula,” China’s foreign ministry said in a statement. \nChina said it cut off coal imports from North Korea in February, in accordance with U.N. Security Council sanctions. \nThe Global Times, an English-language Chinese newspaper that does not necessarily reflect official policy, recommended that Beijing convey a clear message to Pyongyang: that if it conducts a sixth nuclear test, the Chinese government would support stiffer U.N. sanctions to cut off “the vast majority” of its oil supplies to North Korea. \nThe U.S. Navy sent a strike group to Korean waters last week, but defense officials have said tougher sanctions and pressure was still the favored approach to dealing with North Korea. \n“We’ve got a range of options, both militarily, diplomatic and others … at disposal for the president should he choose to use them,” the White House foreign policy adviser told reporters on Air Force Two. “But for this particular case [of the failed missile launch] … we don’t need to expend any resources against that.” \nTensions are expected to continue for several weeks at least. \nLarge-scale annual exercises between the South Korean and U.S. militaries will continue until the end of April, and North Korea will mark another important date - the anniversary of the foundation of the Korean People’s Army - on April 25. \nRead/post comments "}]