[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:09:53.000+03:00", "author": "", "entities": {"persons": [], "locations": [], "organizations": []}, "text": "For Half the Cost Enterprise Cloud Computing On Force.com Teenagers Think Google Is Cool, Study by Google Finds By Elle Hunt 09 2017 Today's teenagers think Google and Google brands are cool, research funded by Google has found. Google published \"It's Lit: A guide to what teens think is cool,\" a \"magazine\" compiling the results of its research into Generation Z, characterized as those aged from 13 to 17. \nThe Google-funded research found Generation Z relied on brands to \"shape their world,\" and that Google was the third-most cool. Cool was defined by the researchers as \"unique, impressive, interesting, amazing, or awesome.\" \nYouTube, which Google owns, came out at number one ahead of Netflix. Google's web browser Chrome placed tenth, in front of Nike. \n1,100 teenagers aged 13-17 were asked to rank 122 brands by coolness and awareness. \nYouTube, Google and Netflix ranked highly by both. \nAccording to the surveyed teens, McDonalds, Yahoo, and Facebook Messenger were high-profile but not cool. \nDoritos and Oreo were cool. \nVice was not cool. \nOverall, the least cool brands were TMZ, the Wall Street Journal, Sprint and Yahoo. Respondents were least aware of Uniqlo, Patagonia and Supreme. \nBut those surveyed for the Google study were united in their appreciation of Google, with Millennials describing it as \"serious and functional\" and Generation Z finding it more \"fun and functional.\" \nA 17-year-old woman in suburban Florida was quoted as saying that Google was \"not only a powerful search engine, but great at everything it does, from email to documents.\" \n\"Teens love learning and knowing\" was researchers' conclusion. \nThe study stated that 42.2% of Generation Z respondents used its social network Google Plus, putting it ahead of Twitter (35.4%) and Pinterest (26.6%) and only a little over 10% behind Facebook. \nBut the finding betrays the fact that a Google Plus account comes part and parcel with use of its other services such as Gmail. An independent study in 2015 suggested fewer than 1% of Google's 2.2 billion users were active on Google Plus. \nResponding to the research on social media, many expressed scepticism as to its validity. \n\"This study is a great piece of native advertising for Google services,\" tweeted one technology commentator. \nMany write-ups of the report referenced Steve Buscemi's appearance on 30 Rock, now a popular meme: \"How do you do, fellow kids?\" © 2017 Guardian Web under contract with NewsEdge/Acquire Media. All rights reserved. Tell Us What You Think Comment: \n5. Netflix Looking for a Thumbs Up MAY INTEREST YOU More than 70% of data center incidents are caused by human error. Find out how you can avoid that. Discover the most essential attributes to consider when selecting a colocation provider. MORE IN SALES & MARKETING YouTube Cracks Down on Fake News Channels with Ad Changes PUBLISHED: 07 2017 YouTube announced Thursday it is cracking down on fake news channels by no longer placing advertising on them until they've reached 10,000 overall views. \nYouTube, which is owned by Alphabet Inc., also the parent company of Google, announced changes after several big companies pulled their advertising from the company because their ads were appearing with objectionable content. \nThe online video service said the changes are designed to make sure channels are legitimate and not stealing content. \n\"We will no longer serve ads on YPP videos until the channel reaches 10K lifetime views,\" Ariel Bardin, vice president of product management, said in a statement. \"This new threshold gives us enough information to determine the validity of a channel. It also allows us to confirm if a channel is following our community guidelines and advertiser policies. By keeping the threshold to 10K views, we also ensure that there will be minimal impact on our aspiring creators. And, of course, any revenue earned on channels with under 10K views up until today will not be impacted.\" \nYouTube is also adding a review process for creators to join the YouTube Partner Program, which began in 2007. \n\"After a creator hits 10K lifetime views on their channel, we'll review their activity against our policies,\" Bardin said. \"If everything looks good, we'll bring this channel into YPP and begin serving ads against their content. Together these new thresholds will help ensure revenue only flows to creators who are playing by the rules.\" \nThe company, in an effort to help creators reach 10,000, will offer tips on \"making great original content and growing your audience.\" \n\"We want creators of all sizes to find opportunity on YouTube, and we believe this new application process will help ensure creator revenue continues to grow and end up in the right hands,\" Bardin said. \nIn the past, the open-ended policy allowed amateur video creators to earn money and some work became viral and earned a considerable amount. \nSeveral advertisers, including Walmart, General Motors, JPMorgan Chase, Pepsico, Starbucks and Johnson & Johnson, pulled out of YouTube after their ads appeared in extremist hate-speech videos. \nOn March 24, the head of the Association of National Advertisers, which represents 1,000 companies that spend more than $250 billion in marketing and advertising each year, urged Google to change its policy. \n\"ANA strongly believes that brand safety is of paramount importance to our members,\" Bob Liodice said in statement. \"The current crisis is representative of the issues that ANA -- and others -- have raised with respect to fraud and risk, reduced transparency, sub-optimum measurement and nebulous productivity.\" \nYouTube didn't say how many accounts would be affected by the change. \nAdvertisers pay roughly $7 to $12 for 1,000 views and creators split the money with YouTube, The Wall Street Journal reported. \n\"What we do is, we match ads and the content, but because we source the ads from everywhere, every once in a while somebody gets underneath the algorithm and they put in something that doesn't match,\" Alphabet chairman Eric Schmidt said last month in an interview with Fox Business Network. \nYouTube has more than a billion users and as of last July, it had paid out $2 billion to rightsholders, the company said on its website. \n© 2017 UPI Top Stories under contract with NewsEdge/Acquire Media. All rights reserved. \nImage credit: iStock.", "url": "http://omgili.com/ri/jHIAmI4hxg_gp0Lxu81bkdjnT_HcX8mizutndVv8j35MFnBnewDI001EQ8u8oUrogi7HCqCQPIkUExyXVnb7HQ--", "highlightText": "", "highlightTitle": "", "published": "2017-04-09T08:00:00.000+03:00", "language": "english", "title": "Teenagers Think Google Is Cool, Study by Google Finds", "thread": {"title_full": "Teenagers Think Google Is Cool, Study by Google Finds", "site_full": "www.crm-daily.com", "site": "crm-daily.com", "site_section": "http://crmdaily.com/share/rss_feed.php", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "news", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "CRM Daily", "url": "http://omgili.com/ri/jHIAmI4hxg_gp0Lxu81bkdjnT_HcX8mizutndVv8j35MFnBnewDI001EQ8u8oUrogi7HCqCQPIkUExyXVnb7HQ--", "published": "2017-04-09T08:00:00.000+03:00", "title": "Teenagers Think Google Is Cool, Study by Google Finds", "uuid": "39269381c2aeda0b076504c839b4e4905520d19b", "main_image": "http://www.crm-daily.com/images/super/larger-13-TEENS-15to18-PC3.jpg"}, "uuid": "39269381c2aeda0b076504c839b4e4905520d19b", "ord_in_thread": 0}]