[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:14:43.000+03:00", "author": "Euan Ferguson", "entities": {"persons": [], "locations": [], "organizations": []}, "text": "Peter Kay’s Car Share (BBC1) | iPlayer\nThe Knowledge: The World’s Toughest Taxi Test (C4) | All 4\nGuerrilla ( Sky )\nBroadchurch (ITV) | ITV Hub\nLine of Duty (BBC1) | iPlayer\nFor a couple of hours last week, Britain didn’t seem such a bad place after all. Despite all the… stuff . This was achieved, will wonders never cease, by a couple of programmes about, essentially, driving.\nFew people other than the most crashing snobs can dislike Peter Kay. His northern humour may not be to absolutely every single taste, but you’d have to be called something like Peregrine Spunktrumpet to actively eject yourself from his presence. His second series of Car Share kicked off with the usual series of conversations with co-worker Kayleigh, except that now she’s having to commute, these perforce took place on mobile phone. It’s everything low-level infuriating about modern life – traffic jams, lost phone signals, the actionable mediocrity of Forever FM , the fact that two people can’t manage a simple commute without phoning each other eight times despite having nothing to say. Somehow, in Kay’s hands – the set condensed into, essentially, his car and sweeping blurs of a Tesco-liveried Manchester – we learn to forgive, even like, modern life. The staff nights out, the low-level road rage ( you’re the dickhead, you… dickhead”), the marketing that treats us as infants, even, ulp, S Club 7. A splendid Sian Gibson, as Kayleigh, is obviously so right for Mr Kay, but let’s hope this all remains unrequited for the moment, at least for this too-short four-parter. True, it’s so warm-hearted it can sometimes feel like like having a bath with your socks on, but just when you think you know where it’s going along, will come a savage flash of witty, angry, sublime self-perception.\nWhat a surprise was The Knowledge , a sadly one-off foray allowing cameras into the exam centre for London’s black-cab drivers. This could have been bordering on turbid: instead, focusing on the divergent candidates’ very sweats as they gulped their way through the final “appearance”, it was rendered mesmerising.\nFacebook Twitter Pinterest ‘Who’d have thought we would invest so much?’: The Knowledge. Photograph: Channel 4 Television\nFour years’ average study , a 70% dropout rate, 25,000 streets and 100,000 landmarks to memorise, the hideous Uber snarling at their heels, yet still, who’d have thought that we could invest so much in willing people to remember you can’t set down on the right at St Mary Axe, and how to get from the Royal British Society of Sculptors to the Royal Institute of British Architects. We learned about plasticity of brain: we learned that no one’s too old to grow clever, despite having been constantly told they’re thick.\nThe eventual exams – there was a nicely old-fashioned air about these, with most candidates dressed in ties, and it was all “nice to see you again… I’m still Mr Whitehead, you’re still Mr Tilfrey,” – had you rooting for everyone, after four winters on scooters with their daughters’ hot-water bottles up their jerseys. And there were tears, from hard-bitten men and women, on getting that green-gold badge. “Ten foot tall. Feel ten foot tall.” “I won’t stop smiling for a month.” It was, honestly, every bit as exciting as that last University Challenge . As the programme said, keep an eye out for Dave, for Paul, for Kosovan Saimir, next time you’re in the capital, and I will too. My pal the jazz pianist Ian passed the test a few years ago, and similarly speaks of a new lease of life: he’s since persuaded TfL to adorn his cab with “Ride with Pride” rainbow livery, so watch out for that and – shameless plug alert – his song Over the Westway , a real cabbie’s fresh take on the unloved flyover.\nWhat, quite, to make of how this nice Britain all compares to the London of 1971 as depicted in Guerrilla , an Idris Elba production notably written by John Ridley, the man responsible for the 12 Years a Slave script? The Spectator has already labelled it “Self-flagellatory pornography designed for white liberal pillocks” , and that was just the headline – compared to the review itself, it was mealy-mouthed pantywaisting.\nI’m far less inclined to be so censorious, but then I’m far less generally inclined to the taking of recreational offence. True, some of it bordered, politically, on the cartoonish. White people, from the torn-faced lip-purser on the bus to the absurd racism of the Met police, verging on the Not the Nine’o’Clock News “possession of curly black hair and thick lips” sketch, do not come out of this well. Ever. Unless they’re Irish. Or Marxist-Leninist. And… um, but did we truly have quite so many black activists being murdered openly on the streets of London, even in 1971? I think we might have read about that.\nFor all that, it’s an honestly valuable, if wholly imagined, testament to the mood of the times, with some viscerally shocking scenes and an utterly credible mood of menace. Rory Kinnear , with his tenderly rightwing face, and Daniel Mays excel as the toxic Rhodesian-tinted “black power desk” of the Met, as does Babou Ceesay as the rebel without a clue. Babou’s nice liberal teacher Marcus aids the escape of a black “political prisoner” – actually jailed for stabbing someone in an off-licence raid – and this is meant to be (I think) a tale of how well-meant activism can, when provoked by cold concrete establishment prejudice, lead to escalating madnesses. But Marcus and his accomplice (the oddly miscast Freida Pinto) have nothing to exactly rail against, other than nebulous dissatisfaction with their lot.\nFacebook Twitter Pinterest ‘Honestly valuable’: Idris Elba in Guerrilla. Photograph: Sky UK Limited\nI can’t imagine that 1971 was anything like a dander through Paradise Garden for any black person in London. Sometimes, though, this feels like being poked too repeatedly, pointlessly, in the ribs with a reversed sjambok.\nIt’s neck and neck now between Line of Duty and Broadchurch , which has suddenly come up on the rails. David Tennant finally showed his fangs – his “cut off your tiny little cocks” speech, despite being a teensy bit tautologous and delivered to nothing more menacing than a bunch of no-mark slouchers, had elements of his Shakespearian grandeur. Jed Mercurio’s Line of Duty shocked and brilliantly appalled again. Sweaty sofas again early next week. Finally, destination TV returns. It had, after all, been on nothing more than a destination holiday.\nTopics Peter Kay Observer TV reviews Idris Elba Rory Kinnear Broadchurch Line of Duty Documentary reviews Share Reuse this content", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nvb.iEnU1.6mdBzJ.0eU5XIwDMQ_LflCoX9dokF8tlU5cc5ng7atmDBpn6CHRrKzjGZBIsA4xCsWyDpkfd_xrym4.6hFG1kGrrQX6sonLWgMhzbJv0N0NsQSofiSUvbBMqtpRX9maT2P.M_SZq8YRyu.QHox1NX4E", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T10:14:43.000+03:00", "language": "english", "title": "The week in TV: Peter Kay’s Car Share; The Knowledge; Guerrilla; Broadchurch; Line of Duty | Television & radio", "thread": {"title_full": "The week in TV: Peter Kay’s Car Share; The Knowledge; Guerrilla; Broadchurch; Line of Duty | Television & radio | The Guardian", "site_full": "www.theguardian.com", "site": "theguardian.com", "site_section": "http://feeds.theguardian.com/theguardian/culture/rss", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 26, "shares": 26, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "news", "spam_score": 0.0, "domain_rank": 170, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Culture | The Guardian", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nvb.iEnU1.6mdBzJ.0eU5XIwDMQ_LflCoX9dokF8tlU5cc5ng7atmDBpn6CHRrKzjGZBIsA4xCsWyDpkfd_xrym4.6hFG1kGrrQX6sonLWgMhzbJv0N0NsQSofiSUvbBMqtpRX9maT2P.M_SZq8YRyu.QHox1NX4E", "published": "2017-04-16T10:14:43.000+03:00", "title": "The week in TV: Peter Kay’s Car Share; The Knowledge; Guerrilla; Broadchurch; Line of Duty | Television & radio", "uuid": "3967efe2ab6bf0509b396494e8e5c7103a9631d1", "main_image": "https://i.guim.co.uk/img/media/ce5db986580c3c26867fc433eee033261e20495e/0_99_3537_2122/master/3537.jpg?w=1200&amp;h=630&amp;q=55&amp;auto=format&amp;usm=12&amp;fit=crop&amp;crop=faces%2Centropy&amp;bm=normal&amp;ba=bottom%2Cleft&amp;blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&amp;s=cb42818b84cdb023366895f524d671ae"}, "uuid": "3967efe2ab6bf0509b396494e8e5c7103a9631d1", "ord_in_thread": 0}]