[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/DyQaNGXlfMqu0F0pAfRISMAMr0FG7c0dyjduUw5dkcPwBluV5_BbuqPkpQspP.bJ4elwtnxCweuT1j5CNXoukZfE5LWiQiUIVsUPB8NvCoYy9fCC0X4xSjjuEWGdux618XQPXwNXQhSUTa10UrF.TSzz6sbNhPK8", "title": "Republican Lawmakers Expect Role for Congress in Military Force Against Syria", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://trulyrightview.com/feed/", "spam_score": 0.0, "section_title": "Truly Right View", "site": "trulyrightview.com", "site_full": "trulyrightview.com", "performance_score": 0, "uuid": "3a622799801e430da6fa7254911d57e11f311326", "published": "2017-04-16T20:01:00.000+03:00", "site_categories": [], "country": "US", "title_full": "Republican Lawmakers Expect Role for Congress in Military Force Against Syria", "participants_count": 1, "main_image": ""}, "url": "http://omgili.com/ri/DyQaNGXlfMqu0F0pAfRISMAMr0FG7c0dyjduUw5dkcPwBluV5_BbuqPkpQspP.bJ4elwtnxCweuT1j5CNXoukZfE5LWiQiUIVsUPB8NvCoYy9fCC0X4xSjjuEWGdux618XQPXwNXQhSUTa10UrF.TSzz6sbNhPK8", "title": "Republican Lawmakers Expect Role for Congress in Military Force Against Syria", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:25:26.000+03:00", "language": "english", "entities": {"locations": [{"name": "r-mich.", "sentiment": "none"}, {"name": "r-md.", "sentiment": "none"}, {"name": "r-texas", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "r-okla.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "r-ohio", "sentiment": "none"}, {"name": "r-n.y.", "sentiment": "none"}, {"name": "r-pa.", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}], "persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "james lankford", "sentiment": "none"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "assad", "sentiment": "none"}, {"name": "tillerson", "sentiment": "none"}, {"name": "lankford", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "lee zeldin", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "bergman", "sentiment": "none"}, {"name": "harris", "sentiment": "none"}, {"name": "pelosi", "sentiment": "none"}, {"name": "mattis", "sentiment": "none"}, {"name": "jens stoltenberg", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "bashar al-assad", "sentiment": "none"}, {"name": "kelly", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "sean spicer", "sentiment": "none"}, {"name": "jack bergman", "sentiment": "none"}, {"name": "mike kelly", "sentiment": "none"}, {"name": "nancy pelosi", "sentiment": "none"}, {"name": "bashar assad", "sentiment": "none"}, {"name": "lamar smith", "sentiment": "none"}, {"name": "spicer", "sentiment": "none"}, {"name": "sergei lavrov", "sentiment": "none"}, {"name": "andy harris", "sentiment": "none"}, {"name": "james mattis", "sentiment": "none"}, {"name": "jim jordan", "sentiment": "none"}, {"name": "zeldin", "sentiment": "none"}], "organizations": [{"name": "congress in military force against syria", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "senate committee on homeland security", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "military force for congress", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "freedom caucus", "sentiment": "none"}, {"name": "syrian network for human rights", "sentiment": "none"}, {"name": "challenges facing trump", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "daily signal", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "house homeland security committee", "sentiment": "none"}, {"name": "house foreign affairs committee", "sentiment": "none"}, {"name": "defense", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "military force", "sentiment": "none"}, {"name": "congress can authorize force  the trump", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "the daily signal", "sentiment": "none"}, {"name": "governmental affairs", "sentiment": "none"}, {"name": "house freedom caucus", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "3a622799801e430da6fa7254911d57e11f311326", "published": "2017-04-16T20:01:00.000+03:00", "author": "trulymain1", "text": "April 16th, 2017 | Add a Comment \nPresident Donald Trump’s order of a missile strike on a military base in retaliation for the Syrian government’s deadly chemical attack on civilians served as a strong, decisive message to bad actors worldwide, congressional Republicans say, and signified the new administration would hew closely to the traditional concept of American power. Kill Your Cable Bill! Just $2 a month \nIn interviews with The Daily Signal, Republicans of all stripes said they were OK that Trump did not consult Congress before he authorized the strike, in which 59 cruise missiles hit a Syrian air base early Friday morning local time. \nIt was the first U.S. military action against the government of Syrian President Bashar Assad in the country’s six years of civil war. \nBut as the Trump administration hints at a tougher approach to the Assad regime, Republican lawmakers say they expect to have a greater influence on future military action. \n“With this very positive action in Syria, the president has now brought to the forefront the need for a discussion between Congress and the administration about strategy going forward,” said Rep. Jack Bergman, R-Mich., a freshman lawmaker and Vietnam War veteran. “This event has become a catalyst for the next logical step that we have to have as a country. It’s an opportunity for us as a country to show collaborative leadership within our system.” \n>>> After Missile Attack, the Challenges Facing Trump in Syria \nBergman called for the Trump administration to propose an official Authorization for Use of Military Force for Congress to review. Rather than delineating a specific strategy, an AUMF—as the authorization is known—gives the basic legal authority for the U.S. military to use force against an enemy. \n“Congress cannot be disengaged,” Bergman told The Daily Signal in an interview. “We need to be involved in creating an AUMF of the future and understand this not a political game. This is about national security.” \n“Congress cannot be disengaged,” says @RepJackBergman. \nHow Congress Can Authorize Force \nThe Trump administration, like its predecessor, is carrying out a military campaign against the Islamic State terrorist group, also known as ISIS, in multiple countries, including Syria. \nIt takes these actions under an existing AUMF from 2001 permitting the targeting of groups connected to the 9/11 attacks and the 2002 AUMF authorizing the Iraq War. \nPresident Barack Obama, in his second term, urged Congress to give him new authority to use force against ISIS, but there was bipartisan reluctance to do so and lawmakers never took a full vote on such an authorization. \nAfter the U.S. missile strikes last week, some lawmakers—of both parties—said Trump should seek congressional approval for an AUMF that specifically authorizes the U.S. military to fight Assad. \nSen. James Lankford, R-Okla., said it would not be appropriate to use the 2001 authorization, which was intended to fight al-Qaeda, because the Assad regime “is certainly not connected to that group.” \n“If you go back to the Federalist Papers, the Constitution is clear the commander in chief is the commander when the military is in the field, but Congress and the American people are responsible for calling out the military to move into battle—whether it’s through a war declaration or authorization for use of military force,” Lankford, a member of the Senate Committee on Homeland Security and Governmental Affairs, said in an interview with The Daily Signal. \nRep. Nancy Pelosi of California, the House Democratic leader, said she supported Trump’s decision to strike the Syrian air base, but that Congress should consider any proposed future military action in Syria. \n“If the president intends to escalate the U.S. military’s involvement in Syria, he must come to Congress for an Authorization for Use of Military Force which is tailored to meet the threat and prevent another open-ended war in the Middle East,” Pelosi said in a prepared statement to reporters. . @SpeakerRyan , Congress must do its duty & come back into session at once to debate use of military force in Syria. https://t.co/hcxcyN9UUC pic.twitter.com/eJNO4D6Gor \n— Nancy Pelosi (@NancyPelosi) April 7, 2017 \nNeeded: ‘Clear Plan to Win’ \nSome Republican lawmakers interviewed by The Daily Signal were more nuanced in their views, saying they are prepared to wait for the Trump administration to first firm up a broader strategy for the Syrian conflict before proposing any future force. \n“No recent president in decades has ever needed to go to Congress for such a single strike occasion,” Rep. Lamar Smith, R-Texas, a member of the House Homeland Security Committee, said in an interview with The Daily Signal. “That’s exactly the type of situation where the president is given authority under the Constitution to act. I do expect and feel confident the president will brief members of Congress when we return [from Easter recess], and I think we will be brought up to date on what the policy might be and future actions might be. We will have to wait and see if it scales to an all-out war.” \nSo far, Trump’s strategy is unclear. \nDuring the presidential campaign, Trump emphasized his focus in Syria would be on defeating ISIS, which maintains its base in that country. And in the early weeks of his administration, the White House articulated that facilitating the removal of Assad from power was not a priority. \nLast week, Trump’s calculus seemed to change when the president said the chemical weapons attack had “crossed a lot of lines for me” and that his attitude toward Syria and Assad “has changed very much.” \nWhite House press secretary Sean Spicer seemed to suggest Monday that Trump would act against Syria not just if it again used chemical weapons, but also when it used conventional munitions such as barrel bombs—powerful explosive devices often filled with shrapnel. \nThe Syrian Network for Human Rights estimates the Syrian government dropped 12,958 barrel bombs in 2016, resulting in the deaths of 653 civilians. \n“If you gas a baby, if you put a barrel bomb into innocent people, I think you will see a response from this president,” Spicer said in his daily briefing. \n‘Nothing Has Changed’ \nSpicer walked back and clarified his comment later Monday. \n“Nothing has changed in our posture,” Spicer said in a statement to reporters. “The president retains the option to act in Syria against the Assad regime whenever it is in the national interest, as was determined following that government’s use of chemical weapons against its own citizens.” \nOther Trump administration officials in recent days have sought to downplay the prospects for future military action against the Assad regime. \nDefense Secretary James Mattis, speaking to reporters Tuesday, said the administration’s priority in Syria “remains the defeat of ISIS.” \n“Our military policy in Syria has not changed,” Mattis said. \nSecretary of State Rex Tillerson, who is meeting with Russian government officials this week, told reporters that the U.S. seeks a negotiated resolution to the Syrian civil war and wants Moscow’s help in pushing Assad from power. \n“The final outcome does not provide a role for Assad or the Assad family in the future governance in Syria,” Tillerson said in a Wednesday news conference with Russian Foreign Minister Sergei Lavrov. \nTrump, in an interview on Fox Business that aired Wednesday morning, said simply: “We’re not going into Syria.” \nLater Wednesday, Trump called Assad “a butcher” and said U.S. relations with Russia could be at an “all-time low.” \n“Right now, we’re not getting along with Russia at all—we may be at an all-time low in terms of a relationship with Russia,” Trump said during a news conference at the White House with Jens Stoltenberg, the secretary general of NATO . “This has built for a long period of time, but we’re going to see what happens.” \nRep. Lee Zeldin, R-N.Y., a member of the House Foreign Affairs Committee, said the Trump administration should clearly articulate its priorities in Syria to Congress. \n“I am someone who believes strongly we should never send troops into harm’s way unless we have a clear plan to win,” Zeldin told The Daily Signal in an interview, adding: \nPart of executing a strategy to win includes getting everybody on the same page to what winning looks like. There is debate that will take place whether Assad should stay in power, and what role the U.S. should have in the region and around the world. While not every part of this debate should be televised for the adversary to see, at the same time there is a responsibility to ensure we are making the right decisions so that the American public is supportive of our efforts. \nLankford said the Trump administration ought to be focused both on defeating ISIS and helping to remove Assad, because the Syrian dictator’s leadership fuels terrorism. \n“We hope Assad’s status is resolved diplomatically, but you can’t do diplomacy without a credible military threat behind it,” the Oklahoma Republican said. #Syria Pres. Bashar al-Assad’s brutality murders innocent people, creates regional chaos & contributes to the growth of ISIS. #Assad must go \n— Sen. James Lankford (@SenatorLankford) April 7, 2017 \nIf the Trump administration does not provide “a clearly articulated vision” for its strategy in Syria, Lankford said, “Congress should not move forward on any action.” \n“No one knows what the American policy is in Syria right now, and what it stands for and will not stand for,” Lankford said. “None of our allied countries in the region will help in the fight unless they know where America stands. The Trump administration has to fix that or the international community will have no reason to engage.” \nConstitution ‘Pretty Clear’ \nOther Republican lawmakers are more specific about what set of U.S. actions in Syria should require congressional oversight. \nRep. Jim Jordan, R-Ohio, a leader of the conservative House Freedom Caucus, said Congress should review any proposed “boots on the ground” in Syria dedicated to targeting the Assad regime. \n“The Constitution is pretty clear, you are gonna have a debate in the Congress,” Jordan said in a speech Tuesday in his home district that was attended by a Daily Signal reporter. “That’s the way the founders laid this thing out. If it’s gonna escalate, if it’s gonna be something with boots on the ground or anything like that, I think we’ve got to be real careful about that, and it would warrant a full debate in the House and the Senate before we go any further.” \nRep. Andy Harris, R-Md., also of the Freedom Caucus, said he expects the Trump administration to pursue a diplomatic solution to the Syrian civil war—as Obama did. \nBut if Trump failed, and then sought military action against Assad, Congress should have a say, Harris said. \n“If further escalation involving serious military force is necessary, the president should consult with Congress first,” Harris told The Daily Signal in an interview. \n“If further escalation involving serious military force is necessary, the president should consult with Congress first,” says @RepAndyHarrisMD. \n“For instance, if the administration decides its diplomatic efforts weren’t working and decided they needed to attack the Syrian air force, that is probably something they should obtain congressional approval for,” Harris said. \nHe doesn’t believe Trump would need Congress’ blessing if the president sought to create no-fly and safe zones in Syria to protect civilians, the Maryland Republican added. \n‘Part of the Action’ \nIn the interviews, the Republican lawmakers were not unified in describing how Congress should be incorporated into Trump’s Syria plan. \nThe GOP lawmakers appear prepared to give the president some freedom now that he has shown himself not to be wedded to the isolationist foreign policy approach he espoused in the campaign. \n“I think President Trump has a lot different view of the world than candidate Trump,” Rep. Mike Kelly, R-Pa., said in an interview with The Daily Signal. “He won’t sit back and say, ‘This is how I want the world to be’ without regard for the facts of a given situation.” \n“This president is an action guy,” Kelly said, “and I trust he will rely on the advice given by his military advisers. But Congress does need to be a part of the action. That’s our responsibility constitutionally, and I would never walk away from that.” \nPlease follow and like us: 0"}]