[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:11:03.000+03:00", "author": "Martin Love", "entities": {"persons": [{"name": "adam", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}], "locations": [{"name": "mokka", "sentiment": "none"}], "organizations": [{"name": "audi", "sentiment": "negative"}, {"name": "vauxhall", "sentiment": "none"}, {"name": "renault", "sentiment": "none"}, {"name": "facebook twitter pinterest inside", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "text": "Price: £20,230\nTop speed: 122mph\n0-62mph: 10.1 seconds\nMPG: 55.4\nC0 2 : 117g/km\nI have a short friend who insists on wearing bright clothes. Adam’s theory is that his gaudy wardrobe distracts people from his lack of vertical presence. I’ve never been convinced. However, this week I’ve been driving Audi’s dinky Q2 in “Vegas Yellow”. So who better to help test it than a small man in a garish suit?\nLike Adam, the Q2 has all the style and class of a grown-up car in a diminutive package. The market for these “compact” SUVs is one of the liveliest, but until now has been dominated by cheaper offerings, such as Nissan’s Juke, Vauxhall’s Mokka and Renault’s Captur. Audi is the first premium builder to enter the fray. And if you throw money at a problem you tend to get instant results: in terms of pure drivability, ride quality, interior comfort and big-car tech, the Q2 absolutely wipes the floor with the rest of them. It’s easily the best compact SUV on the market – give or take a few grand.\nFacebook Twitter Pinterest Inside story: the interior of the little Q2 has all the feel and finesse of a much bigger car\nIt’s great to look at – the boxy shape is accentuated by the squared running lines and sharp clefts. Like many small cars, the Q2 offers plenty of scope for customisation: it comes in 12 colour options; the C-pillar “blade” and bumpers come in a further five contrast colours; the LED lighting has illuminated inlays in a choice of 10 colours; and alloy wheels are offered in four different sizes. All this gets a thumbs-up from Adam, who has long exploited the power of an arresting colour clash.\nInside, the level of finish is extraordinary for such a small car, with a doll’s house attention to detail. It’s a five-seater, though the back row is rather tight. The boot, however, is unexpectedly roomy and has a useful removable shelf.\nThe “Virtual Cockpit” – Audi’s term for its digital dash – is a delight. You can select from several screen displays and all command prompts come with a mixture of easy-to-hit buttons. You can also add full smartphone connectivity.\nA car this size is a great opportunity for you to sidestep a diesel engine and its attendant NOx emissions, and go for a petrol unit. The clean-burning 1-litre 116bhp three-cylinder turbo is the smallest in the line-up but offers plenty of what Audi calls “go-kart feel”. That’s the last thing I want in a sophisticated drive and the description does the Q2 a disservice. It’s a real QT – light, smooth, nimble and surprisingly composed on the motorway.\nThis baby Audi offers big car comforts in a small car frame. Or, as Adam said: “It’s a little guy that punches above its weight.”\nEmail Martin at martin.love@observer.co.uk or follow him on Twitter @MartinLove166\nTopics Motoring Wheels features Reuse this content", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nO.wz1QD3H399q7pn7t3U3C7ucqXZ64fzxv68CzkPu0kBKA4IA0CkOjyzN6jbSFAOmTPbb7ncc3SOoeIH8CmWIw--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T10:11:03.000+03:00", "language": "english", "title": "Audi Q2: car review | Technology", "thread": {"title_full": "Audi Q2: car review | Technology | The Guardian", "site_full": "www.theguardian.com", "site": "theguardian.com", "site_section": "http://www.theguardian.com/us/technology/rss", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 27, "shares": 27, "comments": 0}, "linkedin": {"shares": 3}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "news", "spam_score": 0.0, "domain_rank": 170, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Technology | The Guardian", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nO.wz1QD3H399q7pn7t3U3C7ucqXZ64fzxv68CzkPu0kBKA4IA0CkOjyzN6jbSFAOmTPbb7ncc3SOoeIH8CmWIw--", "published": "2017-04-16T10:11:03.000+03:00", "title": "Audi Q2: car review | Technology", "uuid": "3c1620fc2e5cfc966a5025b651115f8b48dbd60c", "main_image": "https://i.guim.co.uk/img/media/0ed74842cb5dce7a0ebf5c01e2f0b04db9ee0239/1113_716_1807_1084/master/1807.jpg?w=1200&amp;h=630&amp;q=55&amp;auto=format&amp;usm=12&amp;fit=crop&amp;crop=faces%2Centropy&amp;bm=normal&amp;ba=bottom%2Cleft&amp;blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&amp;s=0ca02d7e55cc9c3229624593ff5e6c26"}, "uuid": "3c1620fc2e5cfc966a5025b651115f8b48dbd60c", "ord_in_thread": 0}]