[{"entities": {"organizations": [{"name": "cba", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}, {"name": "nazi", "sentiment": "none"}, {"name": "social security", "sentiment": "none"}, {"name": "nikko", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "wwl", "sentiment": "none"}, {"name": "wal-mart", "sentiment": "none"}, {"name": "lsu", "sentiment": "none"}, {"name": "byu", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "lecce", "sentiment": "none"}, {"name": "la", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "toledo", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "persons": [{"name": "doug sunseri", "sentiment": "none"}, {"name": "capel", "sentiment": "none"}, {"name": "herbert hoover", "sentiment": "none"}, {"name": "debbie bielsa", "sentiment": "none"}, {"name": "wellman", "sentiment": "none"}, {"name": "handel", "sentiment": "none"}, {"name": "katie", "sentiment": "none"}, {"name": "robert", "sentiment": "none"}, {"name": "estes", "sentiment": "none"}, {"name": "erica", "sentiment": "none"}, {"name": "charles", "sentiment": "none"}, {"name": "don", "sentiment": "none"}, {"name": "benson", "sentiment": "none"}, {"name": "toms", "sentiment": "none"}, {"name": "alice", "sentiment": "none"}, {"name": "marty", "sentiment": "none"}, {"name": "terry mckay", "sentiment": "none"}, {"name": "carolina", "sentiment": "none"}, {"name": "i. ollie", "sentiment": "none"}, {"name": "allen", "sentiment": "none"}, {"name": "caroline", "sentiment": "none"}, {"name": "cheryl jamaal tinsley", "sentiment": "none"}, {"name": "ron", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "ken", "sentiment": "none"}, {"name": "hadley", "sentiment": "none"}, {"name": "ian", "sentiment": "none"}, {"name": "paul moscow charlotte", "sentiment": "none"}, {"name": "jerry", "sentiment": "none"}, {"name": "bakken", "sentiment": "none"}, {"name": "quincy", "sentiment": "none"}, {"name": "terry", "sentiment": "none"}, {"name": "edward", "sentiment": "none"}, {"name": "albert nicaud", "sentiment": "none"}, {"name": "joyce", "sentiment": "none"}, {"name": "clark", "sentiment": "none"}, {"name": "kristi", "sentiment": "none"}, {"name": "tallulah", "sentiment": "none"}, {"name": "mark waugh", "sentiment": "none"}, {"name": "denon", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "neal", "sentiment": "none"}, {"name": "allison", "sentiment": "none"}, {"name": "woolsey bach", "sentiment": "none"}, {"name": "diallo", "sentiment": "none"}, {"name": "damien", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "julie", "sentiment": "none"}, {"name": "ryan kim", "sentiment": "none"}, {"name": "leo", "sentiment": "none"}, {"name": "manson", "sentiment": "none"}, {"name": "chris jones", "sentiment": "none"}, {"name": "nam", "sentiment": "none"}]}, "uuid": "3c636b6d4affa07ed0c8399e19657506463e8d7b", "highlightText": "", "title": "04-16 9:10 am All Things Legal", "thread": {"site": "wwl.com", "country": "US", "participants_count": 0, "site_full": "media.wwl.com", "section_title": "", "uuid": "3c636b6d4affa07ed0c8399e19657506463e8d7b", "site_section": "", "domain_rank": null, "main_image": "http://media.wwl.com/hosting/media/wwl/1643136/legal150.jpg", "performance_score": 0, "published": "2017-04-16T08:00:00.000+03:00", "url": "http://omgili.com/ri/2wGaacqxApuhzrWjBfqlV.QhLiaONGCCyfNNwWmYDUFv1f3xSUNkGZsT7aI1.36yCu1.Udf3t4ziD2dxYwX_HrMcsyYIO5J7", "title_full": "04-16 9:10 am All Things Legal", "title": "04-16 9:10 am All Things Legal", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.169, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T08:00:00.000+03:00", "url": "http://omgili.com/ri/2wGaacqxApuhzrWjBfqlV.QhLiaONGCCyfNNwWmYDUFv1f3xSUNkGZsT7aI1.36yCu1.Udf3t4ziD2dxYwX_HrMcsyYIO5J7", "ord_in_thread": 0, "crawled": "2017-04-16T22:34:42.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "", "text": "04-16 9:10 am All Things Legal Apr 16, 2017 | Doug Sunseri discusses legal issues and answers questions from WWL callers. Related Audio: Doug Sunseri and Albert Nicaud discuss legal issues and answer questions from WWL callers.   \nAssessing the person's legal matter often requires extensive interviews reviewer of contracts and documents and research of the current state of the law on the issues involved. As a result the information provided by the attorney suggested all things legal is given for informational purposes only. It is not to be construed as legal tax investment or other professional advice communications with the attorneys on this program with a verbal our digital do not create an attorney client relationship. Hey we're back ducks sincerity all things legal with our daughter pursue a law student. Case and Jerry were having a family addition while things legal so happy resurrection day. And fiscal 260187. Here Texas and 87870. Answered legal question I'll answer and the inaugural Katie about it I'll be obvious. Professor on the ninth beat nicely. And well couple things up at practice sports just for so our first thing. LSU. Baseball. Is then today the series and yes so we can just enjoy our families with oh QBs bought it way right. Number two. A 137. Days so opening day for LSU vs BYU. Scenario. Now do you okay come. Now when you when you're that we had done and our shore and on Saturdays we had a routine. A top volume in the backseat. While my Wal-Mart the free cookies with Allen and all the samples this move free samples. And then they do in your middle class on an archery at Wal-Mart when he went he'd probably Isabel is cheap sugar. Ryan Kim alluded LA when you take some of you know mom she's really appreciative that that there. While the Tug on that happen and then we'll get the popcorn at the at it's places that it's a goodwill placed now that you could she basketball's. And then. There's two things on a radio in the spring. You'd be supporter LSU baseball the unity still around that is the analogy baseball prompt. Because they play sixty games and then they play. Pup for five games and risen to 84 games this in the regionals. 23 games super regional and then in the World Series with almost seven hearing games that a lot of games so. That's our guests are subjected you to know she baseball Europe on the TV viewers this team here that's right. Now on one question. You are you a letter format stand. Courts the big question will be if he's on the board when the saints picture they picked them. You do I think. I mean I think he's too. Once a generation power then I think it works a lot of different levels. That's close that I know they made a freshman. One person. And that allowed human person master trying to upon them you know this is. And all of and you might try to clip so happy predators and that and so it's odd get a tax sales or let a four part that. 400 New York to win squadron and so excited. So. She waves ways you like it. Now also. It we on a grand while ran across the class that. Great event when great man. And many interesting idea there is it's just new wall enemies use you right now as an additional notes humans. Now this is what I did it through race. I found every police officer one. And I thanked him for this service so like Ron outlook. On this off Europe to man thank you very much they do great job thank serves as amazing now. You know they you know I think she's appreciative yet they are they were really some horrible really liked caught off guard and non. So. At that you know. With rotting try to you know you try to distract you Celtic to a certain extent that you don't think about thinking about sports is trying to get to raise so. Kudos and a and a PD I mean they just kept order that you such wonderful job Kristi classics Marty raw. It is always something is always is it possible is something every. Is about additional please where's it. Please fields in an you do fantastic job and under some pervert difficult circumstances so. Sport talk. In waltzes the only place you Chris Jones he's super. Wood on the city would that. It's this day this is that you know its its I guess it's French courts than on Easter witches. Interest in itself. OK let me ask us where you work for me this summer. I. Am now. Mean and it does now I'll be so who work and salaried pay ala you about Utah actors all right let me Estes. What do you find it Tuesday I mean he works at the used to work performing in Europe maybe. Fourteenth fifteenth in the well often receptionists. Seven. Organized papers. Would would you find interest. As four proxy line and. With you know would. You know all that permits a little different is you know reduce so many different things were were were Clark will Mark Waugh would like a mini Wal-Mart right so it gives it its its really good shakes hands on experience for someone news media looking to the locker. From my situation is really great pit exit do you still double semi different hats and it's dees mean different things and give it a success in monitors. Just the panel on it to him in line there's you know people who means there's personal injury would we ever master Edward. It's a different where is it and in some friends of mine approximately experience in Moscow now and they've only been working media one firm because one thing would be just a personal injury just you. One kind of deal suit you know they don't have a blood expert or anything else I really always like at a kind of Hadley. The united is always had to learn a different avenue way different. Route for all our different subjects that we handled as we really handled. So many different things it's kind of an overwhelming bay it's fun at the same time the kind of keeps a different you know it's not an honest right. It's it's it's sought changes with the need woody woody woody woody findings saying. As far as. It if you check may be at peace on to I think I'd like to do and be good. I like when we do it I guess I guess. Like injury claims that like to do all that medical stuff I have to go on is a little bit of a mind efforts that so I like to do all the calculations. In. I like to get thrown at a crackers I find it there and seeing some people finance boring but. For me I kind of think it's interesting I think is and seeing like. All the different avenues of procedures and all the medications now it would start today you get a lot more versed in the language. So that's easier and easier balance on eighty. Ned now are renewed. Either way cleanest and I thought that might be interesting but down all the things interesting but that's something I understand that I wouldn't think I would have found interesting on top editors dry habit actually quite. Today is a lot lot that's document intensive. And so like in a lot of issues you have an a personal injury case is he might have someone who's. Late fifties early sixties he'd gotten car commander to back. And in the issues. Where was back before the accident you know how was a function and and has exacerbated there always agree with something with something else there before. And and then figured out because. Figure out. You know the deed to the extent it was damaged due to the. Little bit of its little bit of a medical and financial puzzle to put together a kind of like that puzzle which I yakking that's why the eighty succession. Would be kind of media rally is wild sky and really structured type of law. Now eyes and he is interesting you brought that up because we're talking about money host an axis. The baby boomers or nineteen point prop 1962. And it came in right in the world war two and all the servicemen. We're coming back in World War II an assortment pampered at a certain. Missed or why is the couple dynamics occurring first I don't know they were tarring. There there. They are living longer. And you have a lot of interesting issues that are associated with. Maybe I'm living. It just means assisted living and longer and then you got issues regarding. Managing. Baby boomers when they start experience in age related injure. Illnesses that his. The man Charles timers. And how to deal with that from a legal point. And so in and also to. There's a lot of litigation. Regarding and you know unfortunately. Lawyers can be proactive as you now with wills I think you'd be very good with wheels because that's like a puzzle. It. Does because what they do is. Is summarizes these mine needs. How rely address those in my state. For example if someone says for all children. One adult children is very responsible. It's. News you know experienced some problem you know fourth child. He's got some real chemical dependency problems but I want and be taking care but I don't want to do away. That for the sector did dependency problem. And trying to beat it only gets you to outline Friday a lot of too much freedom ticking and responsibilities. And so how do you how do you address that. Does issues. And get it down and writing. And if people overseas you know trustees oversee drugs or whatever you need in RT accomplishes objectives. And but on the other hand as well be proactive in and we always deal with the disputes as I think they say that. They say ministers see people at their best. Doctors Ian sees them as they are in the hours the American horse. A lot of people that's in the worst on their lives especially when it on through. Tragedy. All our dream injury. That are -- wars and he even for even. Like war in this state where you have tragedy someone dying or loss. And then you hit the children and fighting. That's like a double whammy. And you a lot of will mining is in this is something it probably gonna impact when east you'd you'd generation practices. There's actually more cases. Of elderly abuse and financial exportation is oddities that that there's. Some that's the owners actually. Use. And it. And that. A lot of you know issues you might have a child to him to call time and why parent gets up and age all in pounced on him and dimension and Allison which appear to let me take care you mom and dad. And in the house than they get into the pocketbook and checkbook and yet things those type situations that we city. It's not the normal situations. No will we see via normal situation. Was so all right let's go let's go to break that sincerity case since there helping legal will win right back after this brief time out they were factored sincerity with Katie since area. First year law student. You can also. Call so law firm Nikko instance area Bible 48371304. Probable 4837. 13 old war and you know if if Debbie bielsa has me in three years but honestly think he can handle so. Manila to announce her mom or your graduating for years pregnant. In a little bit more. Accredited credit market acted you know may be taken a couple of officer uses oh she went on a road ever. It's Alabama and nice retirement job for you. All right let's go to tax. She is too. How many times. How many types of power attorneys exist. My mom is 86 with the recent diagnosis of dementia are caddie Steve and now a mansion this upon returning them okay how long does that last. I mean until. In Toledo until you die until it's revoked rates. There you go so the Erica he got a it on and on that. On you attack Damien eight plus it's Tallulah does polity do they apply it I guess it plus they do at the mine is scale. The minds of LA plus name on the legacy it's a C plus which filled a special. All right to OK eight day. Day is planned a KE you know he's done any power over attorneys I mean with type par returns they have also I don't actually take. Take succession and estate. And non cut and so are an employee actually is several type degrees apart return you can have power over tourney just for financial. You give proper attorneys for our health care or you can have a power overturning. It basically. Entailing giving someone authority to do all your day to day activities so you can limited. Or extend to the full extent that you want now the issue about dementia he she like medical stuff you're saying that. One a heart parts but dementia is. There's no extra day is no objective way determine if someone has dementia you have to do it based on subject of occupation and our own thing. And by Toms now dean can be taken about capacity having capacity to entrant to or will or improper turn yet. I mean we've gone through like the you can saying in you know we strive classes meaning similar similar and you consent dress all the things that come into play for. Contract on I think as far as that's concern apology and more of our state if such as custody in the fall prize of uncover them because in which you have to have is minority XEQ like who will or proper turning you have to have the cognitive capacity to understand. The consequences. Year. Actions or understand the terms and conditions in some cases where we had a client who we weren't quite sir sometimes it release it and I was there in an outstanding. It is sometimes it came back and they can tell you they're Social Security elder during kids' names that sometimes they get out again and it mean if I was Christmas they'll. You know we've deathly than their situations are headed. Price determined that in a call that this two things they called loose in bills but the doctors call it pockets of recall another words they're out of it. And then day in it. And they understand what they're doing and then go back now. Now one question one thing to find out succession is just because if there if there in it. And ahead cognitive capacity to make the decision but it's a bad decision. It's still legally enforceable and so that the differences. In who is easily our decision it's an informed decision and and as to what they're doing even though it may be horrible decision. So that's one is cheeses is does that person have the cognitive capacity dementia. Is very difficult to determine so we'll talk over about this after the break we going to. Case CBS news update that go to local local news with Don names and will be back on his resurrection day April last half an hour haltingly so we'll see in a couple of minutes they were back Texan Terry case and Terry all things legal because also offer probable port 371304. And we're talking about arbor attorneys with ally great turns to. Listen to listen. He brought up a point about. Power of attorney can be done to do is something for specific purpose. Like a real estate transaction or. You know someone's out of town on available that you want someone to stand in or you can do. Limitations for turning to an easy maybe some did just directs her new year. The finances there you can you can limited. To whatever you wanted to be launching next expressed terms and it's inching dementia. Talk about dimension to. That's that's one of the things that your generation of turned that deal with because of the baby boomers who going to be living longer. Is trying to figure out someone has the cognitive capacity. To have made that particular decision. Team I have a situation where mom and he were merit at sixty years to five years. One of them you know. Mom dies and it up in age. And remarriage to someone. Whose. Allies younger. And then he decides to give his entire parents season. Do you live during a time period that season questionable health. Those and Connie issues. That it probably happened more more. You know as fourteen mitigate this concern and in Blended Families are getting more more what it says edit the lines are kind of as far as new. And inherited and that takes a special skills to this to figure out how to accomplish all the objectives and I'll also all the emotional objectives also. Let's go to Paul Moscow Charlotte's got a core I guess comment about the show hey Cheryl Jamaal Tinsley with the ex intern case in serie. Yes. I don't know. And joy into your program. And the polls and think. Not much disappointed because at least it. But maybe it is not generation that does listen to is I've been to college full. But on the amount of there and didn't make a profit and I'm Julie program from eight to ten. And almond joy it was indicating it's. It's very informative very formative. And just one question in India and it was everything to Colin for. Now that's that's that's very sweet Caroline wish a happy resurrection day. That's very very very kind comment I make my coffee and listen entail the united. Well all the reasons we we kid about that is because. And just not so much shows specific but it's generational license does that it is foreign maligning used to not listen. Took a lottery ago I mean that's one of the challenges ivory is gonna have and future is. Is connecting with them but. They're probably not at the time in their lives they're really in need a lot of legal. Assistant if it did it in and that's why we kind of with him the kind of green the meals because like when we like especially. You are younger kids the younger siblings. Went out tomorrow in Allen L. You know bill meant to comment Tennessee's show and it indicates just relies narrow. You know people my age now and about you young and hip you know tell me that sir but billion another round. Policies. I guess another aspect. You know. Millennial is that you have a com. Pages. You have a different. Habit I guess his habits as forest a lot of on radio. It is. We'll seek when he seek information they don't on that front think radio unity day. You know it probably I and then it's it's probably will frown upon that promise in the miss that he receive their news is a steep probably piston links on FaceBook. And they're like oh what's going on and they complained and that's kind of how most people stay informed on. You know maybe not my generation perceive that made a couple of years younger than me where they're used to have analysts are in technology no mean an I may. For sharing and she's always on the things that and that's how she finds out about things and if I say the minutes and economical political issue Shillue like solo thinks that you know sent a Tutsi and out. Yeah let's go to phone launch we got a tax question now this is one. Will Woolsey Bach and Handel I don't know what good tax question with AJ AJ you and I'll think glee with Texans are encased in serie. Yet. How candy day. Go back and take taxes out. It. That. I would give up. As you know. Like. Yours hey no problem. But. From this state tax on the same. I didn't. Big account all our fuel hundreds well not much but this just about 2000. From 20012002. It means that we haven't seen that. Suddenly they're a column about on about Tuesday's you know this year they take a portion of my my refund. Well. I tell you Wellman dues it is CPA listening. As I I don't know that answer and it seems to me I have to news I'm not sure how or tactics ago. As far as private tax. Back taxes day before you. And I know it's tax week and I'll tell you at the CBA's listening. In the army our tax attorney. I would Arctic in texting I'll let you know aren't. Our. Excellent call AJ let's go to break Texan Terry case and they're helping single will be right tactic has become a were back Texan Terry McKay since Terry all things legal. Wish and everyone out there a happy Easter happy resurrection day this is the this is the big holiday for us. Christians and Nazi judges have a blessed day at blustery with a balance. As we are celebrate with their parameters from memoir now we've which they're really represents. And god you know discount bus everybody. We talk a little bit about Robert turning and succession plan. One of the unique problems regarding. That's going to occur with the baby boomers coming ages. Whether. Certain type transactions said that maybe someone who's older and is not flee Capel understanding. What they're doing is. I did they have the full cognitive capacity. Two and turn into certain type transactions and what is things who we do and his lawyers which are different. Is. Which you know if we're in a situation. Where someone is. Any questionable. Like and a sort of declining health and they want to enter into a trap a legal transaction. Involving the will. Or disposition of property. And you you understand that this decisions on hale. Legal consequences. Where some family members are not going to be happy. Tom says something we use and Katie is is technology. And is is. If for example if you excellent elderly. Who in doubt. We're sword and he is. Will that normally will do is will meet with the person. And talk with them and we'll sorry ask them questions. Now asking who the president. Presidents and they say Herbert Hoover . Would probably so maybe this isn't such a good idea. But you know what I think we're doing now is how I question now. And then now I ask why they're here. You know with today want to accomplish. And this is how proposed accomplishment and then ethic and I meet with you in a few days and we'll discuss it again. And then we do it the second time. A lot of times we'll I'll film on palm with our Smartphones which. You can't you could've done with Diallo right now because you've had been a dollop millennial. But and then so that when that becomes an issue. He that you can. Have a record now here's one thing now monologue Quincy here's what is one new technique people would do to make sure that someone. Signed to legal document that's going to maybe change course and you understand it's gonna. Maybe some of the family members may not be happy will would. Among thrown out he who be another good idea to. Team to like be able to have some independent evidence to verify that that person was in the right state of mind to sign this document. Cyclist how that we filmed you know a lot of video depositions. Kind of same. On the same lines when he can you can video Denon. Circumstance I knew we do sometimes we consult a physician. There you go a expert. Well a plus plus he guy is Leo I was I was I was a squid on that the if you if you come out of that memorial is listening to agreement. Yeah. If I was gonna ask you you for your professor was. I don't have any no we not do and that we got the only it's only fair to me off there. But. If bomb would not ask that you get a pause because which you do it is I think one technique used in the Benson. The stage they knew when this event that's on Sundays documents. It would be follow from and in each well and what he did was they signed the document on the same day once thought doctor. And it. Competence in the right. And so you can't sometimes price if you have a doctors and the I want to doctor that morning and now Carolina want to attorney's office and responding news news at cog in the past we understand. That is great evidence. To show. That you use you. The capacity to do that. That was good. I'm out I was I was I was struck out the airport now the answer and you got a little. Praise for her. If they. Well. Yet and I'm back and be worried about your favorite professor it will. Go out there. I. Ollie in Ohio olina one. Report I know I know. And Obama hard. And with our tort that's. Another and that pirate. But that's just me. He says that's not at you now though. Is. So we would OK here's now by this clash would as a toward. They ago. Like the one like the one achievement that liked it to three sentence version with two to the side. In somebody in that warehouse sister is at a at a that. Thanks and of the national strands there he noon a basically it's a pundit is something meant to punish her on compensate the the plaintiff for the person who's been injured and saying guess what you have two different types of claims sometimes you can do to the civil rowdy criminal round because commitment to different things. It's like if you do you sum to someone else and it causes damage. The process where we say in metric. So that he views be heard in if you if you do something. Because you know causes damage in the right competency. Whatever and injure injury is the fact one Alice at LSU faced being charged in Merrill deport department. And they used to have the hit 200 play football teams that it's meta name. And always remembered the name as a couple of names one I don't wanna say because it's Easter morning but. They call them that tort these yours. Which is a person who commits an action against someone else that may be actionable or some type of damage. And so last thought toward these are my. What is that and I ask say I mean would you not asked lemonade and as much law student who are very glad to educate me a lot more than I want to be on when it was but. All right let's go up by a brick that sincerity. A decent burial things legal we write back in his free time they were back necessary case and there are all things legal. Happy there at yours wrecks today. Couple slap you got exams. And when you perceived it sent him. We. Can't. You read which ones that that's torts and that's your paper up. They're. Out of a guy outages. In general is more interesting. That. It restructures its. Story it is an interesting mr. 995%. Lower rumors about sports. Park. I'll likely sentence him. Ports review. He's very he was he rates the towards the horse that's that's if he's at earth and on that and make it. Utah right now does everybody I detest. Now these days you get a choice you need or use via Microsoft where it's called axiom forced you can either it's basically soften it shuts down your herbal computers all you can do is type on and it just Odyssey was. On constantly so on. We can either use that that's written. The most popular choices that you Ken. Mean in context like I'm disappoint our missing element in my commandments gay talk about that. And kind of reader may answer the Bakken supplement that's why it's time that can chemist who can most people type fashion right now. I feel like I'm a slurs hyper compared to my class because there's a lot of younger. Kids and our clubs their you know I I think they're deathly more Agile on the keyboard than I am but I still think I still tight. Past and now what about are they haven't liked pitching individual rooms Lecce dictated then by voice recognition protest. I think her that I rely on from that any zinni be speaking answers I'll write as lasting AP via isolated but. Let's turn to say I guess to if you typed slightly easier read for the has eight generating usually deal passer an can kind of supplement edit there's. Would he do you would need do you I mean which are we got about a minute ago who would sure like technique to get ready. Firm for an exam you take one exam based on four months material grade do you would EDT. You did have a material so much and towards the end I'm really turn to finalize my my strategy. I'm just in case skeletal outline basically look I'm just I'm just kind of like siding down like main points that way I have something in my mind that's what I envisioned when answering that question of that's kind of how I prepare but honestly sometimes you don't this year in front of that computer screen Erie in the hyper and you just like. Sometimes you blink for second I like to really to my signing requests and I don't start typing. So that's just kind of my method. You know on the questions like the like. Long questions or you have a multi multiple parts and like anyone question might have eight through the year EB when you insert it and there might be like. Four but it's. This is like three hours is a mystery hours this this thing how to use it and the anonymous. One bite at a time national vehemently Neal saying thistle that's what. Well Manson. All right well. Thanks for common Joyce and these are with you you're just gotten very proud of you great daughter and Nam will do Afghanistan. All the countries are you brave brave audio there you go so law listeners I just have a happy Easter happy resurrection day we'll see you next week without an eco and actions aren't all things legal be good people us."}]