[{"entities": {"organizations": [], "locations": [], "persons": []}, "uuid": "43aa45ee375a6b0ef28f30d3259cfb2a7cc560f6", "highlightText": "", "title": "", "thread": {"site": "pjmedia.com", "country": "US", "participants_count": 28, "site_full": "pjmedia.com", "section_title": "PJ Media", "uuid": "ef97d2145e9e20ba17eb987fb71c3c0ff1ba30ef", "site_section": "https://pjmedia.com/", "domain_rank": 5056, "main_image": "https://pajamasmed.hs.llnwd.net/e1/news-and-politics/user-content/50/files/2017/04/AP_17082569506116.sized-770x415xt.jpg", "performance_score": 0, "published": "2017-04-15T19:02:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZSAQZoG.Zl5.6vemZe6HmN21mjlckC.N2ernW_Hl4eJ1NO5lwPVj.WRO6QNn1enuC5c2FD3rZR5GXkCVDNxRn1Nk5urm77JHgf1D8gV8Sv0aW0asceGWgLOqITEkNuDxgLDGZaQbt3cUWkY0bIjLMAd", "title_full": "Clinton: ’80s Drug ‘Sentencing Craze’ was ‘Way Overdone’", "title": "Clinton: ’80s Drug ‘Sentencing Craze’ was ‘Way Overdone’", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.002, "site_categories": [], "replies_count": 78}, "language": "english", "published": "2017-04-16T22:51:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZSAQZoG.Zl5.6vemZe6HmN21mjlckC.N2ernW_Hl4eJ1NO5lwPVj.WRO6QNn1enuC5c2FD3rZR5GXkCVDNxRn1Nk5urm77JHgf1D8gV8Sv0aW0asceGWgLOqITEkNuDxgLDGZaQbt3cUYa3BLXLncg3MdWDfz26Vy4-", "ord_in_thread": 74, "crawled": "2017-04-16T23:51:51.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Charlemagne", "text": "Some estimates are that the societal cost of the \"drug problem\" adds up to about $600 billion annually - that's the cost of enforcement, treatment, lost taxes/productivity, etc. It's a very large number, and bigger than the revenues of Apple, Google, Amazon, Facebook and Microsoft combined. On a per-capita basis, illegal drugs cost the average American about $2,000 every year.\nThe Federal government will spend over $31 billion on drug abuse programs in 2017, about 7% of the discretionary Federal budget alone. The States add another $28 billion at the local level. There's also an unknown amount of private money spent - insurance companies that pay for treatment and so forth. Point is, the US is spending roughly $60 billion on drug abuse, and getting very little return from that investment.\nAt different times over the last several decades, we've focused spending increases on enforcement, education and treatment. The sad reality is that there's no particular correlation between spending on any particular type of program and reducing the size of the drug problem. If you track that $600 billion number back to 1970, it's inched up at about the same rate no matter what we've done.\nCollectively, if the illegal drug industry were combined into a single company, it would be the largest corporation in America, some 25% larger than Walmart. Naturally, like any big operation, it knows how to attract customers, recruit salespeople, protect its supply lines and so on. And against this, we send in the usual government bureaucrat. Let's admit the obvious: the illegal drug industry is winning.\nI have no particular answer other than to suggest that it's time for a clean-sheet review of the whole situation. Many of today's programs exist so that self-serving politicians can spread the wealth to their cronies and can brag about being tough on drugs.\nLiberals will go for the heartstrings, talking about compassion and wanting to spend more on treatment or education. Conservatives will talk about law and order, spending more on interdiction, prisons and the legal system. Problem is, like LBJ's Great Society programs, these things might feel good, but very little actually happens. We've been hearing basically the same stories since the 1960's, and it hasn't gotten us anywhere.\nI, for one, am tired of one ineffective government program after the next, and the drug war is a prime example of wasting tons of the taxpayer's hard-earned dollars while achieving very little of value. It's 2017, and as we inch towards 20 trillion in national debt, it's time to rethink some of these absurd programs...either come up with something that works, or shut it down, legalize what makes sense and admit defeat."}]