[{"entities": {"persons": [{"sentiment": "none", "name": "unlik"}], "organizations": [{"sentiment": "none", "name": "stevia"}, {"sentiment": "none", "name": "weight loss stevia"}, {"sentiment": "none", "name": "national center for biotechnology information"}, {"sentiment": "none", "name": "fda"}, {"sentiment": "none", "name": "european food safety committee"}, {"sentiment": "none", "name": "stevia"}], "locations": []}, "text": "The Stevia plant with its ‘sweet leaf’ is a sugar substitute and also incredibly good for you. Unlike sugar, it doesn’t create an insulin response and actually nourishes the pancreas, which helps regulate blood sugar. The leaf is 30 times sweeter than sugar, while extracts are 300-400 times sweeter. This is good for the  sugar addict  as it will give sweetness without all the negative effects of sugar. 5 SWEET BENEFITS OF STEVIA Excellent for Diabetics Type 2 diabetic patients who took 1 gram of stevioside (present in the plant Stevia) with a meal had an 18 percent reduction in blood sugar according to this  study . A  study  that compared Stevia, regular  sugar  and  aspartame , showed that Stevia lowered blood sugar and insulin levels after a meal. Note:   Artificial sweeteners  often raise your blood sugar levels even more than sugar. Reduces Risk of Pancreatic Cancer Stevia has sterols and antioxidant compounds (kaempferol, quercetin, chlorogenic acid, caffeic acid, isoquercitrin and isosteviol) in it and studies have found that kaempferol can reduce the risk of pancreatic cancer by  23 percent . Helps Lower Bad Cholesterol and Increase Good Cholesterol A  study  in 2009 found stevia helps lower bad cholesterol and increase good cholesterol. Research also noted that the subjects had no adverse side effects from the Stevia on their health. Breast Cancer Reduced This 2012  study  found that stevioside helped to decrease specific stress pathways that create breast cancer growth. Great for Weight Loss Stevia has no calories or carbohydrates.  Consuming added sugars has been shown to contribute an average of  16 percent  of the total calories in the American diet. This high sugar intake has been linked to weight gain and adverse effects on blood sugar.  3 Extra Benefits: Fights Cavities:  The ‘sweet herb’ is antibacterial, and unlike sugar, it does not feed oral bacteria and is recommended by the  National Center for Biotechnology Information  to be helpful in preventing cavities. Stevia extracts were linked to  less acidic plaque , which is good for cavity prevention. Skin Care:  The antibacterial properties help with acne. I have experienced a pimple disappearing soon after using stevia on it. Fights Yeast Infections: Stevia does not feed candida or other yeast and is slightly antibacterial and anti-fungal. Can One Be Allergic to Stevia? The European Food Safety Committee after reviewing the S tevia literature  stated that there was no cause for concern for allergic reactions to the Stevia plant. Also, the  FDA  declared that stevia was safe in foods and beverages.  Stevia Caution Some Stevia extracts are so isolated that they have a bitter taste and so other artificial sweeteners have to be added. Some commercial Stevias have been extracted solely with alcohol solvents (usually the white powder form). This alcohol solvent leaves the sweet taste of the Stevia but can take away some of the health benefits. Highly processed “Stevia,” such as Truvia, is not real Stevia by the time it goes through refining. Chemical solvents are added during the refining process which includes  acetonitrile , found to be toxic to the liver and a carcinogen. ", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "44d66f0b51dc6dd36a5679165a01de671cfa83fa", "rating": null, "highlightTitle": "", "title": "Health Benefits of Stevia, The Sugar Substitute", "thread": {"country": "US", "site": "blogspot.com", "replies_count": 0, "title_full": "Health Benefits of Stevia, The Sugar Substitute", "site_categories": [], "performance_score": 0, "section_title": "Post News", "domain_rank": null, "uuid": "44d66f0b51dc6dd36a5679165a01de671cfa83fa", "main_image": null, "site_type": "blogs", "title": "Health Benefits of Stevia, The Sugar Substitute", "spam_score": 0.0, "site_section": "http://postnewsd2.blogspot.com/", "url": "http://omgili.com/ri/8HG_hanVOKw9p_eP72VnlJg1cgJu_ShG.qvYDapHZ1h5TG2DNFAwME5n2xqrJBoJ30hLb5_dK82OFGhN7Qt2y3cSOwIa5ysYax.XNqmg.cg-", "participants_count": 1, "site_full": "postnewsd2.blogspot.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:25:39.000+03:00"}, "crawled": "2017-04-18T11:25:39.000+03:00", "url": "http://omgili.com/ri/8HG_hanVOKw9p_eP72VnlJg1cgJu_ShG.qvYDapHZ1h5TG2DNFAwME5n2xqrJBoJ30hLb5_dK82OFGhN7Qt2y3cSOwIa5ysYax.XNqmg.cg-", "highlightText": "", "published": "2017-04-18T11:25:39.000+03:00", "author": "Refreshing News (noreply@blogger.com)"}]