[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:16:41.000+03:00", "author": "Yvonne (noreply@blogger.com)", "entities": {"persons": [{"name": "steven manchester", "sentiment": "none"}, {"name": "thomas", "sentiment": "none"}, {"name": "norman", "sentiment": "none"}, {"name": "carmen", "sentiment": "none"}, {"name": "stuart prendergast", "sentiment": "none"}, {"name": "tom prendergast", "sentiment": "none"}, {"name": "russell norman", "sentiment": "none"}, {"name": "baxter", "sentiment": "none"}, {"name": "prendergast", "sentiment": "none"}, {"name": "caroline", "sentiment": "none"}, {"name": "steven", "sentiment": "none"}, {"name": "john lennon", "sentiment": "none"}, {"name": "brian", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "caleb", "sentiment": "none"}, {"name": "salem", "sentiment": "none"}, {"name": "jason", "sentiment": "none"}], "locations": [{"name": "gooseberry island", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "milford road", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "salem", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "bet", "sentiment": "none"}, {"name": "massachusetts department of correction", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}, {"name": "providence book promotions", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "text": "Ashes \nby Steven Manchester \non Tour February 19 - April 21, 2017 \n\n\n\nBook Details \nGenre: Fiction\n\nPublished by: The Story Plant\n\nPublication Date: February 21st 2017\n\nNumber of Pages: 260\n\nPurchase Links: \nSynopsis: Middle-aged brothers Jason and Tom Prendergast thought they were completely done with each other. Perceived betrayal had burned the bridge between them, tossing them into the icy river of estrangement. But life – and death – has a robust sense of irony, and when they learn that their cruel father has died and made his final request that they travel together across the country to spread his ashes, they have no choice but to spend a long, long car trip in each other's company. It's either that or lose out on the contents of the envelope he's left with his lawyer. The trip will be as gut-wrenching as each expects it to be . . . and revealing in ways neither of them is prepared for. \n\nAt turns humorous, biting, poignant, and surprisingly tender, Ashes puts a new spin on family and dysfunction with a story that is at once fresh and timelessly universal. \n\nRead an excerpt: \nTom wheeled his late-model, platinum-colored BMW into Attorney Russell Norman’s freshly paved lot and parked between a brand new Lexus—sporting the license plate JUSTIS4U—and a custom pickup truck. Looks like I’m going after the hillbilly, he thought when he spotted the faded Massachusetts Department of Correction sticker in the rear window. His blood turned cold. “It must be Jason,” he thought aloud. I didn’t think he’d come.\n\nTom took a few deep breaths, not because he was nervous about his father’s death or talking to any lawyer but because he hadn’t seen his Neanderthal brother—for fifteen years, I think. He paused for a moment to give it more thought. Although their relationship had essentially vaporized in their late teens—the result of a fall out that still haunted his dreams—they’d occasionally wound up in each other’s orbits; weddings, funerals, and the like, enough to remain familiar with each other’s career choices, wives, and children. But even that came to an end fifteen years ago, he confirmed in his aching head before opening the door. While his toothache-induced migraine threatened to blind him, he took one step into the oak-paneled waiting room. His and Jason’s eyes met for the briefest moment. As though they were complete strangers, they both looked away. And here he is, Tom thought, disappointed. This is just great.\n\nThrough peripheral vision, Tom noticed that his older brother now wore a scar over his right eye, just above a bushy eyebrow that could have easily belonged to a homeless Scotsman. A jagged ear lobe, a piece clearly torn away, pointed to a crooked nose that sat sideways on his face—all of it rearranged since birth. What a big tub of shit he’s turned into, Tom thought, struggling to ignore his throbbing face and head. He’s as fat as a wood tick now, he thought, grinning, and he looks like he’s ready to pop. Jason looked straight at him, as if reading his mind. Tom immediately looked away, his rapid heartbeat starting to pound in his ears, intensifying his physical pain. Unbelievable, he thought. After all the years and all the distance, his elder brother—by only two years—still scared the hell out of him. He’s just a big asshole, that’s all, he told himself, but he still couldn’t bring himself to rejoin his brother’s penetrating gaze.\n\nThe secretary answered her phone before calling out, “Mr. Prendergast . . .”\n\nBoth brothers stood.\n\n“Attorney Norman will see you now.”\n\nTom walked in first, letting the door close behind him—right in Jason’s face.\n\n“Still a weasel,” Jason muttered, loud enough for all to hear.\n\n“What was that?” Tom asked just inside the door.\n\n“Don’t even think about playing with me,” Jason warned as he reopened the door and entered the room, “’cause I have no problem throwing you over my knee and spanking you right in front of this guy.”\n\nI’m fifty years old, for God’s sake, Tom thought, and he thinks he’s going to spank me? I’m surprised the prison even let him out.\n\nThe attorney—his hand extended for anyone willing to give it a shake—looked mortified by the childish exchange.\n\nTom shook the man’s hand before settling into a soft leather wing chair. Jason followed suit.\n\nThe room was framed in rich mahogany paneling. The desk could have belonged in the oval office. Beneath a green-glassed banker’s lamp, stacks of file folders took up most of the vast desktop. An American flag stood in one corner, while framed diplomas and certificates, bearing witness to the man’s intelligence and vast education, covered the brown walls.\n\nAttorney Norman wore a pinstriped shirt and pleated, charcoal-colored slacks held up by a pair of black suspenders. He had a bow tie, a receding hairline that begged to be shaved bald, and a pair of eyeglasses that John Lennon would have been proud to call his own. There’s no denying it, Tom thought, trying to ignore his brother’s wheezing beside him, he’s either a lawyer or a banker. He couldn’t be anything else.\n\nWhile Jason squirmed in his seat, visibly uncomfortable to be sitting in a lawyer’s office, his hands squeezed the arms of the chair. What a chicken shit, Tom thought, trying to make himself feel better. Peering sideways, he noticed that his brother’s knuckles were so swollen with scar tissue they could have belonged to a man who made his living as a bare-knuckle brawler. He’s still an animal too, he decided.\n\nAttorney Norman took a seat, grabbed a manila file from atop the deep stack and cleared his throat. “The reason you’re both here . . .”\n\n“. . . is to make sure the old man’s really dead,” Jason interrupted.\n\nIn spite of himself and his harsh feelings for his brother, Tom chuckled—drawing looks from both men.\n\n“The reason we’re all here,” Attorney Norman repeated, “is to read Stuart Prendergast’s last will and testament.” He flipped open the folder.\n\nThis ought to be good, Tom thought, while Jason took a deep breath and sighed heavily. Both brothers sat erect in their plush chairs, waiting to hear more.\n\nAs if he were Stuart Prendergast sitting there in the flesh, the mouthpiece read, “My final wish is that my two sons, Jason and Thomas, bring my final remains to 1165 Milford Road in Seattle, Washington, where they will spread my ashes.”\n\n“Seattle?” Tom blurted, his wagging tongue catching his tooth, making him wince in pain. Quickly concealing his weakness, he slid to the edge of his seat. “Oh, I don’t think so,” he mumbled, careful not to touch the tooth again.\n\nJason was shaking his head. “Hell no,” he said.\n\nThe attorney read on. “I’ve always been afraid to fly, so I’m asking that I not be transported by airplane but driven by car.”\n\n“No way,” Tom instinctively sputtered.\n\nJason laughed aloud. “This is just great. The old bastard’s dead and he’s still screwing with us.”\n\nThe less-than-amused attorney revealed a sealed envelope and continued on. “As my final gift to my sons . . .”\n\n“Only gift,” Tom muttered, feeling a cauldron of bad feelings bubbling in his gut.\n\n“I’m leaving this sealed envelope for them to share, once and only once they’ve taken me to my final resting place.”\n\n“What the fuck!” Jason blurted.\n\nEvery cell in Tom’s overloaded brain flashed red. Don’t do it, he thought. You don’t owe that old man a damned thing. But every cell in his body was flooded with curiosity. He looked at Jason, who was no longer shaking his fat head.\n\n“Maybe the bastard finally hit it big at the dog track?” Jason suggested.\n\nTom nodded in agreement but secretly wondered, Could it be the deed to the land Pop bragged about owning in Maine? He stared at the envelope. For as long as I can remember, he claimed to own forty-plus acres with a brook running straight through it. He stared harder. Could it be? he wondered, wishing he had X-ray vision. A parcel of land in Maine sure would make a nice retirement . . .\n\n“How ’bout we travel separately and meet in Seattle to spread the ashes?” Jason said, interrupting his thoughts.\n\n“Great idea,” Tom said, hoping against all hope that the idea would fly with their father’s lawyer.\n\nAttorney Norman shook his head. “I’m sorry, gentlemen, but your father specifically requested that you travel together with his remains to Seattle. Any deviation from this can and will prohibit you from attaining the sealed envelope.”\n\nThere was a long pause, the room blanketed in a heavy silence. Son of a bitch, Tom thought, this couldn’t have come at a worse time. He turned to Jason, who was already looking at him. “What do you say?” he asked, already cursing his inability to curb his curiosity.\n\nJason shook his head in disgust. “The last thing I want to do is to go on some stupid road trip with you.”\n\n“Trust me, that’s a mutual feeling,” Tom shot back.\n\n“But I don’t think we have a choice,” Jason added. “Our fucked-up father wants to play one last game with us, so to hell with it—let’s play.”\n\nThis is insane, but he’s right, Tom thought. With a single nod, Tom stood. “Okay, let’s have the ashes then,” he told the lawyer.\n\nThe attorney shook his head. “I don’t have them. They’re currently at a funeral home in Salem.”\n\n“Salem?” Tom squeaked, unhappy that his tone betrayed his distress.\n\n“That’s right. You have to take custody of your father’s remains from the Buffington Funeral Home in Salem, Massachusetts.”\n\n“You must be shitting me.” Jason said.\n\nThe attorney smirked. “I shit you not,” he said, throwing the letter onto his desk.\n\nSalem? Tom repeated in his head. Just when I thought Pop couldn’t be a bigger prick . . . The migraine knocked even harder from the inside of his skull, making him feel nauseous. Amid the pain, his synapses fired wildly, considering all this would mean: I’ll have to take bereavement leave from school and find someone to cover my classes. I should probably double my treatment with Dr. Baxter tomorrow. And what about Caleb and Caroline? he asked himself, quickly deciding, They’ll be fine without me for a few days. Then he pictured his wife’s face. And Carmen, she’ll be fine without me for a lot longer than that. The nausea increased. Screw her.\n\n“Are we done here?” Jason asked, obviously itching to leave.\n\nThe lawyer nodded. “I’ll need proof in the form of a video or a series of photos that you’ve deposited your father’s remains where he wished. Once I have that, the letter’s all yours.”\n\n“How wonderful,” Jason said sarcastically. He stood, turned on his heels, and headed for the door.\n\nTom also got to his feet. He looked at the lawyer and, trying to ignore his physical discomfort, he smiled. “Don’t mind him,” he said, shrugging. “That imbecile is exactly what our father trained him to be.” \nMy Review \nI’m a huge fan of Steven Manchester’s work, so I jumped at the chance to review his latest book, Ashes. The premise intrigued me even though it’s not a genre I typically read. \n\nAs I started the book, I wasn’t quite sure I would like it or even finish it. I didn’t particularly like the main characters. Each brother seemed to be nasty and not very sympathetic, but as I kept reading, my feelings had a complete turnaround. As I the story continued, I began to truly care about each character and saw what shaped their lives. \n\nI, also, had a preconceived notion of how this was going to turn out. I was sure it would have a predictable ending, but it didn’t. I was totally taken by surprise in the direction the author went. Readers kept learning new things about Jason and Tom with each chapter.  Each character has their faults but also some good things.  They are flawed people, which makes them real.\n\nI ended up not able to put this heart wrenching, emotional, realistic book down. This is a huge slice of life with characters you can truly care about. Steven Manchester did not let me down with this one. \n\n\n\nFTC Disclosure: I voluntarily reviewed an Advance Reader Copy of this book. I was not required to write a positive review. All opinions expressed are my own. \nAuthor Bio: Steven Manchester is the author of the #1 bestsellers Twelve Months, The Rockin’ Chair, Pressed Pennies, and Gooseberry Island as well as the novels Goodnight, Brian and The Changing Season. His work has appeared on NBC’s Today Show, CBS’s The Early Show, CNN’s American Morning, and BET’s Nightly News. Recently, three of Manchester’s short stories were selected “101 Best” for the Chicken Soup for the Soul series.\n\nFind Steven on his Website , on Twitter , & on Facebook ! \n\nTour Host Participants: Don't miss your chance to learn more about Steven Manchester & his book, Ashes! Visit the tour stops for interviews, guest posts, and lots of reviews! Don't Miss Your Chance to WIN Ashes! This is a rafflecopter giveaway hosted by Providence Book Promotions for Steven Manchester and The Story Plant. There will be 5 US winners of one (1) PRINT copy of Ashes by Steven Manchester. The giveaway begins on February 18th and runs through April 23rd, 2017. a Rafflecopter giveaway \n\nVisit Providence Book Promotions for more great reads! ", "url": "http://omgili.com/ri/7aBdisT0NOrw.dqx6SZAhgpjmtKkfEnFwZu5ejs.19_INKtQ4QLelVoGblZrATdG0KIoYKFapGDvHp.u1OLar_QdYl9W_.lXvuIz3WswoQrrpcI_LiyCYpUm4f3GLuBx", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:16:41.000+03:00", "language": "english", "title": "Blog Tour: Ashes by Steven Manchester (Review)", "thread": {"title_full": "Blog Tour: Ashes by Steven Manchester (Review)", "site_full": "socratesbookreviews.blogspot.com", "site": "blogspot.com", "site_section": "http://socratesbookreviews.blogspot.com/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 1, "site_categories": [], "country": "US", "section_title": "Socrates' Book Reviews...", "url": "http://omgili.com/ri/7aBdisT0NOrw.dqx6SZAhgpjmtKkfEnFwZu5ejs.19_INKtQ4QLelVoGblZrATdG0KIoYKFapGDvHp.u1OLar_QdYl9W_.lXvuIz3WswoQrrpcI_LiyCYpUm4f3GLuBx", "published": "2017-04-16T11:16:41.000+03:00", "title": "Blog Tour: Ashes by Steven Manchester (Review)", "uuid": "462f725642e6fc19891dbe68e622adf3930e67a6", "main_image": null}, "uuid": "462f725642e6fc19891dbe68e622adf3930e67a6", "ord_in_thread": 0}]