[{"entities": {"locations": [], "organizations": [], "persons": []}, "ord_in_thread": 0, "thread": {"site_full": "www.autopia.org", "site_section": "http://www.autopia.org/forums/forum194/", "domain_rank": null, "replies_count": 13, "country": "US", "section_title": "CAR DETAILING &amp; FINISH CARE", "title": "Review: Gyeon Bug & Grime Remover", "title_full": "Review: Gyeon Bug & Grime Remover", "published": "2017-04-17T06:05:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg90WXaPeBeIzu03bafladMomhXvGC_ieP4z_vvzMxkaTKZiDEGoiMImdkz9xNzBXrcYN3VcsaAT64MvR.tA3BOgKUntrdaJon3dQYYjGAfNwVTGAu9dnAIMKZsj64lQRpjMzFc4qNaGTQ--", "site": "autopia.org", "main_image": "", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 11, "performance_score": 0, "spam_score": 0.0, "uuid": "494a2f5c9a1ba1110a35ce99c8045e95fc9ea3b7", "site_type": "discussions"}, "title": "Review: Gyeon Bug & Grime Remover", "published": "2017-04-17T06:05:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg90WXaPeBeIzu03bafladMomhXvGC_ieP4z_vvzMxkaTKZiDEGoiMImdkz9xNzBXrcYN3VcsaAT64MvR.tA3BOgKUntrdaJon3dQYYjGAfNwVTGAu9dnAIMKZsj64lQRpjMzFc4qNaGTQ--", "author": "kevincwelch", "crawled": "2017-04-19T08:40:09.000+03:00", "language": "english", "text": "There are parts of the country where bugs are just a real nuisance and a problem for vehicle owners. Chicago is not among them. In 9 years of living in the Chicago area, I can`t recall any significant bug collisions on any of my vehicles that have required anything other than a hose and a good soak with whatever rinseless or 2BW I`m using to remove the stuck-on exploded biologics.\nWhen my wife took the kids on a road trip last summer to New York and came back with a grill full of nasties, I thought I`d get some bug remover for the next time she took a road trip. Well, over the past week, my wife took the kids to Little Rock, Arkansas to visit some friends and relatives, and when she came back a week later, the front end of the Highlander was pretty decently assaulted by insects, and they were splattered just about everywhere.\nNow, this is probably minor compared to what a lot of you Southerners experience, but for us here in the Chicagoland area, this is a lot of bug splatter.\nAs many of you know, I have become a fan of Gyeon, so I picked up some Gyeon Bug & Grime Remover not too long ago, and this was the perfect time to give it a test.\nProduct Description\nRemove bugs before they damage paint!\nGYEON Bug & Grime Remover is a powerful cleaner that dissolves bugs and grime before they can cause permanent damage to paint. This easy to use spray formula is perfect for removing more than just bugs too; use it for road grime, tar, road film, and other common contaminants as well. GYEON Bug & Grime Remover is safe on your vehicle, whether it’s been treated with and SiO2 coating or not!\nDriving down a bug-swarmed highway is never fun. Once you manage to get the windshield somewhat clean, you start to think about the dead bugs eating away at your bumper! When you make it home and it’s time to clean them off, don’t fall for one of those bug cleaning gimmicks, use a product that works, like GYEON Bug & Grime Remover.\nGYEON Bug & Grime Remover makes bug removal easier. You won’t need an improvised scraper or a coarse scrubber that could damage the surface. All you’ll need is a couple of sprays of GYEON Bug & Grime Remover and a quick rinse and your vehicle will be bug free! GYEON Bug & Grime Remover is essential for preventing the damage that caustic bug guts can cause.\n400 ml. I was really excited about this product since it is advertised as a \"touchless\" solution to bug and grime. Whereas other bug removers suggest that you spray and agitate with a special sponge, Gyeon has no such requirements and furthermore states that it is safe for your coated car, which is nice since the Highlander has C1/EXOv2.\nPrice\n$10.99 on AG and ACC\nReview\nThe instructions state\nSpray a moderate amount directly on the surface. Leave to soften the contamination. Rinse with a pressure washer and a large amount of water. DO NOT use on hot paint or in direct sunlight. Do not let dry on paintwork or trim. The product is also environmentally friendly.\nFrankly, I didn`t know how much was a \"moderate\" amount. That was problem number 1. I sprayed somewhere between what I thought was light and liberal. It then stated to leave the product on to soften the contamination. I wasn`t sure how long that should be, but on another retail website, it suggested 1-2 minutes. I was concerned about letting it dry on the paint and trim (it was in the mid 70s), so I let it dwell for about 2-3 minutes. It`s quite possible that wasn`t long enough, but after that time, parts of the paint were getting pretty thin and I was concerned the product would dry out.\nI did not agitate the product as stated on the label of the bottle (despite what some other website retailers suggest).\nHere is a video of the application and the removal, which was done with a high pressure hose (not powerwasher as suggested by the manufacturer).\nYou can see that after the spray, soak and wash that the majority of bugs, splatter and grime are gone from the vehicle. However there are some bulky nasties still present on the vehicle. It required a general wash to get rid of these remnants and they were easily managed by a chenille wash mitt and Rupes m101.\nSo, one could look at this two ways. From one perspective, after spraying the Bug & Grime Remover and hitting it with the hose, the vast majority of the insect splatters and guts were eliminated from the vehicle. Another way to look at this was that the product didn`t work entirely as advertised and required some agitation and physical removal.\nI decided to perform a simple test.\nOn the opposite side, I had a fairly equivalent amount of splatter and stuck-on Hymenoptera. I decided to blast this side with the hose to see if I could get an equivalent cleaning effect with just the pressure of the water without the Gyeon Bug & Grime. Here`s the video.\nAs you can see, the hose knocked off the vast majority of the bugs and splatter, but the Gyeon Bug & Grime did help achieve a bit more removal.\nOpinion\nGyeon Bug & Grime Removal is a fairly easy to use spray for bug and grime removal. Unlike other bug and grime removal sprays, this one is stated to not need any agitation or scrubbing. It is safe for coated cars. In terms of these two claims, I don`t fully agree with the first one. After the first test, there were visible components of bugs and grime still on the vehicle that were removed only with agitation during a full 2BW. However, it is clear that during the second test, water alone was not sufficient to remove the bugs and grime and that Gyeon Bug & Grime Remover did help. Even still, there was some grime left over.\nI`m not entirely convinced that this is a product that will consistently work without some agitation of scrubbing. It does help, but it may not be all that more helpful than water alone followed by a 2BW or possibly rinseless wash.\nThis brings to mind a post by Mike Phillips concerning bird bomb removals. He takes a microfiber, saturates it with water and leaves it on the bird bomb. The bird bomb comes off without a problem. Why are there bird bomb removal products at cost? Do we actually need bird bomb removal products, or is water saturation the key? Similarly, do we need a bug removal product or is water saturation the key?\nAnother interesting question to answer is whether this product is less helpful on coated cars. If coatings offer the best protection, special products to remove bug splatter may be unnecessary. More testing is required to answer this question, and opinions are invited.\nAt this point, however, I am not convinced that s specific bug splatter removal product is that beneficial.\n(In case you`re curious, the trim is dressed with 1 week old McKee`s Trim Restorer.)", "external_links": [], "highlightTitle": "", "uuid": "494a2f5c9a1ba1110a35ce99c8045e95fc9ea3b7", "highlightText": "", "rating": null}]