[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:39:11.000+03:00", "author": "Rick Perlstein, The Washington Spectator", "entities": {"persons": [{"name": "milo yiannopoulos", "sentiment": "none"}, {"name": "jim crow", "sentiment": "none"}, {"name": "bob owens", "sentiment": "none"}, {"name": "j.r.r. tolkien", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "kyle chapman", "sentiment": "none"}, {"name": "yiannopoulos", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "o’connell", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "oleg volk", "sentiment": "none"}, {"name": "richard carter", "sentiment": "none"}, {"name": "george soros", "sentiment": "none"}, {"name": "lapierre", "sentiment": "none"}, {"name": "moshe daniel", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}, {"name": "morgoth", "sentiment": "none"}, {"name": "augusto pinochet", "sentiment": "none"}, {"name": "joe public", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "pepe", "sentiment": "none"}, {"name": "volk", "sentiment": "none"}, {"name": "wayne lapierre", "sentiment": "none"}, {"name": "owens", "sentiment": "none"}, {"name": "nancy pelosi", "sentiment": "none"}, {"name": "kit o’connell", "sentiment": "none"}, {"name": "richard black", "sentiment": "none"}, {"name": "michael moore", "sentiment": "none"}, {"name": "madonna", "sentiment": "none"}], "locations": [{"name": "munich", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "bavarian republic", "sentiment": "none"}, {"name": "orange walk", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "berkeley", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "odin usa", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "morgoth", "sentiment": "none"}, {"name": "antifa", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "trumpland", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "centennial olympic park", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "wooldridge park", "sentiment": "none"}, {"name": "daly city", "sentiment": "none"}], "organizations": [{"name": "armed trump supporters escalate threats against progressives the right wing fear grows as armed trump supporters escalate threats against progressives", "sentiment": "negative"}, {"name": "catholic", "sentiment": "none"}, {"name": "trump pence", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}, {"name": "berkeley", "sentiment": "none"}, {"name": "university of california", "sentiment": "none"}, {"name": "maga", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "national rifle association", "sentiment": "none"}, {"name": "marine", "sentiment": "none"}, {"name": "battle of berkeley", "sentiment": "none"}, {"name": "israel defense forces", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "nra", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "text": "The Right Wing Fear Grows as Armed Trump Supporters Escalate Threats Against Progressives \"There are a bunch of people on the Internet who are waiting for someone to tell them it’s okay to start shooting at you.\" Comments \nPhoto Credit: allstars / Shutterstock.com \nAfriend writes, “For basically the past six months or so I’ve been trying to tell my lefty friends in so many words, ‘Hey, there are a bunch of people on the Internet who are waiting for someone to tell them it’s okay to start shooting at you.’” He became concerned when a thread at the non-political firearms-enthusiasts website he regularly follows became filled with comments in all caps referring to liberals as enemies who must be shot. Developments both online and off following Donald Trump’s election have caused me to share his concern. \nIn December, an author at the biggest and most explicitly non-political gun site, the Firearms Blog (its tagline is “Firearms, not politics”), recounted his experience with an outfit that offers tactical training based on the methods of the Israel Defense Forces. The moderator soon had to begin deleting comments. One that remains protested, “as if through the millennia, hundreds of nations, principalities and city-states reached the same conclusions,” and urged the curious to check out Judaism.is/genocide.html where one can watch the film Jewish Ritual Murder Revisited: The Hidden Cult. \nFour days after Donald Trump’s inauguration, a community member on a moderate firearms law site, PAGunBlog, a civil redoubt welcoming “active participation by both firearms enthusiasts and people who hate them,” described his shock from that morning’s web-surf when “a long-time commenter who I recognized as right-leaning but mostly moderate commented that ‘The Jews own and control everything in America…’ Not many months ago no one except a flaming neo-Nazi would have dreamed of expressing such an opinion, but today it seems to have become an acceptable element of our discourse. I noticed that no one replied to or castigated the comment.” \nThen came February 1 in Berkeley and things really started getting scary. \nThe saga of what happened when Milo Yiannopoulos came to speak at the flagship campus of the University of California has since become foundational, not just with the alt-right but with quite nearly the entire right. Alt-right provocateur Yiannopoulos was turned back by violent protests, which culminated in the burning of a portable generator. Stuffed down the wingnut memory hole are the events that preceded the mêlée. The violence was, in fact, preceded by peaceful protests by approximately 1,500 Berkeley students, until they were waylaid by a tiny handful of off-campus “Black Bloc” and “antifa,” or anti-fascist, cadres who believe racist speech licenses violent resistance. It was also preceded, less than two weeks earlier, by the shooting of a Milo protester in Seattle, by a gunman who has yet to be charged with any crime. \nThe Battle of Berkeley accelerated the construction of a body of mythology: the left has escalated its resistance to Trump into literal war, so Trump supporters must be prepared to resort to violence to oppose it. \nHow afraid of this should you be? The most interesting answers to that question do not come from the left. They come from concerned voices on the right, who’ve been monitoring the chatter with mounting alarm, going public with pleas to liberals to still the antifa renegades before bodies begin piling up. The most convincing evidence that they have a point comes in the ensuing comment threads, where the need to prepare for armed force is taken as gospel. \nThe proprietor of Being Libertarian, a Facebook community with 438,888 likes, wrote of Berkeley, “This was a riot,” and urged liberals to “BE LOUD” and renounce the rioters: “Conservatives are going to have a field day with this. If you just sit there quietly, you’re essentially letting yourself be associated with campus-pillaging barbarians.” He added, “You should consider yourself lucky nobody shot you.” \nClearly, this man knows his audience. The comment, “When someone has set your car on fire and is chasing you around with a blunt object, you get to make an executive decision regarding your continued existence,” got 1,403 likes. The conviction that this would be acting in self-defense was affirmed by the man who wrote, “these riots that have been occurring are what got my ass in gear to get the final steps of my pistol permit application completed. My unrestricted carry permit can’t come soon enough.” Someone reminded him a gun license “is not a license to kill.” His response: “Yes I’m aware. I just refuse to end up a helpless victim when crazy shit like this goes down.” \nOleg Volk is an advertising professional and Second Amendment activist based in Nashville. He wrote on a Facebook wall about the Berkeley events: “Rioting? That’s how you get Freikorps reenacting the demise of the Bavarian Republic with full approval of the majority of the population.” The Freikorps were volunteer paramilitaries set up by German World War I veterans that violently put down Communist uprisings, piling up bodies by the thousands; the movement officially came to a close in 1933 when Freikorps leaders surrendered their battle flags in loyalty to the Nazi command. Volk made it clear that he was opposed to such escalation. Commenters responding to his post were not. “Trying to decide if I will be unhappy or happy to don Freikorps attire. Then what to bring to the party,” said one. Others discussed appropriate armaments—“Ill see your 308 and raise you a 45-70” [sic]—until one Richard Carter trumped them all: “see you all that crap 50 bmg.” He was referring the .50-caliber Browning machine gun, a weapon useful for downing low-flying aircraft. After all, another commenter observed, “The Brownshirts are all liberals now.” \nAnother commenter offered a “Side note: Ever notice they don’t try that shit somewhere like Texas or Florida, where the odds are good that Joe Public will ventilate their asses when assaulted.” As it happened, one month later events provided a natural experiment to prove or disprove his hypothesis. \nMarch 4 was national “March 4 Trump Day.” It was also Confederate Flag Day—though whether coincidence or not is always a difficult question to answer in Trumpland, where what the president’s “respectable” partisans would prefer to keep hidden in the basement is only a dogwhistle away. \nA prelude to the March 4 Trump events played out on February 19, when a complement from the “III% Security Force” armed with rifles stood guard over a pro-Trump rally in Atlanta’s Centennial Olympic Park. The next day, National Rifle Association president Wayne LaPierre went online with a video advertising his appearance at the following week’s Conservative Political Action Conference. The video opened with the words “THEY COULDN’T HANDLE IT,” interposed with clips of Michael Moore calling Donald Trump a fascist and Nancy Pelosi intoning “white supremacist,” then the words, “SO THEY STARTED A WAR,” “AGITATION,” “INSURRECTION,” and “ANARCHY.” All this was interspersed with chaotic images of fire, vandalism, and Madonna at the Women’s March explaining, “I have thought an awful lot about blowing up the White House.” Thereupon LaPierre pledged the NRA would be the spearhead of the counter-resistance: “On Friday, February 24, we fight back.” \nThen in Austin on March 4, a blogger who calls himself Morgoth, after the J.R.R. Tolkien character often interpreted as a stand-in for Satan, filed a dispatch from the pro-Trump rally at Wooldridge Park, sprinkled with pictures of dudes with signs like the one featuring the alt-right iconic image of Pepe in a pilot outfit with the legend “FREE HELICOPTER RIDES” and the silhouette of a woman falling from the sky. “The only contribution we received from the Republican Party was some Trump Pence and MAGA signs,” he boasted. “Quite unlike the AstroTurf leftist protests where professional agitators are organized, bused in and often paid by shadowy group funded for George Soros or the Democratic Party.” [ sic ] Morgoth was impressed with organizers doing “everything possible to dispel the notion that Trump or his supporters are in any way racist. After all, speakers at the event included a black woman . . . and a Mexican woman who had just obtained U.S. citizenship. Amusingly, the Mexican lady’s speech was largely drowned out by long and raucous chants of ‘build the wall, build the wall!’” \nMorgoth estimated the alt-right contingent at 10 to 20 percent of the crowd. He celebrated their chants, including “Free helicopter rides for commies” and “One people, one nation, one leader.” He reported, “The Alt Right were well turned out, many wearing shirts and ties, well groomed, well informed, physically fit, and well versed in their arguments. They stood in stark contrast to the weak degenerates of Antifa . . .” He said the whole thing made him feel as glorious as when he participated in an Orange Walk—those marches where Ulster unionists would parade menacingly through Catholic neighborhoods to celebrate the 1690 defeat of Irish Catholics. He thrilled to what he claimed was evidence that “even mainstream conservatives” were moving “toward us.” \nHe also confirmed the accounts of about a dozen anti-Trump protesters that one of them, Austin radical journalist Kit O’Connell, received a concussion when he was smashed against a post by a former Marine after touching his flag. \nO’Connell was arrested and charged with a crime. The attacker was not. O’Connell’s assailant, wearing an American-flag windbreaker, carrying an American flag, and sporting two small American flags in his MAGA cap, can be heard in a video boasting, “He was so light, I thought he was a girl. But I hit him against the pole, and I felt sorry for him so I stopped. . . How do you justify attacking somebody with an American flag? . . .They went after my flag.” \nMorgoth’s blog post in praise of this fine patriot featured a screen grab of O’Connell’s Facebook message. Morgoth’s comment: “Here is a post of the glass jawed communist made on Facebook the next day showing him still in this hospital bed whining about his treatment at the hands of the fascist police state. You’d need a heart of stone not to laugh. . . . Antifa pussy, straight from central casting.” The screen grab contained the name of the hospital, should any local neo-Nazi—like the fellow who recently charged into an Austin anarchist bookstore and threatened to burn them out—wish to visit him. When I reached O’Connell by phone, he told me, “There’s a real feel in the Austin left, especially the far-left, that this counter-resistance is becoming frighteningly organized.” \nAnd why not? They believe they’re only fighting back. \nA Morgoth commenter who calls himself Gentleman Jim Crow praised the “virile young Alt-Rights clashing with clapped out retrograde commies. The future belongs to us.” Another commenter responded to that, “They will still escalate.” Morgoth himself wrote, “While looking for footage of the Austin march to accompany this post I came across this footage of the violence at the March 4 Trump in Berkeley, California. . . the Trump supporters seem to be more physically capable, but the weaker leftists are prepared to up the ante by introducing cowardly devices like tasers and pepper spray.” \nStudents of fascism will recognize the fantastical confusion of tropes: the enemy as a terrifying horde, raising the stakes ruthlessly beyond all civil bounds; but also the enemy as pitiful (“glass jawed”) weaklings—sometimes both within the same utterance. Such language is how students of fascism know that they are in its presence. \nI’ve seen the Berkeley footage Morgoth is referring to. That’s how I made the acquaintance of Stick Man. \nBerkeley’s March 4 Trump was organized by a man named Richard Black, who announced that members of the alt-right, neo-Nazis, and white supremacists were banned. Among those who did not get the memo were Moshe Daniel, who goes by the nickname “Kilt Man.” Daniel depicts himself on Facebook with a giant serrated knife and a T-shirt featuring the face of the late Chilean fascist dictator Augusto Pinochet, the legend “PHYSICAL REMOVAL,” and another of those silhouettes of people being dropped from helicopters—a Pinochet-favored method for dealing with dissenters. \nThe march turned into a “small riot,” as gun-rights blogger Bob Owens, one of the most widely read on the web, and a cool and clear-thinking moderate, described it after reviewing the available documentation. “Both sides came to this incident prepared for a fight,” he wrote, concluding it was impossible to see “who threw the first punch.” In my mind, however, there were at least two moments where the person who threw the first punch was starkly evident. In both cases it was an individual who wore all black, from boots to baseball cap, and carried a distinctive black shield emblazoned with a “V” for victory, and an American flag. The man in black also wore a gas mask, surely in response to a widely disseminated urban legend that antifas are routinely attacking protesters with pepper spray. In one video he whacks a downed anti-Trump protester with the long wooden stick he carries (with two tiny American flags attached, thus he can call it a flagpole). In another, he can be seen smashing his stick down so hard on an unarmed protester’s head that the stick breaks in half. \nHe’s since become a right-wing folk hero, and, after Berkeley police arrested him on several felony charges, naturally, a right-wing martyr. \nMorgoth declared an image of Stick Man in his getup to be his “picture of the week.” Wrote the proprietor of a blog called Ride the Bomb!, who calls his hero Captain America: “For those who are not aware, the Antifa jerks have been bringing flags to violent protests so that they can use the flag poles to beat Trump supporters over the head. This gentleman’s ‘flagpole’ was a great FU to all of them. My personal favorite video . . . shows Captain America breaking his ‘flagpole’ over the head of an Antifa member. . . . Let us hope now he understands that it was foolish to think that a beta male Liberal wussy boy like him who has never been in a fair fight in his life could brawl with men. I believe that going forward Captain America will serve as in [ sic] inspiration for us all. More than anyone else he will be remembered as the symbol of the turning point represented by the Berkeley ‘March 4 Trump.’” \nStick Man’s real name is Kyle Chapman of Daly City, California. On Facebook, he can be seen dipping bullets into bacon, apparently for use against Muslims. His favorite books include March of the Titans: A History of the White Race . He likes the Nordic-Germanic Front, Nordic Beauty, Soldiers of Odin USA, and RT. He also has a long criminal history, including felony convictions for charges that include robbery and grand theft. Following a crowdfunding campaign to aid with his bail and defense, he wrote, “The out pouring of support has nearly brought me to tears. I do not consider myself a hero. I’m a patriot that loves freedom and my fellow countrymen. I have long embraced my inner warrior as many of the warrior patriots that have fought along side me. Could not have done it without them. The decadence of the West has made us soft. We must reverse this if our republic is to survive. Let 3.4.17 be the beginning of a new revolution.” Among those who have joined the crowdfunding crusade is Richard Black, the organizer of March 4 Trump, who had banned white nationalists and the alt-right. \nBob Owens’s post about the March 4 Trump in Berkeley is entitled “Can Trump Supporters Legally Shoot Left-wing ‘Antifa’ Attackers?” He wrote it in response to a Tweet directed to him, noting a moment where three antifas got in three light kicks at a downed Trump supporter, asking, “Looks like lethal self-defense could be justified. Opinions?” Owens assured his readers this was indubitably not so. He reviewed California’s statute on the use of deadly force, which requires a shooter to “reasonably believe” he or she “was in imminent danger of being killed or suffering great bodily injury,” then to use “no more force than was reasonably necessary to defend against that danger,” and that “belief in future harm is not sufficient, no matter how greatly or how likely the harm is believed to be.” He concluded, “Both sides acted childishly and violently, but there was no violence that came close to justifying the use of firearms to stop a deadly force attack,” Introducing firearms, he wrote, would have been “frankly stupid, as you’re much more likely to hit innocent bystanders downrange than you are likely to hit the person you’re shooting at in such dense crowds.” \nTo which his commenters replied: to hell with that, we’re shooting anyway. They’re not ashamed. They use their real names, and sometimes list their hometown; and, in one case (a firefighter in a small Florida town), their employment, which I confirmed. Then, they say things like this: \n“[W]hen the law says you must die why would you care about the law.” \n“It’s far better to be judged by 12, then carried by 6.” \n“If you physically attack someone you can legally be shot. Doesn’t matter what Kool Aid you drink.” \n“[I]f a person, or persons, are a threat to you or someone else . . . Act accordingly to protect life. Everything else, including the target’s well being, is a by product that is not my concern.” \n“If deadly force isn’t reasonable then why do the cops show up armed???” \nAnd last but not least: “But let’s face it legalities put aside, killing these ANTIFA douches would probably make America a better place.” \nJust chest-thumping boasts? My friend, a liberal and a Second Amendment advocate, isn’t sure what to think. He hopes “they have jobs and mortgages and kids and so on . . . They have way too much to lose to start shooting at anybody.” \n“But then there’s another part of me that knows how men (and they’re mostly men) of this type are. When you have that much invested in some hardware, and they do have a lot invested as a percentage of income, then you want to use it.” \nMaybe it’s all just idle Internet chatter. But didn’t they used to say that about Munich beer halls once, too?", "url": "http://omgili.com/ri/jHIAmI4hxg_Gxjn1RB9fog8Xr9hmSdWNQufKdogVCDXiKlpPaIVPhSrUZV0hSg0qUNHfe40.wHIZbVf7NmPoY2h8T.vI5PYct00D.Y207HAi_BMDmd2lnPpkDyr.52T4qCxzP.2depYRtx7suDg.a0flpatHRqYU", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T01:46:00.000+03:00", "language": "english", "title": "Fear Grows as Armed Trump Supporters Escalate Threats Against Progressives", "thread": {"title_full": "Fear Grows as Armed Trump Supporters Escalate Threats Against Progressives", "site_full": "www.alternet.org", "site": "alternet.org", "site_section": "http://feeds.feedblitz.com/%7E/13965868/1fhppt/alternet", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": 5130, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "AlterNet.org Main RSS Feed", "url": "http://omgili.com/ri/jHIAmI4hxg_Gxjn1RB9fog8Xr9hmSdWNQufKdogVCDXiKlpPaIVPhSrUZV0hSg0qUNHfe40.wHIZbVf7NmPoY2h8T.vI5PYct00D.Y207HAi_BMDmd2lnPpkDyr.52T4qCxzP.2depYRtx7suDg.a0flpatHRqYU", "published": "2017-04-16T01:46:00.000+03:00", "title": "Fear Grows as Armed Trump Supporters Escalate Threats Against Progressives", "uuid": "4b433030b06ede72efe0bf1f205ae0c85315c2c0", "main_image": "http://www.alternet.org/sites/default/files/story_images/man_with_gun.jpg"}, "uuid": "4b433030b06ede72efe0bf1f205ae0c85315c2c0", "ord_in_thread": 0}]