[{"entities": {"locations": [{"name": "lexington", "sentiment": "none"}, {"name": "commonwealth", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}], "organizations": [{"name": "university", "sentiment": "none"}, {"name": "unm", "sentiment": "none"}, {"name": "office of institutional analytics", "sentiment": "none"}, {"name": "university of new mexico", "sentiment": "none"}, {"name": "sal", "sentiment": "none"}], "persons": [{"name": "sarah geegan", "sentiment": "negative"}, {"name": "victor hazard", "sentiment": "none"}, {"name": "tim tracy", "sentiment": "none"}, {"name": "greg heileman", "sentiment": "none"}, {"name": "tracy", "sentiment": "none"}, {"name": "heileman", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "uknow.uky.edu", "site_section": "http://uknow.uky.edu/taxonomy/term/12,24,13,16,17,102/0/feed", "domain_rank": 9151, "replies_count": 0, "country": "US", "section_title": "Legacy term feeds", "title": "Heileman Named Associate Provost for Student and Academic Life", "title_full": "Heileman Named Associate Provost for Student and Academic Life", "published": "2017-04-18T21:45:00.000+03:00", "url": "http://omgili.com/ri/Mx2PHH_4C22gVZrRDX_qbzKjfWehUG0_R7J2QAlAqa9zxFInajnmniNm1Jxu8kTKqF69x6WzFtjxXD_CiwoexwNplAF.rLazZUCjAH6DYr1jOUnbCucbhGzNLizO5qiYLNzJjDzdOOKsxTZW7VUuIBts8ZQiGdfS", "site": "uky.edu", "main_image": "https://uknow.uky.edu/sites/default/files/styles/facebook/public?itok=oeGJRDb1", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 0, "performance_score": 0, "spam_score": 0.0, "uuid": "4c20827b2baa52db31efe22d758780397333a4de", "site_type": "blogs"}, "title": "Heileman Named Associate Provost for Student and Academic Life", "published": "2017-04-18T21:45:00.000+03:00", "url": "http://omgili.com/ri/Mx2PHH_4C22gVZrRDX_qbzKjfWehUG0_R7J2QAlAqa9zxFInajnmniNm1Jxu8kTKqF69x6WzFtjxXD_CiwoexwNplAF.rLazZUCjAH6DYr1jOUnbCucbhGzNLizO5qiYLNzJjDzdOOKsxTZW7VUuIBts8ZQiGdfS", "author": "", "crawled": "2017-04-19T08:40:16.000+03:00", "language": "english", "text": "By Sarah Geegan Tuesday \nLEXINGTON, Ky (April 18, 2017) — Signaling a major step in the reorganization of academic success units, on Tuesday UK Provost Tim Tracy named a long-time academic leader in student success and support services to serve as the university’s new leader for student and academic life. \nGreg Heileman , currently vice provost for teaching and learning at the University of New Mexico, has been named the associate provost for student and academic life (SAL), a new unit reporting to the Office of the Provost. \nAs associate provost, Heileman will be responsible for supporting the university’s goals through vision and direction of the SAL unit. He also will serve as chief advisor to the Provost in recommending new university-wide initiatives and special programs that provide the right support and services across the four pillars of student success . \nHeileman also will collaborate with the provost, deans and other campus leaders to develop and execute plans and goals for SAL. His responsibilities also include coordinating policies and programs across the spectrum of student services to have the greatest impact on the university’s co-curricular and curricular goals. \n“We are thrilled for Dr. Heileman to join the UK family,” said UK Provost Tim Tracy. “He is a transformative leader whose core values of professionalism, quality and innovation will further fuel our ambitious goals related to student success. His track record of inspiring collaboration and excellence among student support units will serve him well as he begins working toward our shared vision.” \nSince the adoption of UK’s strategic plan in October 2015, the institution has begun focusing more intently than ever on student success, with the goal of achieving a first-to-second-year retention rate of 90 percent and a six-year graduation rate of 70 percent. \nTo that end, the Office of the Provost in 2016 began an extensive organizational shift to realign the number of personnel – and resources – directly working with and supporting students, while shifting administrative layers that inadvertently served as an impediment to a more integrated and seamless structure. \nAs part of that reorganization, two previous units – Undergraduate Education and Student Affairs – merged to create the new Student and Academic Life that Heileman will now lead. The SAL name better reflects the holistic nature of its role – to support student success in every facet of university life. \n“The   has taken a very intentional, data-driven approach to begin realigning student support units and initiatives,” Heileman said. “I look forward to building upon this good work, encouraging collaboration among the talented people across campus and executing a vision based on a simple, but profound goal: helping students succeed.” \nIn his capacity at the University of New Mexico, Heileman is responsible for collaborating with deans and other academic leaders across campus to provide leadership, coordination and administrative support for the institution’s teaching and learning missions. \nFor five years leading up to his current role, he served as UNM’s associate provost for curriculum, overseeing campus-wide student academic success initiatives, curriculum, university advising, curricular and co-curricular assessment, academic program review, institutional accreditation, the tutoring center and the Office of Institutional Analytics. \nVictor Hazard served as UK’s interim associate provost for student and academic life since the realignment began last year. \n“We are extremely grateful for Dean Hazard’s leadership and extraordinary efforts throughout the realignment process,” Tracy said. “His deep commitment to student success is evident to anyone who has the pleasure of working with him.” \nHeileman will begin his work at UK on August 1, 2017. \n\n\n\nUK is the University for Kentucky. At UK, we are educating more students, treating more patients with complex illnesses and conducting more research and service than at any time in our 150-year history. To read more about the UK story and how you can support continued investment in your university and the Commonwealth, go to: uky.edu/uk4ky . #uk4ky #seeblue Media Resources", "external_links": [], "highlightTitle": "", "uuid": "4c20827b2baa52db31efe22d758780397333a4de", "highlightText": "", "rating": null}]