[{"entities": {"locations": [{"name": "middle east", "sentiment": "none"}, {"name": "yugoslavia", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "federalist society", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "american enterprise institute", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "pentagon", "sentiment": "none"}, {"name": "national review", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "defense", "sentiment": "none"}], "persons": [{"name": "trump", "sentiment": "negative"}, {"name": "jonah goldberg", "sentiment": "negative"}, {"name": "jonah goldberg trump", "sentiment": "negative"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "bret baier", "sentiment": "none"}, {"name": "vladimir putin.it", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "leonard leo", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "neil gorsuch", "sentiment": "none"}, {"name": "larry kudlow", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "h.r. mcmaster.it", "sentiment": "none"}, {"name": "james mattis", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.unionleader.com", "site_section": "http://www.unionleader.com/section/?template=RSS?nocache=1?omniture=0", "domain_rank": 41865, "replies_count": 0, "country": "US", "section_title": "All Stories", "title": "Jonah Goldberg Trump is borrowing from the lame-duck playbook", "title_full": "Jonah Goldberg Trump is borrowing from the lame-duck playbook", "published": "2017-04-19T08:38:52.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_GbzPSD3e8vS.s8ZsXJjqEOa39DKxEQv9Z1tgEaE62tWCwDZYQERDPEygzt1z5lMt98wvgMBTcHsJEySy.XUsbcWEfGbXMHWIH7Qkd3w_vpNMIyYE9ZBqDU0vPdD6UrCKnKrSCX7B6Zg--", "site": "unionleader.com", "main_image": "http://www.unionleader.com/images/unionleaderlogo.jpg", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 0, "performance_score": 0, "spam_score": 0.0, "uuid": "4f42f186ee1ae558169389014cb5477f29469ea6", "site_type": "news"}, "title": "Jonah Goldberg Trump is borrowing from the lame-duck playbook", "published": "2017-04-19T08:38:52.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_GbzPSD3e8vS.s8ZsXJjqEOa39DKxEQv9Z1tgEaE62tWCwDZYQERDPEygzt1z5lMt98wvgMBTcHsJEySy.XUsbcWEfGbXMHWIH7Qkd3w_vpNMIyYE9ZBqDU0vPdD6UrCKnKrSCX7B6Zg--", "author": "", "crawled": "2017-04-19T08:38:52.000+03:00", "language": "english", "text": "Jonah Goldberg: Trump is borrowing from the lame-duck playbook By JONAH GOLDBERG One of the (many) things that makes the Trump presidency so hard to read is that the chapters are all out of order.Traditionally, during the transition period, Presidents-elect are out of the limelight. But while Barack Obama was still in the White House, Donald Trump announced “deals” and appointments that made it seem as if he were already in office, hitting the ground running to Make America Great Again. On the entirely subjective calculus of wins, he probably had more before his inauguration than any President.Conversely, the first 100 days are supposed to be a time of big domestic legislative achievements. Instead, they’ve looked more like the lame-duck period of a President’s second term.Once sworn in, rather than get a political honeymoon with the news media, Trump had an angry divorce. And instead of giving Trump a big gift-wrapped box of legislation, Congress has mostly given him the sorts of headaches Presidents have to deal with when they’ve lost their clout.The White House is touting its raft of executive orders as proof that things are getting done and promises are being kept. That’s a fair spin. Trump campaigned on repealing a slew of Obama’s executive orders and other “job-killing” regulations.But that doesn’t change the fact that Presidents usually turn to executive orders when getting big stuff through Congress is impossible and to prove they still have their mojo. Hence Obama’s famous quip in 2014 that he still had “a pen and a phone.”There’s another thing Presidents famously do in their second terms, when Congress isn’t interested in the President’s agenda: retreat to foreign policy. Ronald Reagan concentrated on dealing with the Soviets. Bill Clinton focused on peace negotiations in Northern Ireland and the Middle East and his air war in the former Yugoslavia. George W. Bush launched the surge in Iraq, gave a shot at Israeli-Palestinian peace talks and ramped up a massive humanitarian effort to fight AIDS in Africa. Obama’s second term was dominated by his obsession with getting a nuclear deal with Iran.And now President Trump, early in his first term, is trying the same trick. That’s because, according to many reports from inside the shockingly leaky White House (another feature of lame duck presidencies, when staffers look to their own political futures,) Trump is eager for “wins.” As Trump informal adviser Larry Kudlow told the Washington Post, “The President wants W’s — he wants wins.”His biggest “W” to date was the appointment of Neil Gorsuch to the Supreme Court, which came when he turned to seasoned pros who know how to get things done in Washington, namely Senate Majority Leader Mitch McConnell and Leonard Leo of the Federalist Society. His other big “W” was his missile strike on Syria, for which he also had seasoned pros to thank: Defense Secretary James Mattis and National Security Adviser H.R. McMaster.It’s early yet, but that strike, combined with Trump’s authorization of a massive bomb drop on an alleged Islamic State compound in Afghanistan, has yielded other apparent foreign policy W’s. China seems to be cooperating in the administration’s effort to squeeze the North Korean regime. Domestically, these moves succeeded in sucking some of the oxygen out of the media’s feeding frenzy over allegations that Trump’s campaign colluded with Russia and claims that he is a “puppet” of Russian President Vladimir Putin.It seems a fair guess that Trump’s response will be “more, please.” As Fox News anchor Bret Baier recently put it, Trump is “not that ideological. He is more practical and he is looking for W’s, wins. If you turn to the Pentagon and say, ‘give me some wins,’ they have got a long list of things that can produce W’s.”Trump’s sudden transformation into a foreign policy President isn’t necessarily sinister. Obama’s policy of “strategic patience” and “leading from behind” left a lot of low-hanging fruit for Trump to pluck.The question is, what happens when the list of easy W’s runs out? There’s little evidence that Trump is operating with a coherent strategic vision, which means that he won’t have a thought-out criteria for knowing when to say no to the generals he clearly admires. For a true lame-duck President, that may not matter — when the W’s run out, he’s out of office. For a first-term President who just acts like a lame-duck President, it’s another story. Jonah Goldberg is a fellow at the American Enterprise Institute and a senior editor of National Review.", "external_links": [], "highlightTitle": "", "uuid": "4f42f186ee1ae558169389014cb5477f29469ea6", "highlightText": "", "rating": null}]