[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:16:38.000+03:00", "author": "Jaime Castro (noreply@blogger.com)", "entities": {"persons": [{"name": "michel chossudovsky", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "uijongbu", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "united states  us", "sentiment": "none"}, {"name": "nebraska", "sentiment": "none"}, {"name": "tonopah test range", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "nellis air force base", "sentiment": "none"}, {"name": "hiroshima", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "offutt air force base", "sentiment": "none"}, {"name": "nagasaki", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "global research", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "dprk", "sentiment": "none"}, {"name": "moab", "sentiment": "none"}, {"name": "global security", "sentiment": "none"}, {"name": "us air force", "sentiment": "none"}, {"name": "nnsa", "sentiment": "none"}, {"name": "strategic command headquarters", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "nssa", "sentiment": "none"}, {"name": "pentagon", "sentiment": "none"}, {"name": "us department of defense", "sentiment": "none"}, {"name": "us senate", "sentiment": "none"}]}, "text": "\n\n\nBy  Prof Michel Chossudovsky Global Research, April 15, 2017 \n\nDouble Standards? Whereas President Donald Trump threatens to wage a preemptive attack against North Korea if Pyongyang goes ahead with its nuclear weapons tests, the NSSA and the US Air Force have announced the carrying out of tests of America’s controversial state of the art B61-12 gravity nuclear bomb. \nIn a bitter irony, the announcement of the B61-12 nuclear bomb tests (which took place a month ago at the Tonopah Test Range in Nevada), was made public on exactly the same day (April 13, 2017) as the official (“first time in history”) deployment of America’s “Mother of All Bombs” (MOAB) as part of a counter-terrorism operation against the ISIS in the remote highlands of Afghanistan.  \n\nIn practice, the deployment of the MOAB in Afghanistan was a de facto “weapons test”, a “dress rehearsal” in disguise for the subsequent deployment of the largest conventional “non-nuclear weapon ever designed” against underground targets in Iran and North Korea. While the deployment of the MOAB received extensive media coverage (focussing on the “war on terrorism”), the testing of the B61-12 nuclear gravity bomb was not considered newsworthy. \nDisinformation through omission: While the media has its eyes riveted on the “North Korean Nuclear Threat”, these tests of America’s nuclear arsenal are not considered “front-page news”. Why? Because the U.S. public is led to believe that America is NOT a threat to Global Security. \nMeanwhile, the West’s (non-existent) anti-war movement remains mum; nobody is challenging (or threatening) Washington for testing the functionality of America’s latest addition to its nuclear arsenal of more than 7000 nuclear warheads: The new B61-12 (guided) gravity nuclear bomb is heralded as an instrument of peace and global security. Pre-emptive nuclear war does not constitute a threat to humanity. \nNeedless to say, the development of the B61-12 is part of a multibillion dollar nuclear weapons modernization program funded by US tax payers. \nThe B61-11 and 12 are bunker buster (gravity) bombs with a nuclear warhead, slated to be used on a first strike basis under the doctrine of “pre-emptive” nuclear war against both nuclear and non-nuclear states. \nThe MOAB is also a high yield bunker buster bomb, with a conventional warhead and a “non-nuclear” mushroom cloud similar to that of a nuclear bomb. Both the MOAB and the B61-11 (which is actively deployed) are (“officially”) intended to destroy underground military targets (e.g in North Korea and Iran). \nAccording to the NNSA : \n\nThe non-nuclear [B61-12] test assembly was dropped from an F-16 based at Nellis Air Force Base. The test evaluated both the weapon’s non-nuclear functions as well as the aircraft’s capability to deliver the weapon. \nThis event is the first of a series that will be conducted over the next three years to qualify the B61-12 for service. Three successful development flight tests were conducted in 2015. \nPeace-making Bombs \nIn 2002, the mini-nukes were recategorized by the US Senate (2001 Nuclear Posture Review), cleared for use in the conventional war theater, thereby foreclosing once and for all the Cold War doctrine of “Mutually Assured Destruction” (MAD) which previously described the use of nukes as part of a doomsday scenario. \nThe B61 tactical nuclear weapons (mini-nukes) have an explosive capacity varying between one third and 12 times a Hiroshima bomb. Their use, however, following the US Senate’s 2002 “recategorization” would not require the “green light” from the Commander in Chief (aka Donald Trump). \nThe B61-12 has an explosive yield varying from 0.3 kilotons to 50 kilotons. While the test in Nevada was limited to evaluating the functionality of the B61-12, without the need for a nuclear explosion, this decision is nonetheless both “timely” and “significant”. It’s also an instrument of propaganda directed against the DPRK. \nWhat it implies is that the new B61-12 which is designated to target underground bunker facilities is in the process of being cleared for active deployment. \nNorth Korea versus the United States \nUS public opinion is routinely led to believe that US nukes are harmless (safe for civilians). The devastating consequences (amply documented) of the use of nuclear weapons is carefully obfuscated. In contrast to the nukes developed by North Korea, the US Department of Defense considers both the B61-11 and the new B61-12 as” harmless to the surrounding civilian population because the explosion is underground “, according to “scientific opinion” on contract to the Pentagon. \nWhile the DPRK’s nukes are considered as bona fide Weapons of Mass Destruction (WMD) and a Threat to Global Security, America’s tactical mini-nukes are categorized as “peace-making bombs”. They’re harmless to civilians according to the military manuals; let’s go head and use them as part of a pre- emptive “humanitarian” war under an R2P mandate (“Responsibility to Protect”). \nLest we forget, the DPRK has been threatened by the US with nuclear war for more than half a century. Barely a few years after the end of the Korean War (1950-53), the US initiated its deployment of nuclear warheads in South Korea. This deployment in Uijongbu and Anyang-Ni had been envisaged as early as 1956. \nTrump-Style Political Insanity \nAll the safeguards of the Cold War era, which categorized the nuclear bomb as “a weapon of last resort”, have been scrapped. “Offensive” military actions using nuclear warheads are now described as acts of “self-defense”. \nIn the post Cold war era, US nuclear doctrine was redefined. There is no sanity under the Trump administration as to what is euphemistically called US foreign policy. Trump hasn’t the foggiest idea as to the consequences of nuclear war. Nor does he have an understanding of the workings of US foreign policy. \nAt no point since the first atomic bomb was dropped on Hiroshima on August 6th, 1945, has humanity been closer to the unthinkable… (Image of Hiroshima in the wake of the bombing) \nStay informed, spread the word far and wide. To reverse the tide of war, the broader public must be informed. Post on Facebook/Twitter. \nConfront the war criminals in high office. \n#StandDownMrTrump. What we really need is real “Regime Change in America”. \nClick image to order Michel Chossudovsky’s book directly from Global Research \n“On August 6, 2003, on Hiroshima Day, commemorating when the first atomic bomb was dropped on Hiroshima (August 6 1945), a secret meeting was held behind closed doors at Strategic Command Headquarters at the Offutt Air Force Base in Nebraska. \nSenior executives from the nuclear industry and the military industrial complex were in attendance. This mingling of defense contractors, scientists and policy-makers was not intended to commemorate Hiroshima. The meeting was intended to set the stage for the development of a new generation of “smaller”, “safer” and “more usable” nuclear weapons, to be used in the “in-theater nuclear wars” of the 21st Century. \nIn a cruel irony, the participants to this secret meeting, which excluded members of Congress, arrived on the anniversary of the Hiroshima bombing (August 6) and departed on the anniversary of the attack on Nagasaki (August 9).” (Michel Chossudovsky, Towards a World War III Scenario, The Dangers of Nuclear War, Global Research, Montreal, 2012) Click the link above to order directly from Global Research. \n\nThe original source of this article is Global Research Copyright © Prof Michel Chossudovsky , Global Research, 2017 \nhttp://www.globalresearch.ca/americas-peace-making-nukes-vs-north-koreas-wmd-simultaneous-nuclear-weapons-tests-by-u-s-and-north-korea/5585140 \n\nCounter Information published this article following the Creative Commons rule. If you don't want your article to appear in this blog email me and I will remove it asap. Follow @counter_info ", "url": "http://omgili.com/ri/GiCaV2xJNYsHxSg680IJv.nQTTWlUkTLA0uaJ0pSRvUUpS6xIIznXqHce35QAytHVKMgraaNUq8R.IA95tmmISP0jAuqS9fc1FJhx9TL1Uc-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T07:16:00.000+03:00", "language": "english", "title": "America’s Peace Making Nukes vs. North Korea’s WMD: Simultaneous Nuclear Weapons Tests by U.S. and North Korea", "thread": {"title_full": "America’s Peace Making Nukes vs. North Korea’s WMD: Simultaneous Nuclear Weapons Tests by U.S. and North Korea", "site_full": "jforpeace.blogspot.com", "site": "blogspot.com", "site_section": "http://jforpeace.blogspot.com/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Counter Information", "url": "http://omgili.com/ri/GiCaV2xJNYsHxSg680IJv.nQTTWlUkTLA0uaJ0pSRvUUpS6xIIznXqHce35QAytHVKMgraaNUq8R.IA95tmmISP0jAuqS9fc1FJhx9TL1Uc-", "published": "2017-04-16T07:16:00.000+03:00", "title": "America’s Peace Making Nukes vs. North Korea’s WMD: Simultaneous Nuclear Weapons Tests by U.S. and North Korea", "uuid": "4fbc402bf9d45d3c718f7f01b0dbb69c5cf5d253", "main_image": null}, "uuid": "4fbc402bf9d45d3c718f7f01b0dbb69c5cf5d253", "ord_in_thread": 0}]