[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:15:49.000+03:00", "author": "Parrot (noreply@blogger.com)", "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "text": "  Facebook shareholders demand report on fake news threat Shareholders have proposed that Facebook Inc. prepare a report on the threat fake news spread on the social media poses to democracy and free speech, PREMIUM TIMES has learnt. According to a proxy filing made on Friday, which its board of directors have recommended a vote against, the shareholders also want the report to look into the dangers fake news may pose to the company itself. The proposal, which suggests the company review the issue broadly, said Facebook had provided “a financial mechanism supporting fabricated content” on the internet. Reuters news agency reports, Saturday, that it also includes the extent to which it blocks fake posts, how its strategies impact free speech and how it evaluates claims in posts. According to the proposal, “Facebook is highly vulnerable, as fake news promoters are spamming their way to visibility for fake news through strategically gaming Facebook’s algorithms and publishing platform.” It added that, “In light of the societal crisis generated by the explosion of fake news and related hate speech, failure to effectively manage this issue creates public policy risk.” The U.S. presidential election of 2016 brought the fake news issue to the radar, as many inaccurate posts were widely shared on Facebook and other social media services. The social platform, however, said it was tackling the problem. On Thursday, more than 30,000 accounts were suspended in France, ahead of the country’s presidential election. Similarly, the media platform already has a program in France to use outside fact-checkers to combat fake news in users’ feeds. Meanwhile, shareholders also proposed a gender pay equality report be prepared by December, with recommendations that the company disclose the percentage pay gap between male and female employees across race and ethnicity and the policies taken to address the gap. Additionally, they want the media platform to state the methodology used to take those measures as well as targets that could be set to reduce the gap. Posted by", "url": "http://omgili.com/ri/jHIAmI4hxg.mxYXP4Is5dY.B3dWSU8mjIjUG8AWWG8Iz2SJlRuslSHvUgNTIT8.FVxUXygd5lRKWHXF08sCbq7iioPuLGyZip.B2rJHFHEkbxKAgxdnAZg--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:15:49.000+03:00", "language": "english", "title": "Facebook shareholders demand report on fake news threat", "thread": {"title_full": "Facebook shareholders demand report on fake news threat", "site_full": "www.parrotnigeria.com", "site": "parrotnigeria.com", "site_section": "http://www.parrotnigeria.com/feeds/posts/default", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Welcome to Parrot's Blog", "url": "http://omgili.com/ri/jHIAmI4hxg.mxYXP4Is5dY.B3dWSU8mjIjUG8AWWG8Iz2SJlRuslSHvUgNTIT8.FVxUXygd5lRKWHXF08sCbq7iioPuLGyZip.B2rJHFHEkbxKAgxdnAZg--", "published": "2017-04-16T11:15:49.000+03:00", "title": "Facebook shareholders demand report on fake news threat", "uuid": "53860b26285118fa1ac32b243bf5edfaffea7f05", "main_image": "https://4.bp.blogspot.com/-wdcxhzbxYc0/WPMnVdkMv7I/AAAAAAABQkY/UhfDsFxw9gYmNKBK_5i7CmDhHIfgduSugCLcB/w1200-h630-p-k-no-nu/facebook-logo-1.jpg"}, "uuid": "53860b26285118fa1ac32b243bf5edfaffea7f05", "ord_in_thread": 0}]