[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/uBQNNiLKiWarOBJfFzTgVofOoNADvX6AcQWiujlO0bN0vsFy1DvUYQoEfXvoPFE6MOISdiNBfxe0iMlgXAViE2bWNG9TIZjsPLfTekf8w7mprdXkr59JUnqMBgtotTPJ3SvmBBHNzryuE3RtYSe8UA--", "title": "HREC Arranges Sale of Hampton Inn Cherry Hills Voorhees, New Jersey", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://hotelexecutive.com/rss.xml", "spam_score": 0.0, "section_title": "HotelExecutive.com - Your view from the top", "site": "hotelexecutive.com", "site_full": "hotelexecutive.com", "performance_score": 0, "uuid": "541080d0da61395b5b612c9040c30b65322b06cd", "published": "2017-04-17T08:00:00.000+03:00", "site_categories": [], "country": "US", "title_full": "HREC Arranges Sale of Hampton Inn Cherry Hills Voorhees, New Jersey", "participants_count": 0, "main_image": ""}, "url": "http://omgili.com/ri/uBQNNiLKiWarOBJfFzTgVofOoNADvX6AcQWiujlO0bN0vsFy1DvUYQoEfXvoPFE6MOISdiNBfxe0iMlgXAViE2bWNG9TIZjsPLfTekf8w7mprdXkr59JUnqMBgtotTPJ3SvmBBHNzryuE3RtYSe8UA--", "title": "HREC Arranges Sale of Hampton Inn Cherry Hills Voorhees, New Jersey", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:26:39.000+03:00", "language": "english", "entities": {"locations": [{"name": "new jersey  denver", "sentiment": "none"}, {"name": "hampton inn cherry hills voorhees", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "philadelphia-camden-wilmington", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "camden county", "sentiment": "none"}, {"name": "cherry hill mall", "sentiment": "none"}, {"name": "u.s.s. new jersey", "sentiment": "none"}, {"name": "hampton inn cherry hill-voorhees", "sentiment": "none"}, {"name": "washington d.c.", "sentiment": "none"}, {"name": "voorhees", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "clementon amusement park", "sentiment": "none"}], "persons": [{"name": "jane davis", "sentiment": "none"}, {"name": "harrah", "sentiment": "none"}, {"name": "ketan patel", "sentiment": "none"}], "organizations": [{"name": "new jersey business & finance hrec", "sentiment": "none"}, {"name": "hrec", "sentiment": "none"}, {"name": "hotel business review", "sentiment": "none"}, {"name": "harris school of business", "sentiment": "none"}, {"name": "subaru", "sentiment": "none"}, {"name": "hrec investment advisors", "sentiment": "none"}, {"name": "rowan university", "sentiment": "none"}, {"name": "hotelexecutive.com", "sentiment": "none"}, {"name": "ketan patel the national conference center", "sentiment": "none"}, {"name": "american corporate headquarters", "sentiment": "none"}, {"name": "american water works", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "541080d0da61395b5b612c9040c30b65322b06cd", "published": "2017-04-17T08:00:00.000+03:00", "author": "", "text": "Business & Finance HREC Arranges Sale of Hampton Inn Cherry Hills Voorhees, New Jersey \nDENVER, CO. & WASHINGTON, D.C. April 17, 2017 \u0096 HREC Investment Advisors is pleased to announce it has arranged the sale of the 120-guestroom Hampton Inn Cherry Hill-Voorhees located in Voorhees, New Jersey to a regional hotel ownership group. \nKetan Patel, Senior Vice President in HREC Investment Advisors\u0092 Washington D.C. office, exclusively represented the seller during the transaction. \nThe Hotel is strategically located in Voorhees, a part of Camden County and the Philadelphia-Camden-Wilmington, Metropolitan Statistical Area. The Hotel is situated roughly 15 miles southeast of downtown Philadelphia. Attractions near the Hotel include downtown Philadelphia, Subaru\u0092s American Corporate Headquarters, the Harris School of Business, Clementon Amusement Park, American Water Works, Nexxt Level Coliseum, the Cherry Hill Mall, Harrah\u0092s Casino, Flyers Skate Zone, Rowan University, U.S.S. New Jersey and the Adventure Aquarium. \nAbout HREC®: HREC® is the nation\u0092s leading lodging and gaming real estate advisory firm specializing in property sales, mortgage brokerage, equity/JV structuring, consulting (market studies and appraisals), and litigation support. With offices throughout North America, HREC® is distinguished by unwavering commitment to client service and success through its team approach, intellectual capital and hotel/casino specialization. \nFor addition information on the property, please contact: Ketan Patel The National Conference Center Announces Jane Davis, Director of Sales Revenue Acquisitions & Hotel Openings Coming Up In The May Online Hotel Business Review Feature Focus Eco-Friendly Practices: The Value of Sustainability The hotel industry continues to make remarkable progress in implementing sustainability policies and procedures in their properties throughout the world. As a result, they continue to reap the benefits of increased profitability, enhanced guest experiences, and improved community relations. In addition, as industry standards are codified and adopted worldwide, hotels can now compare how their operations measure up against their competitors in terms of sustainable practices and accomplishments. This capacity to publicly compare and contrast is spurring competition and driving innovation as hotels do not wish to be left behind in this area. Water management and conservation is still a primary issue as population growth, urbanization, pollution and wasteful consumption patterns place increasing demands on freshwater supply. Water recycling; installing low-flow fixtures; using digital sensors to control water usage; and even harvesting rainwater are just a few things that some hotels are doing to preserve this precious resource. Waste management is another major concern. Through policies of reduce, reuse and recycle, some hotels are implementing \u0093zero-waste\u0094 programs with the goal of substantially reducing their landfill waste which produces carbon dioxide and methane gases. Other hotels have established comprehensive training programs that reinforce the value of sustainability. There is employee engagement through posters and quizzes, and even contests are held to increase innovation, sensitivity and environmental awareness. Some hotels are also monitoring a guest\u0092s energy usage and rewarding those who consumed less energy with gifts and incentives. The May issue of the Hotel Business Review will document how some hotels are integrating eco-friendly practices into their operations and how they and the environment are benefiting from them. Copyright © 1996-2017. All content on HotelExecutive.com is exclusively copyright to HotelExecutive.com and cannot be republished without prior written consent by HotelExecutive.com. Advertise Submit a News Release Terms of Access & Use Unsubscribe Hotel Newswire RSS \nars, the Hotel Business Review journal has been a leading online resource for hotel executives, providing white papers on best practices in hotel management and operations. With a dedicated board of more than 300 contributing editors - some of the most recognizable names in hotels - the Hotel Business Review maintains a progressive flow of exclusive content every week, so that owners, operators, senior executives, investors and developers can stay informed on the constant changes in the hotel industry. k"}]