[{"entities": {"organizations": [{"name": "promo post haddie", "sentiment": "none"}], "locations": [{"name": "vermont", "sentiment": "none"}, {"name": "kobo", "sentiment": "none"}, {"name": "burlington", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "lake tahoe", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "persons": [{"name": "melanie hooyenga", "sentiment": "none"}, {"name": "sascha darlington", "sentiment": "none"}, {"name": "hunter", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "margie", "sentiment": "none"}, {"name": "blake", "sentiment": "none"}, {"name": "melanie", "sentiment": "none"}, {"name": "cally", "sentiment": "none"}, {"name": "christina philippou", "sentiment": "none"}, {"name": "sophia", "sentiment": "none"}, {"name": "sam", "sentiment": "none"}, {"name": "miniature schnauzer owen", "sentiment": "none"}]}, "uuid": "572962f0b1bbe29ffeeaf9feaad4c4da6000bcf6", "highlightText": "", "title": "Blazing #BlogTour: The Slope Rules by Melanie Hooyenga", "thread": {"site": "wordpress.com", "country": "US", "participants_count": 1, "site_full": "lovesgreatreadsblog.wordpress.com", "section_title": "Blazing #BlogTour: The Slope Rules by Melanie Hooyenga – Loves Great Reads Blog", "uuid": "572962f0b1bbe29ffeeaf9feaad4c4da6000bcf6", "site_section": "https://lovesgreatreadsblog.wordpress.com", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-12T20:53:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZQle34fKQf9QdfTRWUVhPdORhzFU7oeaSq8worb.Lugwz6.z2swwwEFym88ruPi6iTrGl4zJSuQnizwN6DstCuJSr4BpCb3yFXbL2_SeqYbXHowGg2F6qyIHmZOrm7BZhCvOzO9MqCmNw--", "title_full": "Blazing #BlogTour: The Slope Rules by Melanie Hooyenga", "title": "Blazing #BlogTour: The Slope Rules by Melanie Hooyenga", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-12T20:53:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZQle34fKQf9QdfTRWUVhPdORhzFU7oeaSq8worb.Lugwz6.z2swwwEFym88ruPi6iTrGl4zJSuQnizwN6DstCuJSr4BpCb3yFXbL2_SeqYbXHowGg2F6qyIHmZOrm7BZhCvOzO9MqCmNw--", "ord_in_thread": 0, "crawled": "2017-04-16T23:19:27.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "lovesgreatreadsblog", "text": "\nThe Slope Rules \nby Melanie Hooyenga \nGenre: YA Sports Romance \nRelease Date: February 24th 2017 \nSummary from Goodreads: \nFifteen-year old Cally accepted her fate as one of the guys, so when she meets Blake, a hot snowboarder who sees her for more than her aerials on the slopes, she falls fast and hard. But their romance can only last as long as vacation.\nOr so she thinks.\nA twist of fate—well, her Dad opening another brewery in a new town—lands her in Blake’s school, but the charismatic boy she fell for wants nothing to do with her, and worse, the Snow Bunnies, the popular clique, claim her as their newest recruit.\nCally must learn to be true to herself—all while landing a spot on the ski team and figuring out who she is without her old friends. And when she finds out what Blake is hiding, she learns the rules on the slopes apply to more than just skiing.\nAdd to Goodreads \nBuy Links: Print / Amazon / BN / Kobo / Smashwords / iBooks \nEXCERPT: \nI double check that Blake is still in line for hot chocolate, then whip out my phone and fire off a text to Sophia. Found a hottie. Made contact. \nMy good knee bounces in time to my heart, which hasn’t settled since Blake deposited me in a chair near the fireplace and pulled off his helmet, revealing shaggy brown hair that falls just above his crazy-blue eyes. The image in my head of us sipping hot chocolate next to the fire is beyond corny, but who am I to argue when they were the only open chairs.\nMy phone vibrates. Spill. \nMajor wipeout. He came to my rescue. Carried me into the lodge. \nI check his progress in line and shake my head. What universe have I landed in where the hottest guy here—and the nicest, and not to mention a kickass boarder—is trying to impress me? It’s not like I’m not interested in boys, but I’ve always been so focused on skiing that by middle school I wedged myself in as one of the guys and now it’s too late to change it. The few dates I’ve been on were with boys outside my circle and they always get scared off once they meet my pack of friends and see how protective they are of me.\nAnd you’re having his babies when? \nI snort just as Blake sits in the chair next to me. “Was it something I said?”\n“Sorry! It’s my friend. She’s a little… never mind.” I tuck my phone into my coat pocket and take a Styrofoam cup from him. Our fingers graze and a little zing of electricity rockets up my arm and straight into my belly. I clear my throat, hoping he doesn’t notice that I can’t seem to speak.\nHe sets a bag of ice on the table, slides another chair close to me so I can prop up my leg, and sits in the chair next to me. I grab the bag and roll the ice around to break up any chunks, then plop it on my knee. I should really pull up my snowpants for the ice to help, but the bunny long underwear is staying in hibernation.\nOnce he’s sure I’m situated, he leans forward so his elbows are on the table and points one finger like he’s counting. “So here’s what I know. You’re one of the best trick skiers I’ve ever seen.” He points a second finger. “You’re here with your dad and…?” His head tilts as he waits for me to reply.\n“Just my dad.”\nHe points the third finger. “And you’re gorgeous. Now this would be enough for your average snowboarding fool, but I want to know more.”\nWho talks like that? I look around, expecting people to be staring, but no one’s paying attention to us. “Am I being punked?”\nHe furrows his brows. “What?”\n“I’ve never once had anyone say something like that to me. I figure it must be a joke.”\nA blush creeps up his cheeks and he pushes his hair off his forehead. “No joke. I had a lot of time to think when you were with the ski patrol dude. But I mean it. The girls at my school are too worried about their hair to put on a helmet and pull the flip you did.”\nI shrug. “I guess I don’t worry about those things.”\nHe smiles and my belly does another somersault. “And that’s why I want to know more about you. Where are you from?”\nI take a deep breath and force myself to relax. While I don’t want to fall into the friend zone with Blake, I know how to talk to guys. Pretend he’s Hunter or Sam. “I’m from Vermont. South Burlington. I’m on the ski team and wasn’t supposed to try that last trick without my coach, but the powder here is so different from back home I couldn’t resist.” I glance out the window in the direction of the scene of my crash and smile. “He’ll be happy you forced me onto the sled.”\nHis dimple deepens. “Right place, right time. So this is your first time in Colorado?”\nI nod. “What about you?”\nHis smile hardens for a millisecond, but it’s back so fast I wonder if I imagined it. “I’m from Lake Tahoe. The California side.”\n“Ooh, a Cali boy?”\nHe rolls his eyes. “We’re not all bad.”\n“No, I’m intrigued. Us east coast girls don’t have too many run-ins with surfer boys.”\nHe bites his lower lip. “I don’t surf. I live in the mountains.”\n“Oh, I figured you’re such a good snow boarder that you must surf in the summer.” He’s quiet, and I scramble for a new topic. I don’t know what made him clam up, but I can’t blow this in the first five minutes. “How long are you here for?”\nThe tension in his shoulders relaxes and he leans back in his chair. “‘Til Sunday.”\n“Me too.” I can’t stop the goofy smile that plasters itself to my face. I met this boy less than an hour ago and I’m acting like we’re already in love. Which makes my cheeks flame even hotter.\n\nAbout the Author \nWhile not a fan of matching Day-Glo outfits, Melanie’s been skiing since she was five and always points her tips up while exiting the chairlift. She lives in the land of lake effect snow—also known as west Michigan—with her husband Jeremy and Miniature Schnauzer Owen, and is always looking for ways to enjoy the outdoors. This novel, her fourth, inspired her to purchase her first helmet.\nAuthor Links: Website │ Goodreads │ Twitter │ Facebook │ Instagram \nGIVEAWAY :\na Rafflecopter giveaway \nBlog Tour Organized by:\n\nYA Bound Book Tours \nBlog Tour Schedule – April 10 th \nThe Silver Dagger Scriptorium http://silver-dagger-scriptorium.weebly.com/ Promo Post\nThe Bookworm Central www.thebookwormcentral.blogspot.com Review\nLILbooKlovers www.lilbooklovers.wordpress.com Review\nApril 11 th \nReading for the Stars and Moon http://readingforthestarsmoon.blogspot.com/ Review\nBook Jems www.bookjems.com Review\nMargie’s Must Reads http://margiesmustreads.com Promo Post\nApril 12 th \nLoves Great Reads https://lovesgreatreadsblog.wordpress.com/ Promo Post \nCBY Book Club http://cbybookclub.blogspot.com/ Promo Post\nWhat Is That Book About www.whatisthatbookabout.com Promo Post\nBooks,Dreams,Life http://staceyschneller06.wordpress.com Review\nA Leisure Moment http://www.aleisuremoment.com Promo Post\nApril 13 th \nSascha Darlington’s Microcosm Explored https://saschadarlington.me Review\nZerina Blossom’s Books http://www.zerinablossom.com/ Promo Post\nHaddie’s Haven https://haddieshaven.blogspot.com Review\nThe Avid Reader http://the-avidreader.blogspot.com Promo Post\nApril 14 th \nThe Phantom Paragrapher www.thephantomparagrapher.blogspot.com Review\nforthenovellovers https://forthenovellovers.wordpress.com/ Review\nChristina Philippou https://cphilippou123.com/ Review\nTo Be Read www.tobereadsite.wordpress.com Review\n\n\n♥ Facebook ♥ Twitter ♥ Tumblr ♥ GoodReads ♥ DON’T FORGET TO FOLLOW OUR BLOG. \n. "}]