[{"entities": {"organizations": [{"name": "congress", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "house intelligence committee", "sentiment": "none"}, {"name": "419th district court", "sentiment": "none"}, {"name": "pbs.org", "sentiment": "none"}, {"name": "alex jones youtube", "sentiment": "none"}, {"name": "skype", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "capitol", "sentiment": "none"}, {"name": "infowars.com", "sentiment": "none"}, {"name": "infowars", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "grammys", "sentiment": "none"}, {"name": "mar-a-lago", "sentiment": "none"}], "locations": [{"name": "travis county", "sentiment": "none"}, {"name": "hays county", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "south austin", "sentiment": "none"}, {"name": "somalia", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "guadalupe street", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "pennybacker bridge", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "west austin", "sentiment": "none"}, {"name": "travis county courthouse", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "persons": [{"name": "don", "sentiment": "negative"}, {"name": "jonathan tilove", "sentiment": "negative"}, {"name": "alex jones", "sentiment": "negative"}, {"name": "alec baldwin", "sentiment": "none"}, {"name": "minton", "sentiment": "none"}, {"name": "jennifer lopez", "sentiment": "none"}, {"name": "lopez", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "infowarrior", "sentiment": "none"}, {"name": "jack nicholson", "sentiment": "none"}, {"name": "stone", "sentiment": "none"}, {"name": "david minton", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "jones", "sentiment": "none"}, {"name": "naranjo", "sentiment": "none"}, {"name": "bobby newman", "sentiment": "none"}, {"name": "infowars", "sentiment": "none"}, {"name": "roger stone", "sentiment": "none"}, {"name": "adam schiff", "sentiment": "none"}, {"name": "wilhite", "sentiment": "none"}, {"name": "alex", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "hoffman", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "baldwin", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "kelly", "sentiment": "none"}, {"name": "a.j.", "sentiment": "none"}, {"name": "randall wilhite", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "john wayne", "sentiment": "none"}, {"name": "schiff", "sentiment": "none"}, {"name": "orlinda naranjo", "sentiment": "none"}, {"name": "newman", "sentiment": "none"}, {"name": "kelly jones", "sentiment": "none"}, {"name": "robert hoffman", "sentiment": "none"}]}, "uuid": "5b4bc1c8fdc93ad674772c830a75c3b4aee776f1", "highlightText": "", "title": "In Travis County custody case, jury will search for real Alex Jones", "thread": {"site": "mystatesman.com", "country": "US", "participants_count": 0, "site_full": "www.mystatesman.com", "section_title": "", "uuid": "5b4bc1c8fdc93ad674772c830a75c3b4aee776f1", "site_section": "", "domain_rank": 39133, "main_image": "http://www.mystatesman.com/rf/image_large/Pub/p8/MyStatesman/2017/04/16/Images/newsEngin.18372972_Screen-Shot-2016-10-20-at-8.50.56-PM.jpg", "performance_score": 0, "published": "2017-04-16T08:00:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9ngjlc0Y7X9Cq_fo5eyYceS_ZCSZ6cH.LPj03X.A9xNTOzfgPFBXHGp15JgiACaMKIQCC9YEZaSoea8Wh9W6u6ryBNG2oUZFgF.CXhp8.c0k1mruWzy2BJ1SXE27yPqi_5eXAvENO._TvmX2ppON8REhjeSkApvjQzttKMUz9KOMW_Wxd1beMvxj8E_grXNHo-", "title_full": "In Travis County custody case, jury will search for real Alex Jones", "title": "In Travis County custody case, jury will search for real Alex Jones", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.111, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T08:00:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9ngjlc0Y7X9Cq_fo5eyYceS_ZCSZ6cH.LPj03X.A9xNTOzfgPFBXHGp15JgiACaMKIQCC9YEZaSoea8Wh9W6u6ryBNG2oUZFgF.CXhp8.c0k1mruWzy2BJ1SXE27yPqi_5eXAvENO._TvmX2ppON8REhjeSkApvjQzttKMUz9KOMW_Wxd1beMvxj8E_grXNHo-", "ord_in_thread": 0, "crawled": "2017-04-16T23:46:53.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Jonathan Tilove", "text": "By Jonathan Tilove - American-Statesman Staff ... On October 8, Alex Jones delivers a message to Donald Trump from above the Pennybacker Bridge in West Austin, saying Trump needed to viciously attack Hillary Clinton at the second presidential debate the next night or get out of the race. \nPosted: 1:50 p.m. Sunday, April 16, 2017 Highlights Alex Jones and his ex-wife, Kelly, will be locked in a child custody trial the next two weeks in Austin. Alex Jones’ lawyers will make the case that their client should not be judged by his on-air persona. Lawyers for Kelly Jones will maintain that Jones’ public outbursts suggest he is not a fit parent. \nAt a recent pretrial hearing, attorney Randall Wilhite told state District Judge Orlinda Naranjo that using his client Alex Jones’ on-air Infowars persona to evaluate Alex Jones as a father would be like judging Jack Nicholson in a custody dispute based on his performance as the Joker in “Batman.” \n“He’s playing a character,” Wilhite said of Jones. “He is a performance artist.” \nBut in emotional testimony at the hearing, Kelly Jones, who is seeking to gain sole or joint custody of her three children with Alex Jones, portrayed the volcanic public figure as the real Alex Jones. \n“He’s not a stable person,” she said of the man with whom her 14-year-old son and 9- and 12-year-old daughters have lived since her 2015 divorce. “He says he wants to break Alec Baldwin’s neck. He wants J-Lo to get raped. \n“I’m concerned that he is engaged in felonious behavior, threatening a member of Congress,” she said, referring to his recent comments about California Democrat Adam Schiff. “He broadcasts from home. The children are there, watching him broadcast.” \n﻿THE LATEST: Jury selected after long first day of Alex Jones trial \nBeginning Monday, a jury will be selected at the Travis County Courthouse that in the next two weeks will be asked to sort out whether there is a difference between the public and private Alex Jones, and whether, when it comes to his fitness as a parent, it matters. \nFor Naranjo, who has been the presiding judge of the 419th District Court since January 2006, it is about keeping her eyes, and the jury’s eyes, on the children. \n“This case is not about Infowars, and I don’t want it to be about Infowars,” Naranjo told the top-shelf legal talent enlisted in Jones v. Jones at the last pretrial hearing Wednesday. “I am in control of this court, not your clients.” \nBut for Alex Jones, at the peak of his power and influence, what emerges from the art deco courthouse on Guadalupe Street might shape whether he comes to be seen by his faithful as more prophet or showman. \nInfowars as evidence \nAlex Jones is an Austin original who, 21 years after he got his own show on Austin public access television, has become an unlikely popular and political force in the Donald Trump era, an ingenious and indefatigable conjurer of conspiracy theories about sinister global elites seeking to enslave the masses, who found, in Trump, a hero open to his shadowy narratives. \n“Alex Jones and his Infowars’ umbrella of radio shows, YouTube and Facebook broadcasts, Internet website and tweets turned out to be Trump’s secret weapon,” Roger Stone, probably Trump’s oldest and closest political confidant, wrote in his book “The Making of the President 2016.”“His fiery words have struck a chord in the nation and he speaks for millions. In fact, more people follow Alex than watch Fox News or CNN.” \nIn addition to broadcasting his radio show on some 150 stations, Infowars.com had 7.6 million global unique visitors between March 16 and April 14 according to Quantcast, which measures web audiences and ranked Infowars.com 387th among all U.S. websites, not far behind Texas.gov, MLB.com and PBS.org. \nThe Alex Jones YouTube channel has more than 2 million subscribers and more than 1.2 billion video views. \nBut Jones’ most important listener is the president of the United States. \nDuring the campaign and into his presidency, many of Trump’s most defining themes and questionable assertions either originated with or were popularized by Infowars: Hillary Clinton for prison. Hillary Clinton is gravely ill. Bill Clinton is a rapist. President Barack Obama founded ISIS. The election is rigged. Millions of immigrants voted illegally. The news media covers up terrorist attacks. The “fake news media … is the enemy of the people.” Obama spied on Trump. \nIn December 2015, thanks to Stone, Trump appeared via Skype on Jones’ show. \n“Your reputation is amazing,” Trump told Jones. “I will not let you down.” \nSince Trump became president, Jones has purported on air to be in regular direct telephone contact with the president, apologizing for not always being able to answer the phone when the president calls. Last week, Jones said that the president had invited him to Mar-a-Lago but that he had to beg off because of family obligations. \nRecently, Jones faulted Trump for falling for the “false flag” that it was the Syrian government, and not its enemies, that deployed chemical weapons against civilians, but he says he understands the political expedience involved and remains hopeful that Trump will reclaim the anti-globalist mantle. \nLIKE US ON FACEBOOK: Our Lone Star Politics page brings Capitol news to your Facebook feed \nNaranjo, meanwhile, said she had never seen or heard Jones on Infowars until Wednesday’s hearing, when Kelly Jones’ legal team started previewing Infowars videos it would like to play for the jury. \nThe first was a clip from a July 2015 broadcast in which Jones had his son, then 12, on to play the latest of some 15 or 20 videos he had made with the help of members of the Infowars team who, Jones said, had “taken him under their wing” during summer days spent at the South Austin studio between stints at tennis and Christian camps. \n“He is undoubtedly cut out for this, and I intend for him to eclipse what I’ve done. He’s a way greater person than I was at 12,” said Jones, turning to his son. “I love you so much, and I didn’t mean to get you up here, sweetheart, and tell people how much I love you, but you’re so handsome, and you’re a good little knight who’s going to grow up, I know, to be a great fighter against the enemy.” \n“So far this looks like good stuff,” Wilhite said. Naranjo OK’d it for viewing by the jury. \nBut Bobby Newman, the attorney for Kelly Jones guiding the court through the Infowars clips, was laying the groundwork for the argument that there is no separation between Alex Jones, father, and Alex Jones, Infowarrior. \n“This is the world he has planned for his kids,” said Newman, quoting Alex Jones at a recent hearing insisting that what he says on the air is what he believes. \n﻿SOCIAL MEDIA REACTS: What people are saying about Alex Jones \nNext up was a video of a recent conversation between Jones and Stone on Infowars that quickly escalated into an expletive-studded, gay-bashing rant by Jones directed at Schiff, the ranking Democrat on the House Intelligence Committee investigation of Trump’s Russia ties, in which, Schiff has suggested, Stone and Jones might be entangled. \nJones’ rant ends: “You got that, you goddamn son of a bitch? Fill your hand,” echoing John Wayne’s warning in True Grit” to a man he’s about to shoot and kill. \n“This is nothing but a response to a congressman who called him a Russian spy,” said David Minton, another lawyer representing Alex Jones. \n“What possible relevance does that have?” Minton asked. “They want to throw the stench in the jury box and never get the stench out. It has nothing to do with parenting.” \nA few days after his Schiff riff, Jones characterized it on-air as “clearly tongue-in-cheek and basically art performance, as I do in my rants, which I admit I do, as a form of art.” \n“When I say, ‘I’m going to kick your ass,’ it’s the Infowar,” Jones said. “I say every day we’re going to destroy you with the truth.” \nJones’ rhetoric is perpetually at a pugilistic fever pitch. \nTEXAS POLITICS DELIVERED EVERY DAY: Sign up for our Texas Politics email \nBack in March, after Baldwin, playing Trump on “Saturday Night Live,” said he got his information on aliens from Alex Jones, Jones challenged Baldwin to a million-dollar charity bout —“I’ll get in the ring with you, and I will break your jaw, I will knock your teeth out, I will break your nose, and I will break your neck.” \nWhen, just after the election, Jennifer Lopez lamented about Trump at the Grammys, Jones responded that Trump “doesn’t want to bring people in from Somalia where women are sold on slave blocks. Why don’t you go to Somalia for five minutes, lady; you’ll be gang-raped so fast it’ll make your head spin.” \nNaranjo said she wouldn’t allow the jury to hear the Schiff diatribe, but she allowed two other clips, including one showing Alex Jones smoking marijuana in California, where it is legal. Naranjo didn’t review the Baldwin and Lopez clips, and it’s not clear whether Kelly Jones’ attorneys will seek to include them in the trial. \nBig legal bills \nEvery record in the Jones case has been under seal since the divorce proceeding was initiated in Hays County in 2013. In January, the court denied Kelly Jones’ motion to unseal the record, granting a motion by Alex Jones — or simply A.J., as he is known in all the court filings — to keep them sealed \nFor good measure, Naranjo said last week she was placing a gag order on all the litigants. \nAt the previous pretrial hearing, on April 7, Naranjo ruled against Kelly Jones and her lawyers on a couple of key motions. \nEarlier this year, her lawyers had moved to add to the trial a $7 million emotional distress tort claim against Alex Jones. \nHis lawyers said it was too late to prepare a defense against a new claim with 172 separate allegations. Naranjo agreed and promised to expedite a second trail on the tort claim. \n“They’d like to drag it out for two years, and she’ll be crushed and she’ll be bankrupt,” said Robert Hoffman, the Houston attorney who is Kelly Jones’ lead counsel, in arguing for rolling the tort claim into the trial. \n“She already is, for all practical purposes,” said Hoffman, who said she owed his firm $200,000, about all she had in the bank. \nHer attorneys also filed a motion to require Alex Jones to help pay her interim legal fees to better enable her to rescue her children from his clutches. \n“I don’t think there’s another case in Travis County with three children whose welfare hangs in the balance like this, except maybe a (Child Protective Services) case,” Hoffman said. \n“This is a wonderful mother who has had her kids turned against her,” Hoffman said. \nWilhite said the crux of Kelly Jones’ problem is that she has gone through one set of lawyers after another and some $3.5 million since her divorce settlement, much of it pursuing fruitless motion after motion that actually cost her access to her children each step of the way. \nAnd she already receives $43,000 a month from her ex-husband. \nNaranjo rejected the motion that Alex Jones should have to contribute more, noting that the average Travis County juror won’t understand why Kelly Jones’ monthly stipend is not enough to cover her legal bills. \n“It is not within the realm of experience of their lives,” Naranjo said. \n”They are not going to believe the amount of money that has been spent on this,” the judge said. \n“This case is not about Infowars,” Naranjo said. “But, for some reason, this family has done very well. Otherwise, there wouldn’t be five lawyers on one side of the table and three over here, because of the business this family is in.” \nMeanwhile, Alex Jones has remarried, and his new wife is expecting a child, who, his lawyers said, might arrive during the trial. About the Author \nJONATHAN TILOVE Sign up for Newsletters Want more news? Sign up for free newsletters to get more of the Statesman delivered to your inbox. Popular in News"}]