[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:19:06.000+03:00", "author": "Pak Deh (noreply@blogger.com)", "entities": {"persons": [{"name": "cheum sor", "sentiment": "none"}, {"name": "suradiredja", "sentiment": "none"}, {"name": "chang theng", "sentiment": "none"}, {"name": "robert elliott", "sentiment": "none"}, {"name": "visal", "sentiment": "none"}, {"name": "tondy suradiredja", "sentiment": "none"}, {"name": "elliott", "sentiment": "none"}, {"name": "huy vatharo", "sentiment": "none"}, {"name": "chan theng", "sentiment": "none"}, {"name": "vatharo", "sentiment": "none"}, {"name": "soth visal", "sentiment": "none"}], "locations": [{"name": "phnom penh", "sentiment": "none"}, {"name": "suradiredja", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "southeast asia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "cambodia", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "kandal province", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "khmer-soviet friendship hospital", "sentiment": "none"}, {"name": "opening cambodia life insurance", "sentiment": "none"}, {"name": "nikkei asian review", "sentiment": "none"}, {"name": "cambodia life", "sentiment": "none"}, {"name": "manulife", "sentiment": "none"}, {"name": "aia", "sentiment": "none"}, {"name": "manulife cambodia", "sentiment": "none"}, {"name": "prudential", "sentiment": "none"}, {"name": "iac", "sentiment": "none"}, {"name": "international labor organization", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "insurance association of cambodia", "sentiment": "none"}, {"name": "cambodia life insurance", "sentiment": "none"}]}, "text": "  Opening Cambodia Life Insurance At the Khmer-Soviet Friendship Hospital in central Phnom Penh, Cheum Sor, 61, is lying on the hospital floor with an intravenous drip attached to his arm. The gloomy, crowded ward does not have any air conditioning or even a nurse call button. His wife, Chan Theng, 54, sits beside him the whole day to fan him and summon the nurse if something goes wrong. The couple gave up their job as contract farmers, where they had earned $3 a day, to come to this public hospital from Kandal Province next to the capital, when Cheum Sor developed high blood pressure. Having been designated \"poor,\" he can receive medical treatments here for free. But expenses for travel, food and special medicine have eaten up most of the 1 million riel ($250) the couple had brought with them -- from their savings and by taking out high-interest loans from a local pawn shop. They have no insurance to cover such expenses or compensate them for their period of unemployment. \"What is insurance?\" Chang Theng asked. Insurance magnet With one of the most underinsured populations in Asia, as well as an economy growing at 7% a year, Cambodia has become a magnet for both life and non-life insurers. Currently, there are seven non-life and six life insurance players in the market. AIA, Asia's largest life insurer, was the latest to join the pack following a license approval last month. \"We have a big cake and many people want a piece,\" Huy Vatharo, chairman of the Insurance Association of Cambodia, told the Nikkei Asian Review . \"But we have a challenge in making people understand the necessity and benefits of insurance.\" According to the IAC, the market, which is less than two decades old, continues to show remarkable growth. Premiums of non-life insurances, which were first launched in the early 2000s, have increased an average 19% in the past five years. For life insurance, which was introduced in 2012, premiums doubled last year. However, tackling hurdles like low public awareness, low income levels and an immature capital market, is no easy task. The ratio of premium to gross domestic product was less than 0.5% in 2015, according to the IAC. In comparison, developed nations like Japan and the U.S. boast penetration rates of 10.8% and 7.3%, respectively. Even Southeast Asian peers such as Vietnam (1.6%) and Indonesia (1.7%) have higher penetration. The country's complex history of years of repression and failed politics makes it difficult to encourage people to pay for something that may or may not occur in the long term. \"People here tend to live for tomorrow, not for the distant future,\" said Tondy Suradiredja, chief executive of Cambodia Life Insurance, the country's first life insurer. \"They think: Why do I have to think about my retirement if I am not sure what is going to happen with the government?\" An Indonesian native, Suradiredja has been in the Cambodian insurance industry since Cambodia Life, a former state-owned company, started business in 2012. Moreover, income levels are still low. Cambodia has the lowest per capita GDP in Southeast Asia. Nominal monthly wages were 642,000 riel ($160) in 2014, according to the International Labor Organization. $1.2 daily premium The market's early birds are trying out various tactics to reach out to potential core customers. Cambodia Life will start, in May, selling low-premium insurance, what can be categorized as micro insurance, at the 3,700 plus agents of Wing (Cambodia), the country's leading mobile payments provider. Two packages providing coverage of $5,000 and $10,000 will be rolled out. Premiums can be paid on either a daily or monthly basis. \"It's just $1.2 a day -- cheaper than a parking ticket,\" Suradiredja said. \"That's how we make a difference.\" Meanwhile, Manulife Cambodia, the local arm of Canadian life insurance giant Manulife, has been launching various marketing campaigns to simply raise the public's awareness since it started business in 2012. \"Cambodian people are still excited about advancing themselves, creating new businesses, finding better jobs and looking for new opportunities,\" Chief Executive Robert Elliott told the Nikkei Asian Review. \"Asking them to sit back and consider where they want to be in 20 years' time is a conversation most people have never had.\" But Manulife is doing just that. It has been holding seminars across the nation to explain about life insurance and its role in people's lives. More than 75,000 have attended to date. \"At first nobody knew our name -- they thought we were a football team,\" Elliott recalls. Now, the company has 300,000 followers on Facebook. Manulife's offerings in Cambodia are mostly endowment policies, savings products that pay out a lump sum at the end of a certain period. \"The saving element is very important because that allows people to plan,\" Elliott said. In fact, according to the IAC's Vatharo, more than 95% of the life insurance policies sold in the market are endowment products. Increasingly popular are education policies that allow the customer to save and pay out when the policy holder's child reaches a certain education stage. If the customer prematurely dies, a lump sum is paid anyway. Soth Visal, a 33-year-old manager at a website operating company, recently bought an education insurance policy for his seven-year-old son from the local arm of U.K.-based Prudential. Out of his annual income of $12,000, Visal pays $243 in annual premiums. The policy will pay out $6,000 when the child reaches 18 years old, even if Visal prematurely dies. \"It's not much, considering that if I die, my wife won't have to worry about our child's education,\" he said. \"It's better than saving in a bank because we can't withdraw the money until the right time comes.\" Premiums in bank deposits But a growing market means that insurers will have to find long-term investment destinations to grow their assets. Currently, Cambodia has no bond market. Its stock market is still in its early days, with only four companies listed. However, the government requires insurance companies to invest 75% of their premiums within Cambodia. Most of the insurance companies invest in bank deposits. \"The interest rate is 4.25% on average,\" said Cambodia Life's Suradiredja. \"And sometimes you can get 6-7% if you put it into microfinance.\" Manulife also deposits 75% of its premiums with local banks, but leaves the remaining 25% with its reinsurance group company in Hong Kong. Elliott is willing to invest in infrastructure projects too, as soon as there is an instrument to do so. Despite the challenges, the companies are confident the outlook is bright. One good sign is that more and more foreign hospital operators are entering the country to provide high-quality, but expensive, health care. \"People may find out that the cost of medical is high if they want to get better treatment,\" IAC's Vatharo said. \"So how do they pay for that? Insurance is probably the answer.\" Posted by", "url": "http://omgili.com/ri/rPCDLkAl21RWOKIP9ji6B9de8s3cOG216cUxD_1vo9UxhxGQLqXPBbW4XXO8_YbWS1YhaJt.R14VjlDfne4ia02Hyejd_bwbb0CMD28rgAM-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T10:19:06.000+03:00", "language": "english", "title": "Opening Cambodia Life Insurance", "thread": {"title_full": "Opening Cambodia Life Insurance", "site_full": "askpakdeh.blogspot.com", "site": "blogspot.com", "site_section": "http://askpakdeh.blogspot.com/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "ASK Pak Deh", "url": "http://omgili.com/ri/rPCDLkAl21RWOKIP9ji6B9de8s3cOG216cUxD_1vo9UxhxGQLqXPBbW4XXO8_YbWS1YhaJt.R14VjlDfne4ia02Hyejd_bwbb0CMD28rgAM-", "published": "2017-04-16T10:19:06.000+03:00", "title": "Opening Cambodia Life Insurance", "uuid": "5cc6e70ec6135a21e034dc621cfbf98fa4c1a949", "main_image": null}, "uuid": "5cc6e70ec6135a21e034dc621cfbf98fa4c1a949", "ord_in_thread": 0}]