[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:39:09.000+03:00", "author": "Augustino Chengula (noreply@blogger.com)", "entities": {"persons": [{"name": "bing", "sentiment": "none"}], "locations": [], "organizations": [{"name": "keypath education uk", "sentiment": "none"}, {"name": "digital marketing", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "ppc", "sentiment": "none"}, {"name": "google analytics", "sentiment": "none"}, {"name": "digital media", "sentiment": "none"}, {"name": "online programme management", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "cpl", "sentiment": "none"}, {"name": "microsoft office suite", "sentiment": "none"}]}, "text": "Digital Marketing (Paid Search) Manager [ad_1]\n\nAbout the role Keypath Education UK is looking for an experienced Digital Marketing (Paid Search) Manager to join our growing team. As the Paid Search Manager, you will be responsible for designing and executing the pay-per-click (PPC) marketing strategies that are aimed at generating quality enquiries for our Online Programme Management partner institutions. You will be responsible for building new campaigns and refreshing/continuously optimising existing campaigns, including conversion rate optimisation to achieve cost-per-lead, volume and quality targets. You will also create programmatic channel, vendor and source performance reports to analyse the development, placement, and overall effectiveness of the PPC campaigns and tests. Remuneration and Benefits A highly-competitive salary and benefits. 25 days annual leave, plus bank holidays, and additional summer and Christmas holidays. Continuing professional development in a life-long learning culture. An entrepreneurial, ambitious and growing company with an inspiring mission. H ow to Apply Please submit a covering letter (of no more than three pages) and CV describing how you meet the person specification by midday Thursday 13 April 2017. Your application will be assessed upon submission. Therefore, immediate applications are encouraged. Posting Date: 25th January 2017 Closing Date: 14th ESSENTIAL DUTIES AND RESPONSIBILITIES: Create and implement all paid search activities and campaigns based on target requirements, including all keyword research, campaign implementation, copywriting and ongoing optimisation. Analyse performance daily to ensure programmes meet enquiry and cost per enquiry goals. Review landing page content and assets regularly, providing recommendations to Marketing Managers for testing in order to continually drive higher click and conversion rates. Work collaboratively and effectively with Marketing Managers on all elements of programmatic channel marketing strategies, budgets, tests, reforecasts and enquiry projections. Provide weekly and monthly reporting to give actionable insight into what is working and what needs improvement to meet enquiry and CPL goals. Implementation and verification of appropriate conversion and web analytics tracking to ensure accurate performance measurement. Communicate with internal OPM Marketing team as Subject Matter Expert on pay-per-click. QUALIFICATIONS MINIMUM REQUIREMENTS Education: Bachelor’s degree in Marketing, Business or Digital Media, ideally with a Google AdWords certification or equivalent. Experience Three plus years’ demonstrable experience in PPC marketing, building AdWords campaigns and utilising the major search engines (Google, Bing), as well as social properties (LinkedIn, Facebook). Proficient in Microsoft Excel to manipulate data and construct reports and charts. Analytic experience using Google Analytics. Proven track record in increasing conversions and net revenue from Paid Search campaigns. Demonstrated critical thinking, decision-making, and problem solving skills. Excellent written and verbal communications skills, including the ability to successfully work with all levels of management. Excellent attention to detail. An understanding of the Higher Education sector, ideally having experience of working within this area. Technical skills Proficient with Microsoft Office Suite, including Outlook, Word, PowerPoint, with an emphasis on Excel. Attitudes Motivated, enthusiastic and has a positive attitude to work. Proactive and seeks to make improvements. Approachable, able to inspire confidence. Creative thinker, always willing to offer new suggestions and ideas\n\n[ad_2]\n\nSource link ", "url": "http://omgili.com/ri/rPCDLkAl21RDfXtuiaQ42geJNUtKA3jAEljqqSTJW9mbgmkXerGomTIikCV3ooiS0J1kkZAifmsryzwlSdywsm3gplmH46uCfI5oxfbSCHh6nd3jdS9M6A--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:39:09.000+03:00", "language": "english", "title": "Digital Marketing (Paid Search) Manager", "thread": {"title_full": "Digital Marketing (Paid Search) Manager", "site_full": "achengula.blogspot.com", "site": "blogspot.com", "site_section": "http://achengula.blogspot.com/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "HOT NEWS AND UPDATES", "url": "http://omgili.com/ri/rPCDLkAl21RDfXtuiaQ42geJNUtKA3jAEljqqSTJW9mbgmkXerGomTIikCV3ooiS0J1kkZAifmsryzwlSdywsm3gplmH46uCfI5oxfbSCHh6nd3jdS9M6A--", "published": "2017-04-16T09:39:09.000+03:00", "title": "Digital Marketing (Paid Search) Manager", "uuid": "600bb78f9af4855360900255768394a474c3d502", "main_image": null}, "uuid": "600bb78f9af4855360900255768394a474c3d502", "ord_in_thread": 0}]