[{"entities": {"organizations": [{"name": "marlins riddle", "sentiment": "negative"}, {"name": "mets", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "marlins", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "majors", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}], "persons": [{"name": "j.t. riddle", "sentiment": "negative"}, {"name": "riddle", "sentiment": "negative"}, {"name": "a.j. ramos", "sentiment": "none"}, {"name": "neil walker", "sentiment": "none"}, {"name": "addison reed", "sentiment": "none"}, {"name": "lucas duda", "sentiment": "none"}, {"name": "travis d'arnaud", "sentiment": "none"}, {"name": "brad ziegler", "sentiment": "none"}, {"name": "yoenis cespedes", "sentiment": "none"}, {"name": "duda", "sentiment": "none"}, {"name": "anthony dicomo", "sentiment": "none"}, {"name": "bour", "sentiment": "none"}, {"name": "jay bruce", "sentiment": "none"}, {"name": "joe frisaro", "sentiment": "none"}, {"name": "justin bour", "sentiment": "none"}, {"name": "david phelps", "sentiment": "none"}, {"name": "matt harvey", "sentiment": "none"}, {"name": "walker", "sentiment": "none"}, {"name": "ozuna", "sentiment": "none"}, {"name": "yelich", "sentiment": "none"}, {"name": "bruce", "sentiment": "none"}, {"name": "asdrubal cabrera", "sentiment": "none"}, {"name": "garcia", "sentiment": "none"}, {"name": "cespedes", "sentiment": "none"}, {"name": "marcell ozuna", "sentiment": "none"}, {"name": "jose reyes", "sentiment": "none"}, {"name": "dan straily", "sentiment": "none"}, {"name": "wilmer flores", "sentiment": "none"}, {"name": "jarlin garcia", "sentiment": "none"}]}, "uuid": "6253d9e1519c242f1014a9eddcf1f9449f10fb67", "highlightText": "", "title": "Riddle's 2-run walk-off homer lifts Marlins", "thread": {"site": "mlb.com", "country": "US", "participants_count": 1, "site_full": "m.mlb.com", "section_title": "MLB News Index", "uuid": "6253d9e1519c242f1014a9eddcf1f9449f10fb67", "site_section": "http://mlb.mlb.com/partnerxml/gen/news/rss/mlb.xml\r", "domain_rank": 627, "main_image": "http://m.mlb.com/assets/images/6/2/4/224690624/cuts/strailygamer_yr9owg0h_ynyy406l.jpg", "performance_score": 2, "published": "2017-04-16T23:56:28.000+03:00", "url": "http://omgili.com/ri/2wGaacqxApu4zzP7PPoEbhznJzHBkWYGpkHGDPr5lkjkFjUHrSH2.avECrD.zxJeY8Rt0ZBk1b1JdcDsUJjtjf6FVPXlkOkbUqJB7BamMTEh2sz1_iT3lg--", "title_full": "Riddle's 2-run walk-off homer lifts Marlins", "title": "Riddle's 2-run walk-off homer lifts Marlins", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 279, "shares": 279, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T23:56:28.000+03:00", "url": "http://omgili.com/ri/2wGaacqxApu4zzP7PPoEbhznJzHBkWYGpkHGDPr5lkjkFjUHrSH2.avECrD.zxJeY8Rt0ZBk1b1JdcDsUJjtjf6FVPXlkOkbUqJB7BamMTEh2sz1_iT3lg--", "ord_in_thread": 0, "crawled": "2017-04-16T23:56:28.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Joe Frisaro and Anthony DiComo", "text": "Riddle's 2-run walk-off homer lifts Marlins Riddle's walk-off two-run homer 0:29 J.T. Riddle crushes a walk-off two-run homer for his first career home run in the Majors, winning the game for the Marlins in the 9th inning By Joe Frisaro and Anthony DiComo / MLB.com | + 0 COMMENTS \nMIAMI -- After having a no-hit bid and a two-run lead disappear, the Marlins celebrated a 4-2 walk-off win on Sunday over the Mets when J.T. Riddle crushed a two-out, two-run homer in the ninth inning off Addison Reed . \nRiddle, who collected his first big league hit on a check swing single a few days ago, left no-doubt with his homer to right field. The blast came after the Marlins lost a replay challenge that Mets catcher Travis d'Arnaud blocked the plate, preventing Marcell Ozuna from scoring. Full Game Coverage \n\"It's crazy,\" said Riddle, who was called up last Sunday after shortstop Adeiny Hechavarria went on the disabled list. \"It's funny how baseball works sometimes. My first hit is a check-swing bouncer off the ground, and then to come up in a situation like that. To do that, it's hard to explain.\" \nIn a wild four-game series, the Marlins rebounded after losing, 9-8, in 16 innings on Thursday night to take the next three. \n\"It was an amazing feeling,\" Riddle said. \"Something you dream of as a kid, and then to be here, doing that to get a walk-off home run and a series win against the Mets.\" Marlins carry no-hitter into 8th NYM@MIA: Marlins carry combined no-no into the 8th The Marlins carry a combined no-hitter into the 8th inning, headlined by Dan Straily's five K's over 5 1/3 strong frames in the team's win \nMarlins starter Dan Straily and the bullpen were trying to accomplish a franchise-first, which was a combined no-hitter. For 7 2/3 innings, they held New York without a hit before Neil Walker 's clean single to center off Brad Ziegler . \n\"At the end of the day, it would have been really cool,\" Straily said of a combined no-hitter. \"Those don't come very often. But at the same time, we got the win, that was most important.\" \nMiami carried a two-run lead into the ninth inning before the Mets rallied with two outs off David Phelps , who was getting the save chance because A.J. Ramos was unavailable. But with two outs, pinch-hitter Asdrubal Cabrera delivered a two-run single to center. Ozuna hangs onto wall for catch NYM@MIA: Ozuna hangs off the wall to make great grab Marcell Ozuna climbs the wall in left field and holds on to rob Wilmer Flores of extra bases in the top of the 5th inning \nOzuna, who had an RBI double in the sixth inning, made a terrific catch at the wall in the fifth inning to rob Wilmer Flores of extra-bases. \nMets right-hander Matt Harvey worked six innings, allowing two runs (one earned) on seven hits with five strikeouts. \n\"This is a good baseball team,\" manager Terry Collins said. \"We have issues like everybody else, but we're trying to mesh a pitching staff we've got to be careful of and a bullpen we're going to be careful of. We're going to be OK.\" Harvey K's Bour NYM@MIA: Harvey strikes out Bour swinging in the 2nd Matt Harvey strikes out Justin Bour swinging for his first K of the game in the bottom of the 2nd inning \nMOMENTS THAT MATTERED Garcia in relief: Straily may not have allowed any hits through 5 1/3 innings, but his pitch count was up to 93 after issuing one-out walks to Walker and Yoenis Cespedes . Miami went with rookie left-hander Jarlin Garcia to face left-handed hitting Jay Bruce and Lucas Duda . With Miami ahead by a run at the time, Bruce struck out and Duda lifted a lazy fly ball to left. Ozuna's RBI double NYM@MIA: Ozuna drives an RBI double to left field Marcell Ozuna rips a double into left that scores Christian Yelich, giving the Marlins a 2-0 lead in the bottom of the 6th inning \nAdd-on run, but key out: The Marlins got a critical add-on run in the sixth inning when Ozuna laced an RBI double into the gap in left-center. Yelich scored from second, but Justin Bour was thrown out at the plate. Cespedes threw to Jose Reyes , whose relay to the plate got Bour. There was a little confusion on the play, as catcher Travis d'Arnaud applied the tag, while his leg prevented Bour from reaching home. The Marlins didn't challenge if d'Arnaud blocked the plate, and Bour was out. More > \n\"I didn't think we had a shot,\" d'Arnaud said. \"But Jose's throw was right on the money. I just tried to apply the tag as quick as I could to be able to get him.\" \nQUOTABLE \"This was a strange series -- a 16-inning game and then basically three walk-offs. Certainly some strange things happened really this entire road trip. But the good news is we came away from these two series with four wins and three losses. So we'll take the positives out of this.\" --Walker, on the Mets' road trip. More > \n\"This last week, I thought had it all. It's been a great first homestand, and a great first impression on me being down here, being new to Miami. It's been a lot of fun.\" -- Straily, on a week in Miami that featured two walk-off wins, a 16-inning loss, a power-outage delay and a delay because a cat was in the outfield. Ozuna's liner hits Stanton NYM@MIA: Stanton hit by liner running to second base While trying to pull off a hit-and-run, Giancarlo Stanton is struck by Marcell Ozuna's screaming line drive in the 4th inning \nRUN AND BE HIT Falling into the category of \"you don't see that everyday,\" Ozuna lined a base hit in the fourth inning that left a mark on his teammate, Giancarlo Stanton . On the play, Stanton was on first and executing a hit-and-run play. Ozuna lined sharply, and the ball was headed towards right field, but instead, it deflected off Stanton, who tried to stride out of the way, but the ball found his left hip. The pitch from Harvey was clocked at 94.5 mph, and the exit velocity, according to Statcast™ , was 92 mph. \nBy rule, Ozuna is credited with a single, but Stanton is ruled out. The putout went to the closest Mets defender, which was second baseman Walker. Mets nab Ozuna at home NYM@MIA: Mets cut down Ozuna at home, call confirmed Yoenis Cespedes and Asdrubal Cabrera team up to throw out Marcell Ozuna at home plate, and the call is confirmed after the Marlins challenge \nUPON FURTHER REVIEW The Marlins challenged that d'Arnaud blocked the plate, not giving Ozuna a chance to score on Miguel Rojas ' double to left in the ninth inning. Cespedes relayed to Cabrera who made a strong throw home. After a short review, Ozuna was ruled out. \nMattingly accepted the fact that Ozuna was out, but he noted that the 30 seconds to make a decision to challenge or not is something he'd like more clarity on. \n\"I think he was out,\" Mattingly said. \"So nothing got changed by it. But I do think it could have. It could have been one of those [decisions] you don't challenge because you ran out of time.\" \nWHAT'S NEXT Mets: Following an off-day Monday, the Mets will return to Citi Field to begin a nine-game, 11-day homestand against the Phillies, Nationals and Braves. First up is a three-game set against Philadelphia, with Zack Wheeler opposing right-hander Zach Eflin in Tuesday's 7:10 p.m. ET opener. \nMarlins: The Marlins start a nine-game road trip, beginning on Monday night at 10:10 p.m. ET at Seattle. Tom Koehler (0-0, 3.27) gets the start for Miami, with lefty Ariel Miranda (0-1, 5.06) getting the nod for the Mariners. The series will feature the return of Miami outfielder Ichiro Suzuki to Safeco Field. \nWatch every out-of-market regular-season game live on MLB.TV . has covered the Marlins for MLB.com since 2002.   @JoeFrisaro and listen to his podcast . has covered the Mets for MLB.com since 2008.   @AnthonyDiComo and Facebook , and listen to his podcast  "}]