[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/GiCaV2xJNYud4BM9ZaOqT4jig2UfkFOA3tD0.ZWsf0dA9TbqdNoj55Bl.rT3YsKVu4peCPI2FC4zLRBuMry5C3sV0Th6cVSXQeQAgoueIt0VK9UMYilynA--", "title": "Review ~ The Classic FM Musical Treasury by Tim Lihoreau", "site_type": "blogs", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://jaffareadstoo.blogspot.com/", "spam_score": 0.0, "section_title": "jaffareadstoo....", "site": "blogspot.com", "site_full": "jaffareadstoo.blogspot.com", "performance_score": 0, "uuid": "62e8760f22f33b436399e5db3353878ecb571769", "published": "2017-04-17T11:24:41.000+03:00", "site_categories": [], "country": "US", "title_full": "Review ~ The Classic FM Musical Treasury by Tim Lihoreau", "participants_count": 1, "main_image": null}, "url": "http://omgili.com/ri/GiCaV2xJNYud4BM9ZaOqT4jig2UfkFOA3tD0.ZWsf0dA9TbqdNoj55Bl.rT3YsKVu4peCPI2FC4zLRBuMry5C3sV0Th6cVSXQeQAgoueIt0VK9UMYilynA--", "title": "Review ~ The Classic FM Musical Treasury by Tim Lihoreau", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:24:41.000+03:00", "language": "english", "entities": {"locations": [], "persons": [], "organizations": []}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "62e8760f22f33b436399e5db3353878ecb571769", "published": "2017-04-17T11:24:41.000+03:00", "author": "jaffareadstoo..... (noreply@blogger.com)", "text": "Elliot & Thompson\n9 March 2017 \nA curious collection of new meanings for old words. \n\n\n\n\nWhat's it all about ... \nThere are all sorts of people, events and sounds that exist in the musical world for which there are no words. We have been sadly bereft of a satisfactory way to describe the contortion of a singer’s mouth when reaching for the high notes; the audience member who leaves a concert halfway through the grand finale; or that person who places one finger in their ear and raises their eyes heavenwards when they sing. \n\nWhat did I think about it... \n\nIt's no secret that I love listening to Classic FM , particularly on a Sunday morning when I am preparing my blog posts for the week ahead. So, to have a new musical treasury is a real treat especially as it is written by Classic FM presenter, Tim Lihoreau. \nThe Classic FM Musical Treasury is a feast for the senses, as not only does it have a delightfully humorous approach to musical facts, there is also the possibility of learning something you never knew you needed to know.  There should always be a word to describe what's happening in music but when that word doesn't exist, well as this book suggest, why not create one... \nThe treasury is divided into ten sections and spans Performers and their Works, through to, my favourite section, Trivia and Treats. This treasury incorporates, with musical suggestions, to quote the author... \"the place names of towns and villages, the suburbs,  hamlets, digs, dens, the quarters and quoins of this beautiful land of ours…” \nI was especially heartened to see the name of a village a couple of miles away from Jaffareadstoo mentioned on the very first page. It made me smile and thus set the scene for the rest of this delightful treasury which had me nodding in agreement on more than one occasion and which sent me scurrying through the book to spot other place names I recognised. \nFor classical music fans this book is definite smorgasbord of different musical meanings which stretch and fire the imagination. \nThese are just a few of my favourite place names within this musical meandering… \nJolly’s bottom (pg202) Trivia and Treats Steeple Bumstead (pg37) Performers and Performances Totley Rise (pg60) Concerts, Festivals and Tours And my absolute favourite is Buldoo (pg163) Composers and their Works …this definition made me laugh out loud... \n‘a faux Scottish work of light music purporting to ‘evoke the sights and sounds of the highlands’ (written ten years ago originally about farming and kept in a bottom drawer ready to be re-branded when the opportunity arose). \nAnd one for Jaffa… Cat’s Bank (pg8) Performers and Performances \n'names in a fixer's little black book that can be called on when a diva falls ill\" \nIf you like random musical quirkiness with a hint of the absurd all melted together with British eccentricity then this book works really well. \n\nBest Read with... A Hamperley of Apperley Parva and a glass or two of Hartsop \n\n\nAbout the Author \n\nTim Lihoreau presents one of the most popular breakfast shows on commercial radio: Classic Fm's More Music Breakfast.\n\n\n\nMy thanks to Alison  at Elliot & Thompson for this delightful treasury  \n\n\n~***~ \n\n\n"}]