[{"rating": null, "external_links": [], "crawled": "2017-04-16T08:37:31.000+03:00", "author": "AFN News Staff", "entities": {"persons": [{"name": "cheryl haselhorst/afn staff photogra", "sentiment": "none"}, {"name": "sal diciccio", "sentiment": "none"}], "locations": [{"name": "gila river branch-komatke", "sentiment": "none"}, {"name": "pecos", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "ahwatukee", "sentiment": "none"}, {"name": "gila river indian community", "sentiment": "none"}, {"name": "pecos road", "sentiment": "none"}, {"name": "east valley", "sentiment": "none"}, {"name": "laveen", "sentiment": "none"}, {"name": "south mountain freeway", "sentiment": "none"}, {"name": "phoenix", "sentiment": "none"}, {"name": "west pecos road", "sentiment": "none"}, {"name": "salt river", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "afn news staff", "sentiment": "none"}, {"name": "arizona department of transportation", "sentiment": "none"}, {"name": "u.s. army corps of engineers", "sentiment": "none"}, {"name": "adot", "sentiment": "none"}, {"name": "girls club", "sentiment": "none"}, {"name": "u.s. district court of appeals", "sentiment": "none"}, {"name": "environmental protection agency", "sentiment": "none"}, {"name": "ninth circuit", "sentiment": "none"}, {"name": "corps of engineers", "sentiment": "none"}, {"name": "federal highway administration", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "gila community", "sentiment": "none"}]}, "text": "Feds schedule water permit hearing for freeway AFN News Staff 0 Cheryl Haselhorst/AFN Staff Photographer As work crews continue to straighten out problems involving the interim Pecos Road, the U.S. Army Corps of Engineers announced it will hold a public hearing next month on a permit needed for the South Mountain Freeway. The hearing – 6-9 p.m. May 9 at the Boys and Girls Club of the East Valley, Gila River Branch-Komatke, 5047 West Pecos Road, Laveen – won’t slow down construction, the Arizona Department of Transportation said in a release last week. “The project remains on track for completion in late 2019,” ADOT said, adding its “project team will move forward with other construction while the May 9 hearing is pending.” Any work occurring in a designated waterway that falls under the jurisdiction of the U.S. Army Corps of Engineers and the Environmental Protection Agency requires a so-called Section 404 Clean Water Act permit. “Along the 22-mile South Mountain Freeway corridor, these areas, including the Salt River, various washes and a conveyance channel in Laveen, are being been roped off and identified by signs saying “Waters of the United States,’” ADOT said. The Gila River Indian Community early last year requested the hearing, which the Corps of Engineers has the discretion to hold. “ADOT has worked closely with stakeholders to plan a South Mountain Freeway that not only meets strict environmental standards but also addresses one of the most critical transportation needs in the Valley: an east-west alternative to Interstate 10 through downtown Phoenix,” the department said in a release, saying its 13-year analysis was “the most extensive environmental review of any highway project to date in Arizona.” That position is at the heart of the appeal by the Gila Community and Ahwatukee-based Protect Arizona’s Resources and Children, which is attempting to stop the freeway’s construction. They are asking the U.S. District Court of Appeals for the Ninth Circuit to overturn a federal judge’s finding that ADOT and the Federal Highway Administration complied with all environmental regulations when the agencies planned the freeway. Meanwhile, ADOT and freeway developer Connect202Partners are continuing to field complaints from motorists and residents about overnight construction noise and the condition of the interim Pecos Road between 24th and 40th streets in Ahwatukee. “My experience was one of the most frightening driving situations ever,” one motorist wrote on social media about the road as he recounted how the glare of the rising morning sun blotted out lane markings and signs on the new road. “What you could see was the sun reflecting off the old tar lines from previous repair of Pecos,” he said. “Those lines appeared to look like the road was straight, but it wasn’t. The next thing I saw was a car coming straight at mine. Thankfully nothing happened, but it was close. ADOT needs to make a lane divider separating the two directions of traffic or there is bound to be a serious head-on.” ADOT has stated it and the freeway developer are continuing to upgrade signage and road striping along the makeshift interim roadway, and reduce long traffic jams on 40th Street and Pecos Road. \n“I completely agree that what happened on Pecos Road this past week is not safe and not conducive to allowing traffic to get through,” city Councilman Sal DiCiccio posted on Facebook Friday, adding that ADOT told him it had made some improvements last week and would be continuing this week. Tags", "url": "http://omgili.com/ri/jHIAmI4hxg8Vo8uWgjB9AUG6zxS72ThyHBGNmpxNIZDTuC44amRSnKlHmuMPrI_aHSw4mW4Mxbve2gSHxAW5Qf8s4nCWjaLS6bqgOYr3qai4YfaoR63nhEFDifkgZbwhwQy0dtSOuus-", "highlightText": "", "highlightTitle": "", "published": "2017-04-14T21:00:00.000+03:00", "language": "english", "title": "Feds schedule water permit hearing for freeway", "thread": {"title_full": "Feds schedule water permit hearing for freeway", "site_full": "www.ahwatukee.com", "site": "ahwatukee.com", "site_section": "http://www.ahwatukee.com/search/?q=&quot;politics&quot;&t=&l=25&d=&d1=&d2=&s=start_time&sd=desc&f=rss", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "www.ahwatukee.com - RSS Results", "url": "http://omgili.com/ri/jHIAmI4hxg8Vo8uWgjB9AUG6zxS72ThyHBGNmpxNIZDTuC44amRSnKlHmuMPrI_aHSw4mW4Mxbve2gSHxAW5Qf8s4nCWjaLS6bqgOYr3qai4YfaoR63nhEFDifkgZbwhwQy0dtSOuus-", "published": "2017-04-14T21:00:00.000+03:00", "title": "Feds schedule water permit hearing for freeway", "uuid": "63f96bb63f5767b77d39f2a8b2e3c7803c921244", "main_image": "http://bloximages.chicago2.vip.townnews.com/ahwatukee.com/content/tncms/assets/v3/editorial/8/ec/8ec6024e-7f52-11e6-ac15-2f7ab4417bdd/57e1698b4f641.image.jpg?resize=949%2C630"}, "uuid": "63f96bb63f5767b77d39f2a8b2e3c7803c921244", "ord_in_thread": 0}]