[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/uBQNNiLKiWarOBJfFzTgVofOoNADvX6AcQWiujlO0bO0Sc5uzxXf8Ejmz.Nk30TzqLqYi4KULnP8eIb7W0VQJdcDEk6CEmSKihfl5VAXeBUHdH3OYJVgAeaLAHwlojFNfscP5Kxx5LrejdACre71lw--", "title": "JW Marriott Starr Pass Resort & Spa Appoints Fransua Executive Chef", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://hotelexecutive.com/rss.xml", "spam_score": 0.0, "section_title": "HotelExecutive.com - Your view from the top", "site": "hotelexecutive.com", "site_full": "hotelexecutive.com", "performance_score": 0, "uuid": "644cec0092f4ea87c0dbd99c2ceaa0452e034e71", "published": "2017-04-17T08:00:00.000+03:00", "site_categories": [], "country": "US", "title_full": "JW Marriott Starr Pass Resort & Spa Appoints Fransua Executive Chef", "participants_count": 0, "main_image": ""}, "url": "http://omgili.com/ri/uBQNNiLKiWarOBJfFzTgVofOoNADvX6AcQWiujlO0bO0Sc5uzxXf8Ejmz.Nk30TzqLqYi4KULnP8eIb7W0VQJdcDEk6CEmSKihfl5VAXeBUHdH3OYJVgAeaLAHwlojFNfscP5Kxx5LrejdACre71lw--", "title": "JW Marriott Starr Pass Resort & Spa Appoints Fransua Executive Chef", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:26:25.000+03:00", "language": "english", "entities": {"locations": [{"name": "jw marriott orlando grande lakes", "sentiment": "none"}, {"name": "w. starr pass boulevard", "sentiment": "none"}, {"name": "tucson national park", "sentiment": "none"}, {"name": "starr canyon river", "sentiment": "none"}, {"name": "tucson", "sentiment": "none"}, {"name": "az", "sentiment": "none"}, {"name": "phoenix sky harbor international airport", "sentiment": "none"}, {"name": "denver", "sentiment": "none"}, {"name": "tucson international airport", "sentiment": "none"}, {"name": "jw marriott houston", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "monsoon falls", "sentiment": "none"}], "persons": [{"name": "russ bond", "sentiment": "none"}, {"name": "fransua", "sentiment": "none"}, {"name": "arnold palmer", "sentiment": "none"}, {"name": "david fransua", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "bond", "sentiment": "none"}, {"name": "ryan eller", "sentiment": "none"}], "organizations": [{"name": "jw marriott starr pass resort & spa appoints fransua executive chef appointments & promotions jw marriott starr pass resort & spa", "sentiment": "none"}, {"name": "aaa four diamond", "sentiment": "none"}, {"name": "marriott international", "sentiment": "none"}, {"name": "starr pass", "sentiment": "none"}, {"name": "marriott", "sentiment": "none"}, {"name": "hotel business review", "sentiment": "none"}, {"name": "starr pass golf club", "sentiment": "none"}, {"name": "hashani spa", "sentiment": "none"}, {"name": "art institute of colorado", "sentiment": "none"}, {"name": "colwen hotels", "sentiment": "none"}, {"name": "homewood suites boston logan airport chelsea opens business & finance", "sentiment": "none"}, {"name": "hotelexecutive.com", "sentiment": "none"}, {"name": "jw marriott starr pass resort & spa", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "aaa four diamond starr pass resort & spa", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "jw marriott starr pass resort", "sentiment": "none"}, {"name": "rising starr kid's club", "sentiment": "none"}, {"name": "inc", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "644cec0092f4ea87c0dbd99c2ceaa0452e034e71", "published": "2017-04-17T08:00:00.000+03:00", "author": "", "text": "Appointments & Promotions JW Marriott Starr Pass Resort & Spa Appoints Fransua Executive Chef \nTUCSON, AZ. April 17, 2017 \u0096 David Fransua has been named Executive Chef for the JW Marriott Starr Pass Resort & Spa in Tucson, Arizona, according to General Manager Russ Bond. \nFransua brings more than 16 years of culinary experience to the 575-room, AAA Four Diamond property. His career with Marriott International began in 2005 as a banquet sous chef at the JW Marriott Orlando Grande Lakes, and has held similar positions at various Marriott properties including three prior executive chef positions. Fransua was most recently the Executive Chef at the JW Marriott Houston. \n\"I'm pleased to announce David's appointment to executive chef at Starr Pass,\" said Mr. Bond. \"He brings an impressive track record and years of revered culinary and management experience to the team. His passion for food, unwavering dedication and respected leadership skills will be integral in maintaining the resort's successful culinary programs.\" \nFransua attended the Art Institute of Colorado in Denver, and is married with two children. \nAbout JW Marriott Starr Pass Resort & Spa \nNestled on 50 acres in the saguaro-covered foothills of Tucson National Park, the AAA Four Diamond Starr Pass Resort & Spa is considered one of Tucson's premier destination resorts. Featuring 575 guestrooms (including 35 suites) with picturesque views, the resort offers 88,000 square feet of indoor and outdoor meeting space, six dining experiences, 20,000 square-foot Hashani Spa, fitness center, a collection of outdoor water features including the meandering Starr Canyon River and Monsoon Falls waterslide, the Blur Teen Lounge and Rising Starr Kid's Club, two tennis courts and access to multiple hiking and biking trails on property. Starr Pass Golf Club features 27 holes of championship golf designed by Arnold Palmer. JW Marriott Starr Pass Resort & Spa is located just 12 miles from Tucson International Airport. With easy access to Interstate 10, the resort is a short 90 minute drive from Phoenix Sky Harbor International Airport. Visit us online, or follow us on Facebook, Twitter and Instagram. JW Marriott Starr Pass Resort is located at 3800 W. Starr Pass Boulevard in Tucson. \nContact: Empire Resorts, Inc. Announces Appointment of Ryan Eller as President and Chief Operating Officer Acquisitions & Hotel Openings Developed and Owned by XSS Hotels and Managed by Colwen Hotels, Homewood Suites Boston Logan Airport Chelsea Opens Business & Finance Coming Up In The May Online Hotel Business Review Feature Focus Eco-Friendly Practices: The Value of Sustainability The hotel industry continues to make remarkable progress in implementing sustainability policies and procedures in their properties throughout the world. As a result, they continue to reap the benefits of increased profitability, enhanced guest experiences, and improved community relations. In addition, as industry standards are codified and adopted worldwide, hotels can now compare how their operations measure up against their competitors in terms of sustainable practices and accomplishments. This capacity to publicly compare and contrast is spurring competition and driving innovation as hotels do not wish to be left behind in this area. Water management and conservation is still a primary issue as population growth, urbanization, pollution and wasteful consumption patterns place increasing demands on freshwater supply. Water recycling; installing low-flow fixtures; using digital sensors to control water usage; and even harvesting rainwater are just a few things that some hotels are doing to preserve this precious resource. Waste management is another major concern. Through policies of reduce, reuse and recycle, some hotels are implementing \u0093zero-waste\u0094 programs with the goal of substantially reducing their landfill waste which produces carbon dioxide and methane gases. Other hotels have established comprehensive training programs that reinforce the value of sustainability. There is employee engagement through posters and quizzes, and even contests are held to increase innovation, sensitivity and environmental awareness. Some hotels are also monitoring a guest\u0092s energy usage and rewarding those who consumed less energy with gifts and incentives. The May issue of the Hotel Business Review will document how some hotels are integrating eco-friendly practices into their operations and how they and the environment are benefiting from them. © 1996-2017. All content on HotelExecutive.com is exclusively copyright to HotelExecutive.com and cannot be republished without prior written consent by HotelExecutive.com. & Use"}]