[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:55:19.000+03:00", "author": "Sam Shead", "entities": {"persons": [{"name": "edgar scholler", "sentiment": "none"}, {"name": "søren schmidt", "sentiment": "none"}, {"name": "mickan", "sentiment": "none"}, {"name": "robaczek", "sentiment": "none"}, {"name": "carstensen", "sentiment": "none"}, {"name": "graphcool graphcool  schmidt", "sentiment": "none"}, {"name": "gaëlle walrave", "sentiment": "none"}, {"name": "james currier", "sentiment": "none"}, {"name": "hana ahriz", "sentiment": "none"}, {"name": "firas khalifeh", "sentiment": "none"}, {"name": "lapinski", "sentiment": "none"}, {"name": "heroku", "sentiment": "none"}, {"name": "flyte flyte  mascarenhas", "sentiment": "none"}, {"name": "lang", "sentiment": "none"}, {"name": "charmaine li  li", "sentiment": "none"}, {"name": "axel springer", "sentiment": "none"}, {"name": "marc seitz", "sentiment": "none"}, {"name": "ahriz", "sentiment": "none"}, {"name": "ewelina robaczek", "sentiment": "none"}, {"name": "night  carstensen", "sentiment": "none"}, {"name": "seitz", "sentiment": "none"}, {"name": "freunde von freunden", "sentiment": "none"}, {"name": "ewelina vouchery  robaczek", "sentiment": "none"}, {"name": "ed sheeran", "sentiment": "none"}, {"name": "rihanna", "sentiment": "none"}, {"name": "taqanu taqanu  némethi", "sentiment": "none"}, {"name": "philipp hammerstein", "sentiment": "none"}, {"name": "daly", "sentiment": "none"}, {"name": "rohrwacher", "sentiment": "none"}, {"name": "mascarenhas", "sentiment": "none"}, {"name": "jorge martins", "sentiment": "none"}, {"name": "hackerbay hackerbay  seitz", "sentiment": "none"}, {"name": "eric wahlforss", "sentiment": "none"}, {"name": "hackerbay", "sentiment": "none"}, {"name": "charmaine li", "sentiment": "none"}, {"name": "ruby", "sentiment": "none"}, {"name": "florian mickan", "sentiment": "none"}, {"name": "thetravelogue thetravelogue  ahriz", "sentiment": "none"}, {"name": "lisa lang", "sentiment": "none"}, {"name": "daniel mascarenhas", "sentiment": "none"}, {"name": "milka", "sentiment": "none"}, {"name": "stan chudnovsky", "sentiment": "none"}, {"name": "firas", "sentiment": "none"}, {"name": "udo schloemer", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "tom hanks", "sentiment": "none"}, {"name": "aimie carstensen", "sentiment": "none"}, {"name": "scholler", "sentiment": "none"}, {"name": "julana chondrasch", "sentiment": "none"}, {"name": "kirstyn mcmullan", "sentiment": "none"}, {"name": "brian daly", "sentiment": "none"}, {"name": "sponsokit sponsokit  walrave", "sentiment": "none"}, {"name": "iris lapinski", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "taqanu", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "le wagon germany", "sentiment": "none"}, {"name": "copenhagen", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "state street", "sentiment": "none"}, {"name": "sponsokit", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "github", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "zalando", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "viadrina", "sentiment": "none"}, {"name": "factory berlin", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "carbonworks carbon mobile  firas", "sentiment": "none"}, {"name": "palm beach agency factory  mcmullan", "sentiment": "none"}, {"name": "rolling stones", "sentiment": "none"}, {"name": "factory berlin factory  rohrwacher", "sentiment": "none"}, {"name": "carbon mobile", "sentiment": "none"}, {"name": "uber linkedin/julana chondrasch  chondrasch", "sentiment": "none"}, {"name": "le wagon germany factory  hammerstein", "sentiment": "none"}, {"name": "audi", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "factory", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}, {"name": "soundcloud london & partners  wahlforss", "sentiment": "none"}, {"name": "techstars  factory", "sentiment": "none"}, {"name": "german national academic foundation", "sentiment": "none"}, {"name": "shell", "sentiment": "none"}, {"name": "midnight digital", "sentiment": "none"}, {"name": "carbonworks", "sentiment": "none"}, {"name": "techstars", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "soundcloud", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "lyft", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "css", "sentiment": "none"}, {"name": "electrocouture factory  lang", "sentiment": "none"}, {"name": "palm beach agency", "sentiment": "none"}, {"name": "cmo", "sentiment": "none"}, {"name": "newsweek", "sentiment": "none"}, {"name": "apps for good", "sentiment": "none"}, {"name": "vouchery.io", "sentiment": "none"}, {"name": "facebook messenger", "sentiment": "none"}, {"name": "deloitte digital ventures", "sentiment": "none"}, {"name": "wearable technologies", "sentiment": "none"}, {"name": "cnn travel", "sentiment": "none"}, {"name": "techstars techstars  daly", "sentiment": "none"}, {"name": "vertical media", "sentiment": "none"}, {"name": "ovum", "sentiment": "none"}, {"name": "london school of economics", "sentiment": "none"}, {"name": "twitter germany", "sentiment": "none"}, {"name": "cto", "sentiment": "none"}]}, "text": "You have successfully emailed the post. The 21 most interesting people in Factory Berlin Apr. 16, 2017, 3:20 AM 7,038 print \nBrian Daly is the European marketing manager at TechStars. TechStars \nFactory has become one of Berlin's best-known tech hubs since it was founded in 2011, and the six-storey building is now used by some of the city's most interesting founders, investors, and software engineers. \nMembers pay €50 (£42) a month and get access to desks, free coffee, a nap room, and ping pong tables. A number of larger corporate partners, including Google and Deutsche Bank pay considerably more to access Factory's entrepreneurial community. \nOver a thousand people have signed up to be Factory members and a number of well known startups — including Uber and SoundCloud — have chosen to base themselves out of private Factory offices, either in the main Factory building or in nearby satellite properties that offer slightly more privacy. \nWe rounded up some of the most interesting people working at Factory. See them here: \nFull disclosure: The author of this story is a member of Factory Berlin. 21. Lisa Lang — Founder and CEO of ElectroCouture Factory \nLang founded ElektroCouture, an agency that helps brands to prototype and manufacture fashion and wearable technologies, in 2014. In typical Berlin style, the company uses \"old\" technologies and turns them into new, retro-style products. \nLang was also a mentor to European startups on the hardware.co accelerator programme, and was named one of the 100 most influential people in wearables by Wearable Technologies , which is a website dedicated to promoting wearables. 20. Udo Schloemer — Founder and CEO of Factory Berlin YouTube \nUdo Schloemer is the founder and CEO of Factory. He made his fortune in real estate — by focusing on the restoration of listed buildings and residential properties in Berlin — before going on to invest some of that money into early stage startups like Wunderlist, which was acquired by Microsoft . He set up Factory in 2011 and sells it as a hub for corporates to meet startups and vice versa. 19. Søren Schmidt — Cofounder of Graphcool Graphcool \nSchmidt started his tech career in Copenhagen, Denmark, as a developer at business reviews website TrustPilot. \nAfter nearly seven years, he left to cofound a food startup in London called Eat Better, which aimed to help people improve their diets. Now in Berlin, he's onto his next company: Graphcool. It's a developer platform that can be used to create web and mobile products. The platform launched a year ago and companies such as Twitter Germany and app developer Hackerbay have already signed up as early beta customers. 18. Kirstyn McMullan — Founder of Palm Beach Agency Factory \nMcMullan is an Australian creative who moved to Berlin two years ago to start Palm Beach Agency. The agency designs and develops digital experiences for websites, web apps, and native apps. It also helps companies put on events and produce magazines. Palm Beach Agency is currently working on a variety of projects for startup and corporate companies like Data Revenue, The Collective, Deloitte Digital Ventures, Milka, and DAX30 in Berlin, London, and San Francisco. 17. Charmaine Li — Freelance writer and journalist Charmaine Li \nLi is a Canadian writer and journalist based in Berlin specialising in art, design, and technology. Her work has appeared in Newsweek, AnOther Magazine, CNN Travel, Kinfolk, Dazed Digital, and Freunde von Freunden among others. She's also a regular contributor to Factory's own magazine. Previously, she was an online editor at iGNANT, a senior editor at Tech.eu, and an editor at Vertical Media. 16. Brian Daly — European marketing manager at TechStars TechStars \nDaly is the European marketing manager for Techstars, which is a well-known startup accelerator program. Daly moved to Germany two years ago to launch Techstars in Berlin. Prior to that, he worked for Web Summit, a technology conference with its HQ in Dublin. 15. Niclas Rohrwacher — Cofounder and chief relations officer at Factory Berlin Factory \nRohrwacher is chief relations officer at Factory Berlin. Rohrwacher founded his first startup, Mentor, in 2012 at the age of 24. One year later, he cofounded digital agency Midnight Digital and signed up the likes of Google, Shell, and Deutsche Bank as clients. In 2015, Midnight was sold to Factory. \nRohrwacher is also a trained stage actor with more than 150 German and international stage performances and film roles. In his free time, Rohrwacher organises theatre plays across Germany with his theatre troupe \"Die Achse\". 14. Edgar Scholler — Founder of Getaway Getaway \nScholler's app Getaway allows people to pay to unlock and use other people's cars. Car owners can connect their cars to the Getaway fleet whenever they're not using it and have it generate income. \nPrior to Getaway, Scholler studied economics in Berlin. He is also a scholar of the German National Academic Foundation. 13. Firas Khalifeh — Cofounder and CTO of CarbonWorks Carbon Mobile \nFiras is a cofounder and CTO at CarbonWorks, the company that created the Carbon smartphone , which is made of composites and nanotechnology. Firas cofounded Carbon Mobile with his partner Jorge Martins in 2015. 12. Hana Ahriz — Founder of TheTravelogue TheTravelogue \nAhriz left her job as a project manager for Airbnb in France to launch a travel startup called The Travelogue. The company, which is still in stealth mode, will aim to create digital tools for solo travellers, and particularly female solo travellers. Prior to joining Airbnb, Ahriz worked for Uber in Berlin. 11. Ewelina Robaczek — Cofounder and CEO of Vouchery.io Ewelina Vouchery \nRobaczek is cofounder and CEO of Vouchery.io, a management software company launched in 2016. Vouchery.io aims to help companies to optimise their promotional spending and prevent coupon abuse. Robaczek previously worked at Berlin tech giant Rocket Internet. 10. Iris Lapinski — Founder and CEO of Apps for Good Apps for Good \nLapinski runs Apps for Good, an organisation that aims to get people in schools to learn how to create apps and websites. Over the past seven years, Apps for Good claims it has reached over 1,500 schools and 75,000+ 11-18 year olds across the UK, Portugal, USA, Spain, Poland, and several other countries \nLapinski dropped out of an electronic engineering degree then completed an undergraduate degree in cultural studies in Germany and a master's degree in Human Rights from the London School of Economics. She has a background in commercial digital media and telecoms consulting, as well as running business planning and strategy projects, particularly in sub-Saharan Africa and the Middle East for Ovum. 9. Balázs Némethi — CEO of Taqanu Taqanu \nNémethi is the founder of Taqanu, which is a bank for refugees and for people without a fixed address. It says on its website that it uses a blockchain-based digital ID to provide banking to everyone, regardless of their background and what documents they have available. The early-stage company, which employs five people, is yet to launch its app and bank card but it's inviting people to pre-apply. 8. Florian Mickan — Managing Director of Factory Kitchen Factory \nMickan is managing director of Factory Kitchen — a restaurant inside the main Factory building that makes fast and healthy food. \nHe learnt to cook in Berlin's most prestigious hotel restaurants and has cooked for Barack Obama, Tom Hanks, and The Rolling Stones. Prior to joining Factory, Mickan spent some time in Australia, where he learnt how to catch fish with his own hands. 7. Daniel Mascarenhas — Cofounder and CMO of Flyte Flyte \nMascarenhas is the cofounder of Flyte, which creates levitating products including light bulbs, plants, and clocks that range from $15 (£12) to more than $1,000 (£805). Mascarenhas also mentors other creators looking to build successful Kickstarter campaigns. 6. Aimie Carstensen — Founder of ArtNight Art Night \nCarstensen cofounded ArtNight, a digital platform that's designed to bring people together via two hour do-it-yourself workshops in bars and restaurants. \nCarstensen started her career at Axel Springer and she holds a masters degree in business from Viadrina, which is a university in Frankfurt. 5. Julana Chondrasch — Marketing manager at Uber LinkedIn/Julana Chondrasch \nChondrasch is a marketing manager at Uber who helped to launch Uber in Berlin and scale it in other German cities. \nHer job at Uber involves working on marketing strategy, brand and campaigns, communications, partnerships, media, social media, email marketing, events, rider support and community building. 4. Gaëlle Walrave — Founder of Sponsokit Sponsokit \nWalrave is the founder of Sponsokit, which is a platform that's designed to connect marketers with YouTube celebrities. \nIn April 2016, her company was selected to join the TechStars accelerator programme in London. She now runs the business from one of the Factory's family buildings, which means Sponsokit can have its own space while still accessing the Factory community. \nSponsokit employs 10 people at present and has several multi-billion dollar companies as clients, including Universal, and Zalando. 3. Philipp Hammerstein — Driver of Le Wagon Germany Factory \nHammerstein heads up Le Wagon Germany, which is a coding bootcamp founded in France. The bootcamp aims to teach people computing languages like Ruby, Ruby on Rails, JavaScript, jQuery, SQL, HTML, CSS, APIs, Github, and Heroku (among other things). Over 75 companies have been started by its alumni, with several of them going on to raise funding for a startup or join established tech companies like as Uber and Stripe. 2. Eric Wahlforss — Cofounder of SoundCloud London & Partners \nWahlforss is the cofounder and chief product officer of music streaming company SoundCloud, which occupies three floors of the main Factory building. \nSoundCloud's platform allows creatives around the world to upload their content onto the internet. More than 150 million pieces of content have been uploaded to SoundCloud, including music from the likes of Rihanna and Ed Sheeran. 1. Marc Seitz — CTO and Founding Partner of Hackerbay Hackerbay \nSeitz is a self-taught hacker, as well as the CTO and founding partner of Hackerbay — a platform that connects corporations to a network of app developers. \nFounded in 2016, Hackerbay's clients already include Twitter, Facebook, Lyft, Audi, and Wirecard. Twitter, for example, asked Hackerbay's founders to work on several projects and one of them included digitising a foosball table in its Berlin office — something they were able to do in 24 hours. The company charges €15,000 (£13,000) on average for each application. \nHackerbay's investors include Stan Chudnovsky, head of product at Facebook Messenger, and venture capitalist James Currier. \nSeitz holds two degrees in physics and finance and prior to Hackerbay he worked at State Street, an investment management firm, building financial products for Wall Street.", "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meuL1ei1Bo_4WHN6_cTFcBDJE7ZBZsJRKNCS6Qeyk2goV2o6ZR2R8saqQYJdLkMyaWw5fvlazUFnqC0n7qOaoQBYBDdWWy27VFg--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T10:55:19.000+03:00", "language": "english", "title": "The 21 most interesting people in Factory Berlin", "thread": {"title_full": "The 21 most interesting people in Factory Berlin", "site_full": "www.businessinsider.com", "site": "businessinsider.com", "site_section": "http://feedproxy.google.com/typepad/alleyinsider/silicon_alley_insider", "performance_score": 0, "social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "facebook": {"likes": 48, "shares": 48, "comments": 0}, "linkedin": {"shares": 209}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": 283, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Tech Insider", "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meuL1ei1Bo_4WHN6_cTFcBDJE7ZBZsJRKNCS6Qeyk2goV2o6ZR2R8saqQYJdLkMyaWw5fvlazUFnqC0n7qOaoQBYBDdWWy27VFg--", "published": "2017-04-16T10:55:19.000+03:00", "title": "The 21 most interesting people in Factory Berlin", "uuid": "649909c034bf4e9c9c53c631a1e0096de38ea68d", "main_image": "http://static4.businessinsider.com/image/58f31b3edd089513788b4833-1190-625/the-21-most-interesting-people-in-factory-berlin.jpg"}, "uuid": "649909c034bf4e9c9c53c631a1e0096de38ea68d", "ord_in_thread": 0}]