[{"uuid": "64f07b41fb2d04ebbc3f053a8f860f1f6460595a", "url": "http://omgili.com/ri/jHIAmI4hxg.xFuPC2FweVywcOuV6tnrFA2tf4ARAFaQ3SwppaHv.4ACUM6PCnGxF6x0m_EegRMiJAq.kt.6r97QcNn5eO00A89cfpfZKm.xifx8RPRr72VX4dFbfl2Qs8dYMkkEB7GfW84vVqkfj7Q--", "title": "Proposed bills would gut local zoning regulations", "author": "", "rating": null, "published": "2017-04-18T10:02:00.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "franklin", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house", "sentiment": "none"}], "locations": [{"name": "williamson county", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}], "persons": [{"name": "franklin may", "sentiment": "negative"}, {"name": "ken moore", "sentiment": "negative"}, {"name": "franklin", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "ken moore bill", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "64f07b41fb2d04ebbc3f053a8f860f1f6460595a", "url": "http://omgili.com/ri/jHIAmI4hxg.xFuPC2FweVywcOuV6tnrFA2tf4ARAFaQ3SwppaHv.4ACUM6PCnGxF6x0m_EegRMiJAq.kt.6r97QcNn5eO00A89cfpfZKm.xifx8RPRr72VX4dFbfl2Qs8dYMkkEB7GfW84vVqkfj7Q--", "site_full": "www.tennessean.com", "title": "Proposed bills would gut local zoning regulations", "site_section": "http://rssfeeds.tennessean.com/nashville/opinion", "domain_rank": 13759, "published": "2017-04-18T10:02:00.000+03:00", "title_full": "Proposed bills would gut local zoning regulations", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "GANNETT Syndication Service", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "https://www.gannett-cdn.com/-mm-/62afc000cfe86361d615f028f11cf8305ff43646/c=0-50-1389-835&amp;r=x633&amp;c=1200x630/local/-/media/Nashville/2014/05/22/moore0309.jpg", "site": "tennessean.com"}, "external_links": [], "language": "english", "text": "Proposed bills would gut local zoning regulations Ken Moore 9:02 p.m. CT April 17, 2017 Franklin Mayor Ken Moore Bill seems to be targeting “overregulation” but would gut Franklin's planning and development. Ken Moore is mayor of Franklin. 3 CONNECT 1 COMMENT EMAIL MORE \nI am writing out of concern for two bills that have been proposed in the state House and Senate that aim to take away city and county rights regarding building design elements for single and two-family homes. \nThese bills are House Bill 476 and Senate Bill 520 . Both should be of great concern to communities and homeowners that have good zoning and design regulations across Tennessee. The bills would take away a local jurisdictions’ ability to adopt residential building standards that support their adopted master land use plans. The scope of the bill has far reaching implications that will potentially change the look of neighborhoods and lower home values. \nThe bill specifically seems to be targeting “overregulation” and lacks support of the legislative delegation from Williamson County. It would gut Franklin’s approach to planning and development that has been a significant part of our success. \nCommunity design and standards have been a part of making Williamson County and Franklin the nation’s leader in job growth, and also significant permitted development. \nOver the past year, more than 1,600 residential permits were issued. Including commercial buildings, the permitted development or investment in our community was $774 million. \nWe have taken great pride in working with developers and builders to streamline our processes. Services such as one-stop permitting, electronic plan submittal, and electronic inspection scheduling have all had positive results. Design professionals meet monthly with staff reviewing various issues and subjects. \nDuring the last legislative session, we worked closely with the home builders to craft vesting legislation on developments. We value the relationships that we have and work to establish transparency with citizens and business partners which include development professionals. \nFranklin’s standards were not developed in a vacuum but were developed with community input, in public hearings and board meetings. \nFranklin does not prohibit the use of specific exterior building materials but takes into consideration citizen comments and engagement of development professionals. Material selection is based on the character of the neighborhood in order to maintain community and neighborhood characteristics. \nAn area of concern is existing subdivisions that are not under the control of an HOA, because of the stage of development, or because there is none. This bill would allow homes to be constructed that would not comply with the character of the development whether it be building materials or architectural features such as windows or garage placement. \nWe all have seen ugly homes which “stick out like a sore thumb.” Their context in a neighborhood lowers home values and pits neighbors against neighbors. HB 476/ SB 520 does not represent a positive approach to community building, but rather a negative force under the pretense of affordability and obstructions to developers. \nOur experience demonstrates that a city that provides community standards elevates a home’s value, generates civic pride, and provides an attractive quality of life for Franklin residents. \nKen Moore is mayor of Franklin.  ", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:43.000+03:00"}]