[{"entities": {"locations": [{"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "arctic silver", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "orchid grey", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}], "organizations": [{"name": "samsung", "sentiment": "negative"}, {"name": "t-mobile", "sentiment": "none"}, {"name": "samsung health", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "bixby home", "sentiment": "none"}, {"name": "samsung galaxy s8", "sentiment": "none"}, {"name": "lg", "sentiment": "none"}, {"name": "samsung galaxy s8 korean galaxy s8 owners see red tints", "sentiment": "none"}, {"name": "bixby vision", "sentiment": "none"}], "persons": [{"name": "alexa", "sentiment": "none"}, {"name": "fionna agomuoh", "sentiment": "none"}, {"name": "fionna agomuoh samsung", "sentiment": "none"}, {"name": "siri", "sentiment": "none"}, {"name": "bixby", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.yahoo.com", "site_section": "https://www.yahoo.com/news/", "domain_rank": 5, "replies_count": 0, "country": "US", "section_title": "Yahoo News - Latest News &amp; Headlines", "title": "7 Stand Out Samsung Galaxy S8 Specs And Features: First Impressions Review", "title_full": "7 Stand Out Samsung Galaxy S8 Specs And Features: First Impressions Review", "published": "2017-04-19T04:23:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZQCR4GWh90giYJ9nPRvkrAwsQZ_i94F__zQDRZIwFjoGU4_CcOKzTa59ZSCTYrQik5zZ9xSkYV7n3VVTmP5DkSx", "site": "yahoo.com", "main_image": "https://s.yimg.com/uu/api/res/1.2/DTwpTkWRkIOAyBzM5N5tWQ--/aD0zNDU2O3c9NTE4NDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/ibtimes_176/3b802132ee984f98b31e250a8a3446e5", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "64fd9f8802ff75de53c1b9130785df3dd649b683", "site_type": "news"}, "title": "7 Stand Out Samsung Galaxy S8 Specs And Features: First Impressions Review", "published": "2017-04-19T04:23:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZQCR4GWh90giYJ9nPRvkrAwsQZ_i94F__zQDRZIwFjoGU4_CcOKzTa59ZSCTYrQik5zZ9xSkYV7n3VVTmP5DkSx", "author": "Fionna Agomuoh", "crawled": "2017-04-19T08:38:40.000+03:00", "language": "english", "text": "The Galaxy S8 releases Friday and as Samsung prepares to introduce to the market its first premium device following the Galaxy Note 7 disaster, the 2017 spring flagship is already receiving glowing reviews among pundits and enthusiasts. Preorder figures for the Galaxy S8 indicate consumers have not been scared away from products by the Android king. Reports indicate more than one million handsets have already sold in South Korea alone. In the U.S. carriers, including T-Mobile have already begun shipping models to early adopters.\nThe large-screen Galaxy S8 Plus is expected to be the more popular model, but either option would be an excellent choice for someone in the market for a new all-around device.\nStay tuned for International business Times’ in-depth review of the Samsung Galaxy S8, but in the meantime, here are some feature highlights consumers should consider before purchasing.\n1. It’s sleek and beautiful The Samsung Galaxy S8 design is a showstopper, hands down. The device stands out due to its infinity display, which has ultra slim bezels but does not include a physical home button. Samsung has introduced an on-screen home button and navigations keys for back and recent functions. These keys can be customized by users and will fade away to allow for full-screen functions, such as watching videos or playing games.\nThe standard Galaxy S8 has a 5.8-inch dual-edge curved display, while the Galaxy S8 Plus has a 6.2-inch display. Consumers can expect that Samsung has now done away with the flat display in order to outfit larger displays on smaller device frames. Due to its infinity display, the Galaxy S8 is ever so slightly smaller than the Galaxy S7 Edge, while the Galaxy S8 Plus has a size similar to the Galaxy Note 7. The Galaxy S8 is not heavy but does feel significantly more sturdy in the hand than the Galaxy S7 Edge, for example.\nThe Galaxy S8 will be available in a host of color options, but the Midnight Black, Orchid Grey, and Arctic Silver options will be available in the U.S. Blue Coral and Maple Gold will be available in international markets , such as Korea and China.\nSamsung Galaxy S8 More Samsung Galaxy S8 Midnight Black Photo: Fionna Agomuoh\nWith an all-glass frame, the Galaxy S8 has a sleek and glossy finish, much like the Black Pearl Galaxy S7 Edge and the Jet Black iPhone 7. The device can be prone to smudging and consumers will likely feel safer handling the Galaxy S8 in a protective case. Those with steady fingers may feel comfortable using only a screen protector. However, the Galaxy S8 is unlikely to survive repeated falls.\n2. Infinity display make interface and themes look amazing In addition to the superb external build quality on the Galaxy S8, its Samsung Experience interface has a minimalist feel that allows for easy access to all areas of the device. The default home screen setup allows users to swipe up on the display to access the apps drawer without a button.\nSamsung Galaxy S8 More Read More Samsung Galaxy S8 Photo: Fionna Agomuoh\nUsers can add the app drawer back to the home screen within settings, but we prefer the swipe function. Newly installed apps can easily be found within the app drawer, instead of being automatically duplicated within the app drawer and on the home screen.\nThe haptic feedback feature associated with Android 7.0 Nougat also makes it easy to move or remove app icons and uninstall applications. Users can long press an app icon to bring up a menu instead of a drag and drop function.\nWe recommend setting up a theme on the Galaxy S8 to complement the infinity display. There are several free and paid options available at Samsung’s themes hub.\n3. Bixby feature won’t be complete at launch Samsung is introducing with the Galaxy S8, its own artificial intelligence assistant called Bixby, which will rival features such as Siri and Alexa. Bixby includes its own capacitive button for easy access. Recent reports indicate users will be unable to rework the Bixby button for alternative functions.\nSamsung Galaxy S8 More Samsung Galaxy S8 Hello Bixby Photo: Fionna Agomuoh\nSamsung confirmed that several Bixby features won’t be available at launch. Users won’t be able to execute voice commands with Bixby until later this spring; however, features including Bixby Vision, Home and Reminder will come standard on the Galaxy S8. Bixby Home serves as a hub device functions, news (essentially replacing Samsung’s Briefing station) and trackers such as Samsung Health. Bixby Vision uses the camera application and AI features to help users identify products, objects, and places, among other things. The self-explanatory reminder feature allows users to set notes to keep track of various tasks and device functions.\n4. Samsung FINALLY made a dent in low-light imaging The Samsung Galaxy S8 features a 12-megapixel rear camera with f/1.7 aperture, which brings vast improvements to low-light photography, in comparison to older Galaxy handsets. Samsung has been working on camera improvements for several premium iterations and appears to have finally hit a sweet spot with the Galaxy S8. Granted, the camera app likely includes its fair share or after shot processing, our night shots came out with a level of sharpness, clarity, color accuracy and reduced glare never before seen on Samsung flagships. Users can expect the Galaxy S8 to maintain a high standard imagining for well-lit areas. The device also features an 8-megapixel front camera with a similar f/1.7 aperture that also produced rather impressive night shots. However, we did experience a slight glare in some images.\n5. One-handed handling is a dream, especially with smaller model Once upon a time, a large screen meant a huge smartphone, but no more. Even users with small hands can feel comfortable being able to stretch their thumb from one side of the Galaxy S8 display to the other. Users can also set up a one-handed mode, which will truncate the home screen to an even smaller size and situate the display according to hand dominance. The overall Galaxy S8 slimness will make also the device easy to pocket.\n6. The rear fingerprint scanner is cumbersome To accommodate the Galaxy S8 infinity display, Samsung placed the fingerprint scanner on the back of the handset. The Galaxy S8 fingerprint scanner is located in the upper left corner of the device, which is a difficult area to access the feature. Users may find it difficult to set up and access the Galaxy S8 fingerprint scanner.\nOther devices, such as the LG G6 have rear fingerprint scanners with a more centralized location, which makes it easier for users to access the feature blind. However, the Galaxy S8 has several other biometric options, including an iris scanner and facial recognition. These can be set up as alternatives to fingerprint biometrics.\nSamsung Galaxy S8 More Samsung Galaxy S8 fingerprint scanner error Photo: Fionna Agomuoh\n7. Users must choose between iris scanner and facial recognition Users can set up several security features on the Galaxy S8; however, the iris scanner and facial recognition options cannot be set up simultaneously. Users will be asked to choose between face unlock and iris unlock if both face and iris biometrics are registered. Users can simultaneously set up the device’s fingerprint scanner with either face unlock and iris unlock, in addition to other security features, including PIN and password.\nSamsung Galaxy S8 More Samsung Galaxy S8 biometrics options Photo: Fionna Agomuoh\nRelated Articles\nNew ‘Places’ Feature In Samsung Galaxy S8 Korean Galaxy S8 Owners See Red Tints In The Smartphone's Display", "external_links": ["https://s.yimg.com/ny/api/res/1.2/zwt1B2IEVsQjmRqh2k4AQQ--/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en-US/homerun/ibtimes_176/bbb16337c2e7dc2d1a37c359c46a0252);", "http://www.ibtimes.com/samsung-galaxy-s8-colors-where-will-blue-coral-maple-gold-be-available-2518893", "http://www.ibtimes.com/samsung-galaxy-s8-release-date-april-21-t-mobile-price-details-available-2517197", "http://www.gsmarena.com/samsung_galaxy_s8_preorders_in_korea_have_crossed_1_million_mark-news-24567.php", "http://www.ibtimes.com/samsung-galaxy-s8-issues-korean-users-see-red-tints-smartphones-display-2526700?utm_source=yahoo&utm_medium=partner&utm_campaign=rss_yahoo_news_related", "https://s.yimg.com/ny/api/res/1.2/SauHs6LE64bHCsKFJ_h.kg--/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en-US/homerun/ibtimes_176/4856d8279f30376ccf0ce3686574e0fb", "https://s.yimg.com/ny/api/res/1.2/zwt1B2IEVsQjmRqh2k4AQQ--/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en-US/homerun/ibtimes_176/bbb16337c2e7dc2d1a37c359c46a0252", "http://www.theverge.com/2017/4/11/15266028/samsung-galaxy-s8-bixby-assistant-launch-voice-support", "https://s.yimg.com/ny/api/res/1.2/ko58y21y8dD99jKpi1d0hQ--/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en-US/homerun/ibtimes_176/659e4b4d7fdf618ca24d428a029dbfe7);", "https://s.yimg.com/ny/api/res/1.2/21EXkh7t09hXNks19G3vIQ--/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en-US/homerun/ibtimes_176/cc934b448a89f872688680bd31ee439a);", "https://s.yimg.com/ny/api/res/1.2/9jYhrFXbGDyt4_AazhTBGA--/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en-US/homerun/ibtimes_176/ef0804db41ea8c12f1d16b3498479e2a", "https://s.yimg.com/ny/api/res/1.2/21EXkh7t09hXNks19G3vIQ--/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en-US/homerun/ibtimes_176/cc934b448a89f872688680bd31ee439a", "http://www.ibtimes.com/samsung-galaxy-s8-places-feature-calling-local-businesses-made-easier-hiya-2525923?utm_source=yahoo&utm_medium=partner&utm_campaign=rss_yahoo_news_related", "http://www.ibtimes.com/samsung-galaxy-s8-colors-where-will-blue-coral-maple-gold-be-available-2518893&quot;", "https://s.yimg.com/ny/api/res/1.2/9jYhrFXbGDyt4_AazhTBGA--/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en-US/homerun/ibtimes_176/ef0804db41ea8c12f1d16b3498479e2a);", "http://www.gsmarena.com/samsung_galaxy_s8_preorders_in_korea_have_crossed_1_million_mark-news-24567.php&quot;", "https://s.yimg.com/ny/api/res/1.2/ko58y21y8dD99jKpi1d0hQ--/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en-US/homerun/ibtimes_176/659e4b4d7fdf618ca24d428a029dbfe7", "http://www.theverge.com/2017/4/11/15266028/samsung-galaxy-s8-bixby-assistant-launch-voice-support&quot;", "https://s.yimg.com/ny/api/res/1.2/SauHs6LE64bHCsKFJ_h.kg--/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/http://media.zenfs.com/en-US/homerun/ibtimes_176/4856d8279f30376ccf0ce3686574e0fb);", "https://s.yimg.com/g/images/spaceball.gif", "https://androidcommunity.com/t-mobile-shipping-galaxy-s8-devices-earlier-than-announced-20170417/", "https://androidcommunity.com/t-mobile-shipping-galaxy-s8-devices-earlier-than-announced-20170417/&quot;"], "highlightTitle": "", "uuid": "64fd9f8802ff75de53c1b9130785df3dd649b683", "highlightText": "", "rating": null}]