[{"rating": null, "external_links": [], "crawled": "2017-04-16T08:58:45.000+03:00", "author": "BlackBook", "entities": {"persons": [], "locations": [], "organizations": []}, "text": "You still have to notify if/when asked .\nOne of the biggest issues is that it is up to the officer to decide if you notified \" promptly \". It is also up to them to decide if you notified properly . And, if they decide otherwise, you are arrested, jailed, charged with an M1 and loss of license. On top of that, many officers are unclear on the law and hassle people who are *not* required to notify because they are not carrying. We have story after story of people ending up in a bind over this - it is the single most frequent issue that licensees get hassled or arrested over.\nOriginally Posted by Ohioans For Concealed Carry [W]e have story after story where good people get jacked up over it because it is a legal requirement. In one case, according to the dash camera, a young man notified 51 seconds into an encounter with law enforcement, was arrested, jailed, went to trial and had to spend $10,000+ of his own money to fight it and was found not guilty. In another, Officer Harless ( search YouTube for that one ) completely botched an encounter with a licensee who was attempting to notify, and the list goes on. Mandatory notification, especially where the penalty is an M1 and loss of license, is bad law. Only 10 states require it, and the states without it don't seem to have issues. Also, check the Toledo Law Review from Fall 2012 \" Firearm Notification Laws Put Concealed Carriers In Law Enforcement Sights \" (44 U. Tol. L. Rev. 179) for an in-depth analysis. Refrences:\nPDF of HB142 *automatic download* Bill progress Ohioans For Concealed Carry on Facebook Concealed Carry Law Enforcement Notification: Is it a duty, or a courtesy?\nThis is not only about driving. This law currently applies any time you are stopped by a cop for a law enforcement purpose, even if walking on the sidewalk. Some cops have misunderstood this law to mean you have to notify when the cop strikes up a casual conversation with you at the grocery store while standing line.\nShould this repeal pass, you still have to notify when asked. What this repeal does is remove the amiguity. If the cop wants to know, they ask, and you notify. That's it. If they don't ask because it's not germane to why you were pulled over, and you don't tell because it's not germane to why you were pulled over, no crime occured.", "url": "http://omgili.com/ri/.wHSUbtEfZTH_Vr.qEl_SaHgJQluVd9Zwar9TbFhpb.lsK_ZcovZLYmjvgQ6DFdUAGt5NKBIRQ2.W.ZF3vnCJUKTi96Kn.XcpkbiUx84y6c7jYsWISLim_20KfPg4o0zgG_vGIwMEEypVjFAcnFOgJYackGyuuGWBH12rNyBEK1iKIJ5wvUUXPhSfmp_i0C6", "highlightText": "", "highlightTitle": "", "published": "2017-03-25T07:32:00.000+03:00", "language": "english", "title": "HB 142 Eliminate need when stopped to notify carrying firearm.", "thread": {"title_full": "HB 142 Eliminate need when stopped to notify carrying firearm.", "site_full": "www.usacarry.com", "site": "usacarry.com", "site_section": "https://www.usacarry.com/forums/forum-post614531.html", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 5, "site_type": "discussions", "spam_score": 0.0, "domain_rank": 45578, "replies_count": 8, "site_categories": [], "country": "US", "section_title": "USA Carry - Concealed Carry Forum", "url": "http://omgili.com/ri/.wHSUbtEfZTH_Vr.qEl_SaHgJQluVd9Zwar9TbFhpb.lsK_ZcovZLYmjvgQ6DFdUAGt5NKBIRQ2.W.ZF3vnCJUKTi96Kn.XcpkbiUx84y6c7jYsWISLim_20KfPg4o0zgG_vGIwMEEypVjFAcnFOgJYackGyuuGWBH12rNyBEK1iKIJ5wvUUXPhSfmp_i0C6", "published": "2017-03-25T07:32:00.000+03:00", "title": "HB 142 Eliminate need when stopped to notify carrying firearm.", "uuid": "65103ecc6829a610956db46baf7e09ab01bb0e58", "main_image": ""}, "uuid": "65103ecc6829a610956db46baf7e09ab01bb0e58", "ord_in_thread": 0}]