[{"entities": {"organizations": [{"name": "google trends", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "vine", "sentiment": "none"}, {"name": "google analytics", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}, {"name": "domain authority", "sentiment": "none"}, {"name": "social media activity authority building obviously", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}], "locations": [{"name": "vine", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "canva", "sentiment": "none"}], "persons": [{"name": "vine", "sentiment": "none"}, {"name": "viner", "sentiment": "none"}, {"name": "alexa rank", "sentiment": "none"}]}, "uuid": "65eec0013487de71c2e6e7f941290ad61aa438ba", "highlightText": "", "title": "Benefits of Newsjacking – A Case Study Into 2500% More Traffic", "thread": {"site": "business2community.com", "country": "US", "participants_count": 1, "site_full": "www.business2community.com", "section_title": "Business 2 Community", "uuid": "65eec0013487de71c2e6e7f941290ad61aa438ba", "site_section": "http://www.business2community.com", "domain_rank": 9376, "main_image": null, "performance_score": 0, "published": "2017-04-17T00:03:57.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meiBroIYWuT_clanOQFCEdRW6NjrZuFmOx9RSe4x9dCVo5ttISHubtkqTKtmuYzU61f1dsO3dWAYG2zzJzqA4u6H0teO1EOMGOFvifn5Z8NYPjaM_a4NSlqA-", "title_full": "Benefits of Newsjacking – A Case Study Into 2500% More Traffic", "title": "Benefits of Newsjacking – A Case Study Into 2500% More Traffic", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 13, "shares": 13, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 2}, "vk": {"shares": 0}, "linkedin": {"shares": 2}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-17T00:03:57.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meiBroIYWuT_clanOQFCEdRW6NjrZuFmOx9RSe4x9dCVo5ttISHubtkqTKtmuYzU61f1dsO3dWAYG2zzJzqA4u6H0teO1EOMGOFvifn5Z8NYPjaM_a4NSlqA-", "ord_in_thread": 0, "crawled": "2017-04-17T00:03:57.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Mike Allton", "text": "Over lunch on a Thursday I took twenty minutes to bang out a post about some breaking news in the social media industry.\nOver the next few days, that post received over 20,000 views.\nLet’s dig a bit into what that post is about, the methodology behind it, and both the short- and long-term benefits. By the end, you’ll be able to take home some tips and ideas that you might leverage for a trending topic of your own.\nA Brief Blog Post About Vine When I first started writing about social media news and information, I made it a point to subscribe to the blogs and press rooms of every major network. While not every newsworthy change or update is published there, many of the important developments are announced that way.\nSo late on a Thursday morning, I got a notification that Vine had published to their blog on Medium, a post cryptically titled, “ Important News about Vine. ” That’s how I came to find the stunning news that Twitter was shutting down Vine.\nAs I’ve mentioned before , every time you become aware of a piece of news that might potentially be interesting to your audience, you have to ask yourself these questions:\nIs the news interesting and relevant to my audience (if not, ignore) Am I interested in writing about this news (if not, share the original source) Do I have time right now to write & publish an article (if not, share the original source) Often, sharing that blog post from Vine would be the way to go. But in this instance, I had positive answers for each of the questions.\nMy readers might be interested in Vine, and there’s a potential to reach far more Vine users that aren’t part of my existing audience. While I’m not an avid Vine user personally, I’ve written about Vine and have included Vine in my monitoring of social network active usage for years, so the topic is quite interesting and relevant to me. Time… that was going to be close. I had about 25 minutes to finish my lunch before a weekly noon meeting commenced, so I’d need to write, publish and get some initial promotion started within that amount of time. Piece of cake when it’s something you’ve done countless times.\nNow, fortunately, shutting down of Vine wasn’t, in itself, a complicated topic. The post that I wrote simply needed to convey what was going on, when, what impact it would have on existing Vine users, and whatever Why could be gleaned from the original Vine blog post.\nThat took just 15 minutes to write – it didn’t have to be a massive article – plus a few minutes to create a graphic in Canva and then publish. “ What’s Happening To Vine? ”\nApproaching Topics From Experience This is certainly an example of where experience matters a great deal.\nFirst, earlier this year, I’d published an article about the imminent demise of Blab and titled it “ What Is Happening With Blab? ” – and that proved to be an excellent title format as many people were wondering exactly that. So I mimicked it for this new post on Vine.\nSecond, as with Blab and Posterous and other networks before Vine, I’ve written about the shuttering of social platforms and therefore understand what readers want to know. They want to know what’s going on, of course, and why it’s all happening. But most importantly and immediately, they need to understand how they’re impacted and what the can or should do.\nWhen Posterous closed , for instance (a blogging platform Twitter bought in 2012 and shut down in 2013), users needed to understand how to save their content so that they might recreate their blog on another platform. Vine was the same way. Vine users now need to know how to save their vines as video files that they can then choose to upload to another platform.\nThey also need to know how to try and get their audience to move from Vine to their preferred (active) network.\nSo those were points I knew instinctively I needed to make in the article.\nThird, this wasn’t a surprise to me. I’d written at the new year that I fully expected 2016 to be a year filled with attrition in the social network space as there were already too many networks with similar functionality and demographics.\nNot only was I prepared to write an article like this, it was a point I could easily make within the article.\nI mention all of this to help illustrate the point that newsjacking, like any skill, takes time and practice to improve. And there’s no doubt that my skill pales in comparison to top new journalists who are covering breaking news every day – I just do it when the topic suits my audience and I feel like taking the time.\nFor most of you, you’ll need some time to get this level, so don’t be discouraged if you need a few hours to write the post, or if your first few newsjacking attempts don’t go over as well as you’d like.\nKeep at it!\nSpreading The Word About Vine Closing The bulk of my motivation for writing about the topic in the first place was to make sure that as many people as possible heard about the news and, if it affected them, they’d have to prepare.\nThe fact is, if I publish content to my blog, I reach a far greater audience than if I simply share an article to my social channels. My blog content gets emailed, indexed in search, and shared by countless other readers and subscribers, resulting in tremendous spread.\nSo once I published the post, I shared it to all of my channels and it was automatically sent to my email subscribers.\nFrankly, the initial interest was low – and in fact, days later the post still has less-than-average indications of social shares and interest.\nI assumed that meant that my audience had very little interest in Vine… which was something I had figured from the start. It was the Vine community that I’d hoped to reach.\nAnd boy, did I ever.\nBy Thursday evening, I began to notice a different kind of traffic coming in – Organic. Google had begun to rank my content among the top results for search terms like, “What’s Happening To Vine”.\n\nNote that my article appeared just after a post by The New York Times and Vine’s own blog announcement.\nNot too shabby!\nSo Thursday evening I spent a little more time optimizing the post.\nI edited the Title to include “Twitter Is Shutting It Down.” I embedded a video from a Viner reacting to the news. I added a forwardlink from related past articles. I added a Click To Tweet with the hashtag #RIPVine I scheduled additional social shares. I added a little more context and information. On Thursday, the post got 1,943 views.\nOn Friday, the post got 8,704 views.\nOn Saturday, the post got 6,647 views.\nOn Sunday, the post got 2,757 views.\nNearly 92% of that traffic was via Google search.\nThese view counts also reflect the Google Trends graph for related terms over that period, which we’ll get into in a moment.\nBut it’s important to note not just the raw numbers but how they compare to the typical content that I publish. Because while I’ve had many successful articles, nearly every one has been a slow, gradual growth over time.\nThis one article accrued 20,051 views over a 4-day period but my normal articles see an average of 750 visitors during the first 30 days. That’s a 2500% increase in traffic! \nSo of course, I want to keep riding that wave for as long as possible.\n\nYou can also see my site’s overall traffic for the two months leading up to the Vine Shutting Down article. \nThat’s partly where this article fits in, to be frank. By referencing the Vine article and topics, I’m continuing to link to that post and use the keywords that people are searching. There will also be some people who read this article and who didn’t know about the first one, so this continues to raise awareness.\nBut I also used Google Trends, as I mentioned, to review where the topic was headed. I researched and compared a number of terms, looking for related keywords I might not have thought of, as well as any indications some might be trending up.\n\n(Note that this is over Halloween weekend in the U.S. and therefore Monday might see renewed interest. It’s something I’ll continue to keep an eye on.)\nThe point here is that you can use Google Trends to watch hour-by-hour, day-by-day interest in a particular topic. While this may not help you determine whether to write about a topic, it might be a good indicator whether you should invest more time into optimizing and spreading a post you’ve just recently written. Or even publishing follow-up content! (I’ve seen some great articles that try to explore the Why behind the decision to close Vine, for instance.)\nUPDATE 11/04 : While interest and traffic has continued to wane, numbers for Monday and Tuesday were still significant. The What’s Happening To Vine post saw 1,493 visitors on Monday, 1,219 on Tuesday, and over 500 as of midday on Wednesday. So while readership of the post will no doubt die down to a trickle very soon, this article and topic has had significantly more staying-power than most.\nUPDATE 12/30 : Surprisingly, the Vine article has continued to perform well through the end of the year. This has been buoyed somewhat by the fact that Twitter announced a slight change in their stance on Vine. They said on 12/16 that instead of completely closing down Vine, Vine users would still be able to use the app to share photos and 6-second videos to Twitter. I updated the original article accordingly and within a few days, search engine traffic doubled from 250 a day to over 500 a day.\nUPDATE 04/08 : Traffic to this one-time newsjacking article continues to hold strong! There was an update to the story in January as Twitter decided to let Vine users continue to use the Vine app as a camera, and that uploaded videos of 6 seconds or less would automatically loop like Vines, effectively giving long-time Viners an ongoing medium for their creative work. At the time, traffic to the post continued at a pace of about 250 visits per day. Then in March, that doubled and wen back up into the 400-500 visits per day, and has stayed that way into April. After 5+ months, the article has received over 75,000 pageviews , of which 93% has been referral traffic from organic Google search.\nThe Benefits of Newsjacking Some of the benefits are probably clear just from what I’ve already shared in this post, but let’s call them all out and differentiate between short-term and long-term. Even though this post is clearly just days old at the time this Case Study is published, I’ve written enough newsjacking posts in the past to be able to speak to their long-term benefits.\nShort-Term Benefits of Newsjacking Traffic – potentially massive traffic Social Media Activity Authority Building Obviously not every article is going to get the kind of traffic this Vine post did – but it’s always a possibility! I would also be remiss not to note that sometimes even a newsjacking article will continue to rank well and gain traffic long-term – it just depends on the topic. I quick blog post I wrote in 2013 about an update to the Twitter app continues to rank to this day for users searching how to set up multiple Twitter accounts .\nConversely, most of my newsjacking articles get far more social media activity than this post did. That can usually be attributed to the topic and audience fit. Had I been writing about a Facebook change, it would have seen far greater reach and engagement on Facebook. Regardless, when you share a piece of news with your social networks, many of your followers will be eager to share it with their own audiences.\nWhile traffic and social engagement can be measured, the last short-term benefit of newsjacking, Authority Building, cannot be so easily quantified. Yet, it’s there nonetheless. When you write about topics, particularly trending ones, you immediately position yourself as ‘in the know’ to your followers and potential followers. The significance of that authority cannot be overstated.\nLong-Term Benefits of Newsjacking New Subscribers for ongoing email marketing. New Website Visitors for ongoing remarketing. Increased traffic and ranked content for long-term SEO benefits. Alexa Rank. Domain Authority. Backlinks. If your topic is on point – in other words, you gave Newsjacking Question #1 careful consideration and made sure that the news was both interesting and relevant to your readers – then it’s likely that readers of the article will be interested in subscribing to future email updates.\nSimilarly, if you’re using remarketing (or retargeting) to run Facebook or Google ads for people who have already visited your website, a smash hit like this Vine post really helps those campaigns by injecting significant levels of new visitors.\nNow, a more subtle benefit could be long-term SEO improvement. Because you see, as long as your content is great – it answers the questions readers have – search engine traffic can beget search engine traffic. In other words, once Google begins to send more traffic to your site, and sees that those readers seem satisfied with that result, your content can be ranked higher and gain even more traffic.\nAnd those results can lead to an increase in your website’s Alexa Rank (there’s no doubt that adding 20,000 visitors in a month is going to help mine), as well as domain authority. Depending on the topic and insight that you offer, you’ll often find other bloggers and writers linking to your content, creating valuable backlinks.\nThose benefits can only be seen over time, so be sure to make a notation in your Google Analytics so that you can measure the impact a particular piece of content has on your traffic, referrals and goal completions.\nWhat’s Next? In order to begin to see some of these benefits for yourself, you’re just going to have to start newsjacking. There’s no substitute for experience.\nHowever, that doesn’t mean you have to be wholly unprepared. We’ve reviewed the major questions to ask, but what most people struggle with is making sure that they’re informed well enough in advance to be able to write a newsjacking piece.\nIf you’re hearing about a topic from mainstream news, it’s likely too late to write about it yourself and still catch that news cycle.\n \nOriginally published on The Social Media Hat . Republished with permission. \n"}]