[{"rating": null, "external_links": [], "crawled": "2017-04-16T08:18:01.000+03:00", "author": "", "entities": {"persons": [{"name": "laura hooper calligraphy", "sentiment": "none"}, {"name": "emma roberts", "sentiment": "none"}, {"name": "evan hansen", "sentiment": "none"}, {"name": "michelle guerrere", "sentiment": "none"}, {"name": "joan didion", "sentiment": "none"}, {"name": "erin stutland", "sentiment": "none"}], "locations": [{"name": "west", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "panama", "sentiment": "none"}, {"name": "pinterest", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}], "organizations": [{"name": "cmg clique media group inc", "sentiment": "negative"}, {"name": "bank of america", "sentiment": "none"}, {"name": "browse facebook", "sentiment": "none"}, {"name": "opentable", "sentiment": "none"}, {"name": "youtube", "sentiment": "none"}]}, "text": "Your styled life starts here. Follow Us © 2017 CMG Clique Media Group Inc. ARE YOU AN \nJoin our daily email list for must-read lifestyle and home décor inspiration and advice. April 15, 2017 37 Things to Do On a Sunday Night When You're Bored by Michelle Guerrere \n@lucywilliams02 \nSunday is often the most challenging day of the week. As some people say, anticipation can be worse than the real thing—which in this case is the week ahead. On Saturday, you’re all gung-ho about the weekend, but as the hours creep further and further into Sunday, you get a case of what’s been dubbed “ the Sunday scaries .” What do you have going on this coming week? Are you ready? How can you possibly make it through five whole days of work? \nWhat we really should be doing with those Sunday night hours is savoring them, not wishing them away. So you don’t have to waste any more precious time, we’ve rounded up the 37 best things to do on a Sunday night when you’re bored. Print out this list (or save it to your phone!) and cross activities off as you go. \n1. Give your hair a hot oil treatment. Put any olive oil you have in the house in a mug, heat it up for 60 seconds at a time in the microwave, and leave on your strands for 15 minutes. Shampoo out and your locks will thank you. \n2. Prep a frittata to have for breakfast all week long. We’re partial to this paleo breakfast casserole with its signature sweet potato crust. \n3. Join Emma Roberts’ new book club— Belletrist . The first book is Joan Didion’s South and West , so get reading. \n4. Browse pet adoption web sites. Even if you aren't ready to get one (or you already have one), it'll put a smile on your face. \n5. Look at your friends’ (and friends' of friends) wedding registries. Why? Because it's pure fun. \n6. Make a list of special things you want to treat yourself to this year . Keep this saved for motivation the next time you want to quit your side gig or you have a bad day at work. \n7. Download the Shapr app. This program lets you connect with people in your business field...so go in with the goal of networking with two new individuals this month. It's kind of like a dating app, but for work! \n8. Take an online calligraphy class ...we're partial to Laura Hooper Calligraphy . Those swirls! \n9. Download the soundtrack from your favorite show, movie or musical. Then sing along to the whole thing. Is anyone else on a Dear Evan Hansen kick? \n10. Soak your feet in the tub. If you want to be fancy, throw in some bubbles, bath salts or even a bath bomb for some fizz. \n11. Hang those pictures you never got around to . Who else has several stacked under their bed for an aspirational gallery wall? \n12. Do an edit of your closet. You'll feel so much better knowing what you have and what you may need. And don't be shy—toss/donate anything that's worn, doesn't fit or that you won't ever wear again. \n13. Write some snail mail to a friend —just because . We love these chic notecards with sweet sayings. \n14. Buy tickets to a charity event. Browse Facebook to find fun fundraisers coming up. Then pick out which dress you'll wear/rent. Now you've got something to look forward to...while giving back. \n15. Explore a personalized daily vitamin plan , courtesy of Care/of . These custom pre-made vitamin/supplement packs are perfect for girls on-the-go. \n16. Browse Thumbtack to find a new hobby. From voice lessons to dance instruction to the basics of tennis, you'll find an expert to teach you anything that interests you (be sure to read the reviews!). \n17. Download a new book from the public library database onto your e-reader . Did you know that most public libraries let you borrow e-books free of charge (with a library card, of course)? Be sure to see if there is a Librarians' Picks section...it usually has some great under-the-radar selections. \n18. Look up volunteer opportunities near you. Find something that interests you like tutoring local kids or helping at a soup kitchen. Then enlist a friend to join you! \n19. Put on some teeth whitening strips. Who doesn't want more of a reason to smile? Distract yourself from the weird feeling by watching some aspiring musicians do celebrity covers on YouTube. \n20. Dance around to get in the last few steps of the day on your fitness tracker. Let loose. \n21. Do some guided imagery meditation. It will put you in a good place as you cruise into Monday. Take a peek at some of our favorites . \n22. Get your taxes together. Remember how rushed you were this year? Quickly gather any receipts, bills or expenses and make a spreadsheet of anything you need to keep track of. Prepping early will eliminate any guesswork for next year. \n23. Clean your jewelry. Did you know dish soap makes rings squeaky clean? \n24. Make a five-year plan. Who else has received the dreaded interview question \"What is your five-year plan?\" Make one list that’s career-focused and another that revolves around your personal life. \n25. Gather your change and roll it. Or just gather it! Some banks like Bank of America will actually send it out unrolled and deposit it in your account with no fees (if you’re a cardholder, of course). \n26. Scroll through MyDomaine 's Pinterest for travel destination inspo. Japan? Hawaii? Panama? Which destination will you save for next? \n27. Go on OpenTable and snag a coveted reservation weeks in advance. Use Zagat to get some fun ideas. \n28. Clean your makeup brushes. Do you know how dirty they actually get? If you're not a fan of cleaning them by hand, this cool contraption cleans up to 12 brushes at once. \n29. Whip up some fruit-infused water for the week. Simply cut up your favorites and put them at the bottom of a pitcher...pour water over the slices and let it sit for at least an hour in the fridge. A good combo is strawberries, cucumbers and mint. \n30. Search for a friend’s birthday gift months in advance. It will guarantee you'll get them something just as special as they are. \n31. Stretch. Lay out your yoga mat and just do some light stretching. You'll instantly feel more zen. \n32. Treat yourself to fro-yo at your favorite local spot. Splurge on some extra toppings because you're worth it. \n33. Arrange a pretty bouquet. Plus, here's how to do it with flowers from the grocery store. \n34. Try bullet journaling for the week. It may take some time to familiarize yourself with the symbols, but this method will be so good for your time management. \n35. Scroll through old pictures of you and your friends. Is there anything better than a trip down memory lane? You’ll be occupied for hours…plus you may even be inspired to print some photos! \n36. Take a Soul Stroll. Fitness guru Erin Stutland's playlist features music mixed with empowering mantras—the perfect soundtrack for a relaxing walk. \n37. Write yourself inspirational notes to scatter throughout your home. Everyone can use some words of encouragement! \nBe sure to read about the 24 things you should do on a plane when you're bored. What is your go-to activity to beat boredom on a Sunday night? Tell us in the comments!", "url": "http://omgili.com/ri/jHIAmI4hxg9RlgJgumItCwvBE8mpL5VOv85v1bdHssKU97diVXrS7qxz1ZfJeV77N4RqpsBOonc-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T08:18:01.000+03:00", "language": "english", "title": "37 Things to Do On a Sunday Night When You're Bored", "thread": {"title_full": "37 Things to Do On a Sunday Night When You're Bored", "site_full": "www.mydomaine.com", "site": "mydomaine.com", "site_section": "http://www.mydomaine.com/rss", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "news", "spam_score": 0.0, "domain_rank": 11962, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Chic, Everyday Lifestyle Inspiration and Advice | http://www.mydomaine.com", "url": "http://omgili.com/ri/jHIAmI4hxg9RlgJgumItCwvBE8mpL5VOv85v1bdHssKU97diVXrS7qxz1ZfJeV77N4RqpsBOonc-", "published": "2017-04-16T08:18:01.000+03:00", "title": "37 Things to Do On a Sunday Night When You're Bored", "uuid": "67051f44d19f1f05da93b72abe5c0ccd638b8927", "main_image": "https://cdn.cliqueinc.com/posts/221580/-221580-1492173472254-promo.640x0c.jpg"}, "uuid": "67051f44d19f1f05da93b72abe5c0ccd638b8927", "ord_in_thread": 0}]