[{"thread": {"domain_rank": 61543, "replies_count": 0, "url": "http://omgili.com/ri/jHIAmI4hxg_gzetfSprxLL_58.O2xIVmXPMuCF0I62IhSfzbYyVjpsfAm.EgNZ_zAnJ6p4.Pg8hK2PnFP0n4hkB_TE6.zRXcNcphVmgAQGvN4ToR6RDTMgxVjAKt.gZpQX49bbyCppsQ5uf24o_xvw--", "title": "Arkansas governor says execution plan just part of the job", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://stamfordadvocate.com//home/collectionRss/Homepage-Hcat-Nation-and-World-1688.php", "spam_score": 0.0, "section_title": "Nation and World", "site": "stamfordadvocate.com", "site_full": "www.stamfordadvocate.com", "performance_score": 0, "uuid": "67624f806437fd919fcdb4655a72abb764f71048", "published": "2017-04-17T11:25:38.000+03:00", "site_categories": [], "country": "US", "title_full": "Arkansas governor says execution plan just part of the job", "participants_count": 1, "main_image": "http://ww2.hdnux.com/photos/60/43/55/12729173/3/rawImage.jpg"}, "url": "http://omgili.com/ri/jHIAmI4hxg_gzetfSprxLL_58.O2xIVmXPMuCF0I62IhSfzbYyVjpsfAm.EgNZ_zAnJ6p4.Pg8hK2PnFP0n4hkB_TE6.zRXcNcphVmgAQGvN4ToR6RDTMgxVjAKt.gZpQX49bbyCppsQ5uf24o_xvw--", "title": "Arkansas governor says execution plan just part of the job", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:25:38.000+03:00", "language": "english", "entities": {"locations": [{"name": "arkansas", "sentiment": "none"}, {"name": "gallery little rock", "sentiment": "none"}, {"name": "fayetteville", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "capitol", "sentiment": "none"}, {"name": "ark", "sentiment": "none"}, {"name": "ark.", "sentiment": "none"}, {"name": "little rock", "sentiment": "none"}], "persons": [{"name": "asa hutchinson", "sentiment": "negative"}, {"name": "roger", "sentiment": "none"}, {"name": "pilate", "sentiment": "none"}, {"name": "jill bleed", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "michael lamoureux", "sentiment": "none"}, {"name": "johnny depp", "sentiment": "none"}, {"name": "kelly p. kissel", "sentiment": "none"}, {"name": "martin luther king", "sentiment": "none"}, {"name": "stephen b. thornton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}, {"name": "lamoureux", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "hutchinson", "sentiment": "none"}, {"name": "rita sklar", "sentiment": "none"}, {"name": "jesus", "sentiment": "none"}, {"name": "brian chilson", "sentiment": "none"}, {"name": "robert e. lee", "sentiment": "none"}, {"name": "clint schnekloth", "sentiment": "none"}, {"name": "bill vickery", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "western district of arkansas", "sentiment": "none"}, {"name": "american civil liberties union of arkansas", "sentiment": "none"}, {"name": "ap arkansas", "sentiment": "none"}, {"name": "drug enforcement administration", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "good shepherd lutheran church", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}, {"name": "homeland security", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "u.s. supreme court", "sentiment": "none"}, {"name": "american bar association", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "pontius pilate", "sentiment": "none"}, {"name": "ap image", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "67624f806437fd919fcdb4655a72abb764f71048", "published": "2017-04-17T11:25:38.000+03:00", "author": "ANDREW DeMILLO, Associated Press", "text": "Close Image 1 of 3 FILE- In this Jan. 4, 2017, file photo Arkansas Gov. Asa Hutchinson speaks to members of the press during a Q&A session in Little Rock, Ark. Hutchinson is a low-key former prosecutor known for delving into policy issues, but he has put himself and his state at the center of the national debate over the death penalty with his extraordinary plan to execute eight men before the end of April. The executions are set to begin Monday, April 17. less FILE- In this Jan. 4, 2017, file photo Arkansas Gov. Asa Hutchinson speaks to members of the press during a Q&A session in Little Rock, Ark. Hutchinson is a low-key former prosecutor known for delving into ... more Photo: Brian Chilson, AP Image 2 of 3 Protesters gather outside the state Capitol building on Friday, April 14, 2017, in Little Rock, Ark., to voice their opposition to Arkansas' seven upcoming executions. Protesters gather outside the state Capitol building on Friday, April 14, 2017, in Little Rock, Ark., to voice their opposition to Arkansas' seven upcoming executions. Photo: Kelly P. Kissel, AP Image 3 of 3 Actor Johnny Depp greets someone as he walks to the podium to speak at a rally opposing Arkansas' upcoming executions, which are set to begin next week, on the front steps of the Capitol Friday, April 14, 2017, in Little Rock, Ark. (Stephen B. Thornton /The Arkansas Democrat-Gazette via AP) less Actor Johnny Depp greets someone as he walks to the podium to speak at a rally opposing Arkansas' upcoming executions, which are set to begin next week, on the front steps of the Capitol Friday, April 14, 2017, ... more Photo: Stephen B. Thornton, AP Arkansas governor says execution plan just part of the job 1 / 3 Back to Gallery LITTLE ROCK, Ark. (AP) — Arkansas Gov. Asa Hutchinson comes across as a reluctant figure just carrying out the duties of his office when he discusses his extraordinary plan to execute eight inmates in 11 days. Although the plan faces multiple legal hurdles, no other state has executed that many people so quickly since the U.S. Supreme Court reauthorized the death penalty in 1976, and it has thrust Hutchinson and his solidly Republican state into the center of the debate over capital punishment. It's an unusual position for Hutchinson, a low-key former prosecutor who delves into policy issues with the help of charts and graphs and isn't known for giving fiery speeches. Yet it was he who signed off on the plan to execute so many prisoners before the state's supply of an execution drug expires at the end of the month, with the first two originally scheduled for Monday. \"It's not something I designed from when I ran for governor,\" Hutchinson told reporters at a recent news conference, the only time he's spoken at length publicly about the decision. \"It's something that is put in your lap as the result of 25 years of litigation action and it's here for me.\" If allowed to proceed with the executions, they would be the first Arkansas has carried out since 2005 due to legal wrangling and trouble obtaining the drugs. But separate courts granted stays to two inmates before two other courts — one state and one federal — temporarily barred the state from executing any of them at this time. The state is appealing. Aside from the inmates' lawsuits, the plan — which called for double executions on four days — has drawn opposition from civil rights leaders and groups such as the American Bar Association . Religious leaders, meanwhile, have appealed to the devoutly Christian governor's conscience, with one pastor invoking the biblical story of Pontius Pilate , the Roman official who reluctantly ordered Jesus' crucifixion at the urging of a crowd. \"I think (Hutchinson's) a good man. ... What he can't do is what Pilate did: 'I wash my hands,'\" said the Rev. Clint Schnekloth , of Good Shepherd Lutheran Church in Fayetteville. Arkansas' lull in executions wasn't a major issue when Hutchinson ran for governor three years ago. But as he prepares to run for re-election, there likely will be little political fallout from Hutchinson's aggressive push for executions, as the death penalty remains popular in his state. Allies of the governor say politics isn't a factor for Hutchinson, who has enjoyed strong approval ratings. \"If he were a wild-eyed crazy man megalomaniac, he'd be making speeches and getting on TV and trying to promote the issue to show the popularity he could gain,\" Republican political consultant Bill Vickery said. \"He's forgoing that and saying we're going to quietly go about justice here and not revel in it.\" Hutchinson has been a fixture in Arkansas politics since the early 1980s, when President Ronald Reagan named him U.S. attorney for the Western District of Arkansas. During his three years in that post, Hutchinson prosecuted then-Gov. Bill Clinton 's brother, Roger, for cocaine possession and the head of a white supremacist organization on weapons and terrorism-related charges. In 1996, Hutchinson was elected to Congress, where he served as one of the House prosecutors in the impeachment case against then-President Clinton. He's also served as head of the Drug Enforcement Administration and as a Homeland Security undersecretary. As governor, Hutchinson has focused on economic issues, including pushing for tax cuts. That doesn't mean he hasn't taken up tough issues. An abortion opponent, he ordered the state in 2015 to cut off Medicaid funding to Planned Parenthood — a move blocked by one of the judges that has halted his execution plan. He also tangled with fellow Republicans over his support for keeping the state's hybrid Medicaid expansion under President Barack Obama 's health care law. This year, Hutchinson opposed legislation aimed at preventing transgender people from using the bathrooms of their choice and he championed a law ending Arkansas' practice of paying tribute to Confederate Gen. Robert E. Lee and the Rev. Martin Luther King on the same day. That moderate record, death penalty opponents say, makes Hutchinson's execution timeline all the more perplexing. \"Does he want to bring Arkansas forward or keep us stuck in the past?\" said Rita Sklar , executive director of the American Civil Liberties Union of Arkansas . Michael Lamoureux , Hutchinson's former chief of staff, said the governor's background as a prosecutor is evident in how carefully he approaches most issues. He recalled Hutchinson poring through pardon and commutation applications. \"I would be surprised if any other governor in the country read those with the level of detail he did,\" Lamoureux said. As for the men he's seeking to execute, Hutchinson said he's reviewed trial transcripts and filings for each of them, met with some victims' families and toured the execution chamber. \"When I set those, I thought not only about the process, the responsibility, but I also thought about the victims and what they had endured for the last 25 years,\" he said. ___ Associated Press writer Jill Bleed contributed to this report. ___"}]