[{"uuid": "696a3e699f0b126486ceca5ea86b28db2b21aa52", "url": "http://omgili.com/ri/jHIAmI4hxg_Zgcd6DZGtTSgNTyMJexbgl2rPfb4qPsioa8c0a_sM4a2JZ9_9oGnKiKsKpYUJh3SSYRP16eKakrwptwt5iMUCwLodghmYmFA-", "title": "Trump targets visa program for highly skilled workers", "author": "", "rating": null, "published": "2017-04-18T23:23:38.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "walt disney world", "sentiment": "none"}, {"name": "export-import bank", "sentiment": "none"}, {"name": "snap-on", "sentiment": "none"}, {"name": "howard university", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "university of california", "sentiment": "none"}, {"name": "snap-on inc.", "sentiment": "none"}, {"name": "new trump", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "palm beach", "sentiment": "none"}, {"name": "wis.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "upper midwest", "sentiment": "none"}, {"name": "kenosha", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}], "persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "sean spicer", "sentiment": "none"}, {"name": "susan walsh", "sentiment": "none"}, {"name": "ronil hira", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "696a3e699f0b126486ceca5ea86b28db2b21aa52", "url": "http://omgili.com/ri/jHIAmI4hxg_Zgcd6DZGtTSgNTyMJexbgl2rPfb4qPsioa8c0a_sM4a2JZ9_9oGnKiKsKpYUJh3SSYRP16eKakrwptwt5iMUCwLodghmYmFA-", "site_full": "www.mprnews.org", "title": "Trump targets visa program for highly skilled workers", "site_section": "http://minnesota.publicradio.org/tools/rss/mprnews.php", "domain_rank": 28181, "published": "2017-04-18T23:23:38.000+03:00", "title_full": "Trump targets visa program for highly skilled workers", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "All News - MPR News", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "https://img.apmcdn.org/855871549896c47b73c61aef433f227fd4d76f63/uncropped/a62f6a-20170418-trump.jpg", "site": "mprnews.org"}, "external_links": [], "language": "english", "text": "Business Associated Press , John Enger · Kenosha, Wis. · Apr 18, 2017 President Donald Trump speaks at tool manufacturer Snap-on Inc. in Kenosha, Wis., Tuesday. Susan Walsh | AP Updated: 6:08 p.m. | Posted: 3 p.m. \nTurning back to the economic populism that helped drive his election campaign, President Donald Trump signed an order Tuesday he said should help American workers whose jobs are threatened by skilled immigrants. \nAt the headquarters of hand and power tool manufacturer Snap-on Inc., Trump signed an order aimed at curbing what his administration says are hiring abuses in a visa program used by U.S. technology companies. Dubbed \"Buy American and Hire American,\" the directive follows a series of recent Trump reversals on economic policies. • Earlier: New Trump order extends 'buy American' and 'hire American' rules \n\"We are going to defend our workers, protect our jobs and finally put America first, Trump declared, standing in front of an American flag fashioned out of wrenches. \nMuch like some prior orders, however, Trump's executive action Tuesday essentially looks for detailed reports rather than making decisive changes. In this case, the reports are about granting visas for highly skilled foreign workers and ensuring that government purchasing programs buy American made goods as required by law. \nStill, the latest order has some leaders in Minnesota's technology industry worried. \nMinnesota High Tech Association CEO Margaret Anderson Kelliher said the state's tech industry needs more foreign labor, not less. \n\"Although I absolutely wholeheartedly agree, we need more U.S.-born and Minnesotans in these jobs, we are in an already immediate shortage of workers,\" she told MPR News on Tuesday. \nThere are 12,000 science and technology jobs open in Minnesota right now, she said, and changes to the H1-B program would make them much harder to fill. \n\"To very quickly change policies on the H1-B visa like this will definitely have a negative effect,\" Anderson Kelliher said. \nTrump chose to sign the directive at Snap-on Inc., based in Wisconsin, a state he narrowly carried in November on the strength of support from white, working-class voters. Trump currently has only a 41 percent approval rating in the state. \nHe campaigned last year on promises to overhaul U.S. trade and regulatory policy, but his executive orders on those issues reflect the administration bowing somewhat to the limits of presidential power. Also, he has recently reversed several populist promises, including standing up to China, which he contended was manipulating its currency and stealing American jobs, and eliminating the Export-Import Bank, which he billed as wasteful subsidy. \nBut Trump returned to Tuesday to the economic tough talk of his campaign, saying: \"We're going to make some very big changes or we are going to get rid of NAFTA for once and for all,\" referring to the Clinton-era U.S. trade pact with Canada and Mexico. \nIn his new directive, the president is targeting the H-1B visa program, which the White House says undercuts U.S. workers by bringing in large numbers of cheaper, foreign workers and driving down wages. The tech industry has argued that the H-1B program is needed because it encourages students to stay in the U.S. after getting degrees in high-tech specialties — and because companies can't always find enough American workers with the skills they need. \nThe new order would direct U.S. agencies to propose rules to prevent immigration fraud and abuse in the program. They would also be asked to offer changes so that H-1B visas are awarded to the \"most-skilled or highest-paid applicants. \nThe number of requests for H-1B visas declined this year by about 15 percent, or roughly 37,000 applications, but the total was still nearly 200,000, far more than the 85,000 limit. \nTuesday's order also seeks to strengthen requirements that American-made products be used in certain federal construction projects, as well as in various grant-funded transportation projects. The commerce secretary is to review how to close loopholes in existing rules and provide recommendations to the president. The order asks for a review of waivers of these rules in free-trade agreements. \nThe trip brought Trump to the congressional district of House Speaker Paul Ryan, but Ryan was out of the country on a congressional trip. The president was greeted by Gov. Scott Walker outside Snap-on's headquarters. \nDuring his remarks, Trump weighed in on another economic issue, promising to find a solution to a trade dispute with Canada that has left dairy farmers in Wisconsin and New York without a market they had for their product. \nTrump said Canada has been \"very, very unfair\" to dairy farmers and \"we're going to start working on that.\" \nCanada has decided to impose import taxes on ultra-filtered milk, a protein liquid concentrate used to make cheese. It had been duty free but Canada changed course after milk producers there complained. About 70 dairy producers in both U.S. states are affected. • Trump supporters in northern Minnesota have a message: Be more 'presidential' \nAs for the visa program, Democratic lawmakers and organizations ranging from the pro-business Chamber of Commerce to the Information Technology and Innovation Foundation say they welcome proposals to improve the visa program, though not always in line with Trump's ideas. \nSen. Tammy Baldwin, D-Wis., urged Trump to skip further study and support her bill to rebuild U.S. infrastructure with American iron and steel. The Chamber of Commerce added that it would be a \"mistake to close the door on high-skilled workers\" who can contribute to the growth and expansion of American businesses and make the U.S. more competitive around the world. \nTrump has long pledged to support American goods and workers, but his own business record is mixed. Many Trump-branded products, like clothing, are made overseas. His businesses have also hired foreign workers, including at his Palm Beach, Florida, club. \nSnap-on makes hand and power tools, diagnostics software, information and management systems, and shop equipment for use in various industries, including agriculture, the military and aviation. It has 10 manufacturing sites in the U.S. and says its total employment worldwide is 12,100. Of those, about 6,700 are in the U.S. and roughly 3,000 of them are manufacturing jobs. \nDuring the tour, Trump was shown metal boxes where cremated ashes are deposited. He called it \"very depressing.\" \nThe news on your schedule from MPR News Update Email Address* MPR News Update AM Edition MPR News Update PM Edition \nSee our Privacy Policy . Must be age 13.", "ord_in_thread": 0, "crawled": "2017-04-18T23:23:38.000+03:00"}]