[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:44:48.000+03:00", "author": "Adam L Silverman", "entities": {"persons": [], "locations": [], "organizations": []}, "text": "— 🛑 lulu lemew 🕊 (@lulu_lemew) April 16, 2017 \nBased Stickman, real name Kyle Chapman, is this lovely fellow: Here's a tweet w/ \"Based Stick Man's\" real name; another w/his photo; another w/his name & previous arrest; another w/reference to Berkeley. pic.twitter.com/tdBRdKcFpk \nHistorian Rick Perlstein wrote a bit about Chapman yesterday : Behold Stick Man \nI’ve seen the Berkeley footage Morgoth is referring to. That’s how I made the acquaintance of Stick Man. \nBerkeley’s March 4 Trump was organized by a man named Richard Black, who announced that members of the alt-right, neo-Nazis, and white supremacists were banned. Among those who did not get the memo were Moshe Daniel, who goes by the nickname “Kilt Man.” Daniel depicts himself on Facebook with a giant serrated knife and a T-shirt featuring the face of the late Chilean fascist dictator Augusto Pinochet, the legend “PHYSICAL REMOVAL,” and another of those silhouettes of people being dropped from helicopters—a Pinochet-favored method for dealing with dissenters. \nThe march turned into a “small riot,” as gun-rights blogger Bob Owens, one of the most widely read on the web, and a cool and clear-thinking moderate, described it after reviewing the available documentation. “Both sides came to this incident prepared for a fight,” he wrote, concluding it was impossible to see “who threw the first punch.” In my mind, however, there were at least two moments where the person who threw the first punch was starkly evident. In both cases it was an individual who wore all black, from boots to baseball cap, and carried a distinctive black shield emblazoned with a “V” for victory, and an American flag. The man in black also wore a gas mask, surely in response to a widely disseminated urban legend that antifas are routinely attacking protesters with pepper spray. In one video he whacks a downed anti-Trump protester with the long wooden stick he carries (with two tiny American flags attached, thus he can call it a flagpole). In another, he can be seen smashing his stick down so hard on an unarmed protester’s head that the stick breaks in half. \nHe’s since become a right-wing folk hero, and, after Berkeley police arrested him on several felony charges, naturally, a right-wing martyr. \n(much more at the link) \nThis is a serious problem. Dedicated, hard core alt-righters who push both Russian derived propaganda and are organizing themselves to conduct violence in a way as to lay the blame on left of center Americans who look to peacefully protest. The first tweets under the hashtag #SyriaHoax came from Russia. Cernovich picked up on it; now it's trending in the U.S. \n*We see you* pic.twitter.com/Ek7z7UYniW \n— Caroline O. (@RVAwonk) April 6, 2017 Berkeley was not a clash between anti/pro Trump groups. This was a pre-planned assault by a group of violent alt-right Trump supporters. pic.twitter.com/aBhqjE0N5e \n— Caroline O. (@RVAwonk) April 16, 2017", "url": "http://omgili.com/ri/.wHSUbtEfZT5MLxqRYeXDUF82dFep79iTlm044k5Mi99ldSth8Op3dacVurgsKYVt1plja7sM6b9DyEkGS8BGCjgyBnu9okrlNmx120zOO.LKSmCqIkhdmbnBp2c9XWGDetGkI35Npw-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T10:44:48.000+03:00", "language": "english", "title": "Today’s Berkeley Beat Down: Planned Action by the Alt-Right", "thread": {"title_full": "Today’s Berkeley Beat Down: Planned Action by the Alt-Right", "site_full": "www.balloon-juice.com", "site": "balloon-juice.com", "site_section": "http://www.balloon-juice.com/feed/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": 56482, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Balloon Juice", "url": "http://omgili.com/ri/.wHSUbtEfZT5MLxqRYeXDUF82dFep79iTlm044k5Mi99ldSth8Op3dacVurgsKYVt1plja7sM6b9DyEkGS8BGCjgyBnu9okrlNmx120zOO.LKSmCqIkhdmbnBp2c9XWGDetGkI35Npw-", "published": "2017-04-16T10:44:48.000+03:00", "title": "Today’s Berkeley Beat Down: Planned Action by the Alt-Right", "uuid": "6a90da61fa38318f8db03e753e01d48abd1b3262", "main_image": ""}, "uuid": "6a90da61fa38318f8db03e753e01d48abd1b3262", "ord_in_thread": 0}]