[{"entities": {"organizations": [{"name": "wall decor & dream catchers   soaps n dreams", "sentiment": "none"}, {"name": "etsy shop", "sentiment": "none"}, {"name": "soap n dreams", "sentiment": "none"}, {"name": "soaps n dreams", "sentiment": "none"}], "locations": [], "persons": [{"name": "etsy", "sentiment": "none"}, {"name": "kristin kirkland", "sentiment": "none"}]}, "uuid": "6b0cc827326b70ab8c1088b95c8f5759d4ffbaf3", "highlightText": "", "title": "Soaps N Dreams - Natural, Soaps, Bath, Beauty, Wall Decor & Dream Catchers", "thread": {"site": "blogspot.com", "country": "US", "participants_count": 1, "site_full": "notjustanothersoutherngal.blogspot.com", "section_title": "Not Just Another Southern Gal", "uuid": "6b0cc827326b70ab8c1088b95c8f5759d4ffbaf3", "site_section": "http://notjustanothersoutherngal.blogspot.com/", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T23:44:24.000+03:00", "url": "http://omgili.com/ri/snFTpiOKdJVH_CuDOh2ZsLI92zX8DrfpBcJhNJtgb.uFXHulJlu76OypdVsxALl6XnSuhFUuPW0KpsZo3K0hrEwZYrBa9J7bOF3b0ppfjWWlys1Q16rbLO34s.htobGa", "title_full": "Soaps N Dreams - Natural, Soaps, Bath, Beauty, Wall Decor & Dream Catchers", "title": "Soaps N Dreams - Natural, Soaps, Bath, Beauty, Wall Decor & Dream Catchers", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T23:44:24.000+03:00", "url": "http://omgili.com/ri/snFTpiOKdJVH_CuDOh2ZsLI92zX8DrfpBcJhNJtgb.uFXHulJlu76OypdVsxALl6XnSuhFUuPW0KpsZo3K0hrEwZYrBa9J7bOF3b0ppfjWWlys1Q16rbLO34s.htobGa", "ord_in_thread": 0, "crawled": "2017-04-16T23:44:24.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Jenny Finney (noreply@blogger.com)", "text": "\n\nSoaps N Dreams really says it all about this Etsy Shop.  There, you will find Natural products such as soaps, bath products, beauty products, wall decor and dream catchers.  Soaps N Dreams has 66 items in their shop and I got to experience some of these wonderful products that this Etsy shop has to offer. \n\nThis first two product, shown below, are the E xtravagant and Sleep Scented Shimmer Premium Body Lotions . Both smell totally awesome, but I would have to say that the Extravagant is my favorite of the two.  It smells heavenly!  Both lotions have this shimmering sparkle when you apply it and it leaves your skin so soft!  They are a non-greasy lotion, that absorbs into your skin, leaving your skin moisturized with a fun sparkle!  Great for the evenings or weekend nights out.   \n\n\n\nI was surprised, after using this one night, that my skin still felt soft and a little moisturized.  That is exactly what I'm looking for in a body lotion!  This is not a lotion that will absorb and then hours later, you have to apply.  If you have sensitive skin, Soaps N Dreams offers this lotion in an unscented version. \n\n\n\nAvailable Flavors: \n\n     *EXTRAVAGANT: Rose & Peony \n     *FRESH:             Sweet Orange Peppermint \n     *LOVELY:            Japanese Cherry Blossom \n     *SIMPLE:            Unscented \n\n     *SLEEP:              Lavender Vanilla \n\nThe next two products are bar soaps.  The two fragrances, shown here, are the Fresh and Cheerful .  I love the scent of both of these and the Fresh really does have this fresh scent to it.  My favorite is the Cheerful.  It's so uplifting, inviting and I couldn't stop smelling this!   \n\n\n\nEach soap came in this adorable burlap bag, wrapped in a pink ribbon.   Fresh Soap has a sweet citrus aroma of ripe oranges with a cool minty kick.  It wakes up all your senses, has a gold shimmer and will leave your skin feeling rejuvenated, to kick start your day!  This bar has the option to include an exfoliation, which is granulated orange peel, suspended throughout the bar. \n\nCheerful soap has this therapeutic property that should help with stomach upsets, which is made with a honey base.  It's sweet and refreshing and has become my favorite of the two.  There is a combo of honey and Chamomile and can be made with or without the orange peel exfoliation .  Each bar is a 5.25 oz bar.  The soaps you see above, that I am holding, is just a sample of what the actual soap bars are. \n\n\n\nCheerful Soap     \n\n\n\nFresh Soap \n\nThe last product, shown below, is the Simple Bar Soap , available unscented. It is a cream to an off-white bar that has silky moisturizing properties that leaves your skin, happy and healthy.  Simple is made using pure olive oil, coconut oil and palm oil, which all help nourish your skin.  The unscented version is excellent for those with sensitive skin. \n\n\n\n\n\n\nYou can find these, and other wonderful products, by visiting Soaps N Dreams at the links below. Kristin Kirkland is the shop owner of Soap N Dreams so drop in with any questions you may have. \n\nSOAPS N DREAMS ETSY SHOP \nFACEBOOK ***I received complimentary products, in exchange, for my honest and unbiased review.  All opinions are always 100% my own. "}]