[{"thread": {"domain_rank": 1272, "replies_count": 0, "url": "http://omgili.com/ri/jHIAmI4hxg_ScoimW67Wq8bSaq4wH9DrO0iDN1V6hfIVGnz.l00x7A98jY8svjFVp9L5PIsM2cdjuR2Snh7meeopHhH6XJQd..lCkrXAbRCkAYk7YhO3QPYTiv5FNrb5g7sGGdxnDI7eW7Cks6KOHw--", "title": "13 favorite moments from &apos;Star Wars&apos; Celebration in Orlando this weekend", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://www.chicagotribune.com/news/weather", "spam_score": 0.937, "section_title": "Weather - Chicago Tribune", "site": "chicagotribune.com", "site_full": "www.chicagotribune.com", "performance_score": 0, "uuid": "6c2e75c59e6c4912e909e4fb0beaaff6c46e165c", "published": "2017-04-16T15:38:00.000+03:00", "site_categories": [], "country": "US", "title_full": "13 favorite moments from &apos;Star Wars&apos; Celebration in Orlando this weekend - Chicago Tribune", "participants_count": 1, "main_image": "http://www.trbimg.com/img-58f36163/turbine/ct-star-wars-celebration-10-best-20170415"}, "url": "http://omgili.com/ri/jHIAmI4hxg_ScoimW67Wq8bSaq4wH9DrO0iDN1V6hfIVGnz.l00x7A98jY8svjFVp9L5PIsM2cdjuR2Snh7meeopHhH6XJQd..lCkrXAbRCkAYk7YhO3QPYTiv5FNrb5g7sGGdxnDI7eW7Cks6KOHw--", "title": "13 favorite moments from &apos;Star Wars&apos; Celebration in Orlando this weekend", "highlightTitle": "", "external_links": ["http://www.trbimg.com/img-58ee87e1/turbine/chi-movie-reviews-pictures-pg", "http://d3ik2vfsvyg6fu.cloudfront.net/a/embed.html#layout=", "http://www.trbimg.com/img-58f10642/turbine/ct-greg-kot-album-reviews-pictures-pg", "http://www.trbimg.com/img-58f36163/turbine/ct-star-wars-celebration-10-best-20170415", "http://www.trbimg.com/img-58f36276/turbine/ct-star-wars-celebration-10-best-20170415-002", "http://www.trbimg.com/img-58f35f7d/turbine/ct-artist-recreates-child-s-bedroom-at-star-wars-celebration-20170416", "http://www.trbimg.com/img-58f21260/turbine/ct-photos-star-wars-celebration-fans-20170414", "http://www.trbimg.com/img-58f35be8/turbine/ct-handmade-items-featured-at-star-wars-celebration-20170416", "http://www.trbimg.com/img-58f363d3/turbine/ct-video-billy-dee-williams-at-star-wars-celebration-20170416", "http://www.trbimg.com/img-58f36165/turbine/ct-star-wars-celebration-10-best-20170415-001"], "crawled": "2017-04-17T11:27:32.000+03:00", "language": "english", "entities": {"locations": [{"name": "orlando", "sentiment": "none"}, {"name": "willrow hood", "sentiment": "none"}, {"name": "anaheim", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "cloud city", "sentiment": "none"}, {"name": "burbank", "sentiment": "none"}, {"name": "winnipeg", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "rockford", "sentiment": "none"}, {"name": "northern california", "sentiment": "none"}, {"name": "kenner", "sentiment": "none"}, {"name": "orange county convention center", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "belvidere", "sentiment": "none"}], "persons": [{"name": "harrison ford", "sentiment": "none"}, {"name": "mark daniel", "sentiment": "none"}, {"name": "forest whitaker", "sentiment": "none"}, {"name": "darryl sorensen", "sentiment": "none"}, {"name": "luke skywalker", "sentiment": "none"}, {"name": "gerardo mora", "sentiment": "none"}, {"name": "john williams", "sentiment": "none"}, {"name": "elliot", "sentiment": "none"}, {"name": "filoni", "sentiment": "none"}, {"name": "gustavo caballero", "sentiment": "none"}, {"name": "chewbacca", "sentiment": "none"}, {"name": "george lucas harrison ford mark hamill liam neeson forest whitaker", "sentiment": "none"}, {"name": "hamill", "sentiment": "none"}, {"name": "leia", "sentiment": "none"}, {"name": "christopher borrelli", "sentiment": "none"}, {"name": "proust", "sentiment": "none"}, {"name": "kenner", "sentiment": "none"}, {"name": "george lucas gerardo mora", "sentiment": "none"}, {"name": "michael phillips", "sentiment": "none"}, {"name": "dave filoni", "sentiment": "none"}, {"name": "dewback", "sentiment": "none"}, {"name": "lando calrissian", "sentiment": "none"}, {"name": "orlando philharmonic", "sentiment": "none"}, {"name": "doug chiang", "sentiment": "none"}, {"name": "liam neeson", "sentiment": "none"}, {"name": "lucas", "sentiment": "none"}, {"name": "chiang", "sentiment": "none"}, {"name": "samuel l. jackson", "sentiment": "none"}, {"name": "mark hamill", "sentiment": "none"}, {"name": "george lucas", "sentiment": "none"}, {"name": "dj elliot", "sentiment": "none"}, {"name": "carrie fisher", "sentiment": "none"}, {"name": "greg kot", "sentiment": "none"}, {"name": "billy dee williams", "sentiment": "none"}, {"name": "stevie nicks", "sentiment": "none"}, {"name": "rancho obi-wan", "sentiment": "none"}, {"name": "david oyelowo", "sentiment": "none"}], "organizations": [{"name": "empi", "sentiment": "negative"}, {"name": "getty images", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "disney", "sentiment": "none"}, {"name": "inferno squad", "sentiment": "none"}, {"name": "national portrait gallery", "sentiment": "none"}, {"name": "death star", "sentiment": "none"}, {"name": "chicago tribune", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "ea", "sentiment": "none"}, {"name": "lucasfilm", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "6c2e75c59e6c4912e909e4fb0beaaff6c46e165c", "published": "2017-04-16T15:38:00.000+03:00", "author": "Christopher Borrelli", "text": "After four days at Star Wars Celebration, a kind of semiannual gathering of Jedi and Rebels and Empire and Ewoks thrown by Lucasfilm as a great wet smooch of thanks to fans, you start to feel knee-deep in Sith, certain you’ll have a seizure if you hear the trumpets from John Williams’ theme one more time. Small children and R2-D2s begin to blur. But also, you are reminded, again and again, that this is a family reunion.\nHere then, in the spirit of family newsletters, a handful of takeaways:\nStar Wars Celebration is being held in Orlando April 13-16, 2017.\nNo. 1: My favorite part of the weekend — everyone’s favorite part of the weekend — was the touching opening ceremony, a 40th anniversary gala that delivered more than it promised, and indeed felt like a family coming together after a long time, albeit stuck with each other and incapable of polite nothings. Mark Hamill and Harrison Ford explained to George Lucas why he can’t write dialogue. Liam Neeson made a Jar Jar Binks crack. Samuel L. Jackson lobbied to return to the series, despite his character’s death. Lucas, his seeming discomfort running neck and neck with his watery eyes, blurted that, look, “I’m not supposed to say this, but this was a film for 12-year-olds.”\nHamill said the fans were more supportive than his own family, and Ford, in a convincing deadpan, said that “Star Wars” has made \"no difference in his life whatsoever.”\nThen John Williams and the Orlando Philharmonic played the film’s legendary score as the audience stood at attention, and finally, here is an image to burn in your head: 40 years of cast and crew, standing in the dark edges of the theater, listening and weeping.\nStar Wars Celebration Gustavo Caballero / Getty Images Mark Hamill, Harrison Ford and George Lucas attend the Star Wars Celebration Day 1 on April 13, 2017 in Orlando, Florida.\nMark Hamill, Harrison Ford and George Lucas attend the Star Wars Celebration Day 1 on April 13, 2017 in Orlando, Florida.\n(Gustavo Caballero / Getty Images) No. 2: My next favorite thing at Star Wars Celebration was an art installation, designed by Rancho Obi-Wan, the vast Lucasfilm archive in Northern California, a Library of Congress for “Star Wars” toys and fan-created art and advertising materials and costumes and props from the series. The installation, evocative and touching, was a replica of a boy’s messy, middle-class bedroom, circa 1978, smattered with “Star Wars” bedsheets, music sheets, bootleg lamps, action figures, space ships, carpets, sleeping bags. I visited three times, and each time I witnessed fans of a certain age stop and stand a moment, then put hands to their mouths. Proust couldn’t have said it any better.\nNo. 3: On the third day of Celebration, an excited young boy dressed as Luke Skywalker shouted to an elevator full of passengers: “We just met Han Solo!” An adult rider asked: “The real Han?” And the boy’s grandmother said: “Come on. We’d be having sex right now.” On the first day of Celebration, coming out of the 40th anniversary event, a different young boy excitedly told his father: “My favorite part was when Han Solo came and then next best part was when the old man with the stick made the music happen.”\nDave Filoni and George Lucas Gerardo Mora / Getty Images Dave Filoni and George Lucas attend the 40 Years of Star Wars panel during the 2017 Star Wars Celebration at Orange County Convention Center on April 13, 2017 in Orlando, Florida.\nDave Filoni and George Lucas attend the 40 Years of Star Wars panel during the 2017 Star Wars Celebration at Orange County Convention Center on April 13, 2017 in Orlando, Florida.\n(Gerardo Mora / Getty Images) No. 4: Should the “Star Wars” movies end tomorrow — and Lucasfilm plans a couple more decades worth, so fat chance — there’s “Star Wars Rebels,” the lovingly smart animated series on Disney XD that’s attracted talent like Forest Whitaker and David Oyelowo. Or rather, there was “Rebels.” Dave Filoni, the series creator, as close to George Lucas’ creative heir apparent as the “Star Wars” universe has, stood before several thousand packed into a ballroom and said its fourth season, this fall, will be its last. He said every generation should get its own “Star Wars.” His eyes watered, and the audience gave a long standing ovation, a response as warm as the reaction to “The Last Jedi” a day earlier. If you have any doubt of Filoni’s star power, among the amateur Stormtroopers, there were cosplay Filonis, in his trademark cowboy hat and facial scuff.\nHandmade items featured at Star Wars Celebration Christopher Borrelli takes a look at all of the handmade items at the Star Wars Celebration.\nChristopher Borrelli takes a look at all of the handmade items at the Star Wars Celebration.\nSee more videos No. 5: There’s so much licensed at Star Wars Celebration, it’s easy to forget, amid copyrights and trademarks, there were creations made from sheer love. Of course, that Dewback reptile couch, going for $10,000, came from love, too; same goes for that artist who sold “Star Wars” posters re-imagined as 1940s pulp-fiction covers. But what do you make of the full-scale models of Imperial Walkers (those metal moose-like weapons), and motorcycles retrofitted to resemble hover bikes? Lucasfilm art director Doug Chiang gave a fascinating talk on the company’s design philosophy — how the prequels draw from early 20th century handmade creations, while the original films are more rooted in the mass production and decay of post-WWII America. But where does Darryl Sorensen of Belvidere, Ill. (outside Rockford), fit in? He took the raw material of Chiang’s spaceships and redesigned his 2003 Saturn to resemble one. He commutes in it. It has targeting scopes and its own R2 droid. It sat on the exhibition floor here, much admired.\nVideo: Billy Dee Williams at Star Wars Celebration Billy Dee Williams (Lando Calrissian) makes an appearance at the Star Wars Celebration in Orlando.\nBilly Dee Williams (Lando Calrissian) makes an appearance at the Star Wars Celebration in Orlando.\nSee more videos No. 6: One of the more pleasant surprises was running into Billy Dee Williams, Lando Calrissian himself. He wore a royal blue suit and matching sunglasses, rarely removing them throughout his “Smooth Talkin’” panel. At 80, he made a considerable case for his side career as a painter (he has work in the National Portrait Gallery), he said he will not be in a new “Star Wars” movie in the near future (“I’m not that interested in working that hard anymore”) and he held the sweet, calm, awkward energy of a man who had wandered in and sat bewildered, surrounded by people dressed like Lando Calrissian.\nNo. 7: Keeping thousands of “Star Wars” fans sitting patiently in a large, cramped room, especially after many had spent hours in line to get there, is a task no one deserves. Yet DJ Elliot and Mark Daniel, longtime Celebration MCs, have a niche: They asked for volunteers to give up their seats or they would start removing people, and the hall got quiet, until the joke hit slowly and rolled across the room. A couple of days later, Elliot asked if anyone (such as himself) met their spouse or partner through “Star Wars”? A surprisingly large number cheered. “I doubt George Lucas had that in mind,” Elliot said.\nNo. 8: It’s a good time to be a “Star Wars” fan: There is a new generation of fans/creators working alongside the first generation of fans/creators, intent on paying homage and making something new simultaneously. But one of the disappointments of the “Force Awakens” era was EA’s “Battlefront” video game, massively hyped, intricately detailed and deadly dull to play. It’s notable, then, that the panel for “Battlefront II” avoided those criticisms. Developers brought a beautiful trailer and a fresh take: The new game will be told from the POV of the Empire. It will bridge the gap between “Return of the Jedi” and “Force Awakens”; its characters so fully realized that a prequel novel, “Battlefront II: Inferno Squad,” is due in July. The game arrives Nov. 17. Leaving the panel, a young guy in a Darth Vader helmet, his voice made digitally baritone, boomed out: “Yes, but is it fun?”\nNo. 9: Speaking of vague promises of fun: Disney is building two giant “Star Wars”-themed worlds, in Orlando and Anaheim, set to open in 2019. To show the scale of the project, they brought footage of a large brown construction lot, inside which almost nothing is recognizable yet. They spoke of “going to ‘Star Wars,’” piloting the Millennium Falcon and drinking blue milk but offered almost no details of attractions. However, they did bring impressive concept art showing a slight Eastern influence — their “Star Wars” land is apparently set in Stevie Nicks' living room. When the panel moderator asked if the land is a new planet, one of the Disney imagineers answered a bit sharply: “It’s new to you.”\nNo. 10: Star Wars Celebration, being a collector’s paradise, features a lot of Celebration-exclusives, available here for four days only, exclusive Legos, exclusive pins and posters. So give Gentle Giant, a Burbank, Calif., based geek-centric toymaker, props for making clever fun of exclusivity itself, and without ripping anyone off: They brought an $85 re-creation of the Trash Compactor monster from the Death Star — specifically, the weird green bird-lizard thing that was included with Kenner’s Death Star playset in 1978. The packaging played off the silver-striped Kenner boxes from vintage “Star Wars” toys, and the best touch: Also included were perfect replicas of Kenner’s cheap foam trash.\nNo. 11: Speaking of elaborate tributes to deep-cut “Star Wars” references: On Friday afternoon, roughly four dozen men, women and children, in matching orange space jumpsuits, chanting “Ice cream!” and carrying plastic ice-cream makers under their arms, made their way through the convention center, to the confusion of nearly everyone. Here’s the deal: That is called the Running of the Hoods, and it doesn’t get nerdier than this. Willrow Hood is the name of a character, seen for a fleeting second in “Empire Strikes Back,” running through Cloud City when Lando Calrissian orders its evacuation. The actor in the film, for reasons lost to time, was carrying an ice-cream maker. And so now, at every Celebration, in a bit of Pythonesque perversity, groups of fans periodically run through the crowds carrying ice-cream makers under their arms. And now you know.\nNo. 12: Attending a family reunion means inevitably being cornered by someone who wants to explain what they do with great intensity. You could do much worse than being cornered by “Star Wars” collectors. Their seminars drew some of the longest lines of attendees and offered some of the most improbable tales. Deep dives into food-related “Star Wars” collectibles anyone? Who knew about the great art found on a “Star Wars” tie-in from a Winnipeg restaurant chain? Or that Mexican cola caps with “Star Wars” images are fiercely sought? Another panel, on fakes and scandals, detailed master movie-poster forgeries and elaborate scams from former Kenner toymakers — all of which, even the bootlegs, can produce a piece worth something to someone, considering the market.\nFans dress the part at the Star Wars Celebration in Orlando.\nNo. 13: Saturday ended the way you would have hoped, with thousands of “Star Wars” fans seated in a large darkened room, watching episode after episode, the smell of popcorn wafting over everything. After a day of hearing the series discussed abstractly and minutely, after hearing producers and designers promising even greater things in the future, it was nice, simple, a reminder of why everyone was here. Saturday night moved into Sunday morning, and Harrison Ford and Chewbacca ran into danger again, and in the back, a dad slept upright, his mouth hanging open. Beside him sat a young girl, his daughter, clutching a Princess Leia action figure. Wide awake, she elbowed her father:\n“Dad! You’re snoring!”\ncborrelli@chicagotribune.com\nRELATED STORIES:\nMark Hamill pays emotional tribute to Carrie Fisher at 'Star Wars' gathering\nFans thrilled and confused by 'Last Jedi' trailer\n'Star Wars: The Last Jedi' trailer revealed at Star Wars Celebration\nComplete Star Wars Celebration coverage from Chicago Tribune\nCheck out the latest movie reviews from Michael Phillips and the Chicago Tribune.\nCheck out reviews for all new music releases from Tribune music critic Greg Kot.\nCopyright © 2017, Chicago Tribune Art George Lucas Harrison Ford Mark Hamill Liam Neeson Forest Whitaker"}]