[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:07:56.000+03:00", "author": "", "entities": {"persons": [{"name": "johnson", "sentiment": "none"}, {"name": "rudy gobert", "sentiment": "none"}, {"name": "deandre jordan", "sentiment": "none"}, {"name": "hill", "sentiment": "none"}, {"name": "blake griffin", "sentiment": "none"}, {"name": "luc mbah", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "rodney king", "sentiment": "none"}, {"name": "jamal crawford", "sentiment": "none"}, {"name": "chris paul", "sentiment": "none"}, {"name": "george hill", "sentiment": "none"}, {"name": "hayward", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "gordon hayward", "sentiment": "none"}, {"name": "clipper baron davis", "sentiment": "none"}, {"name": "rivers", "sentiment": "none"}, {"name": "derrick favors", "sentiment": "none"}, {"name": "j. terrill", "sentiment": "none"}, {"name": "crawford", "sentiment": "none"}, {"name": "doc rivers", "sentiment": "none"}, {"name": "griffin", "sentiment": "none"}, {"name": "quin snyder", "sentiment": "none"}, {"name": "joe johnson", "sentiment": "none"}, {"name": "diaw", "sentiment": "none"}, {"name": "boris diaw", "sentiment": "none"}, {"name": "raymond felton", "sentiment": "none"}, {"name": "gobert", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "sacramento", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "los an", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "staples center", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}], "organizations": [{"name": "la", "sentiment": "none"}, {"name": "backup g austin rivers", "sentiment": "none"}, {"name": "los angeles clippers", "sentiment": "none"}, {"name": "utah jazz", "sentiment": "none"}, {"name": "nba", "sentiment": "none"}, {"name": "clippers", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "text": "Johnson's drive at buzzer helps Jazz beat LA 97-95 in Game 1 - SWX Right Now-Sports for Spokane, CdA, Tri-Cities, WA Member Center: Johnson's drive at buzzer helps Jazz beat LA 97-95 in Game 1 Posted: Updated: (AP Photo/Mark J. Terrill). Utah Jazz center Rudy Gobert, center, is helped off the court by center Boris Diaw, right, and guard George Hill, left, as coach Quin Snyder watches after Gobert injured his knee during the first half in Game 1 of an NBA bas... (AP Photo/Mark J. Terrill). Utah Jazz center Boris Diaw, right, of France, shoots as Los Angeles Clippers forward Blake Griffin defends during the first half in Game 1 of an NBA basketball first-round playoff series, Saturday, April 15, 2017, in Los An... (AP Photo/Mark J. Terrill). Los Angeles Clippers forward Blake Griffin shoots as Utah Jazz center Boris Diaw defends during the first half in Game 1 of an NBA basketball first-round playoff series, Saturday, April 15, 2017, in Los Angeles. (AP Photo/Mark J. Terrill). Utah Jazz center Boris Diaw, center, of France, passes the ball as Los Angeles Clippers forward Blake Griffin, left, and guard Raymond Felton defend during the first half in Game 1 of an NBA basketball first-round playoff se... (AP Photo/Mark J. Terrill). Utah Jazz center Rudy Gobert, of France, goes down after injuring his knee as forward Gordon Hayward looks back during the first half in Game 1 of an NBA basketball first-round playoff series against the Los Angeles Clippers... Updated: Sunday, April 16 2017 10:08 PM EDT 2017-04-17 02:08:40 GMT Arkansas inmates who had been set for execution this month want a federal appeals court to take up their claim that a compressed timetable violates \"evolving standards of decency.\". More >> Arkansas inmates who had been set for execution this month want a federal appeals court to take up their claim that a compressed timetable violates \"evolving standards of decency.\". More >> Updated: Sunday, April 16 2017 10:08 PM EDT 2017-04-17 02:08:37 GMT Cleveland police say they are searching for a man they say showed the fatal shooting of another man live on Facebook. More >> Cleveland police say they are searching for a man they say showed the fatal shooting of another man live on Facebook. More >> Sunday, April 16 2017 10:08 PM EDT 2017-04-17 02:08:32 GMT Federal tax bills: Where does your state rank?. More >> Federal tax bills: Where does your state rank?. More >> Updated: Sunday, April 16 2017 10:08 PM EDT 2017-04-17 02:08:29 GMT Justice Neil Gorsuch's first week on the Supreme Court bench features an important case about the separation of church and state that has its roots on the playground of a Midwestern church. More >> Justice Neil Gorsuch's first week on the Supreme Court bench features an important case about the separation of church and state that has its roots on the playground of a Midwestern church. More >> Updated: Sunday, April 16 2017 10:08 PM EDT 2017-04-17 02:08:26 GMT The journalist arrested at a Tax Day protest at President Donald Trump's signature Las Vegas hotel has been released from jail. More >> The journalist arrested at a Tax Day protest at President Donald Trump's signature Las Vegas hotel has been released from jail. More >> Updated: Sunday, April 16 2017 10:08 PM EDT 2017-04-17 02:08:20 GMT On Easter Sunday, Fifth Avenue came alive with outlandish costumes that mingled with elegant bonnets fit for services at St. Patrick's Cathedral and other churches. More >> On Easter Sunday, Fifth Avenue came alive with outlandish costumes that mingled with elegant bonnets fit for services at St. Patrick's Cathedral and other churches. More >> Updated: Sunday, April 16 2017 10:08 PM EDT 2017-04-17 02:08:17 GMT Lawmakers in more than a dozen states are trying to increase voter participation by including young people. More >> Lawmakers in more than a dozen states are trying to increase voter participation by including young people. More >> Updated: Sunday, April 16 2017 10:08 PM EDT 2017-04-17 02:08:12 GMT A collapsed interstate in the heart of Atlanta has highlighted the region's reliance on cars and the limitations of a transit system serving the city's core. More >> A collapsed interstate in the heart of Atlanta has highlighted the region's reliance on cars and the limitations of a transit system serving the city's core. More >> Updated: Sunday, April 16 2017 10:07 PM EDT 2017-04-17 02:07:45 GMT Ethiopia's Buzunesh Deba is hoping to win the Boston Marathon on Monday and enjoy the celebration she never got for her first title. More >> Ethiopia's Buzunesh Deba is hoping to win the Boston Marathon on Monday and enjoy the celebration she never got for her first title. More >> Sunday, April 16 2017 10:05 PM EDT 2017-04-17 02:05:36 GMT The wait is over for April the giraffe and her legions of fans. More >> The wait is over for April the giraffe and her legions of fans. More >> By BETH HARRISAP Sports Writer \nLOS ANGELES (AP) - Joe Johnson has seen a lot in his 16 years in the NBA. So the veteran didn't flinch with the clock ticking down and the game tied. \nAll that experience is why the Utah Jazz brought him in this season. \nIt paid off when Johnson drove the lane and hit a floater at the buzzer, giving the Jazz a 97-95 victory over the Los Angeles Clippers after Utah lost Rudy Gobert 17 seconds into their playoff opener on Saturday night. \n\"I just wanted to get as close as I could to the basket, and it was a good thing it went down,\" Johnson said. \nJohnson, who scored 21 points, was left isolated against Jamal Crawford on the final play. He powered his way inside and lofted a shot over Crawford and DeAndre Jordan that bounced around the rim before falling in. A video review confirmed it was good. \n\"I just try to be patient, get to a sweet spot, and make the right play,\" Johnson said. \nHe's made an NBA-best eight game-winning buzzer-beaters in the past 10 years. \n\"That's what he's been doing all his career,\" Utah's Boris Diaw said. \"So when he gets the ball at the end of the game, we are pretty confident.\" \nThe Jazz were dealt a blow before either team had settled into the game. \nGobert sprained his left knee on the game's first play when he banged knees with Clippers forward Luc Mbah a Moute, leaving the Jazz without their 7-foot-1 center who averaged 14.0 points and 12.8 rebounds during the regular season. \n\"We felt and knew that a lot of people probably were counting us out when he went down, but man, we stuck together,\" Johnson said. \nUtah steadied itself behind Johnson and fellow veteran George Hill, both of whom were brought in to balance the inexperienced Jazz. Johnson finished with 21 points off the bench and Hill added 16 points. \nGordon Hayward had 19 points and 10 rebounds for Utah. \nBlake Griffin scored 26 points and Chris Paul added 25 points and 11 assists for the Clippers, whose seven-game winning streak ended with their first loss since March 26 against Sacramento. \nA driving Paul banked in a floater with 13 seconds to go, tying the game at 95. \nThe Jazz didn't call a timeout. \n\"We just wanted to have it where they couldn't set up on us,\" Hayward said, glancing at Johnson. \"We just wanted to get it and go and let this man go to work.\" \nMaking their first playoff appearance in five years, the Jazz outshot the Clippers and narrowly controlled the paint, owning a 42-40 edge. \nThe teams tied with identical 51-31 records in the regular season. The Clippers earned the No. 4 seed and home court by virtue of winning the season series 3-1. \n\"We fought until the end of the year to get it, and now we've given it right back,\" Clippers coach Doc Rivers said. \nUtah withstood Paul's offensive outburst in the fourth after the Jazz led by eight on Hill's 3-pointer. Paul rattled off 10 straight Los Angeles points, drawing the Clippers to 90-89 on a 3-pointer. \nHayward and Johnson scored, keeping the Jazz ahead 94-91. But Johnson lost the ball and Hill fouled Griffin, who made both free throws to get the Clippers to 94-93 with 23 seconds left. \nAfter a timeout by the Jazz, Griffin fouled Derrick Favors, who missed the first and made the second after it hit the rim and went in for a 95-93 lead with 18 seconds left. \n\"We've got to be better,\" Paul said. \"They played harder, they were more physical.\" \nGobert was setting a screen when he and Mbah a Moute made contact and Gobert fell to the court clutching his left leg. \nHe had to be helped off by Diaw and Hill. A team spokesman said X-rays were negative, and Gobert was taken from Staples Center to have a precautionary MRI. \n\"We felt a little bit stunned out there,\" Diaw said, \"but then we regrouped and got back on the horse.\" \nThe matchup between Gobert and Jordan was expected to be a key in the best-of-7 series. Jordan finished with 10 points and 15 rebounds and got called for a technical in the fourth with the Clippers down six. \n\"We have the rule, no fourth-quarter techs, and he got one,\" Rivers said. \"It didn't make a huge difference, but it could have for sure.\" \nUtah outscored the Clippers 16-10 to open the third before Crawford's jumper put Los Angeles ahead 70-68. Hayward singlehandedly outscored the Clippers 6-0 to send the Jazz into the fourth leading 74-70. \nNeither team led by more than six points in the first half. The Clippers were ahead by six when the Jazz outscored them 14-2 in the second quarter to take their own six-point lead. Griffin got stripped under the basket by Hayward, but he hit a 3-pointer and made a layup on the Clippers' next two possessions to key a 14-8 spurt that ended with the half tied 52-all. \nTIP-INS \nJazz: The last time the teams met in the playoffs was a first-round series in 1996-97, won 3-0 by the Jazz. ... Utah also won the teams' other postseason series 3-2 in 1991-92, which was interrupted by the riots after the Rodney King verdict. \nClippers: Backup G Austin Rivers (strained left hamstring) did some shooting for the first time Saturday since his injury. He's out for at least the first two games of the series. ... Former Clipper Baron Davis shared hugs with the referees from the courtside seat. \nUP NEXT \nGame 2 is Tuesday night at Staples Center. \n__ \nMore AP NBA: apnews.com/tag/NBAbasketball Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. All content © Copyright 2000 - 2017 SWXRN. All Rights Reserved.", "url": "http://omgili.com/ri/jHIAmI4hxg_P0c9kMHYJW15fQ1uQTENfy3hr9mwgWi91fWInmWdtM46T_LOZs03urrkWrAhQzxnt89s0gfQQ3vCRj5ELFrsJiniSktvzQs1fRQjHJhBFToy3mA4KyOcMIWNA9MWYFpc-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:07:56.000+03:00", "language": "english", "title": "Johnson's drive at buzzer helps Jazz beat LA 97-95 in Game 1", "thread": {"title_full": "Johnson's drive at buzzer helps Jazz beat LA 97-95 in Game 1", "site_full": "www.swxrightnow.com", "site": "swxrightnow.com", "site_section": "http://www.swxrightnow.com/category/13566/national-sports?clienttype=rss&redirected=true", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "news", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Sports and Weather Right Now - National Sports - Headline", "url": "http://omgili.com/ri/jHIAmI4hxg_P0c9kMHYJW15fQ1uQTENfy3hr9mwgWi91fWInmWdtM46T_LOZs03urrkWrAhQzxnt89s0gfQQ3vCRj5ELFrsJiniSktvzQs1fRQjHJhBFToy3mA4KyOcMIWNA9MWYFpc-", "published": "2017-04-16T11:07:56.000+03:00", "title": "Johnson's drive at buzzer helps Jazz beat LA 97-95 in Game 1", "uuid": "6c8d544848a0982b01553092f6427bff1461ed82", "main_image": "http://images.worldnow.com/AP/images/13632087_G.jpg"}, "uuid": "6c8d544848a0982b01553092f6427bff1461ed82", "ord_in_thread": 0}]