[{"entities": {"persons": [], "organizations": [], "locations": []}, "text": "Book Review: Ericsen, Anders. From Polders to Potosi: The Unlikely Richterist Triumph in the Election of 1682.\nIn 1682, the Dutch Republic held an election across seventeen time zones, using nothing more sophisticated than pencil, paper and telephone cable. An immensely complex logistical undertaking -- polling places in Manhattan, Montreal and Nootka Sound had yet to open by the time voting closed in Australia -- the 1682 election has long been viewed as a turning point in Dutch political history. For the first time, a Richterist party would have undisputed political control over one of Europe's Great Powers. Commanding an absolute majority of seats in the Volksraad, the first party ever to do so under the Mailey reforms, the Richterist camp had free license to enact its governing policies. The van Helsing pensionary would see the passage of a host of major legislative programs, including key Richterist proposals on workplace safety, workers' compensation, and overtime pay, as well as the first proposals for universal basic income to all citizens of the Netherlands.\nThe traditional view of the Richterists is of a coalition of Hollander radicals, prairie co-operatives, and Amsterdam's middle class, feeling the pressures of globalization for the first time. In a thorough review of recently unsealed electoral archives, however, Ericsen provides evidence that what drove the transformational van Helsing pensionary was significant and often critical early support from Catholics.\nReligious toleration was the official policy of the Dutch Republic -- a requirement for a small, urban, densely populated society inflamed by religious tensions. In a society that valued wealth and its understated display, however, Calvinism was still the faith of Dutch elites, and membership in a Reformed congregation often brought with it a network of powerful, politically connected patrons. The rise of Richterist organizations, however, provided Catholics, nonconformists, and other minorities with a parallel path to obtaining wealth and political power...", "ord_in_thread": 16, "language": "english", "external_links": [], "uuid": "6c98736c1da7d0bf21890e20e059bad11fe9bde0", "rating": null, "highlightTitle": "", "title": "", "thread": {"country": "US", "site": "sufficientvelocity.com", "replies_count": 16, "title_full": "IC - Magic, Shell and Steel | Page 17 | Sufficient Velocity", "site_categories": [], "performance_score": 0, "section_title": "Grand Strategy IC | Sufficient Velocity", "domain_rank": 58816, "uuid": "2d57a4f4a03cdf0d3b93641e57a414ad5af40c18", "main_image": "data/avatar/1491229832/m/5/5182.jpg", "site_type": "discussions", "title": "Magic, Shell and Steel 17", "spam_score": 0.0, "site_section": "http://forums.sufficientvelocity.com/forums/grand-strategy-ic.57/", "url": "http://omgili.com/ri/.0rSU5LtMgzLt__IAG7GWRhea8m4ZpNzXsFlbj9PLSpGeKJGyuWD9LEechbeERocSG4Fego4BL3n9WeN_P6kMwUIoSIDHxV11oi_8hzaJFaYE6F5tGZyqw--", "participants_count": 12, "site_full": "forums.sufficientvelocity.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-17T11:43:00.000+03:00"}, "crawled": "2017-04-18T11:24:34.000+03:00", "url": "http://omgili.com/ri/.0rSU5LtMgzLt__IAG7GWRhea8m4ZpNzXsFlbj9PLSpGeKJGyuWD9LEechbeERocSG4Fego4BL3n9WeN_P6kMwUIoSIDHxV11oi_8hzaJFbsTNSYYwXf3tGRbZB2PB1N", "highlightText": "", "published": "2017-04-18T09:14:00.000+03:00", "author": "Mina"}]