[{"entities": {"organizations": [{"name": "united", "sentiment": "negative"}, {"name": "united airlines", "sentiment": "negative"}, {"name": "khou", "sentiment": "none"}, {"name": "us marshall", "sentiment": "none"}, {"name": "united airlines travel united", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "costa rica", "sentiment": "none"}], "persons": [{"name": "michael hohl", "sentiment": "negative"}, {"name": "dao", "sentiment": "none"}, {"name": "maggie schmerin", "sentiment": "none"}, {"name": "hohl", "sentiment": "none"}, {"name": "maxwell", "sentiment": "none"}, {"name": "david dao", "sentiment": "none"}]}, "uuid": "6dd498c5e6ce82a1b1e1db9d400530087bd517e8", "highlightText": "", "title": "Couple claims they were kicked off United flight to their wedding", "thread": {"site": "businessinsider.com", "country": "US", "participants_count": 1, "site_full": "www.businessinsider.com", "section_title": "Business Insider", "uuid": "6dd498c5e6ce82a1b1e1db9d400530087bd517e8", "site_section": "http://www.businessinsider.com/", "domain_rank": 283, "main_image": "http://static1.businessinsider.com/image/58f3b8a8c75d4a62008b48ba-1190-625/a-couple-says-they-were-kicked-off-a-united-flight-on-the-way-to-their-wedding.jpg", "performance_score": 9, "published": "2017-04-16T22:57:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meuL1ei1Bo_4W0Cnv_e61NIybryGUgH4seVRJwqIl5b4GcGCHIziUYC9C8YIUGbzSSuwg1SMO6Co08zW6Uu35b2nt9Tswjj4qkQ--", "title_full": "Couple claims they were kicked off United flight to their wedding - Business Insider", "title": "Couple claims they were kicked off United flight to their wedding", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 947, "shares": 947, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 6}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T22:57:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meuL1ei1Bo_4W0Cnv_e61NIybryGUgH4seVRJwqIl5b4GcGCHIziUYC9C8YIUGbzSSuwg1SMO6Co08zW6Uu35b2nt9Tswjj4qkQ--", "ord_in_thread": 0, "crawled": "2017-04-16T23:17:52.000+03:00", "rating": null, "external_links": ["http://www.khou.com/news/local/bride-and-groom-booted-off-united-flight-in-houston/431644313"], "highlightTitle": "", "author": "Sonam Sheth", "text": "Michael Hohl and Amber Maxwell. Facebook\nIt has been a rough week for United Airlines and some of its passengers.\nThat deluge didn't let up on Sunday, when a local news outlet in Houston reported that a couple had been kicked off their flight from Houston to Costa Rica for their wedding.\nMichael Hohl and Amber Maxwell said they boarded their flight on Saturday and were about to take their seats when they saw a passenger napping across the row they were assigned to.\nHohl said that instead of waking the man, he and Maxwell decided to sit a few rows in front of their assigned seats.\n\"We thought not a big deal, it's not like we are trying to jump up into a first-class seat,\" Hohl told KHOU, a CBS affiliate in Houston. \"We were simply in an economy row a few rows above our economy seat.\"\nHohl said that after he and Maxwell sat down, a flight attendant asked if they were in their assigned seats. When the couple said no and explained why they had moved, Hohl said the attendant denied their request for an upgrade and asked them to return to their original seats.\nHohl said that although he and Maxwell did as they were told, a US marshal boarded the flight and asked them to get off the plane. The couple said they complied with that demand as well but found the overall experience \"strange.\"\n\"They said that we were being disorderly and a hazard to the rest of the flight, to the safety of the other customers,\" Hohl said. \"I think customer service and the airlines has gone real downhill.\n\"The way United Airlines handled this was really absurd,\" Hohl added.\nUnited has disputed Hohl's version of events, saying the couple had repeatedly tried to sit in upgraded seats and refused to comply with requests to move back to their assigned seats.\n\"We're disappointed anytime a customer has an experience that doesn't measure up to their expectations,\" United said in a statement to KHOU . \"These passengers repeatedly attempted to sit in upgraded seating which they did not purchase, and they would not follow crew instructions to return to their assigned seats. We've been in touch with them and have rebooked them on flights tomorrow.\"\nUnited has been engulfed by controversy since a video emerged last week that showed 69-year-old David Dao being violently dragged off a flight after refusing to give up his seat to make room for crew members. Dao's attorney said on Thursday that Dao sustained injuries and planned to file a lawsuit against the airline.\nUnited has adopted a rule that crew members can't displace passengers already on board the plane, The Associated Press reported.\nMaggie Schmerin, a spokeswoman for United, said in an email to the AP on Sunday that the change was an initial step in a review of policies and was meant to ensure that situations like Dao's never happen again.\nSEE ALSO: Man dragged off United flight gears up for legal battle, says he lost teeth, broke his nose, and got a concussion DON'T MISS: UNITED CEO: 'This can never, will never happen again on a United Airlines flight' NOW WATCH: Timeline of a crisis: How United's passenger-bumping debacle unfolded Loading video... More: United Airlines Travel United David Dao"}]