[{"entities": {"locations": [], "organizations": [{"name": "turbotax", "sentiment": "none"}, {"name": "cpp", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "turbotax canada", "sentiment": "none"}], "persons": []}, "ord_in_thread": 0, "thread": {"site_full": "commoncentsmom.com", "site_section": "http://commoncentsmom.com/feed/", "domain_rank": null, "replies_count": 0, "country": "US", "section_title": "Common Cents Mom", "title": "Tax Tips for Canadian Freelancers", "title_full": "Tax Tips for Canadian Freelancers", "published": "2017-04-19T08:38:46.000+03:00", "url": "http://omgili.com/ri/0xd.sZhj5jdz6.8lbJAq8Tt1x_zmTyAWFrwNY4kxsjInqD9CzqcHqPSx779tsjBtwjkARM.KSY9UhEUoNaG91UwFmcI6iSUw", "site": "commoncentsmom.com", "main_image": "http://commoncentsmom.com/wp-content/uploads/2017/04/tax-tips-for-freelancers.jpeg", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "6f94667121b975fa6b095fdae7572627c169e30c", "site_type": "blogs"}, "title": "Tax Tips for Canadian Freelancers", "published": "2017-04-19T08:38:46.000+03:00", "url": "http://omgili.com/ri/0xd.sZhj5jdz6.8lbJAq8Tt1x_zmTyAWFrwNY4kxsjInqD9CzqcHqPSx779tsjBtwjkARM.KSY9UhEUoNaG91UwFmcI6iSUw", "author": "Common Cents Mom", "crawled": "2017-04-19T08:38:46.000+03:00", "language": "english", "text": "Common Cents Mom Taxes \nIt is almost tax time for Canadian tax filers but did you know Canadians who are self-employed receive an extra six weeks to file within. Your documents are due June 25th, however, if you owe the tax man the interest on payments starts on May 1st this year. So what tax tips do I have for freelancers who may have just started living the gig lifestyle or just started working for themselves? Keep Accurate Records \nCan I confess something? The first few years I had my blog I kept no records, but that is ok because I earned no revenue from my blog. It was a passion project, a hobby. Once it became an income earning blog it was important to have accurate records of payments, gifts received and expenses. It was and is important to keep accurate records for seven years. Declare It \nI know many freelancers who “forget” income. Did you get paid with a gift card my blogger friends? That counts as income? Did you receive product for writing a review, that is income? Are you earning money from a side hustle while working a full-time job? You have to declare that as well. Expense It \nWhen you start working for yourself, you quickly learn how many things you can now expense. Your home office becomes an expense, that laptop you just bought, your cell phone that you are using for your business is an expense, those new daycare toys, those new tools. The list goes on. \nSome of my favourite write-offs include: Transportation to and from gigs, conferences, or seeing clients. Reasonable food, beverages, and entertainment expenses. (Food bloggers love this one.) Learning( take a course, you can write it off if it relates to learning skills you need for what you do.) The Home Office ( take the square footage of your office space divided by the total square footage of your home to calculate the part you can deduct) Car Expenses( use your car for what you do, keep logs and repair receipts) \nThese are just a few of the things you can claim as a freelancer if you have the receipts, that is why it is so important to keep careful accurate files. Save It \nYou should be saving some for the tax man. You definitely do not want to be left owing the tax man. I recommend saving at least 30% of your income for CPP and taxes. File It Yourself \nEven a busy small business owner can file their taxes themselves with the ease of the TurboTax Home & Business software. Your personal tax return and your business return are one and the same. Remember you do have to fill out a Statement of Business Activities. One return will cover your entire life and that is a good thing! \nIf you would like more tax tips for the Canadian freelancer or small business owner, check out the TurboTax Canada blog Win \nLeave a blog post with your tax tip for freelancers and you can win a copy of TurboTax. There are 5 copies to win! \n* Giveaway is open to Canadian tax filers and the giveaway closes April 25th at 12:00 am.", "external_links": [], "highlightTitle": "", "uuid": "6f94667121b975fa6b095fdae7572627c169e30c", "highlightText": "", "rating": null}]