[{"entities": {"locations": [], "organizations": [], "persons": [{"name": "hannah", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "mamaspinkbag.wordpress.com", "site_section": "https://mamaspinkbag.wordpress.com", "domain_rank": null, "replies_count": 0, "country": "US", "section_title": "REVIEW: 13 Reasons Why – Mama's Pink Bag", "title": "REVIEW: 13 Reasons Why", "title_full": "REVIEW: 13 Reasons Why", "published": "2017-04-19T08:38:45.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZTma4SbrQOEeWpQvVodmuYHHUPx.Uy8NmQrVSpLM3U4TMrAu5aVR_ZO5xpArWoMD_f4g6D0jqteNpKyRdjkHa6l", "site": "wordpress.com", "main_image": null, "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "70562403ed7569c35d015849870d574e96003362", "site_type": "blogs"}, "title": "REVIEW: 13 Reasons Why", "published": "2017-04-19T08:38:45.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZTma4SbrQOEeWpQvVodmuYHHUPx.Uy8NmQrVSpLM3U4TMrAu5aVR_ZO5xpArWoMD_f4g6D0jqteNpKyRdjkHa6l", "author": "mamaspinkbag", "crawled": "2017-04-19T08:38:45.000+03:00", "language": "english", "text": "If you have not heard about this Netflix Original then you must be off the grid. For over a week now it has been coming up on my friends newsfeed on facebook as well as mine.\nI am not one to follow a trend or watch what everyone else is watching but the things my facebook friends were posting about this made me curious….\nMy friends have been posting things like “it really makes you think”, “I pray my kids never have to go threw this”, and more.\nSo, I decided to watch the first one yesterday morning…. which led me to finishing the first season today!\nYes, I went a little crazy and allowed myself to be a little lazy a couple days after easter.\nAnyways, it has a strong message. I seriously felt like I was back in high school as I faced a few things the main character (Hannah) did. Which made me feel relieved that I never have to go back.\nI also sat here asking myself how original is this Netflix Original as I swear I have seen some of this on a Lifetime movie.\nAfter watching my opinion is it really was not something I wouod ever pick out to watch. Yet, I feel that this original could do some good for those in high school classroom to watch.\nWhich makes me think… if a school made 1 day or week about the effects one can cause another as well as having the teens watch 13 reasons why would or could it change the high school itself?\nSchools are always saying they are anti-bullying but how true is it? I know when I was in school it was a slap on the wrist and nothing ever changed.\nIt has been 7 years since I walked those halls. I am now a mother of two beautiful children. My concern is what they will go threw. Will bullying be worst or getting better? Is it worth sending my kids to school or homeschooling them? Would I be able to catch the signs that they are the bully or being bullied? Or even worst that they are wanting to end their life?!?!?\nThe pain of even thinking something could ever happen to your child is hard. I could not even imagine it actually happening.\nSo anyways, if you have a teen and you want to open their eyes of what reality can be from their actions or others around them this is a must watch! I know I may use this as tool for my children when they get older.", "external_links": [], "highlightTitle": "", "uuid": "70562403ed7569c35d015849870d574e96003362", "highlightText": "", "rating": null}]