[{"entities": {"persons": [{"sentiment": "none", "name": "dake kang"}, {"sentiment": "none", "name": "steve stephens"}, {"sentiment": "none", "name": "stephens"}, {"sentiment": "none", "name": "delano massey"}, {"sentiment": "none", "name": "cynthia coley"}, {"sentiment": "none", "name": "mark gillespie"}, {"sentiment": "none", "name": "robert godwin sr."}, {"sentiment": "none", "name": "alexis lee"}, {"sentiment": "none", "name": "john seewer"}, {"sentiment": "none", "name": "lee"}, {"sentiment": "none", "name": "williams"}, {"sentiment": "none", "name": "godwin"}, {"sentiment": "none", "name": "steve"}, {"sentiment": "none", "name": "joy lane"}, {"sentiment": "none", "name": "justin osofsky"}, {"sentiment": "none", "name": "stephen"}], "organizations": [{"sentiment": "none", "name": "facebook"}, {"sentiment": "none", "name": "cbs"}, {"sentiment": "none", "name": "associated press"}], "locations": [{"sentiment": "none", "name": "cleveland"}, {"sentiment": "none", "name": "erie"}, {"sentiment": "none", "name": "toledo"}, {"sentiment": "none", "name": "cleveland"}, {"sentiment": "none", "name": "philadelphia"}, {"sentiment": "none", "name": "pennsylvania"}]}, "text": "Videos show desperation of suspect in Facebook video killing April 17, 2017 - 10:45pm \nCLEVELAND — The suspect in the random killing of a retiree posted on Facebook made his living mentoring teens in Cleveland, but his life appeared to be unraveling under the weight of gambling debts and trouble with his girlfriend. \nRambling videos he shared showed his despair, saying he was out of options and wanted to kill as many innocent people as he could. \nWhile authorities have not found any evidence that he killed anyone else, the manhunt for Steve Stephens stretched into a third day on Tuesday and far beyond the neighbourhood where police said he shot a 74-year-old man who was picking up aluminum cans on Sunday after spending Easter with some of his children. \nStephens, 37, could be anywhere, authorities said, calling it a nationwide search. A $50,000 reward is being offered for information leading to his capture and prosecution. \nStephens posted a video of himself killing Robert Godwin Sr., a former foundry worker who had 10 children, police said. In it, he said, \"I snapped, I just snapped.\" But police would not speculate on what was behind it. \n\"Only Steve knows that,\" Williams said. \nIn the video, Stephens told Godwin a woman's name and said, \"She's the reason that this is about to happen to you.\" Godwin did not seem to recognize the name. \nThe woman Stephens spoke of, Joy Lane, said in a text message to CBS that \"we had been in a relationship for several years. I am sorry that all of this has happened.\" \nShe also said Stephens was \"a nice guy\" who was good to her and her children. \nStephens filed for bankruptcy two years ago despite holding down a job as a counsellor helping young people develop job skills and find employment. The behavioural health agency where he worked said an extensive background check before he was hired turned up nothing worrisome. \nIn one video posted on Facebook, Stephens said that he gambled away everything and that he and his girlfriend had planned to marry but did not, without saying why. He blamed her for what was about to happen. \nSome friends said they knew about his gambling. But the videos showed a man they did not recognize. \nAlexis Lee, who saw Stephens last week, said his childhood friend always seemed respectful and got along with everybody. \n\"He never ever told me he had problems or issues. It was always good things,\" Lee said. \"He was always just so happy and cool, calm, collected, like, that's why it's so shocking.\" \nOther neighbours said he was quiet as a kid and intelligent, recalling how he went to college and got a master's degree. \n\"He was just a no problem person at all, compared to a lot of people,\" said Cynthia Coley, a former neighbour . \nIn one video in which he blamed his girlfriend, Stephens said he woke up last week and \"couldn't take it anymore.\" \nInvestigators said that Godwin was the only victim so far linked to Stephens, despite his claim on Facebook that he killed over a dozen people. \nOn Monday evening, Facebook announced that it was launching a review for reporting harmful content following the killing. The company said that Stephens posted a video of himself announcing his intent to commit murder, then two minutes later posted another video of himself shooting and killing Godwin. A few minutes after that, he went live and confessed. \nThe company said it disabled Stephen's account within 23 minutes of receiving the first report about the video of the fatal shooting and two hours after receiving any report. \n\"In this case we did not receive a report about the first video, and we only received a report about the second video — containing the shooting — more than an hour and 45 minutes after it was posted,\" said Justin Osofsky, Facebook's vice-president of global operations. \"We received reports about the third video, containing the man's live confession, only after it had ended.\" \nOfficers searched dozens of places around Cleveland without finding Stephens or any other victims before expanding the manhunt. Detectives spoke with the suspect on Sunday by cellphone and tried to persuade him to surrender, police said. \nLaw enforcement officials said his cellphone was last tracked Sunday afternoon in Erie, Pennsylvania, about 100 miles (160 kilometres ) east of Cleveland. Police in Philadelphia said eight elementary schools and a high school were locked down Monday while they investigated reported sightings but found nothing. \n___ \nAssociated Press reporters Dake Kang and Delano Massey in Cleveland and John Seewer in Toledo contributed to this report. \nMark Gillespie,  ", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "70988667a03c1f828300a100f024face2ec26e23", "rating": null, "highlightTitle": "", "title": "Videos show desperation of suspect in Facebook video killing", "thread": {"country": "US", "site": "cfjctoday.com", "replies_count": 0, "title_full": "Videos show desperation of suspect in Facebook video killing", "site_categories": [], "performance_score": 0, "section_title": "paNOW - World", "domain_rank": null, "uuid": "70988667a03c1f828300a100f024face2ec26e23", "main_image": "", "site_type": "news", "title": "Videos show desperation of suspect in Facebook video killing", "spam_score": 0.0, "site_section": "http://cfjctoday.com/taxonomy/term/25/feed", "url": "http://omgili.com/ri/0xd.sZhj5jcK7wzmpg.m31Nsa_peRm63EYXzdpxNhRmRmy.W8OIBeUMtMlsy.DZKvQ_R9HCETA2rNcftYb9WPZxPalZsFVuT0rsajbL.uEbkC9x92vg9rTtAWAFSsny1", "participants_count": 1, "site_full": "cfjctoday.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:25:02.000+03:00"}, "crawled": "2017-04-18T11:25:02.000+03:00", "url": "http://omgili.com/ri/0xd.sZhj5jcK7wzmpg.m31Nsa_peRm63EYXzdpxNhRmRmy.W8OIBeUMtMlsy.DZKvQ_R9HCETA2rNcftYb9WPZxPalZsFVuT0rsajbL.uEbkC9x92vg9rTtAWAFSsny1", "highlightText": "", "published": "2017-04-18T11:25:02.000+03:00", "author": "The Canadian Press"}]