[{"uuid": "73da66f568f753952babbbf13dd0aff73ce4080a", "url": "http://omgili.com/ri/.wHSUbtEfZRBhehhEp6TO3lE.PJ4DIP3hskERqh42g8RwI7Hl3AfkHXXMzuaHgnm", "title": "Phion Review", "author": "Andrew (Editor)", "rating": null, "published": "2017-04-18T23:24:41.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "phion review diet reviews / supplement manufacturer reviews / phion", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "special trial offer", "sentiment": "none"}, {"name": "apex wellness group", "sentiment": "none"}, {"name": "alkaline minerals", "sentiment": "none"}, {"name": "prebiotic fiber", "sentiment": "none"}], "locations": [{"name": "phion", "sentiment": "none"}], "persons": [{"name": "leptigen", "sentiment": "none"}, {"name": "phion", "sentiment": "none"}, {"name": "phion   leptigen", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "73da66f568f753952babbbf13dd0aff73ce4080a", "url": "http://omgili.com/ri/.wHSUbtEfZRBhehhEp6TO3lE.PJ4DIP3hskERqh42g8RwI7Hl3AfkHXXMzuaHgnm", "site_full": "www.dietspotlight.com", "title": "Phion Review", "site_section": "http://www.dietspotlight.com/feed", "domain_rank": 44738, "published": "2017-04-18T23:24:41.000+03:00", "title_full": "Phion Review", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "Diet Spotlight", "site_type": "blogs", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "", "site": "dietspotlight.com"}, "external_links": [], "language": "english", "text": "Diet Reviews / Supplement Manufacturer Reviews / Phion Review \nWe like when people talk about new companies such as Phion. So, we scoured for information about the side effects, clinical research, and ingredients. Additionally, we also read hundreds of comments to get their side of the story. In the end, we collected the facts to give you the bottom line. Phion Readers:   Leptigen. What is Phion? \nTo begin, Phion is supplement manufacturer. The ingredients commonly used include calcium, magnesium, potassium, phosphorous, elder flower extract, linden flower extract, and other herbs, vitamins, and minerals. Some of their products include Prebiotic Fiber, Alkaline Minerals, Probiotic Blend, pH Test Strips, Ionic Colon Cleanse, among others. The fact that they provide such a wide variety of supplements is impressive. \nPhion is owned by Apex Wellness Group, LLC. Unfortunately, we did not find any info surrounding the company. However, we do know that the Phion website was created in 2008. Their supplements contain many natural components and are offered at a competitive price, but read on… Ions and pH? Can these really help you lose more weight? Phion Doesn’t Work – “Why Aren’t They Effective?” \nThe first thing we have noticed about Phion was the reports of ineffectiveness across some reviews. “When people pay money for a product, they expect it to work,” said our Research Editor. “If this is the case with Phion, then customers will quickly go to another supplement.” \n“Product did not perform at all … it didn’t work when testing urine … nor did it work when testing saliva.” \n“Didn’t notice anything special, but I did lose a few pounds,” commented a customer. \nSome users didn’t have the same experience, though. \n“They are working perfectly for me,” stated a user. \n“They worked very well for what I needed them for,” reported another. Scroll   Poor Taste – “Is The Flavor Bad?” \nThe second issue we found with Phion was the taste of some products. Many reviewers found this problem with their Alkaline Drops. \nOne customer wrote, “The taste of the water was so terrible that it was not even drinkable.” \n“The taste was overbearing,” another agreed. \nHowever, others didn’t seem to mind the taste at all. \n“It does SLIGHTLY change how the water tastes (ALL P.H. changing does) but this is MUCH less noticeable than what I was using,” one review said. \nAnother user testimonial said, “Keep in mind that the drops change the taste of the water but it’s very bearable, and after a short while you get used to it.” \nAfter years of researching supplements, we have found that it can take something tiny to slash the chance of long-term results. If Phion is not efficient and has poor taste, that could be a real issue for the company. The Science – “Where Is the Research?” \nPhion products contain a broad range of natural vitamins and minerals. There is a lot of research supporting the health benefits supplementing the diet with this. However, taking a multivitamin can have the same effects and is a cheaper alternative. Unfortunately, there just isn’t enough evidence available that shows Phion is a better alternative to a simple multivitamin.   Phion Work? \nAre we sold on Phion? Well, we like that the supplements contain natural ingredients and can be used for several different issues. However, we have some issues concerning the taste and effectiveness. For these reasons, we have some reservations about supporting the products. \nIf you want to lose that irritating extra weight, we suggest something that will work with the backing of science and measurable results. \n  we’ve seen this year is Leptigen . The formula contains a blend of four ingredients that have been clinically researched and shown to help increase metabolism and reduce hunger. \nThe company is now offering a Special Trial Offer to all new customers, which is a great deal. Get Your Sample Today   Ions and pH? Can these really help you lose more weight?  ", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:41.000+03:00"}]