[{"entities": {"organizations": [{"name": "dreamworks", "sentiment": "none"}, {"name": "secret life of pets", "sentiment": "none"}, {"name": "baby co", "sentiment": "none"}], "locations": [{"name": "boss baby", "sentiment": "none"}, {"name": "the boss baby", "sentiment": "none"}], "persons": [{"name": "alec baldwin", "sentiment": "none"}, {"name": "toby macguire", "sentiment": "none"}, {"name": "baldwin", "sentiment": "none"}]}, "uuid": "742b4a0a2aabbed4eccffd26335dee9a70deba73", "highlightText": "", "title": "The Boss Baby", "thread": {"site": "blogspot.com", "country": "US", "participants_count": 1, "site_full": "mattflix.blogspot.com", "section_title": "MattFlix", "uuid": "742b4a0a2aabbed4eccffd26335dee9a70deba73", "site_section": "http://mattflix.blogspot.com/", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T23:54:01.000+03:00", "url": "http://omgili.com/ri/2wGaacqxApu5MJk63DFKkmOMamGlU.DlLlPYPdAUY6TvUgZK5J._76rcqwt47z4.ce0lAewb8mc-", "title_full": "The Boss Baby", "title": "The Boss Baby", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T23:54:01.000+03:00", "url": "http://omgili.com/ri/2wGaacqxApu5MJk63DFKkmOMamGlU.DlLlPYPdAUY6TvUgZK5J._76rcqwt47z4.ce0lAewb8mc-", "ord_in_thread": 0, "crawled": "2017-04-16T23:54:01.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Matt Walker (noreply@blogger.com)", "text": "A lot of critics that I've talked to or read reviews from, hated the Boss Baby right from the get go, from minute one of the first trailer, and I really don't understand why. This concept sounds fucking great. Alec Baldwin as a middle management type talking baby in a suit? Fucking brilliant.\n\nThe Boss Baby is the newest animation from the people at DreamWorks and stars Toby Macguire and Alec Baldwin as a baby boss who's sent to this family who work for their competitors, a company who sells puppies. The baby is tasked with gaining intel on the puppy companies latest project as Baby Co are worried that all the love for babies is being stolen by puppies. \n\nNow this is one of those movies where the trailer dropped and it went viral online. I think I logged onto Facebook one morning and about fifty of my friends shared it. Now this happened recently with another movie last year which was The Secret Life of Pets. It presents itself as such a genius concept and has a lot of really funny stuff in the trailers. And that's kind of it. Similarly to what happened with The Secret Life of Pets, a lot of the best and funniest moments in The Boss Baby were in the trailer and that's gonna leave a lot of people disappointed. \n\nThere are as well some interesting choices with the style of animation in The Boss Baby too that makes it quite jarring to watch. For instance, as you'd expect from a child the age of the main character, there is a lot of imagination sequences in this film. And what the director and the animators choose to do is make these a completely different style to the rest of the movie. A very 70's anime style. And I guess the first two or three times it's used it works well, right at the beginning of the movie before Alec Baldwin's character arrives, but later on in the movie a lot more crazy stuff happens in the plot and the over use of these imagination sequences kind of left me guessing, is this real? Even at the end there's a reveal about the narrative of this story that makes you kinda question, wait, was any of that real? The line between what's actually happening in the narrative and what's in the mind of the main character is very very thin and gets blurred a lot and it left myself quite confused at some points. I even heard the kid in the row in front of me who was part of the target demographic for this movie (say 8 or 9 years old) turn to his father during the closing act and ask where it was in  the boy's imagination. The cutaway scenes are very confusing.\n\nBut this is a kids movie and no kid is going to be reading into The Boss Baby and analysing it as much as I do and other critics choose to do so I've got to kick this down to basics in order to tell you all about the good things in this movie.\n\nAlec Baldwin is great as the Boss Baby. He's hilarious and Baldwin's voice is just the perfect fit for this character. He's so funny and it's just a terrific piece of casting. Despite what I said earlier about all the really funny bits being in the trailer I still found this to be a really enjoyable time. I was laughing a lot and found myself getting invested in the adventure of this baby and this kid. Children are definitely going to have fun with this movie. Is it a really good animation on par with the likes of Toy Story or Wall-E? No. But of course it was never going to be that good. This is something that I've talked about a lot in my reviews and if I ever get the time I will go into more detail on is audience expectations. If you're going into The Boss Baby wanting an Oscar worthy animation then I'm sorry but you're going to be disappointed. But if you want a no holds barred family friendly movie that anyone of any age can sit down and enjoy as a pure popcorn flick, then you are going to come out of The Boss Baby smiling. \n\nSo guys I had a lot of fun with the Boss Baby. A flawed but solid family film with a great premise that is just never quite fully realised but nevertheless I'm going to give The Boss Baby a big fat....\n\nC."}]