[{"entities": {"organizations": [], "locations": [{"name": "usa", "sentiment": "none"}], "persons": [{"name": "sara ney", "sentiment": "none"}, {"name": "abigail darlington", "sentiment": "none"}, {"name": "abigail", "sentiment": "none"}, {"name": "ney", "sentiment": "none"}, {"name": "jenna", "sentiment": "none"}, {"name": "molly", "sentiment": "none"}, {"name": "abby", "sentiment": "none"}, {"name": "weston mcgrath", "sentiment": "none"}, {"name": "caleb lockhart", "sentiment": "none"}, {"name": "matthew wakefield", "sentiment": "none"}, {"name": "molly wakefield", "sentiment": "none"}, {"name": "buxom j   about sara ney sara ney", "sentiment": "none"}, {"name": "weston", "sentiment": "none"}, {"name": "caleb", "sentiment": "none"}, {"name": "cecelia carter", "sentiment": "none"}]}, "uuid": "748abebdb7d19efad991a7b2701a6f73a73a6872", "highlightText": "", "title": "Release Blitz: Kiss and Make-Up Series - Sara Ney", "thread": {"site": "blogspot.com", "country": "US", "participants_count": 1, "site_full": "pervyladiesbooks.blogspot.com", "section_title": "Pervy Ladies Book Blog", "uuid": "748abebdb7d19efad991a7b2701a6f73a73a6872", "site_section": "http://pervyladiesbooks.blogspot.com/", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T21:00:00.000+03:00", "url": "http://omgili.com/ri/8HG_hanVOKz1MSJXYxhv.nTWYySNotCYWE6yZAeFgt0gNEmDSKmpA9pSWkf8pd3oMqpCIsAofm3YluH9RPKf2RTexQtSAAkXtNdfe6ZzBtPuUhY7Gk1ZyQ--", "title_full": "Release Blitz: Kiss and Make-Up Series - Sara Ney", "title": "Release Blitz: Kiss and Make-Up Series - Sara Ney", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T21:00:00.000+03:00", "url": "http://omgili.com/ri/8HG_hanVOKz1MSJXYxhv.nTWYySNotCYWE6yZAeFgt0gNEmDSKmpA9pSWkf8pd3oMqpCIsAofm3YluH9RPKf2RTexQtSAAkXtNdfe6ZzBtPuUhY7Gk1ZyQ--", "ord_in_thread": 0, "crawled": "2017-04-16T23:00:34.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Pervy Ladies Book Blog (noreply@blogger.com)", "text": "  About KISSING IN CARS (Kiss and Make Up, Book 1) This novel, along with all others in this series, is a standalone with no cliffhanger. You're welcome. WILL SHE, OR WON'T SHE... Studious and (mostly) sensible, the only thing Molly Wakefield wants to do is get through Senior Year and graduate. Well, that and hit the beach in her spare time. Okay, fine - and go shopping every once in a while for a new dress... (and who could blame her?) And things are going according to plan - until the day she spies Weston McGrath, handsome star athlete and scholar, spying on her in study hall. A tad creepy? Maybe. Thrilling? Absolutely. You see, Weston McGrath happens to be one guy no one can get close to. Despite her best efforts to avoid it (because let's face it - the guy isn't exactly \"boyfriend material\") Molly and Weston form a friendship. And more.... Sort of. But it's a friendship that comes with a price - because Weston just cannot seem to stop screwing things up. Or saying all the wrong things. Possibly in that order... And who has time for an 18 year old \"fixer-upper\" that should know better? Not Molly. Or does she? \nNote: This YA book is intended for 17+ due to the vulgar language used by its male characters (and occasionally the females as well, even though they're too lady like to do it throughout the entire book). Some adult sexual situations that steam up a few car windows. This title is approx. 63,000 words. \nRead KISSING IN CARS for free with Kindle Unlimited ! \nAbout HE KISSED ME FIRST (Kiss and Make Up, Book 2) This novel, along with all others in this series, is a standalone with no cliffhanger. You're welcome. HE SAID... “Trust me – If there’s one thing I’m not attracted to, it’s the shrieking, overly-dramatic shrew that’s taken over my sister’s apartment. And what is up with her hair? I know what I want; an easy, uncomplicated lay – and Cecelia Carter sure as shit isn’t one. But I never could resist a challenge, and vow to wipe that condescending grin off her pretty face. Aw, shit. Did I just call her pretty..?” – Matthew Wakefield SHE SAID... \"Trust me - If there's one thing I'm not attracted to, it's an arrogant, selfish and foul-mouth hockey player. I know what I want; someone who’s good for my body and soul and makes me laugh - and Matthew Wakefield isn't any of those things. I cannot stand the sight of him; I mean, what a jackass. If I refuse to give him anything but sass and sarcasm, it's only because he deserves it…” - Cecelia Carter \nNote:  This book is intended for those 17 and older. If you're offended by cursing (particularly \"F\" bombs), sarcasm, sexual situations and Alpha Male jackasses - this book is not for you... \nRead HE KISSED ME FIRST for free with Kindle Unlimited ! About A KISS LIKE THIS (Kiss and Make Up, Book 3) This novel, along with all others in this series, is a standalone with no cliffhanger. You're welcome. ABIGAIL DARLINGTON IS AWKWARD… She will never be “that” girl. You know the one: that girl on campus, confident in her own skin. Always saying the right things. Putting herself out there. Knows how to talk to a guy without stammering. Nope. Shy but clever, and easily embarrassed, Abby is fine being the wallflower in her circle of outgoing, beautiful friends; she would rather read about a sexy book boyfriend than actually have a live, breathing one. …BUT CALEB LOCKHART IS WORSE. Star goaltender for the University’s hockey team, Caleb is quiet and broody, preferring the solitude of his orderly, regimented life. He doesn’t like, or need people—and plans to keep it that way. One more year left of hockey and he’ll be long gone. AWKWARD NEVER LOOKED SO GOOD. Both their lives change the day that Abigail falls for Caleb. Well, falls directly on top of him, to be accurate. Because sometimes we don’t settle into love. We fall there. \nNote: This book contains cursing, and LOTS of it. It also has sex, uncomfortable and often awkward situations. Not to mention, the secondary characters say some really inappropriate s**t. Not intended for readers under 17 \nRead A KISS LIKE THIS for free with Kindle Unlimited ! \nReview: \nWhat happens when you take two socially awkward characters and throw them together?  An adorably cute and sweet romance—this is exactly what I got from A Kiss Like This.  Abby is the wallflower of her group.  Shy and quiet, she prefers staying in to going out.  But don’t let her silence fool you, she’s clever and can come up with a witty comeback when the need calls for it.  On a rare occasion that her friends drag her out, she falls into the arms of hockey star Caleb.  Like…literally falls into his arms.  Caleb is big, broody and quiet.  Their awkward courtship was at times hilarious, frustrating but most of all adorable.  It definitely left a smile on my face. \nI will say that I had a hard time equating them with college students.  Their behavior brought back memories of high school and first crushes.  I get being painfully awkward and shy but they were almost too hesitant.  My only other pet peeve is that I saw the drama coming from a mile away and it was a little over-the-top.  Other than that, the characters were decently developed.  The secondary characters added additional depth to the story.  Jenna was particularly hilarious, I love a sarcastic character.  This can definitely be read as a standalone.  I haven’t read the other two books in the series and I don’t think I will.  I prefer Ney’s other series. \nIf you like awkward characters that leave a smile on your face, definitely take a look at this one.   -Peace and Love, Buxom J   About Sara Ney Sara Ney is the USA Today Bestselling Author of the How to Date a Douchebag series, and is best known for her sexy, laugh-out-loud New Adult romances. Among her favorite vices, she includes: iced latte's, historical architecture and well-placed sarcasm. She lives colorfully, collects vintage books, art, loves flea markets, and fancies herself British. She lives with her husband, children, and her ridiculously large dog. \nFacebook | Twitter | Instagram "}]