[{"entities": {"organizations": [{"name": "centro escolar university-manila", "sentiment": "none"}, {"name": "the vegan life magazine", "sentiment": "none"}, {"name": "manila vegans facebook", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "peta", "sentiment": "none"}, {"name": "mercy for animals", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "technomic", "sentiment": "none"}, {"name": "vegan society", "sentiment": "none"}, {"name": "gen x’ers", "sentiment": "none"}], "locations": [{"name": "quorn philippines", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "juicesabel", "sentiment": "none"}], "persons": [{"name": "yvonne", "sentiment": "none"}, {"name": "elpidio mijares jugalbot iii", "sentiment": "none"}, {"name": "m. lagon", "sentiment": "none"}, {"name": "patricia", "sentiment": "none"}, {"name": "enrica nicole martina", "sentiment": "none"}, {"name": "yvonne liboro", "sentiment": "none"}, {"name": "wayde", "sentiment": "none"}, {"name": "erin janus", "sentiment": "none"}, {"name": "patricia b. castillo", "sentiment": "none"}, {"name": "yeye", "sentiment": "none"}, {"name": "clem", "sentiment": "none"}, {"name": "wayne", "sentiment": "none"}, {"name": "bev", "sentiment": "none"}, {"name": "kevin brennan", "sentiment": "none"}, {"name": "bev caluma", "sentiment": "none"}, {"name": "wayde nash", "sentiment": "none"}, {"name": "yeye baron", "sentiment": "none"}, {"name": "elpidio", "sentiment": "none"}, {"name": "said clem", "sentiment": "none"}]}, "uuid": "763f58333b01d577e608e689fe65d8a3eaabf030", "highlightText": "", "title": "Re: Millennials develop taste for meatless diet", "thread": {"site": "inquirer.net", "country": "US", "participants_count": 1, "site_full": "newsinfo.inquirer.net", "section_title": "Inquirer News - Latest Comments", "uuid": "763f58333b01d577e608e689fe65d8a3eaabf030", "site_section": "https://inq-newsinfo.disqus.com/comments.rss", "domain_rank": 813, "main_image": "http://newsinfo.inquirer.net/files/2017/04/Millennials-0417.jpg", "performance_score": 3, "published": "2017-04-16T22:51:44.000+03:00", "url": "http://omgili.com/ri/snFTpiOKdJXe_FwmsTkrzzzFX7JG9Bt.RarcA8QEV690M4VBnM6WHlyTHraRhrLmLT_A1_QH0gAuByY0Qim7wZJRH_d.2qSQm8RkJfDE5NY-", "title_full": "Re: Millennials develop taste for meatless diet", "title": "Re: Millennials develop taste for meatless diet", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 334, "shares": 334, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 2}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T22:51:44.000+03:00", "url": "http://omgili.com/ri/snFTpiOKdJXe_FwmsTkrzzzFX7JG9Bt.RarcA8QEV690M4VBnM6WHlyTHraRhrLmLT_A1_QH0gAuByY0Qim7wZJRH_d.2qSQm8RkJfDE5NY-", "ord_in_thread": 0, "crawled": "2017-04-16T22:51:44.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "UGOKTERTE RUDE RIGO😈", "text": "Philippine Daily Inquirer / 01:10 AM April 17, 2017 \nDo any of these dishes sound familiar? Mock meat made of shiitake mushrooms; fish meat from seaweed and soy; cheese and mayonnaise made of cashew, and ice cream made of coconut milk. \nIf you have yet to encounter them in your meals, better prepare your palates for the coming wave of meatless diets. And take note, it’s not a seasonal thing—like fasting for Lent. This one’s for keeps, and it’s the millennials who are serving them up. \nSeveral surveys, including those from the Chicago-based food research firm Technomic, The Vegan Life Magazine and the Vegan Society, showed that millennials—people born between the 1980s and 2000s—are increasingly going meatless. ADVERTISEMENT \nHere in the Philippines, the trend is no different. \nBev Caluma, 22, an English teacher, FX trader and mountaineer started dropping meat from her diet in 2012. In July last year, she adopted a vegan diet and lifestyle devoid of animal products, such as leather clothes, shoes and accessories. Bev said the switch would hopefully “improve [her] health and athletic performance, and minimize [her] impact on the environment.” A kinder life \nYeye Baron, 20, a senior journalism major from Centro Escolar University-Manila, has been vegetarian for over a year. A video by the People for the Ethical Treatment of Animals (Peta) made her “realize the value of embracing a kinder life.” Becoming vegan is her next goal, Yeye said, “because I can’t stand any form of animal atrocity. And I want to do something for our environment.” \nAustralian ultramarathoner Wayde Nash, 34, who has been living in Vietnam as an English teacher and “house husband,” began his vegetarian journey at 15. He then went vegan. “I don’t need animal products to be strong and healthy, so why should animals suffer for something that is unnecessary?” he asked. \nYvonne Liboro, 23, decided to go vegan last year after watching Erin Janus’ documentary “Dairy is F**king Scary.” \nVegan restaurant owner Elpidio Mijares Jugalbot III, 26, was reviewing for the nursing licensure exam in 2011 when he shunned all types of meat, eggs and dairy, and increased his fruit and vegetable consumption. He wanted to prove his theory that this would “improve [his] blood circulation, especially toward the brain,” and help him think better during the board exam. After passing it, he watched the documentary “The Earthlings” and decided to go vegan. \nPatricia B. Castillo, 28, recounted how she became a vegetarian in 2012. When she hugged her dog whom she had rescued after it was almost killed by a neighbor, she saw fear in its eyes. “That’s when I realized how animals fear death as much as humans do,” she said. Vegan online groups \nA vegan since April 2014, Enrica Nicole Martina “Clem” M. Lagon, 22, was a pescetarian for two years when she was accepted as an intern at Peta on her third year in college. It was during her internship that she felt encouraged to follow a vegan lifestyle. ADVERTISEMENT \nBev, Yeye, Wayde, Yvonne, Elpidio, Patricia and Clem are all members of the Manila Vegans Facebook group, one of the biggest Manila-based online vegan communities, with over 11,000 members. The Facebook group helps spread the word about accessible, sustainable, cruelty-free and compassionate living, and comes up with creative recipes as well. \nMeat substitute provider Quorn Philippines has been closely monitoring the slow but steady rise of this meat-free society. “Younger, more educated consumers are seeing the need to reduce meat consumption for health and sustainability reasons. While we have just launched in the Philippines, strong early sales reinforce evidence of this trend,” said Quorn CEO Kevin Brennan during his March 29 visit to the Philippines. British brand Quorn—now owned by food giant Monde Nissin—produces meat-free proteins recently introduced in the country. \nVegetarian millennials now number more than vegetarian members of any previous generation, according to Mercy for Animals organization. The New York Times wrote that “an estimated 12 percent of millennials say they are ‘faithful vegetarians,’ compared with 4 percent of Gen X’ers and 1 percent of baby boomers.” Running as tool \nApart from “a bit of mocking from mates with fragile masculinity tied to meat consumption,” Wayne said he had no real issue to resolve. “I use my running as a tool to advocate going vegan. If I can run an ultramarathon without meat, then clearly it’s not essential,” he said. \nElpidio said that “The Earthlings” awakened his animal-loving nature. “I also learned that animal agriculture is the number one culprit in global warming or climate change. As a Christian, I even consulted the Bible and it affirms that it is prudent to go vegan as it entails mercy and compassion not only to one’s self, but also to others. It made me realize that I could live my life without harming other living beings,” he explained. \nSaid Clem: “It’s actually easy to have a vegan lifestyle if you have the right kind of attitude. Sometimes you have limited options when you eat out but … you can always bring your own food or get delivery from Juicesabel, Greenery Kitchen, etc.” \nThe author has been vegetarian for 17 years, and vegan for 2."}]