[{"entities": {"persons": [{"sentiment": "none", "name": "bellaween"}], "organizations": [{"sentiment": "negative", "name": "apple"}, {"sentiment": "none", "name": "factory reset slide"}], "locations": [{"sentiment": "none", "name": "england"}]}, "text": "How to Reset iPhone without Apple ID 0 Flag Flag as Inappropriate \nPlease select the category that most closely reflects your concern about the presentation, so that we can review it and determine whether it violates our Terms of Use or isn't appropriate for all viewers. Submit Embed this comment into your blog: Comment URL: How to Reset iPhone without Apple ID？ From: http://www.leawo.org/tutorial/how-to-reset-iphone-without-apple-id.html Slide 2 “Hey..I bought this iphone 5 from some one in England … I wanted to reset the iphone back to factory setting but know its asking me for the apple ID and password and i dont knw … Is there any possible way to do factory setting and use iphone 5 normal ??? Helpfull answer will be appreciated thank you…” You may just buy a second hand iPhone like the questioner and you want to reset the iPhone. But you are asked for the Apple ID and passcode of previous owner that you don’t know. Or you haven’t used your Apple account and password for a while and forgot your Apple ID and passcode. There will be many cases that you need to reset iPhone without Apple ID. How to do that? This post will show you how to reset iPhone without Apple ID. All iPhone models, like iPhone SE/6s/6/5s/5/4s/4. are included. Before reseting iPhone, one more thing that you need to keep in mind is that you are not available to back up your iPhone data on iTunes and iCloud if you have no Apple ID and password. The instructed reset may delete all your necessary data. Please do carefully at your own risk. Therefore, if you lose some data after reseting iPhone without Apple ID and you have no iTunes/iCloud backup, you may need the third-party software to help you recover them. Part 1. How to Reset iPhone without Apple ID When Find My iPhone is off Part 2. How to Recover Lost Data from iPhone after Factory Reset Slide 3 Part 1. How to Reset iPhone without Apple ID When Find My iPhone is off Generally speaking, you need the Apple ID to reset your iPhone. iPhone needs you to enter the Apple ID to switch off your account and the Find My iPhone service will be turn off. If you are using iTunes to reset your iPhone, you need to enter the Apple ID when your iPhone reboots. Slide 4 But if you have no Apple ID or passcode, you will have to reset your iPhone without Apple ID. To reset iPhone without Apple ID, you need first ensure that the Find My iPhone option has been off on this iPhone and you could put iPhone into DFU mode, then connect it to your iTunes. Your iTunes will help you to reset your iPhone without entering Apple ID easily. Reseting your iPhone with this method will result in wiping all the data in your iPhone. The following steps will show you how to do that. Step 1: Open iTunes on your computer and connect your iPhone to the computer with a USB cable. Step 2: After that, turn off you device. Press and hold the Home button for 3 seconds. Step 3: Put your iPhone into DFU mode: Press and hold the Power and Home button for 10 seconds. Then release the power button and keep holding the home button. When you see the Apple logo disappears, you have successfully put your iPhone into DFU mode. Slide 5 Step 4: When iTunes detects that your iPhone is in recovery mode, you can restore it now. Step 5: Click on Restore iPhone. Then you will be notified after the reset and your iPhone will take a restart. After resetting your iPhone with the guidance mentioned above, you’d better create a new Apple ID and password in time. After resetting iPhone, you will get all the data swept from iPhone, and you can restore the files from your iPhone, iTunes backup or iCloud backup. However, you can’t backup iPhone to iTunes/iCloud without Apple ID before you reset your iPhone . In this case, you need the third-party iOS data recovery software to help you recover lost data from iPhone after factory reset without Apple ID. Slide 6 Part 2. How to Recover Lost Data from iPhone after Factory Reset Among all iOS data recovery programs, Leawo iOS Data Recovery has an outstanding performance. This software enables you to recover files from iTunes/iCloud backups or iOS devices, and you will be able to recover 12 kinds of files from iTunes/iCloud backups, which include the most important data on your iPhone. What’s more, you can preview the files before recover them to iPhone so that you can recover selected files to your devices. Click the guidance below to see how to recover lost data from iPhone after factory reset with the iPhone data recovery. Slide 7 1 . Connect iPhone to computer with the USB cable, and then run Leawo iOS Data Recovery. The software will recognize your iPhone, click the “Start” button in the middle of the window, and the software will start analyzing your iPhone. Slide 8 2. After analyzing your iPhone, this iPhone data recovery software will begin to scan your iPhone. The categories will show up in the left sidebar, and the names of them will turn white during the scan if any contents are in the categories. Choose a category and then the contents will display in the right part. Check the files you want to recover and then click the “Recover” button at the right bottom of the window. Slide 9 3. The dialog will pop up. Click “Open” in the dialog to choose a target folder to save the recovered files, and then click “Go” to start recovering lost data from from iPhone. Slide 10 After the recovery, the files will show up in the target folder. Although using third party iPhone data recovery software is not as convenient as using iTunes, it enables users to preview and choose the contents they want to recover, and that will avoid troubles after the recovery. Moreover, if you have no any iTunes/iCloud backup before you delete files, the iPhone data recovery software will be quite helpful on this issue. Slide 11 For more details, welcome to visit: http://www.leawo.org/tutorial/how-to-reset-iphone-without-apple-id.html Related Posts: Three Methods to Restore iPhone After Factory Reset How to Reset Password on iPhone iPhone Stuck on Apple Logo? How to Fix It iPhone Keeps Asking for Apple ID Password, How to Fix \nby Bellaween | Modified: 11 minutes ago \nLanguage: English | Topic: Science & Hi-Tech Summary: This PPT provides details about \"How to Reset iPhone without Apple ID\".", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "76cfcd1ceddb77768d6e18f567b9db21666cb1a2", "rating": null, "highlightTitle": "", "title": "How to Reset iPhone without Apple ID", "thread": {"country": "US", "site": "slideboom.com", "replies_count": 0, "title_full": "How to Reset iPhone without Apple ID", "site_categories": [], "performance_score": 0, "section_title": "Latest Presentations", "domain_rank": 14826, "uuid": "76cfcd1ceddb77768d6e18f567b9db21666cb1a2", "main_image": "", "site_type": "blogs", "title": "How to Reset iPhone without Apple ID", "spam_score": 0.0, "site_section": "http://www.slideboom.com/rss/latest_presentations.xml", "url": "http://omgili.com/ri/jHIAmI4hxg9YzcRC9uJoIph4LNQkMW6e75FqEy9fKBeNnYQPSg2iqpg6TVGCigPZ", "participants_count": 1, "site_full": "www.slideboom.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:26:21.000+03:00"}, "crawled": "2017-04-18T11:26:21.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9YzcRC9uJoIph4LNQkMW6e75FqEy9fKBeNnYQPSg2iqpg6TVGCigPZ", "highlightText": "", "published": "2017-04-18T11:26:21.000+03:00", "author": "Bellaween"}]