[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:25:53.000+03:00", "author": "Judy Sebastian", "entities": {"persons": [{"name": "judy", "sentiment": "none"}, {"name": "judy sebastian judy sebastian", "sentiment": "none"}], "locations": [{"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "apex food consultants", "sentiment": "none"}, {"name": "gcc", "sentiment": "none"}, {"name": "food quality & safety", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "holiday retirement group", "sentiment": "none"}]}, "text": "Trends in Food Safety Training April 15, 2017 Print-Friendly Version \nThere is a pleasant turbulence in the field of learning and development for food safety and quality professionals and there’s a reason why I’d like to describe it as enjoyable—adult learning programs are seeing exponential enrollment numbers now more than ever before. You Might Also Like \nRemote “teaching and learning” is making it easier to not only add new skills to the existing talent pool but to pave the way for a bigger and better workforce. \nBelow are some noteworthy trends in the realm of food safety and quality training. \nFrom a Book to a Bite The traditional class room learning environment is transforming into a platform for exchanging ideas rather than the typical teacher-student dynamic. Bite-sized learning via on the job demonstrations, participating in webinars as a cadence program, and engaging in frequent team development meetings are changing the way us professionals learn. \nWalking the Talk Two-week programs are being condensed to one week and week-long training courses are being packed into a few days, where and when possible. \nIt has been established that the adult attention retention period has reduced over the past decade, not because of our inability to learn but because of our increased ability to multitask in the digital age. That being said, changes are being made to the traditional learning environment. Candidate assessments are considering more onsite evaluations than classroom-based reviews as the real measure of training efficiency. \nLearning Too is Now Social Social media platforms have and still continue to take the world by storm. Teaching and continued professional development tools have embraced this change as well. Mobile compatible applications make it easier for “learning-on-the-go” programs and more participants are beginning to interact with one another nationally and internationally. Real-time problems are seeing real-time solutions through web forums and social media networks. \nA few of my favorite modes of social learning include interactive webinars , Twitter chats, Facebook polls, and online gamification tools. \nBlending with Blended Learning Blended learning models, as the name suggests, amalgamates both traditional instruction delivery and web-based learning. This is of great advantage to most food safety and quality professionals as it takes into account varying schedules and levels of experience. \nFor example, food traceability systems are merging with technology and software. This in turn has seen a progression from paper-based reporting to digital time stamps on multiple mobile phones in real time. \nIf we are building tools to solve the problems of both the present and the future, we ought to ensure our learning and development channels are up to speed as well.", "url": "http://omgili.com/ri/jHIAmI4hxg.A4RT_GnMtOd.vR2_yOEbj8aMHPvq3SLqiT.SZHb.amz2znLmeRxnmK.Efd1L57PDJVgOu_PAvGEZOECGTtG_US0RITOhAL.8-", "highlightText": "", "highlightTitle": "", "published": "2017-04-15T18:30:00.000+03:00", "language": "english", "title": "Trends in Food Safety Training", "thread": {"title_full": "Trends in Food Safety Training", "site_full": "www.foodqualityandsafety.com", "site": "foodqualityandsafety.com", "site_section": "http://www.foodqualityandsafety.com/feed", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "news", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Food Quality & Safety", "url": "http://omgili.com/ri/jHIAmI4hxg.A4RT_GnMtOd.vR2_yOEbj8aMHPvq3SLqiT.SZHb.amz2znLmeRxnmK.Efd1L57PDJVgOu_PAvGEZOECGTtG_US0RITOhAL.8-", "published": "2017-04-15T18:30:00.000+03:00", "title": "Trends in Food Safety Training", "uuid": "79017144ab0083914406355c4080f60a755d5341", "main_image": "http://www.foodqualityandsafety.com/wp-content/uploads/2017/04/Blog02_0417.jpg"}, "uuid": "79017144ab0083914406355c4080f60a755d5341", "ord_in_thread": 0}]