[{"entities": {"locations": [{"name": "tampa", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "tropicana field", "sentiment": "none"}, {"name": "st. petersburg", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "harlem", "sentiment": "none"}, {"name": "hillsborough county", "sentiment": "none"}, {"name": "niagara falls", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "tampa bay", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "ebbets field", "sentiment": "none"}], "organizations": [{"name": "brooklyn dodgers", "sentiment": "none"}, {"name": "howard university", "sentiment": "none"}, {"name": "dodgers", "sentiment": "none"}, {"name": "days ago rickie weeks", "sentiment": "none"}, {"name": "luray caverns", "sentiment": "none"}, {"name": "st. joseph's children's choir", "sentiment": "none"}, {"name": "rays", "sentiment": "none"}], "persons": [{"name": "delano s. stewart", "sentiment": "negative"}, {"name": "jackie", "sentiment": "negative"}, {"name": "jackie robinson", "sentiment": "negative"}, {"name": "b.k. jackson", "sentiment": "none"}, {"name": "robinson", "sentiment": "none"}, {"name": "kanika tomalin", "sentiment": "none"}, {"name": "dave roberts", "sentiment": "none"}, {"name": "stewart", "sentiment": "none"}, {"name": "martin luther king jr.", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.tampabay.com", "site_section": "http://www.tampabay.com/rss/news/?tags=sports,baseball,rays", "domain_rank": 10767, "replies_count": 0, "country": "US", "section_title": "TampaBay.com: Florida's Largest Newspaper", "title": "Jackie Robinson's example proved a beacon for pioneering Tampa attorney", "title_full": "Jackie Robinson's example proved a beacon for pioneering Tampa attorney | Tampa Bay Times", "published": "2017-04-18T21:50:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8YAe44rd418HrKSOD8NNSPmU9NAWib53GEOpiCMJS_eOXdqoVfYIGrU9EaMoZPO.Nf50uv8WVN9ed1OlnjNEzBO2VbMrBq00y.O4z18pMteMbjE.Z5_opuWd9OPqu7YAXoHdAgElv63dDfFbBF7mJX70XCre9Y87c-", "site": "tampabay.com", "main_image": "http://www.tampabay.com/resources/images/dti/rendered/2017/04/502942560_19133836_8col.jpg", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "7a5fe6efefef2939f25260ad58895af2565c063a", "site_type": "news"}, "title": "Jackie Robinson's example proved a beacon for pioneering Tampa attorney", "published": "2017-04-18T21:50:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8YAe44rd418HrKSOD8NNSPmU9NAWib53GEOpiCMJS_eOXdqoVfYIGrU9EaMoZPO.Nf50uv8WVN9ed1OlnjNEzBO2VbMrBq00y.O4z18pMteMbjE.Z5_opuWd9OPqu7YAXoHdAgElv63dDfFbBF7mJX70XCre9Y87c-", "author": "Ernest Hooper, Times Columnist/East Hillsborough Bureau Chief", "crawled": "2017-04-19T08:40:06.000+03:00", "language": "english", "text": "As a teen, Delano S. Stewart woke every morning to check the newspaper.\n Jackie Robinson's legacy includes Dodgers manager Dave Roberts\n4 Days Ago\nRickie Weeks reports, says Rays can prove people wrong\n2 Months Ago\n10 Rays that Tampa Bay is depending on for improvement\n1 Month Ago\nHe longed to know how his favorite player fared in the game the night before, but he noted every hit and stolen base recorded by that player as more than statistical footnotes.\nIf Jackie Robinson went 2-for-3 during the late 1940s and 1950s, it did more than help the Brooklyn Dodgers win on the diamond. Stewart says Robinson's success served as a beacon for every black person during that time.\n\"It was the infusion of hope to keep the light of our ideals burning,\" said Stewart, who went on to become one of Tampa's most prominent attorneys. \"When we had so little, every person who was black and who achieved things instilled in you hope.\n\"I never intended to play baseball, but it was a black man excelling in a sport they didn't want him in. That was very inspirational to me.\"\nStewart, who broke multiple barriers during his 50 years of service in the law, will be honored with other community heroes and institutions at Friday night's Rays game when the team celebrates Robinson's legacy on \"Breaking Barriers\" night.\nAlong with St. Petersburg deputy mayor Kanika Tomalin, Stewart, 81, will throw out the ceremonial first pitch.\nBut it won't be the first time Robinson's aura has drawn Stewart to a ballpark.\nIn 1950, Stewart and his family took a summer vacation, visiting Luray Caverns in Virginia and Niagara Falls in New York. On the return trip home, they stopped in Harlem to stay with a relative. Stewart, only 15, took it upon himself to hop a subway train to Brooklyn.\nHe had to see Robinson play at Ebbets Field.\n\"It was a triumphant moment to get on that subway,\" Stewart said. \"I was a Southern boy, but I didn't have enough sense to be frightened. I was propelled by my desire to see him.\n\"Then, I was nervy enough, or foolish enough, to go and talk to him and get his autograph after the game.\"\nStewart said that day and that moment — like the March on Washington, led by Dr. Martin Luther King Jr. that he attended in 1963 — are \"inscribed on the marrow of my bones with arrows and directions.\"\nThose directions served him well in the years to come. After earning his law degree from Howard University, Stewart returned to Tampa to prepare for the bar, but vestiges of racism struck twice.\nA bar review course refused to admit him because he was black, so he sat on a nearby stairwell, in earshot of the class, and took notes on the lecture.\nIn another moment, when he and his four bar studymates, all white, went for coffee, the white server gave him coffee in a foam cup while providing coffee for the others in glasses. For a second, he grew angry at the indignation and thought about throwing the coffee on the server and jumping across the counter. Instead, he turned and exited the diner, preserving his opportunity to become a lawyer.\nRobinson's example of persevering through taunts and indignities were never far from his mind.\n\"He showed me if you've got talent and ability, there are people who are going to try to thwart you, but your strength and ability will hurl you past whatever those obstacles are,\" Stewart said. \"That's what he meant to all of us.\"\nStewart went on to become Hillsborough County's first black public defender, notching one of many firsts during his pioneering legal career. He's looking forward to throwing out the first pitch because, as he notes, thanks to Robinson, we're still in the game.\nThat's all I'm saying.\n. IF YOU GO\n'Breaking Barriers'\nThe Rays salute Jackie Robinson on Friday with a series of special commemorations that begin at 6 p.m. at Tropicana Field. Highlights will include nine \"community champions\" honored for representing Robinson's nine core values, the St. Joseph's Children's Choir singing America the Beautiful and saxophone star B.K. Jackson performing the national anthem.\nJackie Robinson's example proved a beacon for pioneering Tampa attorney 04/18/17 [Last modified: Wednesday, April 19, 2017 12:31am]\n© 2017 Tampa Bay Times\n ", "external_links": [], "highlightTitle": "", "uuid": "7a5fe6efefef2939f25260ad58895af2565c063a", "highlightText": "", "rating": null}]