[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:20:23.000+03:00", "author": "", "entities": {"persons": [], "locations": [{"name": "malvern", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "davita finance", "sentiment": "negative"}, {"name": "group", "sentiment": "none"}, {"name": "davita", "sentiment": "none"}, {"name": "linkedin  davita", "sentiment": "none"}, {"name": "greatest healthcare community the world", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "text": "Home View All Jobs ( 2,596 ) DaVita Finance Manager in Malvern , Pennsylvania This teammate is an integral partner in supporting the operating clinics under his/her assigned division(s). This teammate functions as the highest level finance leader within assigned division(s) and acts as a strategic partner and advisor to Divisional Vice President(s). Teammate will take a leadership role in each of the categories listed below through a strong partnership with Division Vice Presidents and the Group’s finance team. This role is an integral player in driving successful business outcomes. \nSUPERVISORY RESPONSIBILITIES: No \nESSENTIAL DUTIES AND RESPONSIBILITIES \nThe following duties and responsibilities generally reflect the expectations of this position but are not intended to be all-inclusive. \nFinancial Management \nMonthly financial/operations reviews – Explains key drivers behind financial performance. Presents analysis, insight and action to group’s leadership team. \nBudgeting – annual bottoms-up build for labor and controllable cost items \nJoint Venture Reporting – formal quarterly reviews with physician partners on financial performance of joint venture facilities \nSpecial Projects – in partnership with Group Finance Director and Division Vice Presidents, identify opportunities for operational improvement \nGrowth Management \nNew Clinics – build models, assess projects and pitch all potential new and acquired clinics \nGrowth strategy sessions – partner with Division Vice Presidents to analyze, review and recommend overall divisional growth strategy \nForecasting – lead the bottoms-up build of 3-year operating plan \nLeadership \nAs the CFO of your division, you will be expected to interpret data, develop solutions, and effectively communicate your recommendations to senior leadership \nYou will be expected to drive accountability to action plans committed by Divisional Vice Presidents \nYou will be required to coach non-finance oriented TMs on how to use Excel tools and manage a P&L \nHere is what you can expect when you join our Village: \nA \"community first, company second\" culture based on Core Values that really matter. \nClinical outcomes consistently ranked above the national average. \nAward-winning education and training across multiple career paths to help you reach your potential. \nPerformance-based rewards based on stellar individual and team contributions. \nA comprehensive benefits package designed to enhance your health, your financial well-being and your future. \nDedication, above all, to caring for patients suffering from chronic kidney failure across the nation. \nMINIMUM QUALIFICATIONS \nBachelor’s Degree \nExpert-level computer skills and proficiency in MS Excel required; intermediate proficiency in MS Word, Outlook, and PowerPoint \nAbility to travel up to 15% \nPREFERRED QUALIFICATIONS \nMBA or Graduate Level degree \nConsulting experience \nDemonstrated track record of presenting to executive leadership \nJoin us as we pursue our vision \"To Build the Greatest Healthcare Community the World has Ever Seen. \" \nWhy wait? Explore a career with DaVita today. \nGo to http://careers.davita.com to learn more or apply. \nTo learn more about our Village and the world of dialysis, click here . \nFollow us on Facebook and LinkedIn \nDaVita is an equal opportunity/affirmative action employer. As such, DaVita makes hiring decisions solely on the basis of qualifications and experience, and without regard to age, race, color, religion, sex, gender identity, sexual orientation, national origin, disability or protected veteran status. \nWe maintain a drug-free workplace and perform pre-employment substance abuse testing and background verification checks.", "url": "http://omgili.com/ri/GiCaV2xJNYtvgtwaNvzsanb.T2VjOMPpdkcqyGF0PLsd6.VuvZ9Tl06Nbymm0v_j6i94s3YkgLSmVghL214Ox7Y1oC7qfFhz05pxNw7MZcrfYm0Wr4qW3g--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:20:23.000+03:00", "language": "english", "title": "(USA-PA-Malvern) Finance Manager", "thread": {"title_full": "(USA-PA-Malvern) Finance Manager", "site_full": "jobs.davita.com", "site": "davita.com", "site_section": "http://jobs.davita.com/feed/atom", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "blogs", "spam_score": 0.0, "domain_rank": 37881, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Jobs", "url": "http://omgili.com/ri/GiCaV2xJNYtvgtwaNvzsanb.T2VjOMPpdkcqyGF0PLsd6.VuvZ9Tl06Nbymm0v_j6i94s3YkgLSmVghL214Ox7Y1oC7qfFhz05pxNw7MZcrfYm0Wr4qW3g--", "published": "2017-04-16T09:20:23.000+03:00", "title": "(USA-PA-Malvern) Finance Manager", "uuid": "7c920cb0a687e5a550220c39e3a8c5d5cb77d93f", "main_image": ""}, "uuid": "7c920cb0a687e5a550220c39e3a8c5d5cb77d93f", "ord_in_thread": 0}]