[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:00:48.000+03:00", "author": "chataboutbooks", "entities": {"persons": [], "locations": [], "organizations": []}, "text": "I am over the moon to be joining in with Tilly Tennant’s A Wedding In Italy blog tour! :-) Many thanks to Kim Nash for inviting me to take part.\n\nMy review….. This is another gorgeous read by Tilly Tennant, which was just as I expected after loving the first in this series, Rome Is Where The Heart Is . If you haven’t already read book 1 then I highly recommend that you do (you will find my review, along with relevant links, here: Rome Is Where The Heart Is by Tilly Tennant @TillyTenWriter @bookouture #BlogTour #BookReview ), closely followed by A Wedding In Italy , as the story follows on. \nI warmed to Kate straight away and I have thoroughly enjoyed catching up with her again. She is a very real and likeable character who is much braver than I would ever be. I like the fact that her move to Italy hasn’t been plain sailing as I think this makes it a much more realistic story. (Although we all like a fairy tale sometimes.) I love her beloved Alessandro, he is such a sweet character. They are an adorable couple, but not without their disagreements. \nAlessandro’s family are amazing! I love his mother, especially, and the fact that there are lots of them and they are all so close. They remind me of my family, although we don’t all congregate at my Mums most days as they seem to! \nI love how close Kate is with her two sisters also. It would be so hard for me to move away from my family (I struggled living in different counties, let alone countries!), so it very easy to understand how much she misses her sisters. \nKate doesn’t have it easy settling in to her new life and at times it seems like the world is against her and she, understandably, worries that she might have to admit defeat and move back home, but she’s not going to give up easily and thankfully she has her happy ending. \nBeautifully written, as always. I highly recommend! \nMany thanks, as always, to Bookouture for my auto-approval status on Netgalley and to the lovely Kim Nash for inviting me to take part in the blog tour. \n\nPublisher: Bookouture (14th April 2017)\nSun, spaghetti and sparkling prosecco. When it comes to finding love, there’s no place like Rome… \nKate is living the dream with her gorgeous boyfriend Alessandro in his native city, but the reality is sometimes a little less romantic than she’d hoped. Every day in her new home is a fight against leaking pipes, her cantankerous landlord and her less-than-perfect grasp of the Italian lingo.\nAll around her there is talk of weddings, but when a secret from her past is thrust out into the open, Kate must fight to prove to Alessandro’s Mamma – and the rest of his formidable family – that she truly is Italian marriage material.\nWith the women in Alessandro’s life on a mission to break them apart, the cracks begin to show and Kate starts to question if Alessandro really is the man of her dreams. Can love and the city of romance conquer all, or is that just a fairy-tale?\nLet Rome steal your heart this summer in this gorgeously romantic escapist read. Perfect for fans of Jo Thomas and Abby Clements. \nBuy a copy….. US http://amzn.to/2kN1UmF \nAbout the author….. From a young age, Tilly Tennant was convinced that she was destined for the stage. Once she realised she wasn’t actually very good at anything that would put her on the stage, she started to write stories instead. There were lots of terrible ones, like The Pet Rescue Gang (aged eight), which definitely should not see the light of day ever again. Thankfully, her debut novel, Hopelessly Devoted to Holden Finn was not one of those, and since it hit the Amazon best seller lists she hasn’t looked back. Born in Dorset, she currently lives in Staffordshire with her husband, two daughters, three guitars, four ukuleles, two violins and a kazoo.\n\nwww.tillytennant.com https://www.facebook.com/TillyTennant/ https://twitter.com/TillyTenWriter Tilly Tennant’s Amazon Author Page Enjoy! ", "url": "http://omgili.com/ri/.wHSUbtEfZRjnAa_23OeMFKm3kMmpnycEj_yw1nXC49.OlQh7ZVNcMIEmUloRydspMj3s3U6kvqA37HgHqaAnOZYB6Agw8A5jOS9XSDwxCryRgNS_ULJaqHhBcqFNAifuVPZj574UI2CdZr0FVCo2XfpU_R8x64r", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:00:48.000+03:00", "language": "english", "title": "A Wedding In Italy #BlogTour #BookReview @TillyTenWriter @bookouture", "thread": {"title_full": "A Wedding In Italy #BlogTour #BookReview @TillyTenWriter @bookouture", "site_full": "chataboutbooks.wordpress.com", "site": "wordpress.com", "site_section": "https://chataboutbooks.wordpress.com", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "A Wedding In Italy #BlogTour #BookReview @TillyTenWriter @bookouture – Chat About Books", "url": "http://omgili.com/ri/.wHSUbtEfZRjnAa_23OeMFKm3kMmpnycEj_yw1nXC49.OlQh7ZVNcMIEmUloRydspMj3s3U6kvqA37HgHqaAnOZYB6Agw8A5jOS9XSDwxCryRgNS_ULJaqHhBcqFNAifuVPZj574UI2CdZr0FVCo2XfpU_R8x64r", "published": "2017-04-16T11:00:48.000+03:00", "title": "A Wedding In Italy #BlogTour #BookReview @TillyTenWriter @bookouture", "uuid": "7c9c7b6c1acaae760e3ee8add03fefd2229e9920", "main_image": null}, "uuid": "7c9c7b6c1acaae760e3ee8add03fefd2229e9920", "ord_in_thread": 0}]