[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:32:38.000+03:00", "author": "Tim Hill", "entities": {"persons": [{"name": "o’reilly", "sentiment": "none"}, {"name": "bill o'reilly", "sentiment": "none"}, {"name": "maureen mcphilmy", "sentiment": "none"}, {"name": "anderson cooper", "sentiment": "none"}, {"name": "melania trump", "sentiment": "none"}, {"name": "bill o’reilly", "sentiment": "none"}, {"name": "rachel maddow", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "cnn", "sentiment": "negative"}, {"name": "bizpac review", "sentiment": "negative"}, {"name": "unseal bill o’reilly sordid divorce records", "sentiment": "neutral"}, {"name": "fox news", "sentiment": "none"}, {"name": "hollywood reporter", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "text": "Media Bias \n(Bizpac Review) – What happens when media have a chance to eat their own, even quash a competitor, yet hesitate or refuse to do it? \nAs Bill O’Reilly loses sponsors and fights sexual harassment claims, multiple outlets would love nothing better than to obtain the Fox News anchor’s financial records and, especially, the sealed matrimonial records that document the long court battle with ex-wife Maureen McPhilmy. \nRecords bound to be filled with “juicy” items with which to dig an even deeper hole for the already tarnished O’Reilly. \nHowever, according to a Friday report by The Hollywood Reporter, CNN seems to be resisting the siren’s call, as much as the casual observer might think the rival network would love to clear the way for Anderson Cooper, O’Reilly’s 8 pm competitor. In fact, multiple sources confirmed to THR that, even though CNN was close to filing a motion to unseal O’Reilly’s matrimonial records, they are now leaning against this action, despite the fact that some executives are strongly in favor of it. CNN's internal debate: Go after Bill O'Reilly divorce records? https://t.co/vKhAUpKnQo pic.twitter.com/dUDIX4DS8d \n— Hollywood Reporter (@THR) April 14, 2017 \nWhile CNN has been happy to contact Fox News advertisers as they jump off the O’Reilly ship, but “wading into a sticky divorce” may come a bit too close to media cannibalism than some at the network are comfortable with. Or maybe they fear karma. \nAlthough the records of the 2010 court battle are confidential, some information has become public, including a 2015 Gawker report about trail transcripts detailing testimony from O’Reilly’s teenage daughter saying her dad struggles to control his rage and that she witnessed her dad “choking her mom” and dragging “her down some stairs” by the neck. \nWhether or not CNN or another network is able to get court records unsealed, it may not matter in the end, since O’Reilly is now accusing his ex-wife of defrauding him into a separation agreement to “finance an existing extra-marital relationship.” Because of this, a New York judge may be making lots more heretofore private information public. \nBut whatever happens, CNN’s reluctance to hit O’Reilly where it hurts the most could prove that there is indeed at least some honor among thieves, er, media outlets! \nOr, media execs living in glass houses are afraid to throw a stone that big. \nwww.bizpacreview.com/2017/04/15/cnn-blinks-chance-unseal-bill-oreilly-sordid-divorce-records-stopped-473230 ‘Keep It Going’: ‘GoFundMe’ Amount for Fallen Green Beret Who Leaves 5 Kids Shows Who Americans Truly Are Top Stories Shock Report BLOWS HOLES In Liberal Myth That Trump’s Travel Cost... (Angry Patriot) – We have heard over and over again that Trump is traveling too much and it is costing us money. It turns out the Democrats are lying ... If Bannon is on the Outs: Threats Begin to Drop the ‘Mother Lode ... (Bizpac Review) - Amid the palace intrigue over whether there has been a shift in power in President Donald Trump’s inner circle has been plenty of sp... Media Ignore 1 Fact About U.S. Doctor Who Maimed Girls What is religious basis for 'barbaric' procedure? (WND) - A Detroit physician was arrested earlier this week for performing the grisly practice of ... MEDIA BLACKOUT: First Lady Melania Trump’s Visit to Home for Abus... (Gateway Pundit) - How does the national media try to control how Americans perceive the Trump presidency? One way is to not report on actions that ma... MAJOR FAIL – MSNBC’s Rachel Maddow Dedicates Over Half of Her Air... (Gateway Pundit) - MSNBC’s Rachel Maddow wouldn’t have much of a show if she didn’t put her tinfoil hat on every night and screech about the Trump-Rus... Facebook Suspends 30,000 French Accounts 10 days Before Election ... (Gateway Pundit) - Facebook suspended 30,000 French accounts ten days before a hotly contested election. Critics argue the move is in an attempt to...", "url": "http://omgili.com/ri/.wHSUbtEfZQuvtNB2CWYlIZoIzXJjCTwDpqGk11Q83GUMwV3dMwzGpP7ya1GeYiSjDqgtn8Z89VL0YS8P.PdXWU5N5RNeDisWzxK9s8W9JNknc.pIMXaTlcUI.G.jVBwSBCHl4XbPZo-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T10:32:38.000+03:00", "language": "english", "title": "CNN Blinks at a Chance to Unseal Bill O’Reilly Sordid Divorce Records; What Stopped Them?", "thread": {"title_full": "CNN Blinks at a Chance to Unseal Bill O’Reilly Sordid Divorce Records; What Stopped Them?", "site_full": "www.teaparty.org", "site": "teaparty.org", "site_section": "http://www.teaparty.org/feed/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": 49120, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Tea Party", "url": "http://omgili.com/ri/.wHSUbtEfZQuvtNB2CWYlIZoIzXJjCTwDpqGk11Q83GUMwV3dMwzGpP7ya1GeYiSjDqgtn8Z89VL0YS8P.PdXWU5N5RNeDisWzxK9s8W9JNknc.pIMXaTlcUI.G.jVBwSBCHl4XbPZo-", "published": "2017-04-16T10:32:38.000+03:00", "title": "CNN Blinks at a Chance to Unseal Bill O’Reilly Sordid Divorce Records; What Stopped Them?", "uuid": "7cfec13dfaf42b1465b2b131117f149c7ed3a180", "main_image": "https://www.teaparty.org/wp-content/uploads/2014/12/Bill-Oreilly.jpg"}, "uuid": "7cfec13dfaf42b1465b2b131117f149c7ed3a180", "ord_in_thread": 0}]