[{"entities": {"organizations": [], "locations": [], "persons": []}, "uuid": "80e9328f6cfae795dd3f74a497b47ba1adc26075", "highlightText": "", "title": "Symptoms Of Thyroid Problems In Children", "thread": {"site": "newsfetchers.com", "country": "US", "participants_count": 1, "site_full": "www.newsfetchers.com", "section_title": "News Fetchers", "uuid": "80e9328f6cfae795dd3f74a497b47ba1adc26075", "site_section": "http://www.newsfetchers.com/", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T23:32:04.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_gnkhwwu0uPS8yWYINtJ0PJ42tZAU32s1LQ11EGaRPcNrEve2.9SYIF4CQrzL.IPtnRFxQaVvjkNw8sjTP21gQBcYlfvIJTkdx9kVf6eReqw--", "title_full": "Symptoms Of Thyroid Problems In Children", "title": "Symptoms Of Thyroid Problems In Children", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T23:32:04.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_gnkhwwu0uPS8yWYINtJ0PJ42tZAU32s1LQ11EGaRPcNrEve2.9SYIF4CQrzL.IPtnRFxQaVvjkNw8sjTP21gQBcYlfvIJTkdx9kVf6eReqw--", "ord_in_thread": 0, "crawled": "2017-04-16T23:32:04.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "dNews Fetchers (noreply@blogger.com)", "text": "Thyroid problems are not rare in children, but they are not as common as parents usually believe. For example, only about five percent of patients with hyperthyroidism are under fifteen years old.\nEspecially when their kids are overweight, it is important to keep in mind that these children are typically short, while kids who are overweight because they eat too much or exercise too little are usually tall.\nSleeping a lot is another common symptom that brings parents to their pediatrician looking for a thyroid problem. While that symptom usually deserves looking at your child’s thyroid function tests, without other symptoms, they are likely to be normal and you might look for obstructive sleep apnea, depression, etc., as other possible causes.\nThyroid Problems \nThis is not to say that kids can’t get thyroid problems. From conprivate part hypothyroidism and Hashimoto’s thyroiditis to Graves disease, children and teens can indeed develop thyroid problems.\nReviewing some of the common signs and symptoms of hypothyroidism and hyperthyroidism can help you to know when to get thyroid function tests ordered for your child and when to look for another cause for your child’s symptoms.\nSymptoms of Hypothyroidism Hypothyroidism most commonly occurs when the thyroid gland isn’t producing enough thyroid hormone, either because it can’t (primary hypothyroidism) or because it isn’t being stimulated properly (secondary hypothyroidism).\nKids with primary hypothyroidism will usually have a low free thyroxine level (free T4) and an elevated level of thyroid stimulating hormone (TSH) and associated symptoms of hypothyroidism, such as:\nShort stature or deceleration of growth Rough, dry skin Constipation Cold intolerance Fatigue, decreased energy Sleeping more Easy bruising Delayed bone age on X-ray Delayed puberty (teens) Galactorrhea (white chest discharge) Pseudoprecocious puberty (early puberty) Headaches Vision problems Newborns with conprivate part hypothyroidism are usually identified on their newborn screening test, which routinely tests for hypothyroidism.\nSymptoms of Hyperthyroidism \nIn hyperthyroidism, also called thyrotoxicosis, there is an excess of thyroid hormones. These children will usually have a high T4, T3, and a low TSH.\nSymptoms of hyperthyroidism can include:\nEmotional lability, with your child being more likely to cry easily, be irritable and excitable, etc. Short attention span Finger tremor Increased appetite Weight loss, failure to thrive Enlarged thyroid gland (goiter) Exophthalmos (protruding eyes) Upper eyelid lag Infrequent blinking Flushed skin Excessive sweating Muscle weakness Tachycardia and palpitation High blood pressure Whether you think your child’s thyroid is underactive or overactive, talk to your pediatrician if you think his thyroid isn’t working properly. As thyroid disorders are sometimes hard to diagnose and thyroid function tests can sometimes be hard to interpret, an evaluation by a pediatric endocrinologist can also be helpful.\nSource: Verywell\n\nAd ==> 3 fruits you need to eat at least once a day but you neglect, they will help improve your performance in bed Let's block ads! (Why?) \n\nvia: INFORMATION NIGERIA\n\nFollow us on Twitter: @NewsFetchers \nFollow us on Google+: NewsFetchers \nLike our Facebook page: NewsFetchers \n"}]