[{"entities": {"organizations": [{"name": "la times", "sentiment": "none"}, {"name": "mozilla", "sentiment": "none"}, {"name": "penn state", "sentiment": "none"}, {"name": "ohm", "sentiment": "none"}, {"name": "neo/nazi white supremacist", "sentiment": "none"}, {"name": "wikipedia", "sentiment": "none"}, {"name": "los angeles times", "sentiment": "none"}], "locations": [{"name": "oroville dam", "sentiment": "none"}, {"name": "berkeley", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "oroville", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}], "persons": [{"name": "georg ohm", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "uuid": "8103917373661d2453fd17cbb2056d646f9d978a", "highlightText": "", "title": "March for (Non)Science", "thread": {"site": "blogspot.com", "country": "US", "participants_count": 1, "site_full": "lwgat.blogspot.com", "section_title": "The \"Lone Wolf\" Graphic Arts Technologist", "uuid": "8103917373661d2453fd17cbb2056d646f9d978a", "site_section": "http://lwgat.blogspot.com/", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T23:38:40.000+03:00", "url": "http://omgili.com/ri/SEMpReyPU46IzNp3iWU8vV7ysbW2_VbmOS2nJsRwq5detKAOKuvbMfWrWl.Q_XA88cyOK3w48.j5pjnb7.wG3w--", "title_full": "March for (Non)Science", "title": "March for (Non)Science", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T23:38:40.000+03:00", "url": "http://omgili.com/ri/SEMpReyPU46IzNp3iWU8vV7ysbW2_VbmOS2nJsRwq5detKAOKuvbMfWrWl.Q_XA88cyOK3w48.j5pjnb7.wG3w--", "ord_in_thread": 0, "crawled": "2017-04-16T23:38:40.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "John Gault (noreply@blogger.com)", "text": "From the LA Times article linked at the bottom... Science and public policy are always an interesting mix.\n\nAt the right you can see the consequence of government policy as it relates to the science of managing water in California.\n\nIndeed this the Oroville dam during the peak of the California non-drought.\n\nBelow we will see how this relates to the \"March for Science.\"\n\nI came upon the \" March For Science \" after trying to understand the motivation behind things like the riots in Berkeley, CA.  Here's the Facebook page of one the \"attendees\" - it says: \" Headed to Berkeley to disrupt the Neo/Nazi White Supremacist jerk circle today Nervous af but determined to bring back 100 Nazi Scalps \"\n\n\nHmm...\n\nIt struck me that the \"March for Science\" is basically similar in nature to this and a variety of similar events that have taken shape over the last few months:  Woman's March in DC, Tax March (which our image is above seems to be from), etc.\n\nSo before we start let's take a look at what the idea is behind \"science\" ( from Wikipedia ):\n\n\nIn truth it seems pretty simple.  You perform experiments related to some hypothesis, collect evidence, and based on these create a theory.\n\nScience in turn depends on mathematics: deduction, inference, and so on.\n\nNow both science and mathematics are independent of how one might feel about how it's conducted or what conclusions are discovered. \n\nThat's sort of the point. \n\nWe can believe in scientific results or mathematical proofs because the \"discovery\" stands on its own - a result (which may or may not be correct) - independent of how it was discovered.\n\n(Of course, as I write here \" absolute morality \" is required too, i.e., no lying about results, evidence, experiments, and so on.  If you make up evidence, results, etc. then what's the point? - Anyone can do that about anything - hence no real result.)\n\nSo let's take a look at the \"principles\" behind this march (from here ).  Under \"Core Principles\" we find \" Science that Serves the Common Good \" - Here it says: \" We recognize that inclusion, diversity, equity, and accessibility in science are critical to ensure that science reaches its potential to serve all communities .\"\n\nImagine Ohm's law.  Without it today's society would not exist - no electronics or electrical power of any kind.  Invented, no surprise, by Georg Ohm in 1827 (see this  - an individual of \"societal privilege\" for sure, he actually had time to perform scientific research).  I think this law \" serves the common good, \" at least if you believe that humanity needs electricity. \n\nSeems to me Ohm's law is a good example of actual science.\n\nEven if its been used for executions (killing people for the Berkeley educated not afraid of scary subjects).\n\nThat's right, it kills people (in perhaps an \"unfair\" or \"socially unjust\" way), but kills them non-the-less.\n\nNext paragraph we find this gem \" Political decision-making that impacts the lives of Americans and the world at large should make use of peer-reviewed evidence and scientific consensus, not personal whims and decrees. \"  Here \"scientific consensus\" are code words for \"vaccination deniers,\" \"climate deniers,\" Trump, and all the rest of the \" deniers .\"\n\nThese sciences are \" settled \" and require no further investigation.\n\nExercise for the reader: Find where in the \"scientific method\" we (as humans or science or engineers) operate only on \"decided outcomes\" from science. (We can use electricity without Ohm's law, but it will be out of our control because we won't understand it...)\n\nNext we find \"Cutting Edge Science Education\" where it says \" Science works best when scientists come from diverse perspectives, and we must work to encourage and support a new generation of scientists that reflects that. \"\n\nHere there's a subtle and clever conflation of \" science \" with the process of \" scientific discovery .\"  \"Science\" could care less who discovers uncovers its principles.  Many western discoveries were also found in other countries at other times.  But the nature of this is true social engineering as you see, for example, with ouster of president of Mozilla (see this ).  It's silly to believe the operation of the browser (which after all is simply the science of electrons, etc.) cares what this guy believes.\n\nOn the other hand, the process of \"scientific discovery\" is always (or at least nearly always) more efficient with different points of \"scientific\" view (as opposed to \"social perspective\" implied by the above).  Again a subtle and clever conflation of university-developed social constructs and actual science.\n\nThe next item appears to be a political statement targeted at the business of science publishing: \"Open, honest science and inclusive public outreach.\"  Here we ask (at least if I am not being thwarted by secret code words) for publicly funded science to be publicly available. \n\n(Gee, where's the Penn State climate data when you need it... Oh wait, only available if hacker get it.)\n\nThis is probably a mistake - at least if the organizers thought about it.\n\nAfter all.  On the one hand if a giant asteroid was about to hit earth (or at least the potential was discovered) would you only want a few scientists in secret to plan our safety plans?  Or would you rather the trajectory and so forth be public so that the entire planet can participate in finding a solution.\n\n(Don't conflate this with the impending \"climate\" disaster though, that's different...)\n\nUnder funding we find \" De-funding and hiring freezes in the sciences are against any country’s best interests. We believe that the federal budget should reflect the powerful and vital role that science plays in supporting our democracy. We advocate federal funding in support of research, scientific hiring, and agency application of science to management. This funding cannot be limited to a few fields or specific demographics -- scientific support must be inclusive of diverse disciplines and communities. \"\n\nOne images this is actually asking for everyone, even \" deniers \" to be funded.\n\nThis seems unlikely, doesn't it?\n\nOne needs look no further than the Los Angeles Times for how government with the funding of important things \" The government failure at the heart of the Oroville Dam crisis (Image from article at top of post) . \n\nReally seems much more like a \"March for NonScience (Nonsense?)\"\n\n"}]