[{"entities": {"persons": [{"sentiment": "negative", "name": "pablo blazquez dominguez"}, {"sentiment": "none", "name": "sara ashley o’brien"}, {"sentiment": "none", "name": "christoper wilson"}, {"sentiment": "none", "name": "conigliaro"}, {"sentiment": "none", "name": "jim conigliaro jr."}], "organizations": [{"sentiment": "none", "name": "getty images"}, {"sentiment": "none", "name": "cnn"}, {"sentiment": "none", "name": "limousine commission"}, {"sentiment": "none", "name": "tlc"}, {"sentiment": "none", "name": "time warner company"}, {"sentiment": "none", "name": "idg"}, {"sentiment": "none", "name": "uber"}, {"sentiment": "none", "name": "cnntech"}, {"sentiment": "none", "name": "independent drivers guild"}, {"sentiment": "none", "name": "cable news network, inc."}, {"sentiment": "none", "name": "international association of machinists and aerospace workers union"}, {"sentiment": "none", "name": "nyc law department"}, {"sentiment": "none", "name": "lyft"}], "locations": [{"sentiment": "none", "name": "new york city"}, {"sentiment": "none", "name": "philadelphia"}]}, "text": "Uber Drivers Could Soon Start Getting Tips April 17, 2017 9:32 PM (Photo by Pablo Blazquez Dominguez/Getty Images) \nBy Sara Ashley O’Brien \nPHILADELPHIA (CNN) – – New York City is on its way to mandating that Uber allow tips. \nOn Monday, the Taxi and Limousine Commission — which regulates yellow cabs and for-hire vehicles — said will propose a rule requiring Uber and similar services to enable tipping in their apps. \nThat’s according to a letter that was sent from deputy commissioner Christoper Wilson to the Independent Drivers Guild on Monday and viewed by CNNTech. \nPokémon Go Can Make You Happier, Study Says \nIDG, which formed last May, is a coalition of 50,000 drivers for companies like Uber, Lyft and Juno. It said tipping is a top concern among its drivers. \nLyft has supported tipping since its early days, but Uber has repeatedly refused to include this option, citing a “hassle-free” experience that’s better for both drivers and riders. \nIDG raised the concern with Uber in June. After making no headway, it proposed a petition to the TLC in February to try to force Uber’s hand. \nIDG founder Jim Conigliaro Jr. estimates that drivers could make $300 million more a year if tipping practices for yellow cabs in NYC are applied to Uber rides. \n“New York City’s professional drivers have traditionally depended on gratuities for a substantial portion of their income. Cuts to driver pay across the ride-hail industry has made tipping income more important than ever,” said Conigliaro in a statement. “The exploitation of ride-hail drivers must end and this is an important first step.” \nCoffee That Won’t Stain Your Teeth…Because It’s Clear \nConigliaro said that Uber’s “big excuse” has been that tipping complicates the service’s “ease of use.” But he said there are ways to make the process “as seamless as it is right now.” \n“People do want to tip,” he said. “They actually feel uncomfortable when they get out of the car and don’t tip the driver.” \nIn a statement sent to CNNTech, Uber said that it has “not seen the proposal.” \n“[We] look forward to reviewing it,” Uber said, adding that it is “always striving to offer the best earning opportunity for drivers and we are constantly working to improve the driver experience.” \nUber said that’s the reason it has partnered with IDG, an affiliate of the International Association of Machinists and Aerospace Workers Union, to make sure its policies support drivers. IDG is the only organized group of drivers that meets regularly with Uber management to advocate for drivers. \nIt will be some time before drivers start seeing any benefits of Monday’s announcement. The TLC said it will propose the rule by July. It must then be certified by the NYC Law Department and publicly posted for a 30 day comment period. At that point, a final rule is posted and then voted on by the TLC board of commissioners. \n“We’ll follow this all the way through to make sure it does become a rule,” said Conigliaro. \nThe-CNN-Wire ™ & © 2017 Cable News Network, Inc., a Time Warner Company. All rights reserved.", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "811bb691002ac0ce3b74e997acb70128ec2ce069", "rating": null, "highlightTitle": "", "title": "Uber Drivers Could Soon Start Getting Tips", "thread": {"country": "US", "site": "cbslocal.com", "replies_count": 0, "title_full": "Uber Drivers Could Soon Start Getting Tips", "site_categories": [], "performance_score": 0, "section_title": "CBS Philly", "domain_rank": 1192, "uuid": "811bb691002ac0ce3b74e997acb70128ec2ce069", "main_image": "https://cbsphilly.files.wordpress.com/2016/08/457199178.jpg?w=594", "site_type": "blogs", "title": "Uber Drivers Could Soon Start Getting Tips", "spam_score": 0.0, "site_section": "http://philadelphia.cbslocal.com/comments/feed/", "url": "http://omgili.com/ri/8HG_hanVOKxLfJ57sK6P.ggbKCGgTcV7nop.5TDoiBkoJbRKgwzitQF9b9UtaDS7F2uUq8IneWsrVZq9iW4M9V1ytX6vG4NV3RCPb3n1D5ryZL9PQ_xcuw--", "participants_count": 1, "site_full": "philadelphia.cbslocal.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T09:32:00.000+03:00"}, "crawled": "2017-04-18T11:25:41.000+03:00", "url": "http://omgili.com/ri/8HG_hanVOKxLfJ57sK6P.ggbKCGgTcV7nop.5TDoiBkoJbRKgwzitQF9b9UtaDS7F2uUq8IneWsrVZq9iW4M9V1ytX6vG4NV3RCPb3n1D5ryZL9PQ_xcuw--", "highlightText": "", "published": "2017-04-18T09:32:00.000+03:00", "author": "CBS Philly"}]