[{"entities": {"persons": [{"sentiment": "none", "name": "loxton"}], "organizations": [{"sentiment": "none", "name": "paypal"}, {"sentiment": "none", "name": "global shipping program"}, {"sentiment": "none", "name": "pitney bowes inc"}], "locations": [{"sentiment": "none", "name": "israel"}, {"sentiment": "none", "name": "australia"}, {"sentiment": "none", "name": "south australia"}]}, "text": "Image not available Photos not available for this variation X Be the first to write a review . New Easy Pop Melodies for Violin Music Book - Beginners Songbook Consistently receives highest buyers' ratings Ships items quickly the_music_shop_1934   Quantity: 2 available Please enter a quantity of $qty_dummy$ or less Please enter a quantity of 1 Purchases are limited to $qty_dummy$ per buyer Please enter quantity of 1 or more Please enter a lower number Choose quantity that is less than $qty_dummy1$ or equal to $qty_dummy$ You can only choose quantity that is equal to $qty_dummy$ Price: New Condition Shipping: May not ship to Israel - Read item description or contact seller for shipping options. | See details Australia Import charges: (amount   International shipping and import charges paid to Pitney Bowes Inc. Learn More   Any international shipping and import charges are paid in part to Pitney Bowes Inc. Learn More   International shipping paid to Pitney Bowes Inc. Learn More   Any international shipping is paid in part to Pitney Bowes Inc. Learn More   Returns: 30 days money back, buyer pays return shipping | See details Guarantee: Money Back Guarantee Covered by eBay Money Back Guarantee | See details   Get the item you ordered or get your money back. Covers your purchase price and original shipping. Seller assumes all responsibility for this listing. Item specifics Condition: Brand New: A new, unread, unused book in perfect condition with no missing or damaged pages. See the seller’s listing for full details. See all condition definitions   ... Read more about the condition MPN: Questions and answers about this item No questions or answers have been posted about this item. Seller assumes all responsibility for this listing. Shipping and handling The seller has not specified a shipping method to Israel . Contact the seller   and request shipping to your location. Shipping cost cannot be calculated. Please enter a valid ZIP Code. Item location: Loxton, South Australia, Australia Shipping to: Australia No additional import charges at delivery! This item will be shipped through the Global Shipping Program and includes international tracking. Learn more   Quantity: There are 2 items available. Please enter a number less than or equal to 2. Select a valid country. Please enter a valid ZIP Code. Please enter 5 or 9 numbers for the ZIP Code. Domestic handling time Will usually ship within 1 business day of receiving cleared   Return policy After receiving the item, contact seller within Refund will be given as Return shipping Buyer pays return shipping Return policy details All returns must be authorised by The Music Shop before sending items back. Item must still be in brand new unused condition with appropriate packaging. We must receive the returned item within 10 business days of the return authorization . Items will be refunded minus our postage cost. Payment details + import charges (shown at checkout) time left ##2## left | Bid Count Your high bid amount: If the current bid is $20, and you bid $30, we bid $21 for you. If no one else bids, you win and pay $21. If someone else bids $31, we bid for you up to your max of $30. Approx. Bid By placing a bid, you're committing to buy this item if you win. By submitting your bid, you are committing to buy this item from the seller if you are the winning bidder. You have read and agree to the Global Shipping Program terms and conditions   . Import charges previously quoted are subject to change if you increase you maximum bid amount. By clicking Confirm , you commit to buy this item from the seller if you are the winning bidder. By clicking Confirm , you are committing to buy this item from the seller if you are the winning bidder and have read and agree to the Global Shipping Program terms and conditions   . Import charges previously quoted are subject to change if you increase you maximum bid amount. Loading... Bid layer is updating the contents. Resume bidding , if the page does not update immediately. d You've been outbid. Don't let it get away - place another bid. You've been outbid by an automatic bid placed earlier by another bidder. You're the highest bidder on this item! You're the first bidder on this item! You're the highest bidder on this item, but you're close to being outbid. This auction is almost over and you're currently the high bidder. You're the high bidder on this item, but the reserve price hasn't been met yet. You've been outbid by someone else. You can still win! Try bidding again. You've been outbid by someone else's max bid. You can still win! Try bidding again. You've been outbid by someone else. Try raising your max bid. You're the highest bidder! To increase your chances of winning, try raising your bid. You're the first bidder. Good Luck! You're still the highest bidder! You increased your max bid to Please enter your bid again. Enter a valid amount for your bid. Enter a bid that is the minimum bid amount or higher. You have to bid at least Sorry, you can't lower your maximum bid once it's placed. This seller requires the buyer to have a PayPal account to purchase this item. Get a PayPal account here . Your bid is the same as or more than the Buy It Now price.You can save time and money by buying it now. Place bid Review and confirm your bid Bid confirmation Enter a custom max bid more than ##2## Enter a custom max bid of ##2## or more + ##2## approximate import charges Please enter a higher amount than the current bid. + ##2## for shipping", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "82502a07029f22f0eec8b09f408ead48512fa5c1", "rating": null, "highlightTitle": "", "title": "New Easy Pop Melodies for Violin Music Book - Beginners Songbook", "thread": {"country": "US", "site": "ebay.com", "replies_count": 0, "title_full": "New Easy Pop Melodies for Violin Music Book - Beginners Songbook", "site_categories": [], "performance_score": 0, "section_title": "(Category:Sheet Music & Song Books)", "domain_rank": null, "uuid": "82502a07029f22f0eec8b09f408ead48512fa5c1", "main_image": "http://i.ebayimg.com/images/i/182534484014-0-1/s-l1000.jpg", "site_type": "news", "title": "New Easy Pop Melodies for Violin Music Book - Beginners Songbook", "spam_score": 0.0, "site_section": "http://instruments.shop.ebay.com/Sheet-Music-Song-Books-/20833/i.html?_rss=1", "url": "http://omgili.com/ri/jHIAmI4hxg93Ai8AfUnTTWWv6q.A_lmG9H75aYibQOv66ip9DWmA51ox6LVMmYkxaojlidLGlMclf5r7j8Lwrg_iaqxm.mUEdIrLNfiKSz7MIa2UcqLW6obzAr_mqbHp1Gzkv3Ksq.Phi93q8dkrBQ--", "participants_count": 0, "site_full": "www.ebay.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T07:10:00.000+03:00"}, "crawled": "2017-04-18T11:27:07.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg93Ai8AfUnTTWWv6q.A_lmG9H75aYibQOv66ip9DWmA51ox6LVMmYkxaojlidLGlMclf5r7j8Lwrg_iaqxm.mUEdIrLNfiKSz7MIa2UcqLW6obzAr_mqbHp1Gzkv3Ksq.Phi93q8dkrBQ--", "highlightText": "", "published": "2017-04-18T07:10:00.000+03:00", "author": ""}]