[{"entities": {"organizations": [{"name": "facebook", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "natanz", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "oven fox valley", "sentiment": "none"}], "persons": [{"name": "pandora", "sentiment": "none"}, {"name": "jennette mccurdy", "sentiment": "none"}, {"name": "norman lewis", "sentiment": "none"}, {"name": "spotify", "sentiment": "none"}]}, "uuid": "84a74e6e556a70516934bf8c8a3fb769a67c7cf6", "highlightText": "", "title": "How to Give Space in a Relationship", "thread": {"site": "blogspot.com", "country": "US", "participants_count": 1, "site_full": "easydatingtips99.blogspot.com", "section_title": "Easy Dating Tips", "uuid": "84a74e6e556a70516934bf8c8a3fb769a67c7cf6", "site_section": "http://easydatingtips99.blogspot.com/", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T22:00:00.000+03:00", "url": "http://omgili.com/ri/j.JM_ertN3I55ztd2HLVawfxAGUotW3cZTu5OiIGTXTI7m6GQy2WZ6UlkfEYe379apdfnsbzALJFdKT.rJoFXdJVCfy7hkV2pBuBZm_Cj2LqaA4NChRKng--", "title_full": "How to Give Space in a Relationship", "title": "How to Give Space in a Relationship", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T22:00:00.000+03:00", "url": "http://omgili.com/ri/j.JM_ertN3I55ztd2HLVawfxAGUotW3cZTu5OiIGTXTI7m6GQy2WZ6UlkfEYe379apdfnsbzALJFdKT.rJoFXdJVCfy7hkV2pBuBZm_Cj2LqaA4NChRKng--", "ord_in_thread": 0, "crawled": "2017-04-17T00:00:15.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Carol K. Stjean (noreply@blogger.com)", "text": "  to Give Space in a Relationship   to Give Space in a Relationship \nGetting a little space in your relationship doesn't have to be a bad thing. Typically when you think of asking your partner for space, you see the end of your union in the near future. Bridging a small gap between youtwo doesn't have to be all doom and gloom. Taking a break can be a healthy refresher to reignite the flame in your relationship. Instructions 1 \nDisjoin from each other's hip. If you and your sweetheart are so close that you spend every waking -- and maybe even the unawake -- hours together, adjust your routine so that you each have some down time. One of you needs to stay behind when the other has to run errands or walk the dog. Start slow so it's not such a drastic change, and see how you feel about the time apart. 2 \nWork in other rooms if you're prone to spend all of your time doing everything in the same space. Instead of reading a magazine on the couch while your partner works on a late-night work project right next to you, use another room which you've designated as leisure or office space. Separating from each other in these cases will help you two appreciate spending time together when you rejoin. 3 \nReduce your communication. No matter whether you're dating or married, on the verge of a breakup, or so fresh in the relationship that it's becoming smothering, a quick way to widen the space between you two is a change in communication. If you're prone to textingyour partner every minute of the day for a play-by-play of his daily actions, reduce your communication significantly by agreeing to send a \"checking on you\" text only a couple of times a day. 4 \nGo a few days without seeing each other. If you find that having physical space is the only way to keep sanity in your relationship, talk to your partner about creating that space. This may mean not seeing or speaking to each other for a few days. As much as you two may fight giving the other space, consider this the first step toward a healthy solution to your problems. You'd hate to have your good thing end because one of you smothered theother with too much attention. Respect each other's need to learn how to survive on an independent basis, and part ways temporarily for the benefit of your bond. How To Get A Girl To Like You Dating Advice Body Language www. howto getagirltolikeyous.com \nHow to get a girl to like you through mastering the art of talking to women. Articles on the best ways to approach and chat to women. How to Build a Biltong Box How to Make Biltong www.biltongbox.info/ how-to -build-a-biltong-box \nThe first thing you need to do is decide what to use as the box. You could either use wood or cardboard. I have used both in the past. There is no real preference ... How to Make Bento Lunch Box - YouTube www.youtube.com/watch?v=-_hbPLsZvvo \nIngredients for Bento (serves 1) - Potato Salad - 40g Potato (1.41 oz) 10g Carrot (0.35 oz) 400cc Water (1.69 u.s. cup) 1/2 tsp Salt 4cmCucumber (1.57 ... Recipe for how to make Lox smoked salmon at home Caleb ... www.calebclark.org/?p=1377 \nLearn to make simple Lox (Salmon) at home using only your refrigerator, salt, sugarand a few days waiting. How to Make BBQ Ribs in the Oven FoxValley FoodieFox www.foxvalleyfoodie.com/ how-to-make -bbq-ribs-in-the-oven \nMy favorite indoor rib recipe is a simple two step process: First bake the ribs in the oven till tender, then broil the sauce till it caramelizes. How to Make Money Fast in Internet - reviewed by Norman Lewis ... www.youtube.com/watch?v=ScFvd7Deva0 \nClick Here -- http://binarycomplete.com/ -- Click Here How to Make Money Fast in Internet AAlthough there are many websites that claim to show you how to ... west elm headboard how to make your own fabric tufted girlsingrey.lemongrassweddings.com/?p=384 \nI asked my dad to make me a headboard when I was 12... at 26, I finally got one - and if you ask me, it was totally worth the wait! I had my eye on this fabulous tufted Homemade Bird Suet Recipe How To Make SuetFor Birds www.artistic-garden.com/easy-homemade-bird-suet-recipe \nA homemade bird suet recipe saves you money over store-bought suet cakes. My backyard birds love this suet. Great for bluebirds, woodpeckers and all birds. How To Give Her An Intense Orgasm Tonight mynextlevelnow.com www.mynextlevelnow.com/ how-to-give -her-an-intense-orgasm-tonight \nIntense Orgasms for a man are EASY to understand. You simply thrust, get aroused, finish, and go to sleep =) Most men can only have one type of intense Jennette  //my space .com/jennettemccurdy \nYour New Profile. This is your home on Myspace. Fill it with all the things that make you, you. How To Get A Girl To Like You Dating Advice Body Language www. howto getagirltolikeyous.com \nHow to get a girl to like you through mastering the art of talking to women. Articles on the best ways to approach and chat to women. How to get your ex girlfriend back Ex Girlfriend Quotes Love ... www. love quotesforher.com/ how-to -get-your-ex-girlfriend-back \nLove Quotes for Girlfriend and Boyfriend; Heart Touching Quotes for her and him; Good Morning Quotes for her and him; Good Night Quotes for her and him Sexy Poems To Make Your Heart Race! www.ladyof love poems.com/sexy-poems.html \nThese sexy poems will get your heavy breathing going! Warning: These are sexy love poems are rated Mature. Self-esteem and Insecurity: How they Relate to Your Marriage ... www.marriageadvocates.com/2012/02/29/self-esteem-and-insecurity... \nLearn how poor self-esteem can adversely affect your relationship and what to do about it. How Teachers Make Cell Phones Work in the Classroom MindShift blogs.kqed.org/mindshift/2012/05/how-teachers- make -cell-phones... \nWhen we talk about using cell phones in class, were not just talking about using cell phones in class. The idea of mobile learning touches on just about every ... Poultry Farming in Nigeria Step by Step Guide How to Start www. make moneynigeria.com/poultry-farming-nigeria-step-step-guide-start \nPoultry farming in Nigeria has proven a very profitable business opportunity for entrepreneurs. This article will teach you the basic requirements you need. Homemade Bird Suet Recipe How To Make Suet ForBirds www.artistic-garden.com/easy-homemade-bird-suet-recipe \nA homemade bird suet recipe saves you money over store-bought suet cakes. My backyard birds love this suet. Great for bluebirds, woodpeckers and all birds. Pig Farming Business in Nigeria Guidelines on how to Start make moneynigeria.com/pig-farming-business-nigeria-guidelines-start \nIf you arethinking about starting a pig farming business in Nigeria, then thisarticle is for you. It contains a list of tips for beginners to carefully co How to Make a Gum Paste Tiara (Step-by-Step Picture Tutorial) rosebakes.com/ how-to-make -a-gum-paste-tiara-step-by-step-picture... \nAfter asking on Facebook to see if there was any interest, I was immediately convinced I needed to shoot and write this post: How to Make a Gum Paste Tiara. Space \n  Dead Drops Un-cloud your files in cement! 'Dead Drops is an ... deaddrops.com \nUn-cloud your files in cement! 'Dead Drops is an anonymous, offline, peer to peer file-sharing network in public space . How do our favorite tech companies make money? rcs.seerinteractive.com \nEver wonder how Spotify, Google Maps, Pandora, or Dropbox make money? Find out here...find out if they areprofitable or not and how they make their money! How Digital Detectives Deciphered Stuxnet, the Most Menacing ... www.wired.com/threatlevel/2011/07/how-digital-detectives... \nSatellite image of the Natanz nuclear enrichment plant in Iran taken in 2002 when it was still under construction. The image shows two cascade halls, in the upper ... Personal Development 123 www.danielbranch.com \nPersonal Development 123 will guide you to a better life. Free Original Articles, Ebooks, Advice, Quotes, Community, and more. Personal Development has been a topic ..."}]