[{"entities": {"locations": [{"name": "ibotta", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "lubbock", "sentiment": "none"}, {"name": "la michoacana ice cream bars", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}, {"name": "red barons", "sentiment": "none"}], "persons": [{"name": "ibotta", "sentiment": "none"}, {"name": "mobisave", "sentiment": "none"}, {"name": "frito lay", "sentiment": "none"}, {"name": "oetker virtuoso", "sentiment": "none"}, {"name": "sean fields", "sentiment": "none"}, {"name": "oetker", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "lubbockonline.com", "site_section": "http://m.lubbockonline.com/rss.xml", "domain_rank": 73097, "replies_count": 0, "country": "US", "section_title": "Lubbock Online | Lubbock Avalanche-Journal", "title": "Savvy Shopper: These specials offer something new", "title_full": "Savvy Shopper: These specials offer something new", "published": "2017-04-19T08:39:57.000+03:00", "url": "http://omgili.com/ri/SEMpReyPU46QTAsQM2b8MYzMvlGkKLFndTFG6FprEFSlH3nLcMNm45eGX7kistyyVpPC23apXFgLUGr5qB_8Nhmg7orXe8hO0Ai8UVRGGnzcI3zqKQld7A--", "site": "lubbockonline.com", "main_image": "http://lubbockonline.com/sites/default/files/image2097558_web1_Savvy-Shopper-column-mug.jpg", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "863452107fb59b6ddb2dddfcc2c04f3ef0c59032", "site_type": "news"}, "title": "Savvy Shopper: These specials offer something new", "published": "2017-04-19T08:39:57.000+03:00", "url": "http://omgili.com/ri/SEMpReyPU46QTAsQM2b8MYzMvlGkKLFndTFG6FprEFSlH3nLcMNm45eGX7kistyyVpPC23apXFgLUGr5qB_8Nhmg7orXe8hO0Ai8UVRGGnzcI3zqKQld7A--", "author": "newsengin", "crawled": "2017-04-19T08:39:57.000+03:00", "language": "english", "text": "Savvy Shopper: These specials offer something new \nThis Wednesday’s grocery highlights are putting the spotlight on specials that offer something new. \nWhile there are deals that offer bigger discounts, the products taking center stage today offer a story and extend the prospect of a new experience to go along with the savings: \nLa Michoacana Ice Cream Bars — As there are a lot of businesses with “Michoacana” in their name, I think I may have heard of this brand, but I don’t know that for a fact. However, one thing I do know for sure is that this is the first time I have seen this product on sale! \nIf you aren’t familiar with this item, now is a good chance to try it at a lower cost. With an established reputation and good reviews online (http://www.ytupaleta.com/), why not give it a shot? \nMobiSave and SavingStar — Many of the items on the chart have coupon matchups with MobiSave (http://www.mobisave.com/) and SavingStar (https://savingstar.com/coupons). Although I have included these online rebate programs in deal summaries before, I never made a point of highlighting these options until now. \nLike Ibotta and Checkout51, these cash back programs credit you when you submit your receipts online. What makes me like MobiSave and SavingStar more is that they have more matchups that work at Lubbock retailers. For our area, I consider Ibotta and Checkout51 to be a triumph of hope over experience. \nDr. Oetker Virtuoso Pizza — In psychology, cognitive dissonance is the discomfort a person experiences when confronted with new information that contradicts one of their beliefs. \nIt is so widespread that I think it even extends into culinary matters. By this, I mean that a common reason for someone not liking a dish is that they have a preconceived idea of the flavor, only to have it taste significantly different. \nThe ensuing violation of expectation requires that they reject the new option even though it is actually good on its own merits. Take frozen pizza. Although connoisseurs frown upon it, I only think it is because they are comparing it to the restaurant variety. If they would think of it as a different animal, they might understand its greatness. \nAt the same time, some frozen pizza is better than others. In that spirit, Dr. Oetker Virtuoso pizza is an attempt to give the Tombstones and Red Barons a run for the money. Being the No. 1 frozen pizza in Italy should be reason enough to try it. With a great sale price, it’s a closed case! \nTotis snacks — To save on school lunches, I noticed Totis snack sacks on sale for the first time. While they are economically priced in the first place, a sale makes a good thing better. In addition, with flavors different from Frito Lay, this kind of variety can literally be thought of as the spice of life. \nIn addition to these highlights, you can get access to over 100 spectacular offers at the provided links in the online article and on our Facebook page (https://www.facebook.com/LubbockSavvyShopper or log on to Facebook and enter “Lubbock Savvy Shopper” in the search tool). To get the best deals delivered to your news feed every Wednesday and Sunday, “Like” our Facebook page to experience even greater convenience and savings! When you find out about offers, innovative products, or outstanding restaurant specials, write to SavvyShopperLubbock@gmail.com. I answer all mail and am always interested in the latest and greatest. \nSEAN FIELDS is the A-J’s Savvy Shopper. Read his columns Sundays and Wednesdays. Email him at SavvyShopperLubbock@gmail.com, like his Facebook page at Facebook.com/LubbockSavvyShopper, or see previous columns and deals at lubbockonline.com/savvy-shopper. Advertisement", "external_links": [], "highlightTitle": "", "uuid": "863452107fb59b6ddb2dddfcc2c04f3ef0c59032", "highlightText": "", "rating": null}]