[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/0xd.sZhj5jepRzsvYgGXRgIPjmKpM_EBmTbY2vaOk3vn6iSgLJ1xyBxlt6RGDLSzxLKKZ_cYL87oDtJ37RnlwTn5aaWtx9ih", "title": "Bringing the Water(front) to the sea", "site_type": "blogs", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://cruisingwithhoney.blogspot.com/", "spam_score": 0.0, "section_title": "Cruising With Honey", "site": "blogspot.com", "site_full": "cruisingwithhoney.blogspot.com", "performance_score": 0, "uuid": "8763148dd0ef28e5d2e2dfc7697c1f7c16cfc62b", "published": "2017-04-17T11:24:08.000+03:00", "site_categories": [], "country": "US", "title_full": "Bringing the Water(front) to the sea", "participants_count": 1, "main_image": null}, "url": "http://omgili.com/ri/0xd.sZhj5jepRzsvYgGXRgIPjmKpM_EBmTbY2vaOk3vn6iSgLJ1xyBxlt6RGDLSzxLKKZ_cYL87oDtJ37RnlwTn5aaWtx9ih", "title": "Bringing the Water(front) to the sea", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:24:08.000+03:00", "language": "english", "entities": {"locations": [{"name": "pearl", "sentiment": "none"}, {"name": "pacific eden", "sentiment": "none"}, {"name": "pacific pearl", "sentiment": "none"}, {"name": "miss", "sentiment": "none"}], "persons": [{"name": "roger", "sentiment": "none"}, {"name": "toofik", "sentiment": "none"}, {"name": "rogelio", "sentiment": "none"}, {"name": "marius", "sentiment": "none"}, {"name": "marius cerniauskas", "sentiment": "none"}, {"name": "marius maitre", "sentiment": "none"}, {"name": "hope", "sentiment": "none"}], "organizations": [{"name": "black forest", "sentiment": "none"}, {"name": "chicken broth", "sentiment": "none"}, {"name": "p&o", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "8763148dd0ef28e5d2e2dfc7697c1f7c16cfc62b", "published": "2017-04-17T11:24:08.000+03:00", "author": "Honey Pen (noreply@blogger.com)", "text": "\n\nEating out is one of my favourite pastimes. Actually eating full stop. Combine that hobby with cruising, and I’m as happy as a pig-in-mud. \nI’ve written several reviews about eating on cruise ships; at specialty restaurants, the ‘buffets’ and the main dining room, but dining at the Waterfront aboard the Pacific Jewel was a little different as it was just my little poppet and myself. I was worried she’d be bored, but I really had nothing to worry about. \n(Click here for my Waterfront dining reviews on the PacificPearl and Pacific Eden ) \nBesides the nosh, what I really love about eating out is the company, sharing a meal with the people you love is one of life’s greatest gifts. I was looking forward to spending this bonding time with Hope as it is very rare that I get one-on-one time with each of my three girls, but would she feel the same way? \nOnce again, there was a familiarity stepping into the Waterfront. There was a similar set-up on the Eden and Pearl, although not identical. \nTip 1: Visit the Waterfront on Day 1 after you’re settled in your cabin, but the earlier the better. Book your preferred time (the crew taking you booking will give you the options available) and take the stress out wondering what time to eat dinner every night. You’ll be assigned your own table and waiters and you won’t have to wait more than a minute to be seated. It is important to stress here you aren’t bound to attend every night at the Waterfront, even if you booked your table. You might want to eat at the Pantry or Salt , order room service or just skip dinner all together. But, the polite thing to do is to give the W aterfront a quick phone call from your cabin and let them know you won’t be attending. \nTip 2: If you want to watch a show, keep in mind the times and book dinner before or after. \nTip 3: Port days you might be delayed in getting back, so booking a later dinner is advisable. \nTip 4: No bookings needed for Breakfast or Dinner, but you might have to wait a few minutes. \nDuring our 4-night cruise, we ate breakfast twice and dinner twice at the Waterfront. Our first breakfast was unfortunately cut short after an unexpected hurl. I forced little miss to order the pancakes – I mean she had just slumbered for 15 hours so I thought she was up to eating. Seated next to us was another lovely mum and daughter duo enjoying a cruise, how serendipitous. It was also rather calamitous as no-one wants to have breakfast with a side of vomit. However, the waiters were so lickety-spit quick to clean up, our new friends hardly noticed.   I bundled her up and carried her to ou r cabin for a warm shower. \nAnyhoo, by dinner-time word had gotten to the incredible Maître d Marius Cerniauskas and the fabulous Restaurant Manager Rogelio ‘Roger the Dodger’ Mercado that Hope hadn’t eaten all day. Fawning over her and making a real fuss, Marius and Roger told Hope she could have anything her heart (and tummy) desired. Anything. Both her and I were stunned by their attention, but they both reassured us that all they wanted was for Hope to have a wonderful birthday cruise. Tentatively she asked for spaghetti bolognaise, no meat, just tomato sauce and cheese. \nI was handed a menu (Spanish was the theme of the night) and ordered the Chicken Broth and Wontons and the Coral Trout with prawn and lobster sauce, potato patty and zucchini slivers. \nThe soup was perfect and I coaxed a few mouthfuls into my cherub who hadn’t eaten all day. Our waiter Toofik was impeccable and tried his best to make Hope smile and feel comfortable. \nSoon after, the biggest plate of spag bol was placed in front of Hope. Her eyes nearly popped out of her head, then immediately welled up with tears. Noticing her reaction, Toofik raced over and wondered what was upsetting her. “It’s.. too.. big! I can’t finish all this. It’s a waste of food…” and my heart just broke a little. \n“Don’t you worry little baby, whatever you can’t eat I will feed to the fishes! They will love it, so you are actually helping them!” \nRelieved, my little darling picked up her fork, twirled a long strand and started eating. First one mouthful, then another... ok good, it’s staying down… then a third. Great! Sighing a huge sigh of relief that she was finally eating and keeping it down, I could concentrate on my meal. A delicate, perfectly cooked fillet of trout was set before me, fresh and fragrant. Sublime and dainty, the fish was juxtaposed with the most delicious prawn and lobster sauce. Looking up, I asked Hope if she’d like to try some, but she was struggling with the pasta and I doubted she could eat anymore. Wasn’t I wrong! After one forkful of the fish (and her first ever taste of lobster) she moved her chair closer to mine and proceeded to open her mouth happily for the tasty morsels I was ‘aeroplane-ing’ into her little gob. Before I knew it, my plate was empty and my girl was sitting with an impish smile on her face. So, I did what mums do and finished off her leftovers. \n  \nDessert was a silky cream caramel for moi and chocolate éclairs with berry coulis for her. Very tasty and not too heavy. I think the mini éclairs were in the Pantry the next day, which is not unusual. Often you find similar or identical dishes in the Pantry - which isn’t a bad idea. \nI won’t go through breakfast as it’s very similar to my experience on the Pearl ( you can read it here ), however, our most memorable dinner was our last night on the Jewel and will certainly go down as one of those childhood memories my daughter will always look back on with happy tears. \nAs we sat at our table, there was a buzz in the air and, Roger standing behind Hope, sent me a surreptitious wink. Once again the waiters and Marius Maitre D greeted us warmly. I knew something was up when I wasn’t handed a desert menu. \nOur meal was delicious and this night there was a Lebanese theme. I ordered the lamb koftas and Hope had the salmon . \n\nThroughout our meal, Roger entertained Miss Hope with magic tricks and made her a lovely origami flower made from tissue paper. She was having the time of her life. And then, the finale. \nThe table were cleared and I saw no less than half-a dozen waiters approach, Hope was oblivious to all this and continued playing with her toy dogs. Suddenly, a huge Black Forest cake carried by our waiter emerged from the kitchen, astounding little Miss. The room erupted with ‘Happy Birthday’ as she looked around in amazement and blew out her candles. ( You can see the video here ). With glistening eyes, we thanked all the staff profusely and asked to share the cake with the other diners. \n\nDining isn’t just about the food, it’s the whole experience. Long after the flavours fade from your tastebuds, what’s left is a memory steeped in colours, aromas, conversation and laughs. I was overwhelmed with the generosity and hospitality of every crew member in the Waterfront. P&O excel at making both children and adults feel comfortable and creating a relaxed atmosphere. \n\nThe waiters work tirelessly, so please, fill out a feedback form and have their efforts recognised. I know I’m probably repeating myself, but Marius, you’re a class act and Roger, Hope still falls asleep staring at her paper-flower on her nightstand. \n\n\nIf you liked this post, please share by clicking on one of the social media buttons underneath ⤵⤵ ⤵ "}]