[{"entities": {"locations": [], "organizations": [], "persons": []}, "ord_in_thread": 25, "thread": {"site_full": "www.consumeraffairs.com", "site_section": "https://www.consumeraffairs.com/insurance/car.html", "domain_rank": 7480, "replies_count": 29, "country": "US", "section_title": "Find the Best Auto Insurance Companies | ConsumerAffairs", "title": "1,090 USAA Auto Insurance", "title_full": "Top 1,090 Complaints and Reviews about USAA Auto Insurance", "published": "2017-02-07T23:40:00.000+02:00", "url": "http://omgili.com/ri/.wHSUbtEfZQvaVUIteanqo9VoBSc8vJmkd7xQC8YSIxmTooSNBVmiEaf8xPVODDDwbd06iT0qtA2F28P2UOYNA--", "site": "consumeraffairs.com", "main_image": "", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 30, "performance_score": 0, "spam_score": 0.166, "uuid": "3d5b0c4b30e5d5c1ce687d736c108c2e3428852e", "site_type": "discussions"}, "title": "", "published": "2017-03-30T04:25:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZQvaVUIteanqo9VoBSc8vJmkd7xQC8YSIxmTooSNBVmiEaf8xPVODDDwbd06iT0qtC8obWVCM_SL7eVprn8n4rK", "author": "Zach of Salt Lake City, UT", "crawled": "2017-04-19T08:38:23.000+03:00", "language": "english", "text": "As many people have described I had a problem with automatic payments on three occasions. My calls date June 2016, November 2016, and March 2017. Upon each call I had called in to set up/resolve automatic payment problems. The first time I was told that it would be set up and no worries about having to call and check. I received a no pay notice about two months later. After checking the status of my Checking account I showed that the funds were plenty. The tech was capable of processing my payment manually, told me he had set up new auto payments. All was dandy until November where the same issue had happened. Upon calling and talking with the supervisor I was told that an automatic call would notify me upon no pay (requested because lack or internet/permanent location to receive mail).\nAll was good or so I thought when I received a notice of cancellation to the home address upon returning from my extended time away. Checked the account and all looked fine/funds available. Upon calling March 2017 the tech had read the notes from the previous call that stated an automatic call would notify me. She explained that they had no way to set up such notifications and whoever told me was misinformed. She also explained that because my account had been canceled I would have to reapply for a Quote: that would be more expensive.\nI detested this explaining that she had admitted that the problem was their fault and that charging me an additional $50 a month on top of my bill would cause me to walk. Did nothing to secure me. If you admit that the problem is caused by misinformation told to your customers you need to step up and fix the issue. Read THE REVIEWS AS MULTIPLE PEOPLE ARE HAVING THE SAME ISSUES.", "external_links": [], "highlightTitle": "", "uuid": "87cb9dfbf424fccf9575fb5a0730483613b3bad2", "highlightText": "", "rating": 1.0}]