[{"entities": {"locations": [{"name": "charlotte", "sentiment": "none"}, {"name": "nc", "sentiment": "none"}, {"name": "scottsdale", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "ppc", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "walmart", "sentiment": "none"}, {"name": "itr economics", "sentiment": "none"}, {"name": "recycled paperboard alliance/recycled paperboard technical association", "sentiment": "none"}, {"name": "national association of manufacturing", "sentiment": "none"}, {"name": "meadwestvaco", "sentiment": "none"}, {"name": "u.s. marine corps", "sentiment": "none"}, {"name": "nascar hall of fame", "sentiment": "none"}], "persons": [{"name": "tony curcio ron sasine", "sentiment": "none"}, {"name": "ron sasine", "sentiment": "none"}, {"name": "carolyn lee", "sentiment": "none"}, {"name": "rhodes", "sentiment": "none"}, {"name": "ben markens", "sentiment": "none"}, {"name": "joan sahlgren", "sentiment": "none"}, {"name": "paul schutes", "sentiment": "none"}, {"name": "alan beaulieu", "sentiment": "none"}, {"name": "principal of hudson windsor", "sentiment": "none"}, {"name": "shawn rhodes", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "graphicartsmag.com", "site_section": "http://graphicartsmag.com/feed/", "domain_rank": null, "replies_count": 0, "country": "US", "section_title": "Graphic Arts Magazine", "title": "Folding Carton Converters’ Outlook: Get ready for millennial moms and economic growth!", "title_full": "Folding Carton Converters’ Outlook: Get ready for millennial moms and economic growth!", "published": "2017-04-17T18:30:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZSENALWPS6NHgnv90IKZde8xWHjFj_v8EY7A5VtlySHOMfxXIlcmHGsfNflUscK5U.GknRVtwNUvnMnfIXa7elbPEwz_DilRI_YNXdZOKPhy0jqXtwlu_NZSD5P9GDVBD5CQmLTfXk6UQHX1iz0_.mA", "site": "graphicartsmag.com", "main_image": "https://graphicartsmag.com/app/uploads/2017/04/ppcspringmeeting3-in.jpg", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "88167d0683dc7d35f2f77d0dc7b87b3b7a503ca2", "site_type": "news"}, "title": "Folding Carton Converters’ Outlook: Get ready for millennial moms and economic growth!", "published": "2017-04-17T18:30:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZSENALWPS6NHgnv90IKZde8xWHjFj_v8EY7A5VtlySHOMfxXIlcmHGsfNflUscK5U.GknRVtwNUvnMnfIXa7elbPEwz_DilRI_YNXdZOKPhy0jqXtwlu_NZSD5P9GDVBD5CQmLTfXk6UQHX1iz0_.mA", "author": "Tony Curcio", "crawled": "2017-04-19T08:40:10.000+03:00", "language": "english", "text": "| Tony Curcio Ron Sasine address attendees at PPC’s recent Spring Meeting. \nThe Paperboard Packaging Council (PPC) held its Spring Outlook and Strategies Conference March 29-31, 2017 in Charlotte, NC. During the three-day event, leaders in the paperboard packaging industry learned the latest in consumer, economic and policy trends. Much of the conference focused around consumers and their attitudes toward paperboard packaging. Ron Sasine, Principal of Hudson Windsor and former executive for Walmart and MeadWestvaco (now WestRock), revealed that Millennial moms will make most of the important purchasing decisions affecting folding carton manufacturers over the next 30 years. These moms, along with other consumer demographics, are looking for companies that support their values – a significant one of which is sustainability. Fortunately, paperboard shines in this area, he added. Attendees also heard about sustainability and the consumer from Paul Schutes, Executive Director of the Recycled Paperboard Alliance/Recycled Paperboard Technical Association, and Joan Sahlgren, Director of Public Relations for the Paper and Packaging Board. Schutes reminded attendees that fibre-based packaging has an advantage in national campaign aimed at shifting consumer attitudes in favour of paper. Shawn Rhodes discusses management at PPC’s recent conference in Charlotte. \nImparting crucial knowledge around leadership and management, the program also featured Shawn Rhodes, former U.S. Marine Corps war correspondent turned organizational consultant, TEDx speaker, and author. \nRhodes explained that, despite the fact that many business leaders tend to think of change as out of their control, companies can plan for change and pivot when it occurs. To help leaders in attendance do just that, he laid out a three-pronged model around planning, process building and performance. \nPivoting to the hot topics of economic and political policy, attendees heard from Alan Beaulieu, economist and President of ITR Economics, who insisted that good days are ahead for the economy. He urged attendees to reset expectations and get ready for growth. To this end, converters should look for capacity restraints and also have discussions about the willingness to take on risk. Additionally, Carolyn Lee, Senior Director of Tax Policy at the National Association of Manufacturing, filled attendees in on the political side of the equation, reviewing the new Administration and Congress’ significant to-do list, with key issues such as healthcare, tax policy, and infrastructure destined for change and reform. Ben Markens. \n“At PPC’s conferences, folding carton executives learn the latest in economic, political and consumer trends, and also get leadership pointers on how to navigate through these complexities with their teams and companies,” said Ben Markens, PPC President. “I hope that members left our Spring Meeting feeling inspired, energized and prepared to move forward toward their goals and objectives.” In addition to presentations, the conference featured several breakout sessions including meetings of the Marketing & Sustainability, Membership, Canadian, Rigid Box, and Women’s Leadership Committees. Attendees also spent an exhilarating night at the NASCAR Hall of Fame. PPC’s next conference will take place October 4-6, 2017 in Scottsdale, Arizona. \nNow in its 88th year, the PPC is the leading industry association serving suppliers and converters of all forms of paperboard packaging. PPC works to grow, promote and protect the paperboard packaging industry while providing its members with resources and tools to compete effectively and successfully in the marketplace.", "external_links": [], "highlightTitle": "", "uuid": "88167d0683dc7d35f2f77d0dc7b87b3b7a503ca2", "highlightText": "", "rating": null}]