[{"uuid": "8871b922312afacce7b972c3bcc71fea592e0bd4", "url": "http://omgili.com/ri/3Ebkq4DFLEszQkNPVl1Ulz_fVMgvjsUqteSR_FJ4.udu6l8EGj1FKwZ0F2q7BCvoa2h5RyjJYRYAgy2kTE4.pQ--", "title": "Children’s Books for Earth Day", "author": "Katrina", "rating": null, "published": "2017-04-18T23:24:25.000+03:00", "highlightText": "", "entities": {"organizations": [], "locations": [], "persons": []}, "highlightTitle": "", "thread": {"uuid": "8871b922312afacce7b972c3bcc71fea592e0bd4", "url": "http://omgili.com/ri/3Ebkq4DFLEszQkNPVl1Ulz_fVMgvjsUqteSR_FJ4.udu6l8EGj1FKwZ0F2q7BCvoa2h5RyjJYRYAgy2kTE4.pQ--", "site_full": "outnumbered3-1.com", "title": "Children’s Books for Earth Day", "site_section": "http://outnumbered3-1.blogspot.com/feeds/posts/default", "domain_rank": null, "published": "2017-04-18T23:24:25.000+03:00", "title_full": "Children’s Books for Earth Day", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "Outnumbered 3 to 1", "site_type": "blogs", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://outnumbered3-1.com/wp-content/uploads/2017/04/reviewitem-5-700x992.jpg", "site": "outnumbered3-1.com"}, "external_links": [], "language": "english", "text": "You are here: Home / Books / Children’s Books for Earth Day Children’s Books for Earth Day April 18, 2017 by Katrina Leave a Comment I received a sample for review. All opinions are of my own. It is April and that means spring is finally in the air! With the world turning beautifully green and floral after a chilly winter it is time to celebrate Earth Day. Here are 3 Children’s Books for Earth Day and each are a great way to celebrate our planet! \nEvery volume of Science Comics offers a complete introduction to a particular topic—dinosaurs, coral reefs, the solar system, volcanoes, bats, flying machines, and more. These gorgeously illustrated graphic novels offer wildly entertaining views of their subjects. Whether you’re a fourth grader doing a natural science unit at school or a thirty year old with a secret passion for airplanes, these books are for you! \nThis volume: In Bats , we follow a little brown bat whose wing is injured by humans on a nature hike. He is taken to a bat rehabilitation center where he meets many different species of bats. They teach him how they fly, what they eat, and where they like to live. \nSCIENCE COMICS: BATS by Falynn Koch is listed for ages 9-13. It is a graphic novel but is science-oriented non-fiction which makes it pretty unique and “cool.” SCIENCE COMICS brings interesting facts, fun illustrations and critical eye to the problem while still offering up a solution. Reluctant readers and even boys will want to get their hands on this one! Lately Big Sis has really gotten into graphic novels and she has always had a thing for non-fiction so she spent her spare afternoon reading this one the moment it arrived. \nRivers wind through earth, cutting down and eroding the soil for millions of years, creating a cavity in the ground 277 miles long, 18 miles wide, and more than a mile deep known as the Grand Canyon. \nHome to an astonishing variety of plants and animals that have lived and evolved within its walls for millennia, the Grand Canyon is much more than just a hole in the ground. Follow a father and daughter as they make their way through the cavernous wonder, discovering life both present and past. \nWeave in and out of time as perfectly placed die cuts show you that a fossil today was a creature much long ago, perhaps in a completely different environment. Complete with a spectacular double gatefold, an intricate map and extensive back matter. \nGRAND CANYON by Jason Chin is listed for ages 6-9. This book offers an in-depth exploration of almost every aspect of the Grand Canyon while following a father and daughter team on a long hike. From the past to the present this is quite the elaborate story on the Grand Canyon. Even I learned a few things! \nWILDLIFE: A MAP COLORING BOOK by Natalie Hughes is a big coloring book listed for ages 6-12. E ach page has a perforated edge so your little artist can tear it out and display their completed maps! Bold illustrations are filled with small snippets of information and bite-sized captions, making this book a great way to learn about and explore the world around you! \nEach book offers something special to teach kids a little more about our beautiful Earth. For Earth Day we always enjoying picking out books specifically to fit the theme and these are absolutely perfect! Connect: You can connect with Macmillan Children’s Publishing Group on Facebook and @MacKidsBooks on Twitter . \nSave", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:25.000+03:00"}]