[{"entities": {"persons": [{"sentiment": "none", "name": "pilkington"}], "organizations": [{"sentiment": "positive", "name": "amazon"}], "locations": [{"sentiment": "none", "name": "amazon"}]}, "text": "April 17, 2017 • 1 comment Is Kindle Unlimited a Good Idea? \nAmazon has developed a lot of programs over the years, some aimed at making the customer experience better, others intended to take care of its worldwide stable of authors. Unfortunately, the hush-hush nature that all book retailers and publishers have about sales figures can mean that the public doesn’t have full transparency about the process. \nOne source has now broken down the information in a Data Guy-kind of way, examining the likely numbers behind Kindle Unlimited. Written Word Media’s report , while certainly based on a fair amount of speculation, has some solid math behind it. Their take on it examines whether or not KU subscriptions are good for reading consumers, as well as whether or not authors actually stand to benefit from the exclusive requirements that go along with listing their books through KU. \nBacking up, Kindle Unlimited is not to be confused with other programs like Prime Reading or merely KDP Select. Listing a book in KDP Select is certainly a requirement for putting it in Kindle Unlimited, but not for Amazon choosing to enroll a book in Prime Reading. Customers must pay a $9.99 per month subscription fee to read the one million-plus titles in Kindle Unlimited, and authors must sell their books exclusively on Amazon in order to put their books in front of those paying readers. \nWritten Word Media broke down how many subscribers there might be, and correlated that to the results of their own survey, which resulted in a highly educated guess as to how many books KU subscribers actually read in a month. For the full breakdown of their discovery, check out their report here . But a few eyebrow-raising data points include: \n• It’s likely that there are 2.5 Million active readers enrolled in KU. • KU readers read more books and review books at a higher rate. • 77% of KU subscribers go on to purchase books outside of the program. • 60% of the best selling titles on the Amazon paid charts were enrolled in KU. • 88 of the top 100 romance books on the bestseller charts were enrolled in KU. \nSo is exclusivity–and therefore Kindle Unlimited readers–a good thing for authors? There are strategies that can make it very lucrative as a marketing and visibility tactic, and is something that authors should consider. As for customers, membership depends solely on how much value you get from the subscription fee. If you don’t read enough to justify the ten bucks a month, perhaps not. If you do devour your books, you certainly have a lot to choose from. Mercy Pilkington ( 2078 Posts ) \nMercy Pilkington is a Senior Editor for Good e-Reader. She is also the CEO and founder of a hybrid publishing and consulting company.", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "88f24b01ae5c22d6917ee1d04ac5b5ad0190e115", "rating": null, "highlightTitle": "", "title": "Is Kindle Unlimited a Good Idea?", "thread": {"country": "US", "site": "goodereader.com", "replies_count": 0, "title_full": "Is Kindle Unlimited a Good Idea?", "site_categories": [], "performance_score": 0, "section_title": "Good E-Reader – eBook, Audiobook and Digital Publishing News", "domain_rank": 65738, "uuid": "88f24b01ae5c22d6917ee1d04ac5b5ad0190e115", "main_image": "http://goodereader.com/blog/uploads/images/kindle-unlimited-100358732-orig2-1.png", "site_type": "blogs", "title": "Is Kindle Unlimited a Good Idea?", "spam_score": 0.0, "site_section": "http://goodereader.com/blog/feed/", "url": "http://omgili.com/ri/_DuQb1SwTFp69_.WaL1MT07zzeywi42CBWq1bmpYQuDN8Le_Xr5jg8xaFNO3UjPn.mxK_Pmz2rkxyw4niwKGu4eBR_XxEuZoCxdhJHEKIYM-", "participants_count": 1, "site_full": "goodereader.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-17T22:53:00.000+03:00"}, "crawled": "2017-04-18T11:25:21.000+03:00", "url": "http://omgili.com/ri/_DuQb1SwTFp69_.WaL1MT07zzeywi42CBWq1bmpYQuDN8Le_Xr5jg8xaFNO3UjPn.mxK_Pmz2rkxyw4niwKGu4eBR_XxEuZoCxdhJHEKIYM-", "highlightText": "", "published": "2017-04-17T22:53:00.000+03:00", "author": "Mercy Pilkington"}]