[{"uuid": "89b323748a64b0873ecb03b200037feb9be9b049", "url": "http://omgili.com/ri/jHIAmI4hxg8WCUq24hJm5V9yJGhVBl9jScYNlCPvOLvJ8tvGak9Jsobw2CMi8H84_aUhpuQymqot5a64KRG3iQMYDVHl1xIttJMh0yNSBmi.oJCb2AXbmENSleIQATxkoUqz8Qi5gcRfohq5VRVAyA--", "title": "Florida Congressional Reps Call for Tougher Action Against North Korea", "author": "Kevin Derby", "rating": null, "published": "2017-04-18T20:37:00.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "florida congressional reps call for tougher action against north korea florida congressional reps call for tougher action against north korea by kevin derby", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "pacific subcommittee", "sentiment": "none"}, {"name": "house foreign affairs committee", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "r-fla.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "d-calif.", "sentiment": "none"}, {"name": "d-ny", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "yoho", "sentiment": "none"}, {"name": "korean peninsula", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "d-fla.", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}], "persons": [{"name": "ted yoho", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "kim jong-un", "sentiment": "none"}, {"name": "eliot engel", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "brad sherman", "sentiment": "none"}, {"name": "shinzo abe", "sentiment": "none"}, {"name": "ileana ros-lehtinen", "sentiment": "none"}, {"name": "lois frankel", "sentiment": "none"}, {"name": "yoho", "sentiment": "none"}, {"name": "ros-lehtinen", "sentiment": "none"}, {"name": "frankel", "sentiment": "none"}, {"name": "yun byung-se", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "89b323748a64b0873ecb03b200037feb9be9b049", "url": "http://omgili.com/ri/jHIAmI4hxg8WCUq24hJm5V9yJGhVBl9jScYNlCPvOLvJ8tvGak9Jsobw2CMi8H84_aUhpuQymqot5a64KRG3iQMYDVHl1xIttJMh0yNSBmi.oJCb2AXbmENSleIQATxkoUqz8Qi5gcRfohq5VRVAyA--", "site_full": "www.sunshinestatenews.com", "title": "Florida Congressional Reps Call for Tougher Action Against North Korea", "site_section": "http://www.sunshinestatenews.com/story-feed.xml", "domain_rank": null, "published": "2017-04-18T20:37:00.000+03:00", "title_full": "Florida Congressional Reps Call for Tougher Action Against North Korea", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "All Stories", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://www.sunshinestatenews.com/sites/default/files/story_images/tedyoholoisfrankel-sunshinestatenews.jpg", "site": "sunshinestatenews.com"}, "external_links": [], "language": "english", "text": "Florida Congressional Reps Call for Tougher Action Against North Korea By Kevin Derby April 18, 2017 - 8:30am \nAs tensions rise between the United States and North Korea, two congressional representatives from the Sunshine State are calling for getting tough with the Communist regime running that nation. \nU.S. Rep. Ted Yoho, R-Fla., is the vice chairman of the House Foreign Affairs Committee and the chairman of the Asia and the Pacific Subcommittee. After North Korea’s failed missile launch at the end of last week, Yoho took aim at the North Korean leadership, slamming “Kim Jong-un’s complete disregard for international law and determination to obtain a nuclear weapon capable of striking the continental United States.” \nThe North Florida congressman urged tougher action against North Korea after the missile test. \n“Such belligerent action cannot and should not be rewarded with a simple slap on the wrist,” Yoho insisted. “Instead, we need to take real action. \n“Through targeted, secondary sanctions on foreign companies that continue to do business with Pyongyang, we can hit Kim Jong-un where it hurts most: the wallet,” Yoho added. “Kim relies on these funds for his illicit nuclear and missile programs, and we must use every tool we have to deny him the hard currency he needs.” \nYoho urged President Donald Trump and the State Department to include North Korea as a state sponsor of terror. Currently, a president can remove a nation from the State Department’s list of state sponsors of terrorism after a six month period. In January , Yoho brought back a proposal extending that period to two years. His legislation also doubles the amount of time Congress has in reviewing the executive branch’s decision to remove a nation from the state sponsor of terror list from 45 days to 90 days. \n“The administration also needs to reinstate North Korea as a state sponsor of terror,” Yoho said. “These decisive actions will send a clear message to the international community as a whole that the United States is committed to peace on the Korean Peninsula and will do what is necessary to achieve it.” \nEarlier this month , Yoho and U.S. Rep. Ileana Ros-Lehtinen, R-Fla., paired up with U.S. Rep. Eliot Engel, D-NY, the ranking Democrat on the House Foreign Affairs Committee, and U.S. Rep. Brad Sherman, D-Calif., to unveil a proposal extending the North Korean Human Rights Act of 2004, which Ros-Lehtinen has championed during her long tenure in Congress. The legislation “continues current authorities for North Korea-focused activities to promote human rights and democracy, refugee protection, and freedom of information (including broadcasting), as well as the U.S. Special Envoy on North Korean Human Rights Issues\" and “continues reporting aimed at increasing transparency and accountability for any food aid provided to North Korea.” \nYoho is not the only member of the Florida delegation focused on North Korea in recent days. U.S. Rep. Lois Frankel, D-Fla., was part of a congressional delegation which toured American military stations in Asia last week, including the demilitarized zone dividing North and South Korea. Frankel and the other representatives met with Japanese Prime Minister Shinzo Abe, South Korean Minister Yun Byung-se and military experts. \nOn Monday, Frankel weighed in on the situation in Asia, calling for continued support of Japan and South Korea. \n“A strong unwavering relationship between the U.S. and its allies Japan and South Korea is necessary for the national and economic security of all three countries,” Frankel said. “Japan and South Korea are two of America's greatest trading partners and home to important U.S. military bases. A North Korea that has the capability to use a nuclear weapon that can reach an American city or those of an ally poses a grave challenge as the U.S. seeks to preserve peace and stability in the region. \n“In this regard, the United States, in consultation with Japan and South Korea, must explore all reasonable economic, diplomatic and defensive actions such as cyber that would prevent North Korea from developing such a capability,” Frankel added. “This includes further engagement with and economic pressure on China, which North Korea depends upon for 90 percent of its trade. A military strike is an untenable option that would most likely result in a devastating conventional military attack by North Korea on Seoul, South Korea, a megacity with a population of over 25 million including tens of thousands of U.S. military personnel.”", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:29.000+03:00"}]