[{"entities": {"persons": [{"sentiment": "none", "name": "o’sullivan"}, {"sentiment": "none", "name": "jim o’sullivan"}], "organizations": [{"sentiment": "none", "name": "worklo"}, {"sentiment": "none", "name": "uncategorized"}, {"sentiment": "none", "name": "construction news"}, {"sentiment": "none", "name": "national audit office"}, {"sentiment": "none", "name": "cdf"}, {"sentiment": "none", "name": "department for transport"}], "locations": [{"sentiment": "none", "name": "peterborough"}, {"sentiment": "none", "name": "uk"}, {"sentiment": "none", "name": "england"}]}, "text": "April 18, 2017 3dpersonnelblog British construction new , Construction news , Uncategorized 0 Workloads could double from current levels to £4bn a year under the next roads spending programme, Highways England’s chief executive has said. \nJim O’Sullivan told Construction News that early forecasting of supply chain capacity estimated that £4bn of capital work could be carried out on the UK’s strategic roads from 2020, up from the £2.9bn expected to be spent in the final financial year of the Roads Investment Strategy (RIS). \nMr O’Sullivan said the £4bn was an estimate at present, describing it as “just a mark on the wall”. But he added: “When I talk to the supply chain they think they can deliver £4bn a year.” \nAccording to Highways England’s latest delivery plan, the £2bn spent in 2016/17 on capital projects will grow to £2.9bn in 2020. \nMr O’Sullivan said that, depending on the government’s future spending commitments, the £4bn figure for the investment plans beyond the current programme was realistic. \n“It is not a massive step up,” he said. “It definitely looks like something our supply chain can deliver, and talking to senior people within our supply chain they think this is reasonable.” \nThe comments come in the wake of a National Audit Office report into the RIS. \nThe report revealed at least 16 projects posed a risk to value for money and were being reviewed by Highways England and Department for Transport, with options including cancellations, delays, design changes or merging of projects. \nMr O’Sullivan said the report was “balanced and objective” and raised issues that Highways England needed to address. \nThe organisation is currently looking at re-profiling work along regional corridors to ensure the proportion of RIS projects started in its final year is reduced. \nMr O’Sullivan used the example of the road network from Peterborough to the coast, across which seven projects are all scheduled to start in 2020. \nHe said: “If we start the first scheme when we are supposed to start the first scheme and finish the last scheme when we are [supposed] to finish the last scheme, we can rearrange all of the schemes in between to minimise congestion and optimise the supply chain.” \nHighways England’s proposals would see 10 projects brought forward and nine pushed back from their current start dates. \nThis month Highways England is hosting an event with suppliers in which it will outline early plans on what the organisation’s planned Routes to Market framework might look like. \nMr O’Sullivan also said the organisation is looking to adapt its procurement model from the current “one size fits all” approach used on RIS 1 so far. \nHe confirmed that some of RIS 2’s biggest projects would be procured outside of the framework, and that the new agreement would do away with mini bids. \nHighways England is also assessing whether to adopt an alliancing model for its smart motorways programmes. \nMr O’Sullivan said those currently on Collaborative Delivery Framework (CDF) would not necessarily be guaranteed a spot on the new framework and he expected to see new entrants enter the running. \nIn February Construction News revealed that only £2.7bn had been spent on roads projects through CDF, including only £36m through lot two for projects under £50m. \nMr O’Sullivan said lot two had been squeezed as a result of the increase in size of Highways England’s renewals programme. \n“I think it is fair to say we thought lot two would be a lot bigger than [it now is],” he said. \n“What we need to do is forecast work more effectively – perhaps the biggest issue last time round was the forecasting of work, but hindsight is great.” \nThis article was first seen on: https://www.constructionnews.co.uk/markets/sectors/roads/highways-chief-contractors-could-deliver-4bn-of-roadworks-a-year/10019102.article?blocktitle=Latest&contentID=14651 Share this:", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "8a1d915212a2b3f05d2cd933ad82fdfd775c07ff", "rating": null, "highlightTitle": "", "title": "Highways chief: Contractors could deliver £4bn of roadworks a year", "thread": {"country": "US", "site": "3dpersonnelblog.com", "replies_count": 0, "title_full": "Highways chief: Contractors could deliver £4bn of roadworks a year", "site_categories": [], "performance_score": 0, "section_title": "", "domain_rank": null, "uuid": "8a1d915212a2b3f05d2cd933ad82fdfd775c07ff", "main_image": "https://h1m9xazj7tlyitm0-zippykid.netdna-ssl.com/wp-content/uploads/2017/04/3063977_Jim-OSullivan-CEO-Highways-England.jpg", "site_type": "blogs", "title": "Highways chief: Contractors could deliver £4bn of roadworks a year", "spam_score": 0.0, "site_section": "https://3dpersonnelsite.wordpress.com/feed/", "url": "http://omgili.com/ri/.wHSUbtEfZSNvcN7YOvQUPsVOpWBrf7RdNypILMTaMG4q7qDg_lsA8e2byZ2XLoByDrA8RxNFeqw0OG1G2iE0At0JMRYarmnBorJHDugsroMDrr9VDpAbxDufOd0rvmL", "participants_count": 1, "site_full": "3dpersonnelblog.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:26:02.000+03:00"}, "crawled": "2017-04-18T11:26:02.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZSNvcN7YOvQUPsVOpWBrf7RdNypILMTaMG4q7qDg_lsA8e2byZ2XLoByDrA8RxNFeqw0OG1G2iE0At0JMRYarmnBorJHDugsroMDrr9VDpAbxDufOd0rvmL", "highlightText": "", "published": "2017-04-18T11:26:02.000+03:00", "author": "3dpersonnelblog"}]