[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:14:55.000+03:00", "author": "keiseeeinthecity", "entities": {"persons": [{"name": "rucy", "sentiment": "none"}], "locations": [{"name": "korea", "sentiment": "none"}], "organizations": [{"name": "vanity makeup review", "sentiment": "none"}, {"name": "vanity cosmetics", "sentiment": "none"}, {"name": "vanity", "sentiment": "none"}, {"name": "lip & cheek tint", "sentiment": "none"}, {"name": "fda", "sentiment": "none"}, {"name": "vanity gleamy lavish waterproof mascara", "sentiment": "none"}, {"name": "vanity lip & cheek red 8ml", "sentiment": "none"}, {"name": "vanity liquid eyeliner", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "derm plus korea co., ltd", "sentiment": "none"}, {"name": "liquid eyeliner", "sentiment": "none"}, {"name": "youtube", "sentiment": "none"}]}, "text": "\nMy personal review and first impression on make up products from Rucy’s Vanity Cosmetics. Also a giveaway at the end of the post!\n\nRucy’s Vanity is a cosmetics brand that offers a wide range of high quality Korean skincare and cosmetic products for both men and women. It is a FDA approved Philippine brand but their products are 100% made in Korea, manufactured with its affiliated company – Derm Plus Korea Co., Ltd. Rucy’s Vanity initially targets budget-conscious Filipino consumers, which value both affordability and quality of their skincare and cosmetic products.\nNow, Rucy’s Vanity are generous enough to send me some of their face make up products to try; namely, Auto Eyebrow Pencil, Gleamy Lavish Waterproof Mascara, Liquid Eyeliner, Lip & Cheek Tint and a Two-Way Cake .\n\nBelow are my first impression review on each of the products.\n1. Auto Eyebrow Pencil Packaging is simple and clean that’s mainly black with white lettering. I personally like the spin-to-pull-up applicator because it’s easy to use. You can draw mini strokes on your eyebrows that needs to be filled in. I just wish it came with a spoolie on the other end, but overall its a nice product that I would definitely see myself using more!\n2. Rucy’s Vanity Gleamy Lavish Waterproof Mascara , 7ml It is said to be hypo-allergenic, sweat resistant and water-proof mascara. It would be nice if i was able to try it while swimming so I could really tell how waterproof it is but I really like how it makes my lashes appear longer than normal after a few coats. It also doesn’t feel heavy in the eyes which is a thumbs up for me!\n3. Rucy’s Vanity Liquid Eyeliner , 7ml It comes with a dip brush applicator which is honestly what i’m not used to. I’ve been using brush pen type of eyeliner ever since so it was kind of hard for me to apply this but I manage nevertheless (as you can see in the video below). If you’re used to a dip brush type then this is perfect for you. Its long lasting and\na water-proof eyeliner with deep black pigmentation that last whole day without smudging!\n4. Rucy’s Vanity Lip & Cheek Red 8ml This one’s very pigmented! You might want to put a little of the product first because you don’t want to walk with tomato cheeks down the streets, do you? A little goes a long way. You can always add more product to get your desire color. On the lips though I find it too sticky for my liking. I prefer to use it more on my cheeks. Size is perfect for carrying everyday because its small (but not super small) and it doesn’t occupy so much space in your bag/purse.\n5. Two Way Cake SPF 35 PA ++ 12g A 2-in-1 product that combines the goodness of foundation and powder in one with added protection from UV rays. It is said to be whitening and non-cakey but I can’t tell just yet because I haven’t wore it out that much. I’ll update you for sure but so far it does make your face matte and look flawless. This is perfect for travel since it’s a foundation and powder in one. Available in 2 shades – #21 Natural Beige and #23 Dark Beige. I have the #21 shade and it was good for my skintone. Maybe add a little bronzer if you want more depth in your face. It also comes with an applicator (perfect for touch ups) and I love how the packaging has a mini divider between the product and the applicator. I personally like to use a brush when applying this though.\nI hope you find this helpful. I also made a video on my Youtube channel using these products! Tell me what you think and subscribe if you haven’t already!\n\nAlso, since my birthday is coming up and because I love you guys so much, I’M DOING A BIRTHDAY GIVEAWAY! \n\nOne lucky winner will bring home two of Rucy’s Vanity products – the Liquid Eyeliner and the Gleamy Lavish Waterproof Mascara (shown above) by simply following the steps below:\n1. Follow me @keiseee and @rucysvanityph on Instagram\n2. Like my on Facebook page (fb.com/KeiseeeintheCity)\n3. Find the same photo above on my Instagram and repost with the hashtags #KeiseeeintheCityGiveaways #KeiseeeXrucysvanityph. Don’t forget to set accounts on public so we could see your entries!\n4. Comment Done on my Instagram photo and tag 2 of your friends\n5. Additional entry if you subscribe and like my Rucy’s Vanity video on YouTube. Comment on my YouTube video when done.\nThats it!\nContest is open nationwide and runs for a week so make sure to follow me on Instagram because I will announce the winner there. Goodluck! <3\nThank you so much for the love Rucy’s Vanity! You can place orders on their website at www.rucysvanityph.com . I heard they are having an ongoing 20% off summer sale! Follow them on instagram and facebook for more!\n", "url": "http://omgili.com/ri/.wHSUbtEfZRvbo7Pph9c8bAtY1.zfKJYW6oSDIT5a5d4.sduChx1Ptd7dlGRKZ7T14GEGslsHbhejgItL1ybZGU4gHwP2seTN1R2BxZUg6r71xpDhiVS3A--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T00:01:00.000+03:00", "language": "english", "title": "Rucy’s Vanity Makeup Review + GIVEAWAY", "thread": {"title_full": "Rucy’s Vanity Makeup Review + GIVEAWAY", "site_full": "keiseeeinthecity.wordpress.com", "site": "wordpress.com", "site_section": "https://keiseeeinthecity.wordpress.com", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Rucy’s Vanity Makeup Review + GIVEAWAY – keiseeeinthecity | A cebu fashion and lifestyle blog", "url": "http://omgili.com/ri/.wHSUbtEfZRvbo7Pph9c8bAtY1.zfKJYW6oSDIT5a5d4.sduChx1Ptd7dlGRKZ7T14GEGslsHbhejgItL1ybZGU4gHwP2seTN1R2BxZUg6r71xpDhiVS3A--", "published": "2017-04-16T00:01:00.000+03:00", "title": "Rucy’s Vanity Makeup Review + GIVEAWAY", "uuid": "8ca586d932788d4a89ebc4c3a7c6387497461646", "main_image": null}, "uuid": "8ca586d932788d4a89ebc4c3a7c6387497461646", "ord_in_thread": 0}]