[{"uuid": "8d6d95d0a381bfe4bca350724149f22f4c2395f5", "url": "http://omgili.com/ri/.wHSUbtEfZRBhehhEp6TO3lE.PJ4DIP3hcOGbuGf7S1qRaI67Du2b4JU5Ab.v1pA", "title": "MD Diet Review", "author": "Andrew (Editor)", "rating": null, "published": "2017-04-18T23:24:40.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "fda", "sentiment": "none"}, {"name": "united states drug and food administration", "sentiment": "none"}], "locations": [{"name": "leptigen", "sentiment": "none"}, {"name": "salt lake city", "sentiment": "none"}, {"name": "qsymia", "sentiment": "none"}, {"name": "orem", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "contrave", "sentiment": "none"}], "persons": [{"name": "bleviq", "sentiment": "none"}, {"name": "saxenda", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "8d6d95d0a381bfe4bca350724149f22f4c2395f5", "url": "http://omgili.com/ri/.wHSUbtEfZRBhehhEp6TO3lE.PJ4DIP3hcOGbuGf7S1qRaI67Du2b4JU5Ab.v1pA", "site_full": "www.dietspotlight.com", "title": "MD Diet Review", "site_section": "http://www.dietspotlight.com/feed", "domain_rank": 44738, "published": "2017-04-18T23:24:40.000+03:00", "title_full": "MD Diet Review", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "Diet Spotlight", "site_type": "blogs", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "", "site": "dietspotlight.com"}, "external_links": [], "language": "english", "text": "We scoured the web for facts on MD Diet side effects, clinical research, and program elements. We also found and read hundreds of reviews. Finally, we condensed the information to give you the bottom line. MD Diet Readers:   Leptigen. What Is the MD Diet Plan? \nThe MD Diet plan is a diet that focuses on focused physician treatments and HCG programs. They have two centers in Salt Lake City and Orem, Utah. Although they allow regular food, they also provide healthy foods to purchase from their clinics. \nA full monthly program of the medical weight-loss program costs about $100. The HCG Diet costs four times that amount for a month. This program usually comes with consultation from a physician and plans for exercise and diet, which seems reliable, but read on… Does the \"MD\" make this one more effective at helping you reach your weight-loss goals? HCG Diet – “The Main Eating Plan on MD Diet” \nThe first problem we found with MD Diet was the HCG Diet. This diet is a part of their program. “HCG is a female hormone produced while a woman is pregnant,” said our Research Editor. “Upon research, we found some issues with this hormone, which is not good news for this company.” \nThe MD Diet website says, “HCG can be used for rapid weight loss (as much as one pound per day in some cases).” \nHowever, many government organizations and administrations have advised against injecting, or taking, this hormone for weight-loss. \nThe United States Drug and Food Administration wrote, “…HCG weight-loss products marketed over-the-counter (OTC) that are identified as “homeopathic” and direct users to follow a severely restrictive diet.” However, it seems as if this is an unsafe dietary practice. \nThe website goes on to say, “FDA advises consumers who… purchased HCG for weight loss to stop using it, throw it out, and stop following the dieting instructions.” \nRegarding weight-loss, the FDA says, “FDA approves HCG as a prescription drug for the treatment of female infertility and other medical conditions…not recommended for weight loss.” \nThis problem echoes throughout the world. A study performed in Germany found that “…hCG is ineffective in dieting.” \nScroll below for one of the best products we have seen in the past year. Scroll   Qsymia Injections – “Is This the Best Way to Lose Weight?” \nThe second issue we found with the MD Diet plan was the inclusion of Qsymia injections in their diet. According to their website, it is a “lifestyle medication is an appetite suppressant and metabolic stimulator with years of testing behind it.” \nThe FDA has some opinions about this as well. \nThe website says, “Qsymia [is a] lifelong therapy [for] patients who respond to and tolerate them.” \nThey continued, saying, “If, after 12 weeks, a patient has not lost 3% of his/her weight on…Qsymia, FDA recommends that treatment is discontinued.” \nAfter researching diet products for years, we found that it can take something that seems small to slash the chance of long-term results. If the MD Diet has issues with their Qsymia injections and the HCG diet, then there is a problem. The Science – “Are There Any Studies?” \nUnfortunately, we could not find any studies testing the legitimacy of the MD Diet plan and their claims. However, aspects of the diet have been put under scrutiny, most of which is not positive. The safety of the diet can be easily put into question. However, some of the medications are backed by research and shown to work. The medications include Bleviq, Contrave, Naltrexone and Saxenda.   the MD Diet Work? \nWhat the final take in our MD Diet review? Well, we like that real doctors back the diet. However, we have some concerns about the safety of the HCG diet and the effectiveness of the Qsymia injections. For these reasons, we don’t feel comfortable recommending this diet. \nIf you want to lose weight, we think you should choose a supplement that is safe for consumption that you don’t have to inject. \n  we have seen this year is one called Leptigen . Its formula is a proprietary blend of four ingredients, which have been shown in published clinical research to help accelerate fat loss and boost metabolism. \nThey are now offering customers a Special Trial Offer ; a sign of confidence in their supplement. Get Your Sample Today   Does the \"MD\" make this one more effective at helping you reach your weight-loss goals?  ", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:40.000+03:00"}]