[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/uBQNNiLKiWarOBJfFzTgVofOoNADvX6AcQWiujlO0bOspNhy71oeSN5gSHSNZCRpCmla_bjVTusQxVKLc1lI.Mzx1MrAOvS8xJKy4fY23gAtbiwhbLkHyLn5HrJN5g_fV5ZS24p37f6Rb_aZYIIuLclVgvHIzEMQZwY8I2Nh2yx4oeT0NBS_NEOcqnoDFTsY", "title": "Marriott International Appoints Julian Lowry General Manager of Le Meridien Phuket Beach Resort", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://hotelexecutive.com/rss.xml", "spam_score": 0.0, "section_title": "HotelExecutive.com - Your view from the top", "site": "hotelexecutive.com", "site_full": "hotelexecutive.com", "performance_score": 0, "uuid": "8de8094bf92f421eb3c51998f5ecd326250679c5", "published": "2017-04-17T08:00:00.000+03:00", "site_categories": [], "country": "US", "title_full": "Marriott International Appoints Julian Lowry General Manager of Le Meridien Phuket Beach Resort", "participants_count": 0, "main_image": ""}, "url": "http://omgili.com/ri/uBQNNiLKiWarOBJfFzTgVofOoNADvX6AcQWiujlO0bOspNhy71oeSN5gSHSNZCRpCmla_bjVTusQxVKLc1lI.Mzx1MrAOvS8xJKy4fY23gAtbiwhbLkHyLn5HrJN5g_fV5ZS24p37f6Rb_aZYIIuLclVgvHIzEMQZwY8I2Nh2yx4oeT0NBS_NEOcqnoDFTsY", "title": "Marriott International Appoints Julian Lowry General Manager of Le Meridien Phuket Beach Resort", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:26:17.000+03:00", "language": "english", "entities": {"locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "cambodia", "sentiment": "none"}, {"name": "le méridien phuket", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "phuket beach", "sentiment": "none"}, {"name": "le méridien phuket beach resort", "sentiment": "none"}, {"name": "bahrain", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "phuket", "sentiment": "none"}], "persons": [{"name": "le meridie", "sentiment": "none"}, {"name": "julian lowry", "sentiment": "none"}, {"name": "saint martin", "sentiment": "none"}, {"name": "dominic", "sentiment": "none"}, {"name": "nathan", "sentiment": "none"}, {"name": "rudolf borgesius", "sentiment": "none"}, {"name": "karl hudson", "sentiment": "none"}, {"name": "nicola", "sentiment": "none"}, {"name": "julian", "sentiment": "none"}], "organizations": [{"name": "marriott international", "sentiment": "none"}, {"name": "le meridien phuket beach resort appointments & promotions marriott international", "sentiment": "none"}, {"name": "hotel business review", "sentiment": "none"}, {"name": "hotelexecutive.com", "sentiment": "none"}, {"name": "le méridien", "sentiment": "none"}, {"name": "sheraton heathrow hotel", "sentiment": "none"}, {"name": "marriott international area", "sentiment": "none"}, {"name": "le meridien phuket", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "8de8094bf92f421eb3c51998f5ecd326250679c5", "published": "2017-04-17T08:00:00.000+03:00", "author": "", "text": "Appointments & Promotions Marriott International Appoints Julian Lowry General Manager of Le Meridien Phuket Beach Resort Julian Lowry was previously the Executive Assistant Manager from October 2015 and joined Le Meridien Phuket in December 2008 as Director of Food & Beverage. \nPHUKET, TH. April 17, 2017 - Karl Hudson, Marriott International Area Vice President for Thailand, Vietnam, Cambodia, and Myanmar recently announced the appointment of Julian Lowry as General Manager of Le Méridien Phuket Beach Resort. \nPrior to his appointment, Julian was the Executive Assistant Manager of the Resort from October 2015. He joined Le Méridien Phuket in December 2008 as Director of Food & Beverage. \n\u0093I am pleased to announce Julian\u0092s appointment as General Manager of Le Méridien Phuket Beach Resort,\u0094 says Karl Hudson. Julian draws on \u0093a solid 30-year career that includes leadership roles in Culinary, Food and Beverage and overall resort management,\u0094 he adds. \nJulian oversees operations at the stunning property that is next to a secluded beach and features 470 rooms and suites, 10 restaurants and bars, spa, and an onsite conference centre that was completely renovated in May last year. The Resort is set to renovate its free-form pool \u0096 one of two oversized outdoor pools overlooking the Andaman sea \u0096 from 22 April to 31 July, in line with its 30th Anniversary celebration in November this year. \nJulian\u0092s career began with the Sheraton Heathrow Hotel, United Kingdom in 1987 where he was 1st Commis Chef. From there he continued on to work in diverse locations as Germany, France, the state of Qatar, Nigeria, Saint Martin, Georgia and Bahrain. An accomplished chef, he led multinational culinary teams in state banquets for several world leaders, often personally crafting signature dishes at high-profile events. \nJulian is an avid runner, often in tandem with his 10-year-old son Nathan. He also enjoys travelling with the rest of his family including his wife Nicola to familiar and new destinations where he sharpens his photography skills whilst exploring. His eldest son Dominic is 21 and studying in the UK for a bachelor\u0092s degree in international hospitality management. \nJulian is replacing Rudolf Borgesius who is taking a well-deserved retirement after 36 years of service with Le Méridien brand including 16 years with Le Méridien Phuket. \nContact: {hnw-categories} Acquisitions & Hotel Openings Coming Up In The May Online Hotel Business Review Feature Focus Eco-Friendly Practices: The Value of Sustainability The hotel industry continues to make remarkable progress in implementing sustainability policies and procedures in their properties throughout the world. As a result, they continue to reap the benefits of increased profitability, enhanced guest experiences, and improved community relations. In addition, as industry standards are codified and adopted worldwide, hotels can now compare how their operations measure up against their competitors in terms of sustainable practices and accomplishments. This capacity to publicly compare and contrast is spurring competition and driving innovation as hotels do not wish to be left behind in this area. Water management and conservation is still a primary issue as population growth, urbanization, pollution and wasteful consumption patterns place increasing demands on freshwater supply. Water recycling; installing low-flow fixtures; using digital sensors to control water usage; and even harvesting rainwater are just a few things that some hotels are doing to preserve this precious resource. Waste management is another major concern. Through policies of reduce, reuse and recycle, some hotels are implementing \u0093zero-waste\u0094 programs with the goal of substantially reducing their landfill waste which produces carbon dioxide and methane gases. Other hotels have established comprehensive training programs that reinforce the value of sustainability. There is employee engagement through posters and quizzes, and even contests are held to increase innovation, sensitivity and environmental awareness. Some hotels are also monitoring a guest\u0092s energy usage and rewarding those who consumed less energy with gifts and incentives. The May issue of the Hotel Business Review will document how some hotels are integrating eco-friendly practices into their operations and how they and the environment are benefiting from them. Copyright © 1996-2017. All content on HotelExecutive.com is exclusively copyright to HotelExecutive.com and cannot be republished without prior written consent by HotelExecutive.com. Advertise Submit a News Release Terms of Access & Use Unsubscribe Hotel Newswire RSS \nFor 15 years, the Hotel Business Review journal has been a leading online resource for hotel executives, providing white papers on best practices in hotel management and operations. With a dedicated board of more than 300 contributing editors - some of the most recognizable names in hotels - the Hotel Business Review maintains a progressive flow of exclusive content every week, so that owners, operators, senior executives, investors and developers can stay informed on the constant changes in the hotel industry. k"}]