[{"rating": null, "external_links": [], "crawled": "2017-04-16T08:25:08.000+03:00", "author": "Sierra Vista Herald", "entities": {"persons": [{"name": "martha mcs", "sentiment": "none"}, {"name": "mcsally", "sentiment": "none"}, {"name": "jeff sturges", "sentiment": "none"}, {"name": "lopez", "sentiment": "none"}, {"name": "betsy devos", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "devries", "sentiment": "none"}, {"name": "liz bonfim", "sentiment": "none"}, {"name": "caruthers", "sentiment": "none"}, {"name": "martha mcsally", "sentiment": "none"}, {"name": "devos", "sentiment": "none"}, {"name": "gerrodette", "sentiment": "none"}, {"name": "garrett", "sentiment": "none"}, {"name": "kathy garrett", "sentiment": "none"}, {"name": "jo ann caruthers", "sentiment": "none"}, {"name": "margaret devries", "sentiment": "none"}, {"name": "percy childs", "sentiment": "none"}, {"name": "margaret case", "sentiment": "none"}, {"name": "liz lopez", "sentiment": "none"}, {"name": "tricia gerrodette", "sentiment": "none"}, {"name": "martha", "sentiment": "none"}], "locations": [{"name": "sierra vista", "sentiment": "none"}, {"name": "indivisible cochise county", "sentiment": "none"}, {"name": "palominas", "sentiment": "none"}, {"name": "coronado drive", "sentiment": "none"}, {"name": "sahuarita", "sentiment": "none"}, {"name": "cochise county", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "hereford", "sentiment": "none"}, {"name": "fry boulevard", "sentiment": "none"}, {"name": "sierra vista sierra vista herald", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "sierra vista herald", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "sky island unitarian universalist church", "sentiment": "none"}, {"name": "herald/review  percy childs", "sentiment": "none"}, {"name": "u.s. army", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "text": "1 of 2 Jeff Sturges photo for the Sierra Vista Herald \nThe empty chair with “Reserved for Martha McSally” sign, flag, and bottle of water for her. Jeff Sturges photo for the Herald/Review \nPercy Childs spoke about voter suppression — specifically, Interstate Crosscheck — which he said has resulted in one in six Hispanics and one in seven Asian-Americans, and one in nine African-Americans landing on the list to be expunged from the voting rolls. \nLiz Bonfim is the sign-language interpreter. featured McSally a no-show at town hall even in Sierra Vista Sierra Vista Herald ( … ) Jeff Sturges photo for the Sierra Vista Herald \nAttendees at Thursday night's town hall meeting in Sierra Vista, which Congresswoman Martha McSally did not attend, held up signs. Jeff Sturges photo for the Sierra Vista Herald \nThe empty chair with “Reserved for Martha McSally” sign, flag, and bottle of water for her. Jeff Sturges photo for the Herald/Review \nPercy Childs spoke about voter suppression — specifically, Interstate Crosscheck — which he said has resulted in one in six Hispanics and one in seven Asian-Americans, and one in nine African-Americans landing on the list to be expunged from the voting rolls. \nTwo things distinguished Thursday’s town hall meeting in Sierra Vista from similar events being held around the country during the current two-week congressional recess. \nFirst, unlike other town halls, the crowd of more than 100 people was civil during brief statements by a series of presenters who highlighted concerns about education, ethics, the environment, health care and other national issues. \nSecondly, Congresswoman Martha McSally wasn’t there. \n“In contacts we have made with her office, we were told that Martha has no plans for having any town halls in Cochise County,” said Liz Lopez, a public school educator and moderator at Thursday’s gathering. \nThat didn’t stop presenters from addressing their questions to an empty chair — representing McSally — on points of concern. The two-hour event was sponsored by Indivisible Cochise County, which lists 169 members on its Facebook page, and was held at Sky Island Unitarian Universalist Church. \nMcSally held a town hall in Sahuarita in February. \nLopez said she would question why McSally voted in favor of Betsy DeVos as the Secretary of Education, noting that her appointment by President Donald Trump put the future of public education in jeopardy. Lopez said that it took years of extensive education and training to become and retain her position as a public school educator, while DeVos “...has absolutely no education, training, or experience to qualify her for the position.” \n“Donald Trump’s agenda to privatize education has set us up to fail,” Lopez said. \nShe was followed by Margaret Case, an attorney and Palominas resident, who said it’s “jaw-dropping” that the president “... has no ethics.” \n“We’ve become like a Third World country that is being run to the benefit of a single family,” Case said. \nShe outlined a series of transactions between foreign governments and Trump businesses, including an event attended by the president at a newly-opened hotel in Washington, D.C. \n“I would ask Martha McSally about all the ethical problems,” Case said. “We still haven’t seen the president’s tax returns and she voted in favor of a bill that makes it so we may never see them.” \nLocal environmental activist Tricia Gerrodette said she wanted to know where the congresswoman stood on clean air and water. Gerrodette urged McSally to join a bipartisan committee of lawmakers that is meeting regularly on Climate Change and what can be done to address the problem. \n“She has the right background. She’s got a degree in biology and she would be perfect on that committee,” Gerrodette said. \nKathy Garrett, a nurse, questioned whether McSally believed that health care is a privilege or a right. Garrett said people deserve the same coverage that elected representatives in Congress receive. \n“We know that the ACA [Affordable Care Act] will be changed,” Garrett said. “What we need to know is whether Martha will work to make sure the benefits that people need and want are retained. \n“ACA doesn’t need to be replaced or repealed, it needs to be repaired.” \nMargaret DeVries, a mother of two, questioned whether McSally would vote against transparency and allow the president to continue withholding his tax returns. DeVries urged everyone to participate in an upcoming march in Sierra Vista on Tax Day, Saturday, April 15. The march is scheduled to step off on Fry Boulevard, east of Coronado Drive, beginning at 3 p.m. \n“(McSally) has chosen not to honor or engage her constituents,” DeVries said. \nHereford resident Jo Ann Caruthers said building the border wall will destroy the habitat for numerous rare species of wildlife and will cost billions of dollars that are desperately needed for other programs and social services. \n“How will you vote?” Caruthers asked. “How can you justify billions of dollars for this?” \nPercy Childs, a retired U.S. Army combat veteran, who identified himself as a black man, said his concern is voter suppression. He pointed to voter identification laws being adopted across the country that have resulted in more than seven million people being denied a ballot, despite just 10 convictions of people attempting voter fraud. \nBefore a brief recess, Lopez asked people to raise the signs they brought to the meeting. About 20 signs with various messages on national issues were held up by the audience. Angry 0", "url": "http://omgili.com/ri/jHIAmI4hxg_O4v5qEl3mFqh2iFx1QT1xj1kY0pQ1qegbbck09ZQ256gm5G1fVz6YTEMjrwCul10gCvGHiTRtzpevWYi5ML3hTK8xFJe0JZEbZsESxyTBYAdLauR4wld.RRfrEQDTHco5NBAATClz0FXniYH3wg4c", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T04:45:00.000+03:00", "language": "english", "title": "McSally a no-show at town hall even in Sierra Vista", "thread": {"title_full": "McSally a no-show at town hall even in Sierra Vista", "site_full": "www.svherald.com", "site": "svherald.com", "site_section": "http://www.gvnews.com//search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&nsa=eedition&c[]=news/local,news/local/*&f=rss", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "news", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "www.gvnews.com - RSS Results in news/local,news/local/* of type article", "url": "http://omgili.com/ri/jHIAmI4hxg_O4v5qEl3mFqh2iFx1QT1xj1kY0pQ1qegbbck09ZQ256gm5G1fVz6YTEMjrwCul10gCvGHiTRtzpevWYi5ML3hTK8xFJe0JZEbZsESxyTBYAdLauR4wld.RRfrEQDTHco5NBAATClz0FXniYH3wg4c", "published": "2017-04-16T04:45:00.000+03:00", "title": "McSally a no-show at town hall even in Sierra Vista", "uuid": "8fd85b2ebdec678ecec57ec2f1052a39c91a028b", "main_image": "http://bloximages.chicago2.vip.townnews.com/gvnews.com/content/tncms/assets/v3/editorial/e/04/e04093df-f6b1-5e1b-96ac-6a52af166f08/58f27e65e0493.image.jpg?crop=613%2C460%2C0%2C16&amp;resize=613%2C460&amp;order=crop%2Cresize"}, "uuid": "8fd85b2ebdec678ecec57ec2f1052a39c91a028b", "ord_in_thread": 0}]