[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:16:08.000+03:00", "author": "saoirse_jha (noreply@blogger.com)", "entities": {"persons": [{"name": "dan", "sentiment": "none"}, {"name": "jhara", "sentiment": "none"}, {"name": "tatay", "sentiment": "none"}, {"name": "god", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "batangas", "sentiment": "none"}, {"name": "mindoro", "sentiment": "none"}], "organizations": [{"name": "phivolcs", "sentiment": "none"}, {"name": "heritage center", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "ub", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "text": "God bless the Philippines! April 4, 2017 \n\nJust a normal Tuesday spree for Batangueños to work, study and play along with people. Nobody ever expected that a 5.5 magnitude earthquake would literally shake the living soul in us. I was at home. Alone. I really thought there was a truck passing by the time it happened and then I found myself ducking, covering my head and hiding under the narra table Tatay made. I was not sure if I would be able to survive the wrath of Mother Nature but I was sure I would not be able to sleep peacefully that night. Aftershocks came after; I did not hold Twitter for quite a long time but because of the earthquake, I followed Phivolcs immediately. It was a serious moment for all of us living here in one of the towns in Batangas. Staring blankly and looking forward for a peaceful night, I unfolded all my stuff on the floor (4 pillows and 2 blankets, I also used my yoga mat) of our living room since my Dan and Mom were not here to make everything at ease. It was 1:30 in the morning when we experienced another aftershock and that made me wide awake. \nWednesday to Friday became normal for all of us here even though aftershocks made us feel nervous and exhausted at the same time. \n\n\nApril 8, 2017 \n\nTruly, earthquakes come like thieves. No time. No notice. \nSince I was a teacher, even Saturdays become workdays but it didn't matter; passion is passion and teaching comes after it. \nIt was 3 in the afternoon, I was inside the Heritage Center of our school where it was my temporary office with a table because I didn't want to be disturbed, it was at the very corner of the Learning Resource Center of the university I was working, I was doing different forms to be submitted days after that day but I guess Mother Nature wouldn't let me finish after all. \nAll of a sudden, a 5.6 magnitude earthquake struck the whole Batangas area with us emotionless, faces shocked. I forgot my shoes because I cared for my safety, I was even pulled out by the guard to bequeath the room safely. The student assistant I was with was so scared and she panicked. All I can hear were screams from both students and faculty and employees and we all went outside the library. No tough human being can bear that thing at all.  \nBecause we thought it was over, we rushed inside to get out stuff. I hurriedly packed my laptop, thesis (I am a grammarian, too), forms, SHOES and then after a minute, another sudden ground shake happened. This time, it was stronger. Lights were flickering. People did what was done during earthquake drills. Duck. Cover. Hold. \nThe news said it was a 5.9 magnitude earthquake.  My boyfriend happened to have a review during that time and he was the first person I looked for in the crowd. Then I remembered, I forgot my phone inside the library because I got carried away by the nerve-wracking earthquake; s ince we were not yet allowed to get inside any building, the student assistant insisted to get her stuff as well as my phone . It was my Inay who came into my mind to text first how they all are at home. It was a true survival mode. I felt cold. I saw the buildings of the school shaking, too. I was, nope, we were caught off-guard. We were all scared and thinking of ways on how to survive. \nMy boyfriend and I went out of UB and walked until we reached a gasoline station near the jeepney stop, (I told him we should walk because it was a traffic jam), then I noticed it was shaking again (marquees moved, cars and jeeps and trikes swayed, people were panicking and running for their lives). My boyfriend was pretending everything's fine but I know he was scared, too. I saw debris from buildings that fell, it was like a scene from movies after an earthquake. People were piling at the middle of the street waiting for jeepneys or tricycles to get home safely, some were at the verge of crying. We walked. Fast. Some were pale, some were unable to absorb the shock the earthquake gave us. On the other side, there was an expecting mother who was stunned and just looking all over the place. Everyone on the place was dumbfounded on what happened. I was keen to my surrounding back then and store owners closed their stalls fast.  \nWe immediately saw a jeep and inside were passengers panicking and some, silent. \nI, on the other hand, had no other shield but prayers and the belief that God will spare us on this kind of calamity. I was staring at my boyfriend and saw his face that he wanted to go home to check if his family is also okay. I had no other choice, I was selfish that he should stay with my family but of course, he has a family who was also worried for his safety. \nThere, inside the jeep, was a wake up call for all of us. There was this woman seated on my opposite side who was of different religion who kept on telling things that made another woman on my side all-panicky. The driver went to the gasoline station to pump but they were panicking that if an earthquake struck, it would explode and would kill us all because the gasoline is stored under. They were thinking about all these stuff and I controlled myself not to speak up because I might sound disrespectful of their opinions. \nThen I saw this old woman seated at the corner of the jeep, all smiles and peaceful. She was relaxed. She asked a lady beside her what happened and this lady cried but the former was still calm. She reminded us that all we could do is pray and believe that God will not let this happen to scare and lose faith in Him. She also added that this is God's wake up call. This is an overturn that we should seek Him more. \n\n\nShe made me a bit tearful then, she actually made me feel better. She said she'll be crossing the sea since she'll go yet to Mindoro and all she has with her were money, bag full of clothes, pasalubong  and faith.  \nI really believe God was with us, is with us everyday, every time and He is omnipresent no matter what situation we are.  \nE verything went fine after what she said. And it taught me to cling on my faith further and not to become hesitant that God will help us when calamities roll. We may not be able to see God face to face but He is doing miracles in His mysterious ways. \n\nThanks, G! Not just for protecting us but also for showing us your mercy and love. \n\nAlways, Jhara xoxo \nLet's get connected: Follow me on my Instagram and Twitter account - @kissesfromjhara Facebook - facebook.com/JHARAlicious ", "url": "http://omgili.com/ri/SEMpReyPU46V29HAx_7pv99DmJFqwtOgA7RN43_n7louBvJeLqtKcr9IuUIZGtwNdYgrE0ie.nLs549ARO200JNSKG7h0TQA5hel78aPRuQxphvc8Q7wzQ--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:16:08.000+03:00", "language": "english", "title": "Faith over Panic from Earthquake | An Anonymous Woman Who Taught Me to Believe", "thread": {"title_full": "Faith over Panic from Earthquake | An Anonymous Woman Who Taught Me to Believe", "site_full": "limitlessnessbyjhara.blogspot.com", "site": "blogspot.com", "site_section": "http://limitlessnessbyjhara.blogspot.com/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Limitlessness by Jhara", "url": "http://omgili.com/ri/SEMpReyPU46V29HAx_7pv99DmJFqwtOgA7RN43_n7louBvJeLqtKcr9IuUIZGtwNdYgrE0ie.nLs549ARO200JNSKG7h0TQA5hel78aPRuQxphvc8Q7wzQ--", "published": "2017-04-16T09:16:08.000+03:00", "title": "Faith over Panic from Earthquake | An Anonymous Woman Who Taught Me to Believe", "uuid": "9054bc9d625b6c1720d22763674bd8045fbc0579", "main_image": null}, "uuid": "9054bc9d625b6c1720d22763674bd8045fbc0579", "ord_in_thread": 0}]