[{"rating": null, "external_links": [], "crawled": "2017-04-16T08:50:02.000+03:00", "author": "", "entities": {"persons": [{"name": "kiryas joel", "sentiment": "none"}, {"name": "orange cou", "sentiment": "none"}, {"name": "united monroe", "sentiment": "none"}, {"name": "monroe woodbury", "sentiment": "none"}, {"name": "north monroe", "sentiment": "none"}, {"name": "john allegro", "sentiment": "none"}, {"name": "szegedin", "sentiment": "none"}, {"name": "steven m. neuhaus", "sentiment": "none"}, {"name": "myrna kemnitz.no", "sentiment": "none"}, {"name": "harley e. doles iii", "sentiment": "none"}, {"name": "monroe", "sentiment": "none"}, {"name": "emily convers", "sentiment": "none"}, {"name": "justin rodriguez", "sentiment": "none"}, {"name": "joel", "sentiment": "none"}, {"name": "egan", "sentiment": "none"}, {"name": "l. stephen brescia", "sentiment": "none"}, {"name": "neuhaus", "sentiment": "none"}, {"name": "kiryas joel mayor abraham weider", "sentiment": "none"}, {"name": "kiryas joel village administrator gedalye szegedin", "sentiment": "none"}, {"name": "michael amo", "sentiment": "none"}, {"name": "mike egan.also", "sentiment": "none"}, {"name": "rodriguez", "sentiment": "none"}, {"name": "kathy bonnelli", "sentiment": "none"}, {"name": "kj", "sentiment": "none"}], "locations": [{"name": "north monroe", "sentiment": "none"}, {"name": "orange county", "sentiment": "none"}, {"name": "washingtonville", "sentiment": "none"}, {"name": "monroe-woodbury", "sentiment": "none"}, {"name": "monroe", "sentiment": "none"}, {"name": "hudson valley", "sentiment": "none"}, {"name": "town of monroe", "sentiment": "none"}, {"name": "harriman", "sentiment": "none"}, {"name": "goshen", "sentiment": "none"}, {"name": "doles", "sentiment": "none"}, {"name": "goshen", "sentiment": "none"}], "organizations": [{"name": "monroe-woodbury school district", "sentiment": "none"}, {"name": "orange county legislature", "sentiment": "none"}, {"name": "monroe town board", "sentiment": "none"}, {"name": "village of kiryas joel", "sentiment": "none"}, {"name": "united monroe", "sentiment": "none"}, {"name": "planning department", "sentiment": "none"}, {"name": "photo news", "sentiment": "none"}, {"name": "united monroe’s kj alliance", "sentiment": "none"}, {"name": "legislature", "sentiment": "none"}, {"name": "county executive for communications", "sentiment": "none"}, {"name": "town of north monroe", "sentiment": "none"}]}, "text": "Local Deals The deciders United Monroe and officials from Kiryas Joel continue talks with Orange County officials regarding the Town of North Monroe proposal Published Apr 13, 2017 at 5:23 pm (Updated Apr 13, 2017) Make text smaller Make text larger Photos Should the Orange County Legislature act, voters in the Town of Monroe will vote in November on a proposal to create the Town of North Monroe comprised of residents living north of Route 17. GOSHEN — Shortly after 2 p.m. on Monday, April 3, L. Stephen Brescia, the chairman of the Orange County Legislature, convened another meeting to discuss the possible creation of the Town of North Monroe.At the table were County Executive Steven M. Neuhaus, Kiryas Joel Mayor Abraham Weider, Kiryas Joel Village Administrator Gedalye Szegedin and three leaders of United Monroe — Emily Convers, John Allegro and Mike Egan.Also at the meeting were the three Orange County legislators who represent some portion of the Town of Monroe and its three villages — Michael Amo, Kathy Bonnelli and Myrna Kemnitz.No elected officials from the Town of Monroe nor representatives from the Monroe-Woodbury School District were there.Late last year, more than 500 Monroe residents living north of Route 17 petitioned the Orange County Legislature to create a new municipality that would include the Village of Kiryas Joel plus 382 acres that are included in the annexations. The request came with this offer: Do this and the voters of Kiryas Joel — with their bloc vote — would no longer be a factor in Monroe town elections.There are town elections in November: two seats on the Monroe Town Board are open as will the position of town supervisor.There are approximately 50,000 residents in Monroe; Supervisor Harley E. Doles III says that 30,000 are Hasidic.One of the interesting components of the issue is that sitting across from one another at these meetings are groups engaged in lawsuits over annexation: Convers and Allegro are founders of Preserve Hudson Valley, which is appealing a judge’s ruling permitting the 164-acre annexation from the unincorporated portion of the town of Monroe into the Village of Kiryas Joel; and Orange County officials, who also are appealing that ruling, together with a consortium of towns and villages that surround Kiryas Joel. ‘Off the record’ The specifics of the April 3 meeting and two earlier sessions have not been disclosed. As Szegedin wrote in an email exchange with The Photo News: “The substance of what was discussed at the meeting was agreed by all in attendance to be held off the record.”Egan, one of the three ranking United Monroe officials at the April 3 meeting, outlined the grassroots group’s aspirations in an email exchange with The Photo News: “As United Monroe reported on its Facebook page, while our meetings with county officials have been productive so far, we continue to work in search of fair solutions to the very thorny issues. We hope all this work results in a mutually agreeable compromise North Monroe solution and separation. But it is important that we all understand that other key stakeholders, including the school district, will also have their say long before a North Monroe petition is put to a vote at the county legislature in Goshen, and if approved there, brought to Monroe for a full public vetting and eventually a vote by its residents.” Questions The Photo News reached out to several of those at the April 3 meeting and asked the following questions:United Monroe has said it favors the creation of the town of North Monroe, but not at the expense of the additional 300+ acres. Is there a compromise afoot regarding this? Or a reconfiguration of property?Where is the discussion regarding environmental review?The lawyer for the petitioners has said no state environmental review is necessary to approve a referendum to vote on the proposal to create the new town. The counsel for the Legislature has recommend that the Legislature conduct a state environmental review as part of the preparation for the vote on the referendum, although she said there was little case law requiring that kind of deep review. She also said that the county’s Planning Department already has a vast amount of information regarding the lands outside Kiryas Joel that remains subject to annexation from the original county review. Where is this part of the discussion?If the town of North Monroe is created, what – if anything – would happen to the appeals of judge’s decision clearing the way for the annexation of the 164-acres? Would they be dropped? Continued? Settled?Is there any discussion on how the creation of the Town of North Monroe would affect the Monroe-Woodbury (and perhaps the Washingtonville) School District?What are the benefits to creating the Town of North Monroe for the residents living north of Route 17? Some answers Justin Rodriguez, the assistant to the County Executive for Communications and Media Relations, said Neuhaus believes that 300 acres is excessive, “which is why we have been fighting the annexation. The opportunity for a compromise is there, but all parties must be willing to do so.”As for who should sit at the table, “The County Executive believes that in order for this to move forward, the Legislature needs to meet with all parties involved,” Rodriguez said. “It might not be able to be coordinated at the same time, but everyone, elected officials and interest groups, should be heard.”Egan also addressed the absence of elected town of Monroe officials at these meetings:“Although other town notables who are not involved in the discussions are desperately flailing about for public or even private attention on this subject, we believe it would be counterproductive and premature to comment on the status of the North Monroe talks we’ve experienced, or comment on emails we’ve not received,” Egan wrote. “In stark contrast with the others, United Monroe tries not to be reckless with the people’s interests.“Should a win-win proposal be reached by all stakeholders,” he added, “the citizens of Monroe will have ample opportunity to discuss it and then approve or disapprove it with their votes in November.” ‘Let Monroe decide its future’ Doles is opposed to these meetings. At the April 3 Monroe Town Board meeting, he tried to add several items to the meeting’s agenda, calling for a public forum regarding the status of the North Monroe proposal. He failed to get the votes to amend the agenda.Since then, Doles has become increasing vocal — at least through emails — about the town being left out of these discussions.For instance, in an email sent out Thursday, April 13, to the county executive, he wrote:“Mr. Neuhaus, your private meetings with local elected officials while there is annexation litigation is wrong! Your meetings with United Monroe as party to annexation is wrong?“You are advancing creating North Monroe while there is still pending litigation. Annexation preserves both the school district and Monroe’s tax base. Creating (North) Monroe will raise taxes. No doubt. Removing KJ votes from Monroe elections does nothing since your friends at United Monroe’s KJ Alliance own nearly every project, development home re-sale and drop of water in Monroe. Their voters will simply replace those of KJ’s in Town elections. Then there won’t be a North Monroe and Monroe. If you do not allow for annexation you will be responsible for laying the foundation for ‘North KJ’ and ‘South KJ.’ Where will the rest of Monroe go? This does not create ‘peace’ but prevents it from ever occurring. “Open forums in Monroe are right,” he added. “Let Monroe decide its future.” Timetable The Orange County Legislature must approve a measure allowing for a permissive referendum no later than September. The referendum would allow all residents in the Town of Monroe - and that includes voters living in the villages of Harriman, Kiryas Joel and Monroe — to vote on creating the new municipality as part of town elections in November. ", "url": "http://omgili.com/ri/jHIAmI4hxg.L8c8hKUbcLSD6XAr6Gi2_gRw15rZgA9Xowy9B8O30niz93eB.7qkRoL0aUNq1Nf0ot6cCRPrn6kkdK64oT971Fcz_jq_LStxDXwQ8cHPWECe4wNXfi4QNjGAIb0la0tlPLiTTiCi9VQ--", "highlightText": "", "highlightTitle": "", "published": "2017-04-13T08:00:00.000+03:00", "language": "english", "title": "The deciders | Monroe Woodbury NY | Local News", "thread": {"title_full": "The deciders | Monroe Woodbury NY | Local News", "site_full": "www.thephoto-news.com", "site": "thephoto-news.com", "site_section": "", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "news", "spam_score": 0.166, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "", "url": "http://omgili.com/ri/jHIAmI4hxg.L8c8hKUbcLSD6XAr6Gi2_gRw15rZgA9Xowy9B8O30niz93eB.7qkRoL0aUNq1Nf0ot6cCRPrn6kkdK64oT971Fcz_jq_LStxDXwQ8cHPWECe4wNXfi4QNjGAIb0la0tlPLiTTiCi9VQ--", "published": "2017-04-13T08:00:00.000+03:00", "title": "The deciders | Monroe Woodbury NY | Local News", "uuid": "90b564958ed83f949deb3b6a5911d37f8cc52766", "main_image": "http://321-PNwebvarnish.newscyclecloud.com/storyimage/PN/20170413/NEWS01/170419976/AR/0/AR-170419976.jpg\r\n"}, "uuid": "90b564958ed83f949deb3b6a5911d37f8cc52766", "ord_in_thread": 0}]