[{"entities": {"locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "sunnyvale", "sentiment": "none"}, {"name": "pacific crest", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "amd", "sentiment": "neutral"}, {"name": "advanced micro devices, inc", "sentiment": "neutral"}, {"name": "nvda advanced micro devices, inc.", "sentiment": "neutral"}, {"name": "ryzen", "sentiment": "none"}, {"name": "nvda", "sentiment": "none"}, {"name": "vega gpu", "sentiment": "none"}, {"name": "computex", "sentiment": "none"}, {"name": "nvidia", "sentiment": "none"}, {"name": "polaris", "sentiment": "none"}, {"name": "california-based advanced micro devices inc", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "gpu", "sentiment": "none"}], "persons": [{"name": "amigobulls", "sentiment": "none"}, {"name": "vega", "sentiment": "none"}, {"name": "mark bachman", "sentiment": "none"}, {"name": "bachman", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "amigobulls.com", "site_section": "http://amigobulls.com/articles/feed", "domain_rank": 97219, "replies_count": 0, "country": "US", "section_title": "Amigobulls - Stock Market Analysis", "title": "AMD Stock: Advanced Micro Devices, Inc. Could Gain Big On Vega Launch", "title_full": "AMD Stock: Advanced Micro Devices, Inc. Could Gain Big On Vega Launch", "published": "2017-04-18T19:27:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZRfX9TihfeZP10DL65Gb9REyPMWhq4cUcJET_TIo5pFLW8FjByhSQh2AtPJulHTOTTNaFUVwEvOtBZPWX5mieVN6Yz219bw06DNBwkSE3p2TIgWgGiaOJooXi.P4izm6y_7lqNkQ0LYefXHFUnzlaL_", "site": "amigobulls.com", "main_image": "https://static.amigobulls.com/articles/wp-content/uploads/2017/04/AMD-Stock-Advanced-Micro-Devices-Inc.-Could-Gain-Big-Going-Into-Vega-Launch.jpg", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "913de2c3df185108eb09c230bc38388c05861746", "site_type": "blogs"}, "title": "AMD Stock: Advanced Micro Devices, Inc. Could Gain Big On Vega Launch", "published": "2017-04-18T19:27:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZRfX9TihfeZP10DL65Gb9REyPMWhq4cUcJET_TIo5pFLW8FjByhSQh2AtPJulHTOTTNaFUVwEvOtBZPWX5mieVN6Yz219bw06DNBwkSE3p2TIgWgGiaOJooXi.P4izm6y_7lqNkQ0LYefXHFUnzlaL_", "author": "Sreekanth Anasa", "crawled": "2017-04-19T08:40:24.000+03:00", "language": "english", "text": "Related Tickers: AMD , NVDA Advanced Micro Devices, Inc. could gain big with the launch of RX 500 GPUs on 18th April ahead of Vega GPU launch. AMD stock could head higher going into Vega GPU launch. Flickr \nShares of Sunnyvale, California-based Advanced Micro Devices Inc (NASDAQ:AMD) have not yet recovered from the Goldman Sachs downgrade which tanked AMD stock in the first week of April. AMD stock is still down more than 12.5% this month. The recent launch of mid-market Ryzen 5 CPUs which had received overall positive reviews also did little to lift AMD stock. AMD stock seems to be caught in a bearish sentiment and may require some near-term catalysts to put AMD stock back on an upward trajectory. Apart from the earnings, Vega GPU launch is a near-term catalyst which could boost AMD stock in a big way. There was some inflow of positive news recently for the GPU market which bodes well for AMD's Vega GPU launch. AMD stock climbed almost 4% in yesterday's (April 17th) trade on positive comments from a research firm on GPU market outlook. AMD is likely to gain big with its GPU refresh lined up and Vega launch around the corner. RX 500 series launch on 18th April could be a big boost to AMD ahead of Vega launch. \nAMD stock's recent run had also taken a hit early this month, on account of Pacific Crest's research suggesting weak GPU outlook for AMD's rival NVIDIA (NASDAQ:NVDA) . NVDA stock was also downgraded due to this reason. This news had not gone down well with AMD investors since AMD's flagship Vega GPU is scheduled for a launch this quarter. However, in total contrast to the above claim, there are some positive comments coming in recently , regarding the sales of GPUs from boutique research firm MScience. MScience analyst Mark Bachman in his recent interview stated that sales in North America are very strong for both AMD and NVIDIA. When asked about GPU weakness in near-term, he said that \"we are not seeing that weakness in GPU pricing\". He pointed out that all these observations are based on his firm's check on \"receipt-level data\" for the actual sales at retail to consumers which are bound to be more insightful and accurate than the usual supply chain channel checks. Bachman mentions that his data is only for North America and the data of Asia-Pacific, another significant gaming enthusiast market, would take some time to come. \nTalking about AMD specifically, Bachman suggests that AMD's existing Polaris based 400 series GPU sales have rebounded, especially that of RX 480 and RX 470 cards. AMD is set to launch its refreshed Polaris based RX 500 cards today (April 18) ahead of the company's flagship Vega GPU, which is expected to be launched sometime in May. According to a Wccftech post , the RX 500 cards on an average offer 2X more performance than the lower level cards at competitive prices. The MScience analyst is highly optimistic about the latest GPU refresh by AMD and has placed his odds highly in favor of AMD with Vega GPU launch also lined up. If Bachman's research hold's true, AMD could make some significant gains in the mainstream segment before taking on NVIDIA in the high end of the market with Vega. Vega release date may be drawing much closer. \nTo make it tough for AMD's Vega GPUs, in a surprising move, NVIDIA recently launched its most powerful, high-end GPU, Titan Xp at a price point of $1200. There have been numerous leaks till now about AMD's premium Vega GPUs. The latest leaks suggest that the Vega launch is just around the corner. There are some rumors that AMD might launch Vega during its Computex convention on May 30. The latest leaked video teaser suggests that AMD is all set to do a marketing blitz for the Vega GPUs. The Vega GPUs are reported to come with unique packaging design and a lot of goodies along with it. The latest leak also confirms some of the previous impressive leaked specs of Vega and the RX Vega limited edition “Reference” Liquid Cooling Design. We can expect much more leaks going ahead and could even see a much earlier release with NVIDIA mounting pressure on AMD with its launches. Summing it up. \nAMD stock may be in a rough patch presently but the upcoming product launches could be the much-needed catalyst for AMD stock to resume its upward march. The recent bearish commentary about AMD stock has made investors stay away from AMD stock. However, given the potential of upcoming product launches and taking a long-term view, AMD stock now could be a great bargain . As stated in our previous coverage, AMD need not necessarily outperform its rivals on every single parameter to benefit from its new launches. AMD just needs to be competitive keeping in mind the price to performance aspect. The latest positive commentary really bodes well for AMD stock and if the research findings were to hold true AMD could gain big going into its Vega launch. \nLooking for great tech stocks to buy? Then do check out Amigobulls' top   beaten the NASDAQ by over 126%. If you're looking for top picks from the auto sector, you should also check out our top auto   beaten the S&P 500 by over 163%. 11 3", "external_links": [], "highlightTitle": "", "uuid": "913de2c3df185108eb09c230bc38388c05861746", "highlightText": "", "rating": null}]