[{"uuid": "926788010835e3f41353ccf8c2e4ace5aa16c93c", "url": "http://omgili.com/ri/jHIAmI4hxg_.CExbfz1PflkuXrs0oP71JGrCdUWnOadz19QZ_f16Ll2mLPa4rXeLV2viqbV.FDEdM.YkNQw21kXFVNQ_hLeu38WZf5vKsCyK8KNDhrYrzuQChG.9pxeAFtL.jze38KM-", "title": "Suspect in Facebook video murder kills self in Pennsylvania", "author": "arabamericannews.com", "rating": null, "published": "2017-04-18T20:57:00.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "facebook", "sentiment": "none"}, {"name": "pennsylvania state police", "sentiment": "none"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}], "locations": [{"name": "cleveland", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "erie county", "sentiment": "none"}], "persons": [{"name": "steve stephens", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "godwin", "sentiment": "none"}, {"name": "stephens", "sentiment": "none"}, {"name": "robby miller", "sentiment": "none"}, {"name": "robert godwin sr.", "sentiment": "none"}, {"name": "beech brook", "sentiment": "none"}, {"name": "calvin williams", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "926788010835e3f41353ccf8c2e4ace5aa16c93c", "url": "http://omgili.com/ri/jHIAmI4hxg_.CExbfz1PflkuXrs0oP71JGrCdUWnOadz19QZ_f16Ll2mLPa4rXeLV2viqbV.FDEdM.YkNQw21kXFVNQ_hLeu38WZf5vKsCyK8KNDhrYrzuQChG.9pxeAFtL.jze38KM-", "site_full": "www.arabamericannews.com", "title": "Suspect in Facebook video murder kills self in Pennsylvania", "site_section": "http://www.arabamericannews.com/", "domain_rank": null, "published": "2017-04-18T20:57:00.000+03:00", "title_full": "Suspect in Facebook video murder kills self in Pennsylvania", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "arabamericannews.com | Established September 7, 1984", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "", "site": "arabamericannews.com"}, "external_links": [], "language": "english", "text": "The man suspected of killing a Cleveland man and posting a video of the murder on Facebook fatally shot himself after a “brief pursuit” by Pennsylvania State Police officers on Tuesday, police said.\nSteve Stephens was accused of shooting Robert Godwin Sr., 74, on a sidewalk in Cleveland, Ohio, on Sunday before fleeing in a car and uploading a video of the murder to Facebook, becoming the subject of a nationwide manhunt.\nPennsylvania State Police officers found Stephens in Erie County, Pennsylvania, after getting a tip from the public that his white Ford Fusion was parked outside a McDonald’s fast-food restaurant, Calvin Williams, the Cleveland police chief, told a news conference.\nAfter a brief chase, Stephens stopped his vehicle, Williams said.\n“As the officers approached that vehicle Steve Stephens took his own life,” Williams said. “We would have preferred that it had not ended this way,” he added, saying he and the community would have had “a lot of questions” for Stephens.\nStephens, who had no prior criminal record, was not suspected in any other killings, Cleveland officials said. Stephens said in a separate video on Facebook on Sunday that he had already killed a dozen others.\nThe shooting marked the latest video clip of a violent crime to turn up on Facebook, raising questions about how the world’s biggest social media network moderates content.\nThe company on Monday said it would review how it monitors violent footage and other objectionable material in response to the killing. The shooting video was visible on Facebook for nearly two hours before it was reported, the company said.\nStephens is not believed to have known Godwin, a retired foundry worker who media reports said spent Easter Sunday morning with his son and daughter-in-law before he was killed.\nIn interviews before Stephens’ death, Godwin’s relatives said they forgave his killer.\n“I forgive him because we are all sinners,” Robby Miller, Godwin’s son, said in an interview with CNN.\nBeech Brook, a behavioral health facility in a Cleveland suburb where Stephens had worked since 2008, said in a statement on Tuesday that Stephens had shown no cause for alarm.\n“While an employee, he received corrective action notes related to incomplete paperwork and missed appointments, but no disciplinary actions related to harassment, threats of violence or other misconduct,” the statement said.", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:57.000+03:00"}]