[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/jHIAmI4hxg_0wqT7Ae5UJvzJ_c9Ah3oBLmUPfpyarcU4JAnJosmVItDV24Y6wC0cIsPGTP8On118eAM91vKtSXz6FR6i1P0_oOwe5f0wRWMOniiiYceazVJVV21BfN7QOFmw6NZX9YMA7_V66x.ZGQ--", "title": "Bird breaks out, Yanks sweep Cards 9-3 for 7th straight", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://www.beaumontenterprise.com/sports/baseball/collectionRss/Sports-Baseball-Heds-7391.php", "spam_score": 0.0, "section_title": "Sports Baseball Heds", "site": "beaumontenterprise.com", "site_full": "www.beaumontenterprise.com", "performance_score": 0, "uuid": "93d1f00b1597bd4861a8d31b48224268320fafa0", "published": "2017-04-17T11:25:48.000+03:00", "site_categories": [], "country": "US", "title_full": "Bird breaks out, Yanks sweep Cards 9-3 for 7th straight", "participants_count": 1, "main_image": "http://ww2.hdnux.com/photos/60/44/13/12731093/3/rawImage.jpg"}, "url": "http://omgili.com/ri/jHIAmI4hxg_0wqT7Ae5UJvzJ_c9Ah3oBLmUPfpyarcU4JAnJosmVItDV24Y6wC0cIsPGTP8On118eAM91vKtSXz6FR6i1P0_oOwe5f0wRWMOniiiYceazVJVV21BfN7QOFmw6NZX9YMA7_V66x.ZGQ--", "title": "Bird breaks out, Yanks sweep Cards 9-3 for 7th straight", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:25:48.000+03:00", "language": "english", "entities": {"locations": [{"name": "gallery new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "yankee stadium", "sentiment": "none"}, {"name": "st. louis", "sentiment": "none"}, {"name": "bronx", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "pittsburgh", "sentiment": "none"}], "persons": [{"name": "greg bird", "sentiment": "none"}, {"name": "tim mccarver", "sentiment": "none"}, {"name": "derek holland", "sentiment": "none"}, {"name": "bird", "sentiment": "none"}, {"name": "jordan montgomery", "sentiment": "none"}, {"name": "adam wainwright", "sentiment": "none"}, {"name": "aaron hicks", "sentiment": "none"}, {"name": "aaron", "sentiment": "none"}, {"name": "mike matheny", "sentiment": "none"}, {"name": "lance lynn", "sentiment": "none"}, {"name": "ivan nova", "sentiment": "none"}, {"name": "girardi", "sentiment": "none"}, {"name": "wainwright", "sentiment": "none"}, {"name": "michael pineda", "sentiment": "none"}, {"name": "rich schultz", "sentiment": "none"}, {"name": "matt holliday", "sentiment": "none"}, {"name": "ronald torreyes", "sentiment": "none"}, {"name": "yadier molina", "sentiment": "none"}, {"name": "holliday", "sentiment": "none"}, {"name": "hicks", "sentiment": "none"}, {"name": "chase headley", "sentiment": "none"}, {"name": "bob gibson", "sentiment": "none"}, {"name": "adam olsen", "sentiment": "none"}, {"name": "joe girardi", "sentiment": "none"}, {"name": "pineda", "sentiment": "none"}, {"name": "austin romine", "sentiment": "none"}, {"name": "aaron judge", "sentiment": "none"}, {"name": "matt carpenter", "sentiment": "none"}, {"name": "gary sanchez", "sentiment": "none"}, {"name": "miguel socolovich", "sentiment": "none"}, {"name": "carpenter", "sentiment": "none"}], "organizations": [{"name": "new york yankees", "sentiment": "none"}, {"name": "yanks", "sentiment": "none"}, {"name": "cardinals", "sentiment": "none"}, {"name": "chicago white sox", "sentiment": "none"}, {"name": "national league", "sentiment": "none"}, {"name": "louis cardinals", "sentiment": "none"}, {"name": "tampa bay", "sentiment": "none"}, {"name": "yankee", "sentiment": "none"}, {"name": "st. louis cardinals", "sentiment": "none"}, {"name": "yankees", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "93d1f00b1597bd4861a8d31b48224268320fafa0", "published": "2017-04-17T11:25:48.000+03:00", "author": "MIKE FITZPATRICK, AP Baseball Writer", "text": "Close Image 1 of 10 New York Yankees' Greg Bird watches as he hit a two-run home run against the St. Louis Cardinals during the second inning of a baseball game Sunday, April 16, 2017 at Yankee Stadium in New York. New York Yankees' Greg Bird watches as he hit a two-run home run against the St. Louis Cardinals during the second inning of a baseball game Sunday, April 16, 2017 at Yankee Stadium in New York. Photo: Rich Schultz, AP Image 2 of 10 New York Yankees pitcher Michael Pineda delivers a pitch against the St. Louis Cardinals during the first inning of a baseball game ,Sunday, April 16, 2017 at Yankee Stadium in New York. New York Yankees pitcher Michael Pineda delivers a pitch against the St. Louis Cardinals during the first inning of a baseball game ,Sunday, April 16, 2017 at Yankee Stadium in New York. Photo: Rich Schultz, AP Image 3 of 10 New York Yankees' Aaron Judge, left, congratulates Greg Bird (33) after Bird hit a two-run home run against the St. Louis Cardinals during the second inning of a baseball game Sunday, April 16, 2017 at Yankee Stadium in New York. less New York Yankees' Aaron Judge, left, congratulates Greg Bird (33) after Bird hit a two-run home run against the St. Louis Cardinals during the second inning of a baseball game Sunday, April 16, 2017 at Yankee ... more Photo: Rich Schultz, AP Image 4 of 10 St. Louis Cardinals pitcher Adam Wainwright (50) looks to the outfield as New York Yankees' Aaron Hicks circles the bases after he hit a home run during the fifth inning of a baseball game Sunday, April 16, 2017 at Yankee Stadium in New York. less St. Louis Cardinals pitcher Adam Wainwright (50) looks to the outfield as New York Yankees' Aaron Hicks circles the bases after he hit a home run during the fifth inning of a baseball game Sunday, April 16, ... more Photo: Rich Schultz, AP Image 5 of 10 St. Louis Cardinals pitcher Adam Wainwright (50) delivers a pitch against the New York Yankees during the first inning of a baseball game, Sunday, April 16, 2017 at Yankee Stadium in New York. St. Louis Cardinals pitcher Adam Wainwright (50) delivers a pitch against the New York Yankees during the first inning of a baseball game, Sunday, April 16, 2017 at Yankee Stadium in New York. Photo: Rich Schultz, AP Image 6 of 10 St. Louis Cardinals first baseman Matt Carpenter (13) has his finger taped by trainer Adam Olsen as manager Mike Matheny (22) looks on during the first inning against the New York Yankees of a baseball game, Sunday, April 16, 2017 at Yankee Stadium in New York. less St. Louis Cardinals first baseman Matt Carpenter (13) has his finger taped by trainer Adam Olsen as manager Mike Matheny (22) looks on during the first inning against the New York Yankees of a baseball game, ... more Photo: Rich Schultz, AP Image 7 of 10 New York Yankees' Aaron Judge (99) hits a run scoring triple against the St. Louis Cardinals during the second inning of a baseball game Sunday, April 16, 2017 at Yankee Stadium in New York. New York Yankees' Aaron Judge (99) hits a run scoring triple against the St. Louis Cardinals during the second inning of a baseball game Sunday, April 16, 2017 at Yankee Stadium in New York. Photo: Rich Schultz, AP Image 8 of 10 New York Yankees' Ronald Torreyes (74) and Aaron Judge celebrate after defeating the St. Louis Cardinals 9-3 in a baseball game Sunday, April 16, 2017 at Yankee Stadium in New York. New York Yankees' Ronald Torreyes (74) and Aaron Judge celebrate after defeating the St. Louis Cardinals 9-3 in a baseball game Sunday, April 16, 2017 at Yankee Stadium in New York. Photo: Rich Schultz, AP Image 9 of 10 New York Yankees' Ronald Torreyes (74) congratulates Aaron Judge and Chase Headley (12) who both scored on a double by Austin Romine against the St. Louis Cardinals during the eighth inning of a baseball game Sunday, April 16, 2017 at Yankee Stadium in New York. less New York Yankees' Ronald Torreyes (74) congratulates Aaron Judge and Chase Headley (12) who both scored on a double by Austin Romine against the St. Louis Cardinals during the eighth inning of a baseball game ... more Photo: Rich Schultz, AP Bird breaks out, Yanks sweep Cards 9-3 for 7th straight 1 / 10 Back to Gallery NEW YORK (AP) — While the rest of the Yankees were off to a flying start at home, Greg Bird was still grounded at the plate. He finally joined in the fun Sunday night. Bird busted out of his slump with a long home run that began a perfect night in the batter's box, and Michael Pineda pitched New York past the staggering St. Louis Cardinals 9-3 for its seventh straight victory. \"That's the Bird I know,\" teammate Aaron Judge said. \"That's what he did in spring training.\" Aaron Hicks also hit a homer and Judge was robbed of one by a fan in the bleachers , forcing the young Yankees bopper to settle for an RBI triple. New York chased Adam Wainwright (0-3) in the fifth and finished a three-game sweep that left St. Louis at 3-9, the worst record in the National League and its poorest start since 1988. \"It's an incredibly frustrating start to the season,\" the 35-year-old Wainwright said after his first career outing against the Yankees. \"I know Cardinal Nation is ready for me to get my act together, and I am, too.\" His cap cocked to the side, Pineda (2-1) permitted two runs over seven innings in a solid follow-up to his dominant outing last Monday. The right-hander retired his first 20 batters during New York's home opener and struck out 11 over 7 2/3 innings for an 8-1 victory against Tampa Bay. The strong encore Sunday was particularly encouraging to the Yankees, yearning for a steady season from a talented pitcher who has been maddeningly inconsistent throughout his tenure with the team. \"It's important because you want him to keep going, and get some momentum,\" manager Joe Girardi said . \"He had a hard time doing that last year.\" Yadier Molina 's leadoff homer in the seventh trimmed it to 4-2, but Pineda maintained his poise and retired the next three batters. \"After the second inning, I got more energy,\" he said. \"I'm working so hard to be consistent every five days.\" Austin Romine and Ronald Torreyes, the bottom two batters in the order, each had a two-run double against reliever Miguel Socolovich during a five-run eighth that made it 9-2. The late outburst sealed New York's sweep of an early interleague series between two of baseball's most successful and storied franchises. Chase Headley , who also reached safely every time up, singled to start the second, and Judge hit a drive to deep right-center, where a fan reached out just next to the auxiliary scoreboard hoping to catch a home run. The ball popped out of the man's mitt and back into play, triggering a fan interference call by the umpires. Following a replay review that lasted nearly three minutes, the ruling stood and Judge remained at third with an RBI triple — even though it appeared his shot would have easily cleared the fence if not for the eager fan. \"I think that was my first career triple,\" Judge said. \"So I don't mind it.\" Bird made all that moot for the Yankees when he sent Wainwright's next pitch way over the right-field wall and into the elevated bleachers for his first home run since Oct. 1, 2015, against Boston. The 24-year-old first baseman missed last season while recovering from shoulder surgery after hitting 11 homers in 46 games as a rookie in 2015. Following an outstanding spring, Bird began the night 1 for 26 this season and hitless in his past 20 at-bats. But Girardi said before the game he saw some good signs Saturday and was committed to keeping the promising young slugger in the lineup. \"My timing was messed up,\" said Bird, who went 3 for 3 with a double and a walk. \"Tonight, I really just tried to simplify and swing at strikes.\" Hicks added a solo homer off Wainwright in the fifth. A BRONX TALE Minus injured catcher Gary Sanchez , the Yankees have won their first six home games for the first time since opening 7-0 in the Bronx in 1998. The Cardinals are 0-6 at Yankee Stadium since Bob Gibson and Tim McCarver propelled them to a 10-inning victory in Game 5 of the 1964 World Series. \"We just got swept. I don't have a whole lot of positive in my mind right now. Just trying to figure out all the things we can get better at,\" St. Louis manager Mike Matheny said. \"We just know there's a whole different level of baseball we have.\" TRAINER'S ROOM Cardinals: 1B Matt Carpenter was hit in the bare hand by Hicks' first-inning groundout and appeared to damage the nail on his right ring finger. A trainer worked on Carpenter, who initially had blood streaming all over his hand. He remained in the game. Yankees: DH Matt Holliday (stiff lower back) sat out for the second consecutive day against his former team, denying him a chance to face good buddy Wainwright. Girardi said Holliday felt much better, however, and he would be surprised if the veteran slugger wasn't available to play Monday. UP NEXT Cardinals: RHP Lance Lynn (0-1, 5.23 ERA) faces Pittsburgh RHP Ivan Nova (1-1, 2.25) in the opener of a three-game series Monday night in St. Louis. Yankees: LHP Jordan Montgomery makes his second major league start Monday night against Chicago White Sox lefty Derek Holland (1-1, 1.50 ERA)."}]