[{"uuid": "95eef5b6a75142bae72c797d022a07dec181e5a1", "url": "http://omgili.com/ri/.wHSUbtEfZQ3c1Tai1ODOL513Eo_Y7eHtEN0AqcAhnMkLIxD4u8pGavjybiT2lguCwQ8VlWNjzPVrMRWhks_lL9WwVAqdMT4guJsU2aNWjeZ2riQAUCoUPA9cjdAVa1q", "title": "Oral contraceptives reduce general well-being in healthy women", "author": "", "rating": null, "published": "2017-04-18T21:17:00.000+03:00", "highlightText": "", "entities": {"organizations": [], "locations": [], "persons": []}, "highlightTitle": "", "thread": {"uuid": "95eef5b6a75142bae72c797d022a07dec181e5a1", "url": "http://omgili.com/ri/.wHSUbtEfZQ3c1Tai1ODOL513Eo_Y7eHtEN0AqcAhnMkLIxD4u8pGavjybiT2lguCwQ8VlWNjzPVrMRWhks_lL9WwVAqdMT4guJsU2aNWjeZ2riQAUCoUPA9cjdAVa1q", "site_full": "medicalxpress.com", "title": "Oral contraceptives reduce general well-being in healthy women", "site_section": "http://medicalxpress.com/rss-feed/health-news/", "domain_rank": 29082, "published": "2017-04-18T21:17:00.000+03:00", "title_full": "Oral contraceptives reduce general well-being in healthy women", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "Health News - Health, Health Technology", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2016/pills.jpg", "site": "medicalxpress.com"}, "external_links": [], "language": "english", "text": "Oral contraceptives reduce general well-being in healthy women April 18, 2017 Pills. Credit: Public Domain \nOne of the most common combined oral contraceptive pills has a negative impact on women's quality of life but does not increase depressive symptoms. This is shown by a major randomised, placebo-controlled study conducted by researchers at Karolinska Institutet in Sweden in collaboration with the Stockholm School of Economics. The results have been published in the scientific journal Fertility and Sterility . \n\"Despite the fact that an estimated 100 million women around the world use contraceptive pills we know surprisingly little today about the pill 's effect on women's health. The scientific base is very limited as regards the contraceptive pill's effect on quality of life and depression and there is a great need for randomised studies where it is compared with placebos,\" says professor Angelica Lindén Hirschberg at the Department of Women's and Children's Health at Karolinska Institutet. \nShe has led just such a study together with Niklas Zethraeus, associate professor at the Department of Learning, Informatics, Management and Ethics, Anna Dreber Almenberg from the Stockholm School of Economics, and Eva Ranehill of the University of Zürich. 340 healthy women aged between 18 and 35 were treated randomly over the course of three months with either pills with no effect (placebos) or contraceptive pills containing ethinylestradiol and levonorgestrel, the most common form of combined contraceptive pill in Sweden and many other countries. Neither the leaders of the experiment nor the subjects knew which treatment was given to which women. \nThe women who were given contraceptive pills estimated their quality of life to be significantly lower than those who were given placebos. Both general quality of life and specific aspects like mood/well-being, self-control and energy level were affected negatively by the contraceptives. On the other hand, no significant increase in depressive symptoms was observed. \nSince the changes were relatively small, the results must be interpreted with a certain amount of caution, the researchers emphasise. In the case of individual women, however, the negative effect on quality of life may be of clinical importance. \n\"This might in some cases be a contributing cause of low compliance and irregular use of contraceptive pills. This possible degradation of quality of life should be paid attention to and taken into account in conjunction with prescribing of contraceptive pills and when choosing a method of contraception,\" says Niklas Zethraeus. \nThe type of combined contraceptive pill that was used in the study (etinylestradiol + levonorgestrel) is recommended in many countries as the first choice since it is considered to entail the least risk of thrombosis among the combined contraceptive pills. The findings from the study cannot be generalised to other kinds of combined contraceptive pills because they may have a different risk profile and side-effects. Apr 17, 2017 0 Early impact of the affordable care act on oral contraceptive cost sharing September 7, 2016 \nOral contraceptives are the most commonly used contraceptive method in the United States. Forty-one percent of unintended pregnancies are estimated to occur in women using contraception inconsistently. When the pill is not ... Women who take the pill protected from some cancers for up to thirty years March 22, 2017 \nWomen who have taken the oral contraceptive pill are protected from some types of cancer for as long as thirty years according to new research from The University of Aberdeen. Study confirms some contraceptive pills more likely to cause blood clots October 25, 2011 \nA study published in the British Medical Journal today confirms previous findings that certain oral contraceptive pills are more likely to cause serious blood clots (venous thromboembolism - VTE ) than others. The pill won't kill your sexual desire, researchers say December 15, 2016 \nTaking the pill doesn't lower your sexual desire, contrary to popular belief, according to research published in the Journal of Sexual Medicine. The authors of the research, from the University of Kentucky and Indiana University ... Birth control pills pose small but significant stroke risk September 18, 2015 \nBirth control pills cause a small but significant increase in the risk of the most common type of stroke, according to a comprehensive report in the journal MedLink Neurology. Review compares metformin, OCP for teens with PCOS April 28, 2016 \n(HealthDay)—For adolescents with polycystic ovarian syndrome (PCOS), treatment with metformin and oral contraceptive pills can be beneficial, although evidence is limited, according to a review published online April 28 ... Recommended for you Cycling or walking to and from work linked to substantial health benefits April 19, 2017 \nActive commuting by bicycle is associated with a substantial decrease in the risk of death from all causes, cancer and cardiovascular disease (CVD), compared with non-active commuting by car or public transport, finds a study ...   \n  With beetroot juice before exercise, aging brains look 'younger': study April 19, 2017 \nDrinking a beetroot juice supplement before working out makes the brain of older adults perform more efficiently, mirroring the operations of a younger brain, according to a new study by scientists at Wake Forest University. April 19, 2017 \nWhen the people you know run more, you run more. And now there's data to prove it. Air pollution can be as bad for wellbeing as partner's death, say researchers April 19, 2017 \nExposure to Nitrogen Dioxide (NO2) can be as bad for people's happiness as bereavement or divorce, according to a study by the University of York. Researchers find strong link between fast-food ads and consumption among pre-schoolers April 18, 2017 \nPre-school age children who are exposed to child-targeted fast-food advertising on television are considerably more likely to consume fast-food products, according to a recent Dartmouth-led study published in the journal ...", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:42.000+03:00"}]