[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/.wHSUbtEfZSk1IT.8jZp7t..PCoqG00YcYr7bn9OB6VHts5Mj5luWtDL4RjpgNbaNl0owPcUR2W7BMOQVGx.AkdMNtPXFT9H", "title": "Compared to what?", "site_type": "blogs", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "https://mrrichardebauer.wordpress.com", "spam_score": 0.0, "section_title": "Compared to what? – mrrichardebauer", "site": "wordpress.com", "site_full": "mrrichardebauer.wordpress.com", "performance_score": 0, "uuid": "961f228d50db86fb425d94268d03c2c4dbe3df50", "published": "2017-04-17T11:23:39.000+03:00", "site_categories": [], "country": "US", "title_full": "Compared to what?", "participants_count": 1, "main_image": null}, "url": "http://omgili.com/ri/.wHSUbtEfZSk1IT.8jZp7t..PCoqG00YcYr7bn9OB6VHts5Mj5luWtDL4RjpgNbaNl0owPcUR2W7BMOQVGx.AkdMNtPXFT9H", "title": "Compared to what?", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:23:39.000+03:00", "language": "english", "entities": {"locations": [], "persons": [], "organizations": []}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "961f228d50db86fb425d94268d03c2c4dbe3df50", "published": "2017-04-17T11:23:39.000+03:00", "author": "mrrichardebauer", "text": "A quick look at Yelp reviews will show you that NY restaurants are not quite as good as those in some suburbs.\nThis, of course, makes no sense. New York is insanely competitive, with a ton of turnover and a very demanding audience. A fast casual restaurant in Shaker Heights can coast for a long time, because… it’s better than the alternatives.\nThanks to marketing, the media and our culture, we spend a lot of our time comparing before we decide whether or not we’re happy.\nTurn back the clock just 60 years. If you lived in 1957, how would your life compare to the one you live right now? Well, you have access to lifesaving medicines, often in pill form. You can choose from an infinite amount of entertainment, you can connect with humans all over the Earth, for free, at the click of a button. You have access to the sum total of human knowledge. You have control over your reproductive cycle. You can eat sushi (you’ve even heard of sushi). You can express yourself in a thousand ways that were forbidden then…\nThat’s in one lifetime.\nBut we don’t compare our lives to this imaginary juxtaposition. Instead, we hear two things from the media we choose to engage with: Other people have it better, way better. And, it’s going to get worse. Add to that the idea that marketers want us to believe that what we have now isn’t that good, but if we merely choose to go into a bit of debt, we can buy our way to a better outcome…\nComparison leads to frustration which sometimes leads to innovation.\nMore often than not, though, frustration doesn’t make us happy. It only makes us frustrated.\nIf a comparison isn’t helping you get to where you’re going, it’s okay to ignore it.\n\n             from Seth Godin’s Blog on marketing, tribes and respect http://ift.tt/2p9fIxK "}]