[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/8HG_hanVOKxUmqTBmI3yCKbW6e_aKQnlV8fXkhRij76FT9bl7osZzL03P86omQZM2euTe2TykNyzsWUa5BO0oQD5XAjeQhph", "title": "Pick of the Week 24", "site_type": "blogs", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://probationmatters.blogspot.com/", "spam_score": 0.0, "section_title": "On Probation Blog", "site": "blogspot.com", "site_full": "probationmatters.blogspot.com", "performance_score": 0, "uuid": "992759f1e536edcce576be9fc02fd88e66c88436", "published": "2017-04-17T11:24:46.000+03:00", "site_categories": [], "country": "US", "title_full": "Pick of the Week 24", "participants_count": 1, "main_image": null}, "url": "http://omgili.com/ri/8HG_hanVOKxUmqTBmI3yCKbW6e_aKQnlV8fXkhRij76FT9bl7osZzL03P86omQZM2euTe2TykNyzsWUa5BO0oQD5XAjeQhph", "title": "Pick of the Week 24", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:24:46.000+03:00", "language": "english", "entities": {"locations": [{"name": "interserve", "sentiment": "none"}, {"name": "cheshire", "sentiment": "none"}, {"name": "interswerve", "sentiment": "none"}, {"name": "merseyside", "sentiment": "none"}, {"name": "interswerve manchester", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "interswerves", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "persons": [{"name": "pick of the week", "sentiment": "none"}, {"name": "interserve", "sentiment": "none"}, {"name": "grayling", "sentiment": "none"}, {"name": "christopher", "sentiment": "none"}, {"name": "chris edwards", "sentiment": "none"}, {"name": "frank", "sentiment": "none"}, {"name": "yvonne thomas", "sentiment": "none"}, {"name": "yvonne t", "sentiment": "none"}, {"name": "edwards", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "tommy aikens", "sentiment": "none"}], "organizations": [{"name": "certificate of qualification in social work", "sentiment": "none"}, {"name": "citizens advice bureaux", "sentiment": "none"}, {"name": "rar", "sentiment": "none"}, {"name": "justice committee", "sentiment": "none"}, {"name": "volvo", "sentiment": "none"}, {"name": "noms", "sentiment": "none"}, {"name": "ttg", "sentiment": "none"}, {"name": "hdc", "sentiment": "none"}, {"name": "interserve", "sentiment": "none"}, {"name": "nps", "sentiment": "none"}, {"name": "spo", "sentiment": "none"}, {"name": "napo", "sentiment": "none"}, {"name": "directory of services", "sentiment": "none"}, {"name": "jsc", "sentiment": "none"}, {"name": "psc", "sentiment": "none"}, {"name": "mcrc", "sentiment": "none"}, {"name": "oasys", "sentiment": "none"}, {"name": "interchange managers", "sentiment": "none"}, {"name": "manchester crc", "sentiment": "none"}, {"name": "cgm", "sentiment": "none"}, {"name": "pso", "sentiment": "none"}, {"name": "t&c", "sentiment": "none"}, {"name": "greater manchester crc", "sentiment": "none"}, {"name": "skype", "sentiment": "none"}, {"name": "crc", "sentiment": "none"}, {"name": "pscs", "sentiment": "none"}, {"name": "interserve interserve interserve", "sentiment": "none"}, {"name": "society", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "992759f1e536edcce576be9fc02fd88e66c88436", "published": "2017-04-17T11:24:46.000+03:00", "author": "Jim Brown (noreply@blogger.com)", "text": "As we wait and see if the rumours are true regarding the long-awaited Probation Review being kicked into the long grass of Autumn, here are some powerful contributions that particularly caught my eye over the last week or so:- \n\nMorning fellow blogees and what a great weekend to reflect on the failures of the prison and probation 'reforms'. I am sure most of us would agree that 'reform' is just a pseudonym for enormous financial cuts in this time of austerity. There is no actual reform is there..nothing that could be described as an actual improvement to services. Here is a snapshot of 'reform' to the management of offenders in the community over the past 25 years from someone who has recently taken early retirement.  \n\nRemove our professional qualification and take social work out of probation. Let's face it the Certificate of Qualification in Social Work was more representative of our job which incorporates many aspects of social work, working with mental health, drugs and alcohol, domestic violence, child protection...bread and butter of social workers. Concentrating on only criminology or even psychology is missing the major environmental factors that are in need of change. Society v individual as the cause of crime. This government would prefer to blame the individual rather than focus on failings of society. \n\nCreation of PSO's as opposed to fully qualified PO only. Ok I know this is contentious. I actually think there IS a role for PSO's and have worked with many in my time but it is a bit like teaching assistants in schools. Until they are accredited fully and have years of experience behind them they need close supervision and support. They should not be employed and then immediately given large caseload of low to medium risk offenders which is what happens now. It is similar to the news recently with large numbers of classroom assistants left in charge of classes. Gradual erosion of professional standards is not good for anyone. Just because you don't need a professional qualification to be an MP it doesn't mean other professions don't or do. We want to go back to the days of asking the barber to stitch a wound or pull teeth?! \n\nLoss of community reporting offices and day centres. Gone are the days when you knew your local area and everyone operating services there. Some staff were running services voluntarily such as football groups or groups for women on probation. It wasn't cute n cuddly social work, it was a lifeline for some people who have told me years later in the street how much it meant to them! Now service users have to travel miles to get to a central office or 'hub' which seems to be the new fangled word! \n\nGroupwork: groupwork rose to prominence but never replaced one to one work entirely. 2 years ago there were about 8 different groups in my area but post privatisation they have shrunk to about 4 and I am told even lower now as staff running them have left and need to train people up. Doesn't sound like progress to me. \n\nRAR days! Hmmmm..do magistrates really know what a RAR day is I wonder? Surely this is just basic one to one supervision or a group which is what we were doing anyway when we had the time. A trip to the jobcentre? Come on! People would be doing that anyway.. just a renaming if you ask me! \n\nManagement. What was wrong with having one SPO managing one office! Worked for me but now TR means running around like a headless chicken supervising staff at 2 or even 3 offices and failing miserably. \n\nTraining. If it's free book staff on, if it costs forget it! No more in house training unit. So who is doing the basics such as managing risk, working with sex offenders? Ok, CRC don't work with sex offenders! Except when it is historical! Dodgy that!  \n\nCould go on for ever here! Anyway I'm off to mow the lawn on this sunny day and ponder the meaning of life. Back to work on Monday, early retirement doesn't mean you can't get another job but you can hopefully choose to do something a whole less stressful.\n\n\n\"Supervision\" rolled far more easily off the tongue in court, rather than \"rehabilitation activity requirement\", and far more straightforward to explain in terms of the Act and its practical application. I sometimes wonder whether these ridiculous changes are intended to fudge and confuse, all the easier to create an impression of something being done. What is a RAR day? I still don't know. How long does it last? If one is missed, does it require making up? Is there some mystical corner of ND that I've (easily) so far missed that shows how many RAR days have been completed on an ongoing order?\n\n\nWhat is a RAR day? Same goes for Post Sentence Supervision. Poorly defined concepts, poorly integrated and in consequence practitioners, managers and so called businesses alike confused and uncertain. Justice Committee sensibly asks for clarity on Prison Reform lest it be the dog's breakfast that is TR.\n\n\nRAR days = professionals running around like headless chickens ticking boxes and (forced to make some up if not enough are ticked), delivering meaningless interventions all so that the paymasters can get paid. Maybe this should be put in all PSRs when judges and magistrates ask for explanations as to what we do on RAR days.\n\n\nJust had a bizarre dream series where CRCs had been forced to hand contracts over to Citizens Advice Bureaux, and \"community rehabilitation\" was being delivered in libraries & train station cafes by freelance \"advisors\" who were paid in cash after downloading their contact details via a laptop into a CAB mobile server mounted in the boot of a white Volvo V70.\n\n\nThe answer, is 'No.' No-one has noticed - including politicians, journos, etc - because no-one really gives a rats arse. Probation-as-was was always under the radar, low key, understated, modest to the point of clinically shy. On a number of occasions this blog has highlighted the path of probation's demise, from 1992 & the CJAct which turned probation into a political plaything, through the cessation of SW training in 1995/6, NOMS in 2003, Trusts in 2007 to the implementation of TR in 2013. NAPO lost its way from 2005 on as NOMS's stranglehold tightened & Trusts were hatched, with Ledger metaphorically & literally fumbling in the dark.\n\nI've been out of the profession for some time now but I had chance to have conversations with some who are either still hanging on or more recently departed, and they have revealed shocking conditions in which people are working - bullying, incompetence, lying, no equipment, no management, no office, dismissals, people frog-marched out of offices... These are all things written about on this blog at various times, but which I've now had first-hand accounts of. It is monstrous how the privateers are behaving towards staff and clients.\n\nOne conversation was with an ex-colleague, now a senior manager, who thinks it's all just fine & dandy. They seemed well, positive, content and spoke enthusiastically about their achievements in the CRC interestingly, and without fail, that same person was named by others as a \"major local problem\" - variously referred to as a bully, a braggart who refuses to listen, rarely in the office, blames staff for everything, a liar & a fraud.\n\nA gaping chasm has opened up... is that where the simple truth has gone? Everywhere I look these days there are several varieties of truth. Take the US strikes on Syria. 59 tomahawk missiles were fired, but that's the only fact people can agree on. US say 58/59 landed on target. Russia say 23/59. Etc, etc...So Grayling's truth is not my truth - that much I do know!\n\n\nIt's clearly time for a blog special on the fiasco/failure/debacle/disaster that is Interserve's Cheshire and Manchester (and Merseyside, let's not pretend that's really separate) CRC - the very embodiment of cynicism with its institutional disdain for the real needs of its client group and a venomous contempt for the professional and personal integrity of what remains of its workforce.\n\n\nOff Piste I know... but you need an update on the lunacy that is Interserve and the now fabled Interchange Model....The CEO, young Mr Edwards and his now infamous blog; his updates have somehow managed to conflate the abject failure of Interserve to manage one of their contracts in their core role as facility management and subsequent loss of revenue with the service credits accrued by MCRC and CMCRC which are currently running in excess of 100 thousand pound sterling. How he manages to compare the failure to clean a toilet to a satisfactory standard with the production of an ISP that has a Risk Management Plan and good sentence plan in the same breath is bewildering at best...\n\nHe completely ignores; or if I am being kind; he cannot compute the serious high sickness rates, coupled with PSOs/POs leaving in droves... in tandem with those clueless Directors (ACOs) Interchange Managers (SPOs) who think that by cascading an email untouched or not explained sent from on high with a single note saying \"Please action\". Knowing the attachment being one of those heavy duty many-paged documents they want you to pick the bones out of and somehow implement... and you know what the coal face does... F9 Delete....  \n\nIf you can't be bothered to even try to explain in plain English what you want then it does not deserve my attention.... Off piste again with that rant but the latest offering from Interserve is that they want the flex teams (Pods, teams, units, in old money) to sort out amongst themselves, without any management oversight, no direction, no leadership, to reallocate case which may show as failing targets or cases that are 'drifting'. They want us to meet as flex team each week without any management involvement .. review their super duper Service Level Spreadsheets which are monitored by the poor old Case Coordinators (Case Admin, again in old money - there is a theme running here) and decide who should complete the ISP which is now too close to ignore as they are failing said target.  \n\nThe reason that the target is failing my dear Christopher, is because the ridiculous central focused Professional Service Centres (PSCs) are allocating new case to case managers at the start of their leave. So when they return from leave they ae faced with immediate failures.... Now the PSCs will blame the IMs (SPOs - Do keep up!!) for not completing their staffing spreadsheets which show who is available and who is not... but when the IMs have gone off sick or are trying their collective best to learn how to be facility managers (lets be honest, that is what they have turned into) who is in charge? Are the lunatics now running the asylum?...  \n\nWhen I sit down and have a good old one to one with little Tommy Aikens during one of our RAR sessions (Reality = A good old supervision session in old money).. We both end up sharing the same comfort blanket to get through our day... Just another day in the life... interRUPT, interFERE, interGALACTICAL, interMITTENT but very little (inter)service..\n\n\nAbsolutely spot on - Mr E is far too removed to actually care about staff - on one of his visits to offices where he wanted to be viewed as \"a listener/doer/caring\" all he kept banging on about was when \"everything was working effectively then it would make life easier to be a offender manager\" we told him to come back when this was actually happening and that due to the failure of the Interserve model and the stresses associated with it, all staff were dropping like flies or hanging on by our finger nails - I'm sure this was resonated by staff in all offices he visited - the management of Interserve are like the 3 monkey's \"hear no evil, see no evil, speak no evil\" - so much for their motto \"every one has a voice\" - well as long as you're saying what they want to hear!!\n\n\nI don't know how Chris can carry on being so deceitful, its like he knows the service has failed and can't offer anything to the staff but instead of admitting it he carry's on spouting nonsense. I used to think he was okay when he worked for the trust, but he has turned out to be a right pillock. Both him and his wife are doing very well thank you out of interswereve.\n\n\nIf I could afford to leave Interserve's Manchester CRC I'd be gone today. While staff are being run into the ground by unmanageable caseloads and impossible and pointless targets and deadlines the managers - sorry I mean 'executives' and 'directors' and 'Interchange managers' - are busy slapping each other on the back for the 'progress' we're making because they've rendered the already dismal working environment even more unpleasant by shutting most of the offices and making the remaining spaces look and feel like start-up call centres done on the cheap. If there are consultants who advise cut-throat companies on how to make job conditions so miserable that everyone will leave instead of having to be paid redundancy money, they're definitely working for Manchester CRC.\n\n\nI totally agree. I too work within Manchester CRC - I would so love to be able to leave but my finances at present dictate otherwise - Chris Edwards blog this week was of no surprise telling staff that he was impressed by those using Skype in order to cut down on travel expenses (not sure who these people are skyping instead of face to face contact - offenders ?). I've also been waiting (since I read it some time ago) for the \"we need to tighten our belts and not do anything to loose Interswerve any more money\" - they can't even manage a waste contract adequately.  \n\nHe also banged on about groups etc which we all know don't need half as many staff - I'm concerned and have been for some time (especially as Yvonne Thomas told the JSC that they didn't make as many cuts to staffing as they'd anticipated) that they will do so now they need to recoup their losses and nail them out of litigation (due to failed waste contract) - watch this space!! These really are bloody awful times and I totally agree that they want to shaft the experienced more expensive staff to be able to employ more niave inexperienced buggers on Interswerve contracts and T&C's whilst the exec, directors and the likes are of the belief that all in the garden is rosy - full of Interswerves waste Shit!\n\n\nI too would like to leave but can't afford to, however on some days I feel the salary does not add up to the horror and stress working for interswere. They are despicable. I knew the minute I was shafted to work for them that my career was over and that I no longer could uphold the values dignity and morals to help those that are most marginalised in society.\n\n\nYes, it's like there are two Interswerve Manchester CRCs - the special magical Interswerve/Management version where just saying 'inter' five times transforms lives and everything's 'innovative' and 'exciting', and then the real one where the totally demoralised and ever-dwindling staff group are crammed into miserable call centre style offices designed to sap their will to live, while being expected to supervise sixty or seventy cases each with no resources apart from a laptop computer that only works every other day. It's Hellish, and better still it's clearly meant to be hellish so that we'll fuck off and make way for cheaper and more desperate and malleable staff.\n\n\nI think Interswerve are beating the battle on that front from the comments regularly made about them on this blog, it won be long before the odd few staff that are left will leave, you can only suffer for so long. They'll keep getting paid and our lives will continue to be made miserable. Maybe the only staff left will be managers and they can deliver their own worthless piece of shit that they call the interchange model.\n\n\nA little off topic but can I just stress again how much we loath and despise our clueless and morally bankrupt parasite paymasters Interserve, and how their bizarre notion that Probation staff would have the slightest interest in celebrating being a part of what they risibly try to term the 'Interserve family' only makes us hate them all the more... The 'Interserve family' might just be the most repugnant notion I've encountered in my working life....\n\n\nThe chief executive of the Interserve owned Cheshire and Greater Manchester CRC today warned staff that Interserve's losses in their waste business mean that we as a CRC will now have to tighten our belts! Better still, in spelling it out he detailed how we are now expected to respond to Interserve's incompetence by...being of sick less!!\n\n\nAnd as for their 'Interchange model' - A list of words chosen purely because they start with the same five letters as 'interserve' is not a 'model', even if you have paid off a bunch of mercenary university hacks to pretend it is.\n\n\nAgain back to one of my previous posts, the people that are banging the Interswerve drum are Probation staff (Snr Probation officers etc ) - Chris Edwards and his cronies who are narcissists with fragile egos that believe all their own hype and who's bank balances are so much more important than the people that they trained and used to work closely with! - Interswerve have obviously seen their greed and naivety as I'm sure when the going gets tougher Interswerve will (here's hoping) will kick them to the kerb like they've done with everything and everyone else they've touched.\n\n\nI too work for interswerve CGM - I agree in the fact that \"most\" but not all IM's are approachable, however quite a few now have no case manager experience (?) as they've been shafted into the role from being programme managers. \n\nWe received an email today highlighting the fact that NPS will no longer be  loosening the shackles\" and will be rejecting breaches for whatever reason, probably only known to them - numerous colleagues of mine have already experienced breach rejections/failures due to no fault of their own but reasons that the gatekeeping NPS team decided without liaising with said case manager. \n\nThe PSC's regularly get so many things wrong making life very difficult - the majority of staff I speak with feel that their job now entails more administrative duties due to the new model. Case loads are far to high (people have 60 - 100 cases) resulting in most staff being unable to prioritise as everything's a priority - it's a horrible feeling juggling plates like this knowing at some point you're going to drop a few (which could result in an SFO). Staff I know (I've been around quite a long time) experienced ones at that, have dropped like flies due to stress levels of holding so many cases (hearing a name and thinking 'who the hells that?', please tell me they're not on my case load).\n\n\nJust the word 'Interserve' makes my flesh crawl. 'Purple Futures' was bad enough, but Interserve have now abandoned even any pretence of leading a 'partnership'. They plainly don't give a fuck about Shelter still taking our money and yet barely even bothering even to pretend to provide a meaningful 'Through the Gate' service. No one knows who 3SC are or what the fuck they even claim to do. P3 operate a criteria whereby they only provide support to clients who can demonstrate that they don't need it and otherwise it's just Interserve Interserve Interserve all the way. Better still, despite their transparent efforts to deprofessionalise our service, they seem to have some bizarre notion that we might somehow respect their filthy money-grubbing organisation and in some way be pleased or even proud to be a part of their 'Interserve family'. Their efforts to try and make us believe that they are our 'friend' or that they could give a damn about the people we work with truly make me want to vomit. Do they really not understand that as a workforce we have nothing but contempt for them and for everything they stand for? Fuck Interserve.\n\n\nSeeing Interswerves \"Ingenuity at work\" signs on everything makes me feel incensed!! Through the gate staff don't even have access to NDelius so have no bloody idea who they need to contact, hence \"we\" are told that we have to make contact with TTG staff in whatever prison with ALL our custody cases, which yet again is a massive task, also part of Interswerves Appraisal objectives!!  \n\nAs part of Interswerves model we're supposed to have a \"directory of  local) services\" run by 3SC which is not fit for purpose but supposedly we use them for RAR days as they are \"supposed\" to be services that are locally commissioned by PS3 to provide CRC's services (really?) - one service on there is \"phone FRANK\" again REALLY! I'm sure courts would love to hear that we completed RAR days by phoning FRANK! - I totally agree with you it make me ill, however what makes me feel worse are the management that were previously Probation Officers that have sold their soul's to Interswerve and now appear to have no sign of professional nor personal integrity.\n\n\nWell said. Interswerve are a deplorable company but always try to hide behind a made up image that they actually care. Do they seriously think that we are unable to see through their greedy bullshit. I wish they would F off and take their daft interchange model with them, they could try using it on their cleaning contracts.\n\n\nHere's the thing with PF/Interserve. MCRC now has such a terrible reputation with Crown Court judges, District Judges and lay Magistrates. It really is bubbling under the surface. Directors, or ACOs in old money, have been called to account by the Recorder and District Judges for such poor quality of cases not being managed. They are rapidly loosing confidence.. So the bemused directors cobble together a very telling email to staff outlining the 'reputational damage' this is causing and people need to sort this out as a matter of absolute importance. Essentially waving a big stick.  \n\nThey, bless their poor corporate souls, fail miserably in recognising that the IT is so poor, the new PSOs are not trained, those poor sods have re located from admin, accommodation and HQ posts that were got rid of during the great run down of Trusts are now holding 70-80 cases with the most half-arsed on the job training, no idea about OASys sentence plans, RMPs, breach reports, evidence to support breaches, when to breach, HDC, ROTL etc etc etc.... Then, surprise surprise, these people leave in droves, and the cases left behind are by any standard in an absolute mess.  \n\nThe good old boys and gels who now hold nice fancy titles like Interchange Director are literally clueless completely out of their collective depths. The so called DOS (Directory of Services) to support RAR activity well it is merely just a poor quality spreadsheet that is at best described as embarrassing and at worst... well its just criminal. So what do you do when you are handed another dozen or so re-allocated cases that on inspection really does turn your blood cold? You draw a line under the past management and move forward. Sod reputational damage if it is in a unrecoverable mess, then send it back from whence it came saying not in my name... or return it to court in your name but having to expose the mess.. \n\nThis is left at PSO/PO level to sort with that great management default phase ringing in your ears \"Just do your best\".... leadership at its very best... Yvonne T, if you happen to read this blog, I know you or at the very least your bright young things do... either hand back the keys or come down to the coal face and turn over some stones and see for yourself.. "}]