[{"uuid": "9af39fdeedb160dc95813939c5b2c39cbf4e90bd", "url": "http://omgili.com/ri/vkc1Z8ITDMt_dSfV6WEqQ93Jqnb0AQnXounEQm.q9lZFYILc9dGnt8FhWPLsBB6immRllMN1jH5zcNWwx6evGRRJWPl9E0qN6zp50PdrsuI7jhcaythqzE_b9sKVO_AN", "title": "“The Fishery is Gone”: Harvesters Burn Their Gear Before DFO Building", "author": "Andrew Hawthorn", "rating": null, "published": "2017-04-18T20:40:00.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "cleary  dfo", "sentiment": "none"}, {"name": "dfo", "sentiment": "none"}], "locations": [{"name": "port au choix", "sentiment": "none"}, {"name": "white hills", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}, {"name": "northern peninsula", "sentiment": "none"}, {"name": "twillingate", "sentiment": "none"}], "persons": [{"name": "ryan", "sentiment": "none"}, {"name": "richard gillett", "sentiment": "none"}, {"name": "terry ryan", "sentiment": "none"}, {"name": "dominic leblanc", "sentiment": "none"}, {"name": "donald spence", "sentiment": "none"}, {"name": "stella mailman", "sentiment": "none"}, {"name": "gillett", "sentiment": "none"}, {"name": "ryan cleary", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "9af39fdeedb160dc95813939c5b2c39cbf4e90bd", "url": "http://omgili.com/ri/vkc1Z8ITDMt_dSfV6WEqQ93Jqnb0AQnXounEQm.q9lZFYILc9dGnt8FhWPLsBB6immRllMN1jH5zcNWwx6evGRRJWPl9E0qN6zp50PdrsuI7jhcaythqzE_b9sKVO_AN", "site_full": "vocm.com", "title": "“The Fishery is Gone”: Harvesters Burn Their Gear Before DFO Building", "site_section": "http://vocm.com/rss/rssfeed.rss?popular=1", "domain_rank": 47387, "published": "2017-04-18T20:40:00.000+03:00", "title_full": "“The Fishery is Gone”: Harvesters Burn Their Gear Before DFO Building", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "VOCM - News Feed", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://vocm.com/wp-content/uploads/2017/04/DFO-Port-au-Choix-protest-1.jpg", "site": "vocm.com"}, "external_links": [], "language": "english", "text": "VIDEO “The Fishery is Gone”: Harvesters Burn Their Gear Before DFO Building April 18, 2017 | 10:10 am Last Updated:April 18, 2017 | 2:30 pm \nFish harvesters on the Northern Peninsula are gathering outside the DFO building in Port au Choix today to burn their gear in light of major cuts to shrimp and crab quotas. \nSpokesperson Stella Mailman says the gear is no longer needed because “the fishery is gone”. \nShe says harvesters figure they might as well get some heat from it, since it’s no longer useful to them. \nMailman says even the halibut fishery is of no use to local harvesters. She says the halibut quota is 150 tonnes, but 50 tonnes right off the top is being provided to the FFAW for research, and harvesters want to know why. Pictures and video courtesy Donald Spence “All Hell is Going to Break Loose,” Warns Fisherman \nA shrimp fisherman who stormed DFO headquarters just over a week ago warns “all hell is going to break loose” as the state of the province’s fishery starts to hit home. \nRyan calls it a “sad day” when fishermen have to force their way into a government building, and when a fisherman with diabetes and a heart condition has to conduct a hunger strike to get government attention. \nRichard Gillett of Twillingate is into the sixth day of his protest on the lawn of DFO headquarters in the White Hills. \nRyan says harvesters have been put down too long. \nHe says harvesters are partially to blame for being too docile, but warns “all hell is going to break loose.” \nTerry Ryan says he didn’t get any satisfaction out of a recent visit to Ottawa to outline their concerns. \nHe says provincial MPs were all “crackies” when they were in opposition, but now they won’t say anything against their party, the governing Liberals. DFO Officials Hold ‘Substantive’ Meeting with Gillett, Cleary \nDFO says senior regional officials had what it’s calling a “substantive” meeting with Richard Gillett and Ryan Cleary yesterday. \nIn a released statement, DFO says Fisheries Minister Dominic LeBlanc has been kept apprised of the situation and Gillett’s hunger strike. \nThe department says fisheries management decisions are made in a transparent manner with fish harvesters at the table with scientists when reviewing the state of fish stocks. \nIt says management decisions are evidence-based with the ultimate goal to conserve public resources for use now and in future generations. \nIt says as far as the relationship between DFO and the FFAW goes, the certification process of bargaining agents is the decision of harvesters in conjunction with provincial legislation and DFO works with whomever harvesters choose to represent them.", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:30.000+03:00"}]