[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:31:23.000+03:00", "author": "Inge &#124; The Belgian Reviewer", "entities": {"persons": [{"name": "sarah flint", "sentiment": "none"}, {"name": "sarah", "sentiment": "none"}, {"name": "stafford", "sentiment": "none"}, {"name": "cornell miller", "sentiment": "none"}, {"name": "charlie", "sentiment": "none"}, {"name": "robert bryndza", "sentiment": "none"}, {"name": "angela marsons", "sentiment": "none"}, {"name": "moses", "sentiment": "none"}, {"name": "charlotte stafford", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "chick lit club", "sentiment": "none"}, {"name": "aria", "sentiment": "none"}, {"name": "sarah flint facebook", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "text": "\nWhat’s it about? He’s watching, waiting… and counting. The next gripping serial killer read in the DC ‘Charlie’ Stafford series, from the bestselling author of Mummy’s Favourite. Perfect for fans of Angela Marsons.\nHe keeps each one floating in formaldehyde to stop them from rotting. Each finger denotes a victim, tortured and butchered, their heart ripped out and discarded, replaced instead by symbols of their treachery. He sits alone admiring his trophies weekly; each and everyone of them guilty in his eyes. And now more must pay.\nBut who or what links the victims?\nDC ‘Charlie’ Stafford is already investigating a series of escalating racist attacks and it now seems she has a vicious serial killer on her patch. With no leads and time running out, the team at Lambeth are at near breaking point.\nSomething has to give… and all the while he’s watching, waiting… and counting.\nBuy links Amazon | Kobo | iBooks | Google Play \nConnect with Sarah Flint Facebook: @SarahFlintBooks\nTwitter: @SarahFlint19\nAbout Sarah Flint \nWith a Metropolitan Police career spanning 35 years Sarah has spent her adulthood surrounded by victims, criminals and police officers. She continues to work and lives in London with her partner and has three older daughters.\nReview \nI really enjoyed reading The Trophy Taker. This is the second novel about DC Charlotte Stafford but is perfect to read as a standalone novel. The story is set in London this time and Charlie is a withered and serious detective. Her hair and clothes could use some improvement but there’s nothing to say about her skills, or of those of the rest of her team. They are tightly knit and it was great to see them working together and see the contributions from other team members too.\nThe story starts out with her troubles with Cornell Miller who carried out a racist attack on an old, kind man who’s been hiding in his house ever since. She’s vowed to protect Moses and will try her utmost but will have to divide her time chasing The Trophy Taker too. The first victim of this killer is found in a cemetery, her heart is ripped out and tossed on the ground, her ring finger missing.\nI was happy to read about some real police work in this novel and thanks to this outstanding detective work suspicion falls fairly soon on not one but no less than three possible suspects. All of these men have something to hide and a possible motive. I never had a problem believing their motive. The author kept me guessing good and let me have a good time figuring it out on myself.\nI wasn’t entirely surprised who the killer finally turned out to be and I knew for sure a few pages before Charlotte Stafford did, but then I really don’t need much to get on the right trail ;-). It was still entertaining to see how it all played out and how she really got on the right track, involving Cornell Miller even in her chase for the killer. She did an excellent job of letting these two storylines mix in the end.\nIf you like a nice police procedural novel, this novel is certainly comparable to Robert Bryndza’s series and I can definitely recommend adding The Trophy Taker to your reading list.\nI received a free copy from the publisher, Aria, in exchange for my honest opinion. \nFollow Aria Website: http://www.ariafiction.com \nFacebook: @ariafiction\nTwitter: @aria_fiction\nInstagram: @ariafiction\nNetGalley: http://bit.ly/2lkKB0e \nSign up to the Aria newsletter: http://bit.ly/2jQxVtV \nTake a look at the rest of the blog tour too, next up will be: Chick Lit Club Connect \n", "url": "http://omgili.com/ri/.wHSUbtEfZRNRpJtx15GEOzNMp3eo.gfgPRrH6IgzzRAMzuVSNES6XHKjU36BDmckrMjHKKM5FoYlX9ddeZ_9XiQFpXOWqY8sBYul6QfXDPEwl8YWeMGQz2pbTw9B.8Cwj_dUNVtP84-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:31:23.000+03:00", "language": "english", "title": "The Trophy Taker by Sarah Flint #BlogTour #BookReview", "thread": {"title_full": "The Trophy Taker by Sarah Flint #BlogTour #BookReview", "site_full": "thebelgianreviewer.wordpress.com", "site": "wordpress.com", "site_section": "https://thebelgianreviewer.wordpress.com", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "The Trophy Taker by Sarah Flint #BlogTour #BookReview – The Belgian Reviewer", "url": "http://omgili.com/ri/.wHSUbtEfZRNRpJtx15GEOzNMp3eo.gfgPRrH6IgzzRAMzuVSNES6XHKjU36BDmckrMjHKKM5FoYlX9ddeZ_9XiQFpXOWqY8sBYul6QfXDPEwl8YWeMGQz2pbTw9B.8Cwj_dUNVtP84-", "published": "2017-04-16T11:31:23.000+03:00", "title": "The Trophy Taker by Sarah Flint #BlogTour #BookReview", "uuid": "9c6ae84f5d5dee934e2ac9e53e9550c2cac09665", "main_image": null}, "uuid": "9c6ae84f5d5dee934e2ac9e53e9550c2cac09665", "ord_in_thread": 0}]