[{"entities": {"organizations": [{"name": "east asia nonproliferation program", "sentiment": "none"}, {"name": "penn station stampede", "sentiment": "none"}, {"name": "wikileaks", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "facebook tweet", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "trump budget", "sentiment": "none"}, {"name": "trump hotel", "sentiment": "none"}, {"name": "facebook page reveals about domestic violence trump", "sentiment": "none"}, {"name": "defense", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "top court", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "middlebury institute of international studies", "sentiment": "none"}, {"name": "popular girls", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "dnc", "sentiment": "none"}, {"name": "cia", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "doed’s office of civil rights", "sentiment": "none"}], "locations": [{"name": "pyongyang", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "sea of japan", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "san bernardino shooter", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "china warns u.s.", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "u.s.-south korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "ethiopia", "sentiment": "none"}, {"name": "hudson river the new york", "sentiment": "none"}], "persons": [{"name": "ed jones/afp/getty images", "sentiment": "neutral"}, {"name": "mike pompeo", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "jeffrey lewis", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}, {"name": "stephen miller", "sentiment": "none"}, {"name": "dubya", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "sheila abdus-salaam", "sentiment": "none"}, {"name": "bannon", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "elizabeth warren", "sentiment": "none"}, {"name": "lewis", "sentiment": "none"}, {"name": "richard spencer", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "james mattis", "sentiment": "none"}, {"name": "martyn williams", "sentiment": "none"}, {"name": "bill o’reilly", "sentiment": "none"}, {"name": "christ", "sentiment": "none"}, {"name": "paul lepage", "sentiment": "none"}, {"name": "kyle mizokami", "sentiment": "none"}, {"name": "duyeon kim", "sentiment": "none"}]}, "uuid": "9eef843d770fcf023b5a0d4beccf95c5db3dae73", "highlightText": "", "title": "North Korea Parades New Missiles, Then Fails to Launch One", "thread": {"site": "nymag.com", "country": "US", "participants_count": 1, "site_full": "nymag.com", "section_title": "NYMag - Politics, Entertainment, Fashion, Restaurants &amp; NY", "uuid": "9eef843d770fcf023b5a0d4beccf95c5db3dae73", "site_section": "http://nymag.com/", "domain_rank": 1627, "main_image": "http://pixel.nymag.com/imgs/daily/intelligencer/2017/04/16/16-north-korea-new-icbms.w1200.h630.jpg", "performance_score": 1, "published": "2017-04-16T20:38:00.000+03:00", "url": "http://omgili.com/ri/snFTpiOKdJX_Q.Hl4wZ3hP2nZo8dvp7hnjxfgg93aGXMe1Gpo2olc8YjJMCXJ3k5t5.kChOfGhg5Zk2sfNZO_heN3QM7rQ.SzpS2CWpe2RfS1K68R9sMW6aNHuSTqpQ6vS_IEaB73NmVV7lOwfCMRg--", "title_full": "North Korea Parades New Missiles, Then Fails to Launch One", "title": "North Korea Parades New Missiles, Then Fails to Launch One", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 177, "shares": 177, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 5}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T20:38:00.000+03:00", "url": "http://omgili.com/ri/snFTpiOKdJX_Q.Hl4wZ3hP2nZo8dvp7hnjxfgg93aGXMe1Gpo2olc8YjJMCXJ3k5t5.kChOfGhg5Zk2sfNZO_heN3QM7rQ.SzpS2CWpe2RfS1K68R9sMW6aNHuSTqpQ6vS_IEaB73NmVV7lOwfCMRg--", "ord_in_thread": 0, "crawled": "2017-04-16T23:16:51.000+03:00", "rating": null, "external_links": ["https://www.washingtonpost.com/news/worldviews/wp/2017/04/15/here-are-the-missiles-north-korea-just-showed-off-one-by-one/?utm_content=buffer1e9ec&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer", "http://www.japantimes.co.jp/news/2017/04/15/asia-pacific/north-korea-shows-off-suspected-icbm-massive-military-parade/#.WPHh_tVuKrE.twitter", "https://t.co/OevF5NYsQs", "https://twitter.com/martyn_williams/status/853083674631315456", "https://www.nytimes.com/2017/04/15/world/asia/north-korea-missiles-pyongyang-kim-jong-un.html?action=Click&contentCollection=BreakingNews&contentID=65163332&pgtype=article&_r=1", "https://www.washingtonpost.com/world/north-korea-shows-off-new-missiles-in-huge-military-parade-but-doesnt-test-nuclear-weapon/2017/04/15/ba8b447c-212b-11e7-bb59-a74ccaf1d02f_story.html?hpid=hp_hp-top-table-main_no-name%3Ahomepage%2Fstory", "https://t.co/s2mNBMuON2", "http://www.npr.org/2017/04/15/524132697/north-koreans-put-new-advanced-missiles-on-parade-in-pyongyang", "http://www.reuters.com/article/us-northkorea-usa-missile-idUSKBN17H0NL", "https://twitter.com/nknewsorg/status/853525920447070208", "https://twitter.com/KyleMizokami/status/853085602098462720", "https://t.co/c4KVjfdmAx", "http://www.reuters.com/article/us-northkorea-usa-anniversary-idUSKBN17G0WU", "http://thediplomat.com/2017/04/north-koreas-2017-military-parade-was-a-big-deal-here-are-the-major-takeaways/?utm_content=buffer7a3f9&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer", "https://twitter.com/share?text=North%20Korea%20Parades%20Troubling%20New%20Missiles%2C%20Then%20Fails%20to%20Launch%20One&url=http://nymag.com/daily/intelligencer/2017/04/north-korea-parades-new-missiles-then-fails-to-launch-one.html%3Fmid%3Dtwitter-share-di&via=intelligencer", "https://www.nytimes.com/2017/04/16/us/politics/north-korea-missile-launch-mike-pence.html", "http://www.facebook.com/sharer/sharer.php?u=http://nymag.com/daily/intelligencer/2017/04/north-korea-parades-new-missiles-then-fails-to-launch-one.html%3Fmid%3Dfb-share-di", "http://www.vulture.com/2017/04/survivor-contestant-outed-another-as-transgender.html"], "highlightTitle": "", "author": "", "text": "Vice-President Mike Pence and his daughter Audrey look across to the north side of the border in the Demilitarized Zone in Paju, South Korea, on April 17, 2017. Photo: SeongJoon Cho/Bloomberg via Getty Images North Korea did not celebrate its founder’s birthday on Saturday by testing a new nuclear weapon, as many had feared it would. Instead the North Korean regime literally paraded its missiles through Pyongyang , including new intercontinental ballistic missile (ICBM) systems that arms experts had never seen before. North Korea conducted a missile test on Sunday, but it failed , according to military officials in the U.S. and South Korea. It was likely a medium-range missile, which exploded almost immediately after launch.\nDefense Secretary James Mattis responded to the launch on Saturday night (U.S. time), seemingly speaking for the president and White House.“The president and his military team are aware of North Korea’s most recent unsuccessful missile launch,” he said in a statement. “The president has no further comment.”\nA White House official told the New York Times that while President Trump has many options available, he probably won’t respond to North Korea’s failed missile launch. “If it had been a nuclear test, then other actions would have been taken from the U.S.,” the official said.\nVice-President Mike Pence called the test a “provocation” when he arrived in South Korea on Sunday at the start of a four-nation Asia tour. Then, during a surprise visit to the Demilitarized Zone on Monday, Pence called the U.S. alliance with South Korea “ironclad,” and said North Korea “should not mistake the resolve of the United States of America to stand with our allies.”\n“[T]he era of strategic patience is over,” Pence said. “President Trump has made it clear that the patience of the United States and our allies in this region has run out and we want to see change. We want to see North Korea abandon its reckless path of the development of nuclear weapons, and also its continual use and testing of ballistic missiles is unacceptable.”\nRelated Stories The Problem With Trump’s Attempt to Scare North Korea Sunday’s missile test was North Korea’s fifth of the year. The reason it blew up is unknown, but such failures are a regular outcome for the regime. The Times reported that the U.S. began conducting a covert electronic war against North Korea’s missile program three years ago, though the extent of its success is not clear. President Obama apparently accelerated the program last year, and the Times notes that there has been a corresponding increase in the failure rate of North Korea’s tests since then.\nThe large collection of missile systems displayed during Saturday’s parade in Pyongyang still alarmed arms and nonproliferation experts. There were both new configurations of existing missile systems, as well as what appeared to be two new canister ICBM launching systems that may have held new ICBMs.\nWhatever the canisters contained, the regime was clearly trying to demonstrate that, as it has repeatedly promised, it is developing long-range intercontinental ballistic missiles that are capable of hitting the U.S., as well as missiles that utilize solid-fuel technology, which would enable North Korea to more easily transport and hide its missiles and launch them with less warning to international monitors.\nTurns out the submarine-launched ballistic missile wasn't the big unveil. This is: pic.twitter.com/s2mNBMuON2 \n— Martyn Williams (@martyn_williams) April 15, 2017 N.Korea showcases probable intercontinental ballistic missiles at massive military parade https://t.co/OevF5NYsQs pic.twitter.com/c4KVjfdmAx \n— NK NEWS (@nknewsorg) April 16, 2017 Ultimately, the regime is trying to convince the world that it possesses second-strike capability, or will soon — which means that it would be able to respond to any first strike on North Korea with a devastating counterattack on the U.S. or its allies in the region, possibly including a nuclear-weapon payload.\nSome experts warn that appearances can be deceiving, especially when it comes to North Korea. For instance, it’s possible that the country was only displaying mock-ups of new ICBM systems on Saturday, rather than the functioning, or near-functioning, weapons themselves.\nRegardless, analysts seem to agree that the world should be concerned about what Saturday’s parade said about North Korea’s gains and goals. Even if the regime was only displaying mock-ups, they show what North Korea intends to build, and that the government has made progress toward that aim. As one surprised nonproliferation analyst commented in response to the parade:\nThis is a lot of new stuff for a country with an economy 1/4 of Ethiopia to suddenly pull out of a hat.\n— Kyle Mizokami (@KyleMizokami) April 15, 2017 Another expert, Duyeon Kim, explained to the Japan Times that North Korea’s missile pageant was meant to send “a message to its own citizens and the international community that the regime is ‘powerful,’ has made ‘leaps’ in technological advancements and will not cave under U.S. pressure.”\nIn an interview with NPR, Jeffrey Lewis, director of the East Asia Nonproliferation Program at the Middlebury Institute of International Studies, added:\nI think in the United States we sort of laugh at [the North Korean regime]. We treat them like they’re a little bit of a joke, but they don’t think they’re a joke. And I think the North Koreans long ago concluded that their weapons programs are a way of getting us to take them seriously. And so I think a lot of times, we have expectations for the North Koreans, and the North Koreans like to defy those expectations. They like to show us that they’re serious about this, that they really can do this and that if there is a joke, it’s on us, not them. In Lewis’s opinion, the regime may have shown as many as three new ICBM systems on Saturday, and the overall demonstration was “bewildering” to him and other experts. While there have been many stumbles along the way, North Korea has continued to develop the weapons technology they see as integral to their survival.\nOn the other hand, the regime has never successfully tested a long-range ICBM that could reach the U.S. It’s unclear if the regime has been able to build a nuclear warhead small enough to mount on a missile or to survive reentry from space.\nMore ballistic missiles on display during the Day of the Sun parade. Photo: Ed Jones/AFP/Getty Images Aside from the new ICBM canisters, many of the rocket and missile systems on display during the parade on Saturday did not appear to be new; some were just variations of older models, or weapons that had been reconfigured or cosmetically altered. The regime unveiled two solid-fuel missiles, which have been tested but never before seen: a submarine-launched ballistic missile (with an intermediate range of 600 miles) that the country tested last year, and a similar land-based version that the North Koreans launched into the Sea of Japan in February. Most of North Korea’s missiles run on liquid fuel, which means they have to be fueled before firing, making the launches slower and missile systems easier to detect. Solid fuel missiles are preloaded and ready to fire, require a smaller fleet of support vehicles, and can be stored on submarines or easily hidden mobile launchers.\nAmid the still-heightening tensions between North Korea and the U.S., The Diplomat ’s Ankit Panda sees the new missile systems, whether they are ready to use or not, as an ominous development :\n[M]ore so than ever, North Korea seems to be highlighting the perils of a preemptive first strike to the United States and South Korea. With every nuclear and ballistic missile test, its threat of inflicting unacceptable retaliatory damage against Seoul and, eventually, Washington becomes more credible.\n\nWhat’s more, we’re likely still in for a sixth nuclear test sooner or later. Even though Pyongyang withheld from testing this weekend amid rumors of possible retaliation by the United States, North Korea is still looking to improve its missile know-how. Moreover, the long-dreaded ICBM flight test also might not be too far off now. Given the ever-growing number of TELs — both wheeled and tracked — North Korea may soon field nuclear forces amply large that a conventional U.S.-South Korea first strike may find it impossible to fully disarm Pyongyang of a nuclear retaliatory capability. That would give the North Korean regime what it’s always sought with its nuclear and ballistic missile program: an absolute guarantee against coercive removal. This post has been updated throughout. \nTags: north korea trump administration international affairs nuclear proliferation Pence: Era of ‘Patience’ Over After N. Korea’s Missile Test Share on Facebook Tweet this Story Top Stories Reagan Manipulated Television. Trump Is Controlled by It. The Duke Lacrosse Scandal and the Birth of the Alt-Right Donald Trump Is Just George W. Bush But Racist Most Viewed Stories Girls Series-Finale Recap: I Got It Nice of Melania to Remind Donald What to Do During the National Anthem Melissa McCarthy Wasn’t ‘Live From New York’ on Saturday Night Live This Weekend Alex Jones Is Just ‘Playing a Character,’ According to His Lawyer The Woman Texting Someone Else While Her Fiancé Is Away Reagan Manipulated Television. Trump Is Controlled by It. Every Episode of Girls , Ranked President John Tyler’s Grandson, Harrison Tyler, on Still Being Alive After Her Sugar Sphinx, Kara Walker Is a Whole Different Kind of Public Figure Let’s Talk About the Girls Series Finale Most Popular Video On Daily Intelligencer How Much Does Donald Trump Hate His Job? Latest News from Daily Intelligencer 5:37 p.m. Confederate Flag Issue Making a Comeback in South Carolina Special Election A GOP candidate is attacking rivals for voting to remove the Dixie flag from the Statehouse grounds.\n5:34 p.m. North Korea Accuses U.S. of Provoking ‘Dangerous Situation’ “A dangerous situation in which thermonuclear war could break out at any moment.”\n4:53 p.m. Trump Is Making the GOP Heinously Unpopular Again A new poll finds that Americans like the Republican Party a lot less when it’s in power.\n4:52 p.m. Uber May Be Forced to Allow Tipping in Its App in NYC You may be able to give a five-star review, and tip a dollar or two, at the end of an Uber ride in the near future.\n12:35 p.m. Russian State TV Declares Trump ‘More Impulsive’ Than Kim Jong-un “Ivanka already convinced Trump to bomb Assad, what if she convinces him to bomb Kim?” a Russian newscaster laments.\n12:28 p.m. ICE Arrests Are Up in Trump’s First Weeks in Office Attempted border crossings are also down by as much as 70 percent.\n12:11 p.m. It’s White-Knuckle Time in Georgia for Tomorrow’s Red-Hot Special Election Can Democrat Jon Ossoff steal a seat from the Republicans? It’s looking like a coin toss.\n11:28 a.m. Melania Trump Had to Remind Donald What to Do During the National Anthem The president needed a little nudge during the Easter Egg Roll festivities.\n10:13 a.m. Pro-Trump Group Launches Ads to Bolster Trumpcare Supporters America First Policies will spend $3 million on boosting supporters of the president’s health-care law, as Trump tries to revive it on Capitol Hill.\n4:03 a.m. Manhunt Under Way for Suspect Who Posted Video of Fatal Shooting on Facebook The search for Steve Stephens, who is accused of randomly targeting an elderly man, has expanded to five states.\n2:21 a.m. Pence Declares End to ‘Strategic Patience’ After N. Korea’s Failed Missile Test A U.S. military response isn’t expected, though experts were alarmed by the regime’s apparent missile advancements.\n12:03 a.m. Alex Jones Is Just ‘Playing a Character,’ According to His Lawyer The conspiracy goes deeper than we thought.\nYesterday at 9:00 p.m. Reagan Manipulated Television. Trump Is Controlled by It. Cable news will shape what he does today, which will shape what airs tonight, which …\nYesterday at 6:51 p.m. United Employees Can No Longer Displace Boarded Passengers It’s one of the most obviously needed corporate policy changes in history, but the damage to the company may already be done.\nYesterday at 4:54 p.m. Erdoğan Declares Victory in Referendum Granting Him Vast New Powers Over Turkey Voters in Turkey narrowly approved enormous changes to the country’s government, though opposition parties are contesting the results.\nYesterday at 1:41 p.m. Steve Bannon’s Biblical Fall The White House chief strategist is being described as “doomed.” Is there a resurrection in his future?\n4/15/2017 at 3:12 p.m. Federal Judge Blocks Arkansas’s Execution Spree The state will appeal the ruling, but may not be able to get its controversial execution schedule back on track.\n4/15/2017 at 12:30 p.m. The Problem With Trump’s Attempt to Scare North Korea “The history books will say: ‘How could they not have known? How could they not have known these were North Korea’s thoughts?’”\n4/15/2017 at 11:22 a.m. False Gunfire Report Triggers Penn Station Stampede, Injuring 16 The sound of a police Taser sparked a mass panic during Friday night’s commute.\n4/14/2017 at 5:36 p.m. China Warns U.S. and North Korea That ‘No One Will Win’ If War Comes “We urge all sides to no longer engage in mutual provocation and threats,” China’s foreign minister said on Friday."}]