[{"uuid": "a1eb366d064541baf0d1e299adcf77453f152fc4", "url": "http://omgili.com/ri/jHIAmI4hxg.iJPgI2z6a7enpVQ9s33LsMTXCYlX7iP4mSNYrynUfrLeUS7qfQvY3yY3nJfhE8Yxqdf9QMfUXOfQvb8o8m1d3uURnfPrxNo5yx3sR8NVrrg--", "title": "The Trump family's long history with immigration", "author": "", "rating": null, "published": "2017-04-18T23:24:59.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "congress", "sentiment": "none"}, {"name": "us citizenship and immigration services", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "government accountability office", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "trump corporation", "sentiment": "none"}, {"name": "kushner companies", "sentiment": "none"}, {"name": "labor", "sentiment": "none"}, {"name": "the washington post", "sentiment": "none"}, {"name": "department of homeland security", "sentiment": "none"}, {"name": "lamington farm", "sentiment": "none"}, {"name": "uscis", "sentiment": "none"}, {"name": "kaszycki & sons", "sentiment": "none"}, {"name": "jupiter gold club", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "trump organization", "sentiment": "none"}, {"name": "department of defense", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "trump vineyards", "sentiment": "none"}, {"name": "mar-a-lago", "sentiment": "none"}, {"name": "trump national golf club", "sentiment": "none"}, {"name": "house judiciary committee", "sentiment": "none"}, {"name": "trump model management", "sentiment": "none"}], "locations": [{"name": "r-iowa", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "trump tower", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "d-illinois", "sentiment": "none"}, {"name": "jersey city", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "czechoslovakia", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "trump bay street", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "persons": [{"name": "trump", "sentiment": "negative"}, {"name": "chuck grassley", "sentiment": "none"}, {"name": "grassley", "sentiment": "none"}, {"name": "melania", "sentiment": "none"}, {"name": "jeff sessions", "sentiment": "none"}, {"name": "dick durbin", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jared kushner", "sentiment": "none"}, {"name": "durbin", "sentiment": "none"}, {"name": "ivana", "sentiment": "none"}, {"name": "melania trump", "sentiment": "none"}, {"name": "ines knauss", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "a1eb366d064541baf0d1e299adcf77453f152fc4", "url": "http://omgili.com/ri/jHIAmI4hxg.iJPgI2z6a7enpVQ9s33LsMTXCYlX7iP4mSNYrynUfrLeUS7qfQvY3yY3nJfhE8Yxqdf9QMfUXOfQvb8o8m1d3uURnfPrxNo5yx3sR8NVrrg--", "site_full": "www.cnn.com", "title": "The Trump family's long history with immigration", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics.rss&author=CNN&title=Politics", "domain_rank": 81, "published": "2017-04-18T23:24:59.000+03:00", "title_full": "The Trump family's long history with immigration", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "CNN.com - RSS Channel - Politics", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 10}, "pinterest": {"shares": 3}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 662, "likes": 662, "comments": 0}, "linkedin": {"shares": 5}}, "site_categories": [], "country": "US", "performance_score": 6, "main_image": "http://i2.cdn.cnn.com/cnnnext/dam/assets/160718150050-meet-the-trump-family-hala-gorani-pkg-00030606-super-tease.jpg", "site": "cnn.com"}, "external_links": [], "language": "english", "text": "Meet America's new first family 01:27 Story highlights Trump family's businesses have made use of many parts of immigration system Trump hasn't spoken much about how his dealings shape his approach Washington (CNN) President Donald Trump has made overhauling the nation's immigration system a central promise of his administration -- and Tuesday he announced new efforts to get companies to \"buy American (and) hire American.\" But when it comes to hiring, he should know quite a bit about looking abroad. The Trump family's business ventures have made use of virtually every part of the US immigration system over time -- including reported instances of illegal labor on two Trump-branded building projects. Businesses run and owned by Trump and his adult children have been certified to legally hire 1,371 foreign visa workers since 2001, a CNN analysis of visa records shows. In addition, Trump-branded real estate has raised at least $50 million in foreign investor money through a program that gives foreign investors access to green cards, according to the company that did the development of the real estate. Those permits have reflected the wide spectrum of the US immigration system. Read More The Trump enterprise has made use of low-skilled permits for vineyard seasonal workers, for example, and has used high-skilled visas to bring in models for its modeling agency. Trump has telegraphed a hard-line position on immigration, and many of his administration's hires have signaled a move to clamp down on the US immigration system. But Trump has not spoken at length about how his own business dealings influence his approach to the US immigration system. The White House has not responded to a request for comment about how Trump's life experiences will influence his policy decisions. Here's a look at the ways Trump and his family have engaged with the US immigration system: H-1B visas How Trump businesses used it: In their business ventures, the Trumps' businesses have received 283 H-1B visas since 2001. The high-skilled visas have been used for Trump's modeling venture, Trump Model Management, Mar-A-Lago, the Trump Corporation and businesses associated with his hotels and resorts. Melania Trump also used H-1B visas as a model to work in the US before she was granted a green card, according to a letter from her attorney released last year. What it is : Often referred to as high-skilled visas, H-1Bs are \"specialty occupation\" permits, according to US Citizenship and Immigration Services. They cover a variety of fields, including science and technology fields like computer programming, and most types require higher education degrees. Other specific categories include research related to the Department of Defense and modeling. What the political fight looks like : H-1B visas are in high demand by powerful industries, including Silicon Valley, the medical field and academia. The demand far outstrips the supply, and powerful lawmakers like unlikely allies Sens. Dick Durbin, D-Illinois, and Chuck Grassley, R-Iowa, have long sought to overhaul the program. Indian outsourcing companies are often accused of abusing the visas to take jobs away from other American employers. On Tuesday, Trump announced as part of his \"Buy American, Hire American\" initiative an executive order that calls for a review of the H-1B visa program, with the goal of reforming the program. Legislation on H-1Bs has long failed to advance on H-1Bs in Congress despite Grassley, Durbin and others' efforts, but the administration this year took some steps to change the way the visas are distributed. The Friday before the application cycle opened for 2017, USCIS and the Justice Department issued new guidance and policies to make it more difficult for computer programmers to gobble up the visas. While restrictionist immigration groups have sought to cut back the number of visas, as they have with virtually all forms of legal immigration, most lawmakers have sought reforms that would allow the US to attract top talent from around the world and encourage them to stay, especially in the STEM fields. Asked about H-1B abuse during the primary, Trump said during a CNN debate in Miami: \"I know the H1B very well. And it's something that I frankly use and I shouldn't be allowed to use it. We shouldn't have it. Very, very bad for workers. And second of all, I think it's very important to say, well, I'm a businessman and I have to do what I have to do.\" H-2B and H-2A visas How Trump businesses used it : Trump businesses have received 1,024 H-2B visas since 2000, according to a CNN review of Labor records. Those visas have gone to Mar-A-Lago, Jupiter Gold Club, Lamington Farm and the Trump National Golf Club for jobs like cooks, waiters and waitresses and housekeepers. Trump Vineyards has received 64 H-2A permits since 2006, a CNN review found, for agricultural work. What it is : H-2B visas are temporary authorizations to fill non-agricultural jobs with foreign workers. H-2A visas are specifically for temporary agriculture jobs. Employers are required to establish there are no qualified American workers to fill the positions and that hiring the workers will not affect American workers' wages. The jobs can be either seasonal, one-time need, based on peak operations or intermittent. What the political fight looks like : The H-2B programs are controversial but also necessary to many regional economies. The industries that use the H-2 visas, primarily agriculture and food service, also tend to draw heavily on undocumented labor when workers are unavailable legally or the system is perceived as too onerous. Employers in the H-2 program are usually required to provide certain wages, transportation and housing for workers, which can be a burden on businesses that feel they can use undocumented labor for cheaper pay. The program has also been found to be ripe for abuse, as the Government Accountability Office laid out in a 2015 report questioning the effectiveness of penalties built into the program -- without which it is difficult to ensure the prevention of exploitation and abuse of workers. Another concern for employers in the program is that the jobs must be temporary. But some agriculture industries like dairy farming require labor year round, making it difficult for them to use the program to import labor, which they have difficulty finding legally in the US. Like other forms of immigration, several lawmakers on both sides of the aisle would like to boost the number of permits and make them easier for employers to use, in part to alleviate the demand for undocumented labor. Members of Congress, especially those from heavily agricultural districts, pay attention to the issue. But on the other side of the equation, restrictionist groups, who are represented in the administration by Attorney General Jeff Sessions, believe these guest worker programs take jobs away from Americans, and thus should be heavily curtailed. Asked during the 2016 primary about his use of foreign workers during the 2016 primary, Trump defended his Mar-A-Lago property's hiring to The New York Times, saying in an interview, \"There are very few qualified people during the high season in the area.\" EB-5 visas How Trump businesses used it : A project by the family company of Trump's son-in-law and top White House adviser, Jared Kushner, called Trump Bay Street in Jersey City, New Jersey, raised $50 million, or one-quarter of its funding, from EB-5 investments, a company representative confirmed to CNN. The property uses the Trump name but was not a project managed by the Trump Organization. Kushner Companies has not otherwise made us of EB-5, the representative said, although new deals being pursued by the company have drawn scrutiny in recent weeks. Because EB-5 investment does not require disclosure, it is also difficult to know fully how many Trump-branded properties could have benefited from it; Trump also licenses his name to properties that his company does not directly develop. The Trump Organization did not respond to a request for comment on its use of EB-5. What it is : The EB-5 program allows foreign businesspeople and their families to apply for green cards, eventually leading to citizenship. To qualify for the program, would-be applicants must make a qualifying investment in a US enterprise and demonstrate they plan to \"create or preserve\" 10 US jobs, according to USCIS. The Department of Homeland Security has proposed rule changes that would increase the investment threshold over $1 million. Congress takes aim at visa program that benefited Trump family businesses What the political fight looks like : The program has drawn criticism from members of Congress on the left and right, who assail EB-5 as essentially selling citizenship to wealthy foreigners -- many of whom are based in China -- although they acknowledge it does have value as a way to spur investment in the US and job growth. Some rural lawmakers complain that the program unfairly benefits major cities that are already economically well off. Lawmakers that represent major metropolitan areas, like the New York delegation, have often defended the program. EB-5 is currently tied to government funding, which expires at the end of April. Despite years of reform efforts, lawmakers have repeatedly extended the program in continuing resolutions funding the government. At a recent House Judiciary Committee hearing on the topic, lawmakers signaled they would not allow another reauthorization without reform, but with five legislative days left this month before funding runs out, leadership has moved to avoid any controversies that might slow down passing funding. Family visas How the Trump family used it : Trump's family also has a personal connection to immigration, with his grandfather, mother and two wives being immigrants themselves. Melania Trump is Slovenian, but began modeling in the US with H-1B visas and was given a green card in 2001, before she married Trump. Trump self-sponsored herself for residency, according to a letter by her attorney released during the campaign. She became a US citizen in 2006. Trump's grandfather was himself an immigrant to the US, joining his sister from Germany in the late 1800s. Trump's mother was an immigrant from Scotland, coming to the US in her teens to work as a domestic servant. His first wife, Ivana, was also an immigrant, coming to the US via Canada from Czechoslovakia. Ivana became a US citizen in 1988, 11 years after she married Trump. Melania's sister, Ines Knauss, lives in New York, but neither she, family attorneys nor the White House answered an inquiry about whether she was sponsored for a visa or residency by her sister. What it is : In addition to business-related visas, the US offers unlimited visas for \"immediate relatives,\" according to the State Department. That includes spouses of US citizens, unmarried children of US citizens under 21, orphans adopted by US citizens and parents of US citizens who are at least 21 years old. There are also limited numbers of visas for more extended family. Donald Trump's Scottish roots: How a tiny island could shape a President What the political fight looks like : Proponents of immigration reform and restrictionists alike have sought to address \"chain migration,\" a term used to describe the practice of bringing immigrants to the US largely based on their familial connections as opposed to the merits of what they could offer the US. Restrictionists especially have viewed the US system as too lenient, and Trump himself spoke of the need for a \"merit-based\" immigration system in his joint address to Congress. Illegal labor How they used it: There have been two incidents in which Trump-related projects reportedly used undocumented immigrants as labor. Trump faced a lawsuit in the 1980s that accused him and business partners of withholding wages from undocumented Polish immigrants and union workers hired by a contracting company called Kaszycki & Sons to demolish the building that would make room for Trump Tower. Trump testified he did not know the workers were undocumented and blamed the contractor for hiring them. A judge ruled in 1991 that Trump and his associates owed the workers more than $300,000 plus interest. The ruling was appealed, and the case was eventually settled under a sealed agreement, according to a source familiar with the proceedings. Separately, The Washington Post reported in 2015 that it interviewed workers on the construction of Trump's hotel in the nation's capital who said they entered the country illegally, several of whom were still lacking authorization to live and work in the US. Trump's spokespeople at the time said the company requires its contractors to comply with hiring laws and check status of employees, and denied hiring any undocumented immigrants to build the hotel. What it is: Non-citizens of the US are not allowed to live and work in the country without proper authorization. That could be a green card, or a particular type of visa, but foreigners who live and work in the US without proper authorization -- including expired visas -- are considered undocumented immigrants. There's an estimated 11 million of them in the US. What the political fight looks like: Illegal immigration has been arguably the most contentious fight of the landscape. Trump made cracking down on it the focal point of his campaign, pledging to vastly step up border security and deportations and detentions of undocumented immigrants. Many Democrats and moderate Republicans agree with Trump's stated objective to deport serious criminals here illegally. But they have also called for a compromise solution that allows undocumented immigrants who have lived in the US for years, sometimes decades, raising families and contributing to their communities, to have a pathway to legalization and citizenship. Trump has said the \"bad\" ones need to be dealt with first. Sections", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:59.000+03:00"}]