[{"entities": {"organizations": [], "locations": [{"name": "phoenix", "sentiment": "none"}], "persons": [{"name": "joan", "sentiment": "none"}, {"name": "theodore brun", "sentiment": "none"}, {"name": "ava richardson", "sentiment": "none"}, {"name": "harry potter", "sentiment": "none"}, {"name": "una mccormack", "sentiment": "none"}]}, "uuid": "a29e7194170374198c49f6a8989613a2f5ee21fa", "highlightText": "", "title": "Weekly Wonders: 16th April", "thread": {"site": "wordpress.com", "country": "US", "participants_count": 1, "site_full": "aramblingreviewer.wordpress.com", "section_title": "Weekly Wonders: 16th April – A Rambling Reviewer", "uuid": "a29e7194170374198c49f6a8989613a2f5ee21fa", "site_section": "https://aramblingreviewer.wordpress.com", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T22:37:26.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZQCjO3NImYXOFmdpKnBY3fOHO_XfphS7ZyCaY7LCNyh2KQksbMsOo9GEOiko0QSm3UtUnM1P9oOu4FHOPYlzYloNIFdcRs9C7A-", "title_full": "Weekly Wonders: 16th April", "title": "Weekly Wonders: 16th April", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T22:37:26.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZQCjO3NImYXOFmdpKnBY3fOHO_XfphS7ZyCaY7LCNyh2KQksbMsOo9GEOiko0QSm3UtUnM1P9oOu4FHOPYlzYloNIFdcRs9C7A-", "ord_in_thread": 0, "crawled": "2017-04-16T22:37:26.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Lindsey", "text": "\nTime escaped from me last week and I never got around to writing this. That’s what happens when I decide to have an early night.\nThis week has involved quite a lot of uni stress, I must admit. But I saw a friend for lunch (and then saw her again at the end of the week), which was really lovely. Also, for me, kind of a big deal because to say I have a non-existent social life is an understatement.\n\nLast year, for my brother’s 30 th , I bought us both tickets to walk over the O2. We finally did it this week, and oh my word, it was amazing! The climb itself was easier than I thought it would be but the view from the top was incredible. We were lucky with the weather; it was a really nice evening. It’s been something that I’ve wanted to do for a long time, so I’m glad to have finally had the chance.\nAs it is Easter, we had a family gathering today. There were thirty of us! With cousins and partners etc, it’s fair to say that I have quite a big family. It’s lovely how close we all are though. I even met my mum’s aunt and her son, and had a lovely chat about books with my Great-Aunt Joan! Just to keep things interesting!\nIt’s been a bit of a social week for me! Definitely need to get back to the studying next week – hopefully a few long days will help me to feel a little calmer.\nI hope everyone else has had a lovely weekend. While you’re digesting some chocolate, have a read of some of the posts you might have missed this week:\nMonday: Book Review: The Star of the Sea by Una McCormack Wednesday: Self-Care Friday: Film Review: The BFG I’m hoping to spend a little time on the blog over the next few weeks. Although I’ve been writing all the posts etc, I want to just give it a bit more of my time and attention and hopefully generate a real buzz about how I feel about it. At the moment, I feel as if it is falling a little flat, so would love to hear any suggestions about what you would like to see from me in the near future.\nBut for now, here is what is coming up next week:\nMonday: Book Review: A Mighty Dawn by Theodore Brun Wednesday: Don’t Judge a Book By Its Cover Friday: Television Review: Orphan Black, Series 2 Saturday: Book Review: Dragon Trials by Ava Richardson I’ve been re-reading the Harry Potter books since January (slowly, on and off). I think my plan for the rest of the evening is just to curl up with Order of the Phoenix and lose myself for a while.\nHow’s everyone else’s weekends been? I hope you’ve been able to enjoy the long weekend and get some reading done! What are you all reading? Anything you would suggest? Let me know in the comments below!\n\nTwitter | Facebook | Pinterest | Instagram | Bloglovin’ "}]