[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:10:40.000+03:00", "author": "eurovisionunion", "entities": {"persons": [{"name": "ivi adamou", "sentiment": "none"}, {"name": "alma", "sentiment": "none"}, {"name": "krista siegfrids", "sentiment": "none"}, {"name": "edurne", "sentiment": "none"}, {"name": "lena", "sentiment": "none"}, {"name": "benjamin ingrosso", "sentiment": "none"}, {"name": "sanna nielsen", "sentiment": "none"}, {"name": "isaiah", "sentiment": "none"}, {"name": "robin bengtsson", "sentiment": "none"}, {"name": "jack jones", "sentiment": "none"}, {"name": "maimuna", "sentiment": "none"}, {"name": "getter jaani", "sentiment": "none"}, {"name": "robin stjernberg", "sentiment": "none"}, {"name": "maria olafs", "sentiment": "none"}, {"name": "faller", "sentiment": "none"}, {"name": "dami im", "sentiment": "none"}, {"name": "uzari", "sentiment": "none"}, {"name": "koit toome", "sentiment": "none"}, {"name": "lele", "sentiment": "none"}], "locations": [{"name": "sweden", "sentiment": "none"}, {"name": "finland", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "spotify", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}, {"name": "emmelie de forest", "sentiment": "none"}], "organizations": [{"name": "eurovision union", "sentiment": "none"}, {"name": "twitter and facebook", "sentiment": "none"}, {"name": "time", "sentiment": "none"}, {"name": "gente bestial", "sentiment": "none"}]}, "text": "Each week, we’re bringing you a specially curated playlist full of our favourite tunes of the week. We feature new songs from Eurovision artists or national final stars, or their much loved Eurovision or national final entries. This week, we’ve got the perfect mix of new and old, so let’s get into it! Listen to the playlist here: Let’s start off with new tunes from our favourite Eurovision stars, beginning with a new track from 2010 Eurovision winner Lena titled Lost in You. It’s the first song we’ve heard in a while from the German pop princess, and is set to be a single off her upcoming album. She definitely hasn’t lost it! From Ivi Adamou, we’ve got a recent single titled Afto Ton Kero which has traditional elements mixed with a bit of rock. From Swedish representative Sanna Nielsen, we’ve got the new Swedish language track, Inte Ok. We’ve also got a duet of Dami Im and Jack Jones titled Hold Me In Your Arms, a beautiful tune. From some Swedish superstars, we’ve got Benjamin Ingrosso , who is currently one of our favourites after his recent Melodifestivalen performance . This week we’ve featured Love You Again which was released last year. Also from last year, we’ve got Constellation Prize by 2017 Swedish representative Robin Bengtsson, and this was his Melfest bid for 2016. Also part of the Swedish national final last year (and this year) was Krista Siegfrids who we first saw at Eurovision in 2013 representing Finland, so she crossed the border to participate in Sweden last year with the song Faller, which we’ve included in this playlist. Lastly from Sweden, we’ve got one of our favourites from 2013 Eurovision participant Robin Stjernberg titled For the Better. Keeping with the theme of past Eurovision participants, we’ve got Emmelie de Forest, who also participated and won Eurovision 2013, and we’ve got Drunk Tonight, probably our favourite song from the former Danish winner, and we’ve featured the live acoustic version. Also from Denmark, we’ve got Anti Social Media, who we featured in our Top 5 Non-Qualifying entries from 2015 , except we’ve got their post Eurovision song titled Fire Exit. Also featured in our favourite non-qualifiers is Maria Olafs from Iceland, so we’ve got the Icelandic version of her Eurovision song Unbroken. Additionally, we’ve got Time by Uzari and Maimuna, which we thought would be a definite qualifier! Speaking of Time, we’ve also got this year’s entry called Time by the Ukrainian participants O.Torvald . Also from this year’s Eurovision we’ve got Keep the Faith , which we just recently reviewed as part of our 2017 Reviews . We’ve also got other tracks from 2017 artists, including Isaiah from Australia with his X Factor winners single It’s Gotta Be You. We’ve also got a collaboration between former Estonian participant Getter Jaani and one half this year’s Estonian act Koit Toome titled Rannamaja. We’ve also featured La chute est lente by Alma , and it’s left us wanting more from this year’s French artist! Last, but not least, we’ve got Gente Bestial, which was participating in the Portuguese national final , a new single from Sanremo’s Newcomers winner Lele titled Cosi Com’è, and the English version of Edurne’s 2015 Eurovision entry titled Break of Day. Plenty of new tunes to enjoy! Tell us which songs you enjoyed from our playlist, and which songs you would love to see in next week’s playlist! Make sure to follow us on Spotify to keep up with our weekly playlists, and of course Twitter and Facebook to chat with us and other Eurovision fans! ", "url": "http://omgili.com/ri/.wHSUbtEfZSNok7KdjpRpkNfhgy1ib2NR2piTXi1Cg3t8gBz9MtI_1rh0hdgOtahM1BZyd74NUUcO8kXR92Lc0tGnqWkVkbfhyrDk3T0sJUNh7UQgRD4_w--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:10:40.000+03:00", "language": "english", "title": "Eurovision Union’s Weekly Playlist (15/52)", "thread": {"title_full": "Eurovision Union’s Weekly Playlist (15/52)", "site_full": "eurovisionunion.wordpress.com", "site": "wordpress.com", "site_section": "https://eurovisionunion.wordpress.com", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Eurovision Union’s Weekly Playlist (15/52)", "url": "http://omgili.com/ri/.wHSUbtEfZSNok7KdjpRpkNfhgy1ib2NR2piTXi1Cg3t8gBz9MtI_1rh0hdgOtahM1BZyd74NUUcO8kXR92Lc0tGnqWkVkbfhyrDk3T0sJUNh7UQgRD4_w--", "published": "2017-04-16T09:10:40.000+03:00", "title": "Eurovision Union’s Weekly Playlist (15/52)", "uuid": "a29f1f471fc986d417c19281fdeeb676612e5bdd", "main_image": null}, "uuid": "a29f1f471fc986d417c19281fdeeb676612e5bdd", "ord_in_thread": 0}]