[{"entities": {"locations": [], "organizations": [], "persons": []}, "ord_in_thread": 0, "thread": {"site_full": "wbkr.com", "site_section": "http://womiowensboro.com/feed", "domain_rank": null, "replies_count": 0, "country": "US", "section_title": "WOMI Owensboro", "title": "What I Learned From \"One and Not Done\" [REVIEW]", "title_full": "What I Learned From \"One and Not Done\" [REVIEW]", "published": "2017-04-19T07:23:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg98nNIFbjPf.MtVLVzsoyNncJsxjspHpEqq5aOudGOCE3LaqGwY2DwuYFwhzYKaY9HcdttnqTQ8sQ--", "site": "wbkr.com", "main_image": "http://wbkr.com/files/2017/04/GettyImages-623493172.jpg", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "a4c90eab7bff016baeca0877da860b29c50fee94", "site_type": "blogs"}, "title": "What I Learned From \"One and Not Done\" [REVIEW]", "published": "2017-04-19T07:23:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg98nNIFbjPf.MtVLVzsoyNncJsxjspHpEqq5aOudGOCE3LaqGwY2DwuYFwhzYKaY9HcdttnqTQ8sQ--", "author": "Erin Grant", "crawled": "2017-04-19T08:40:32.000+03:00", "language": "english", "text": "What I Learned From “One and Not Done” [REVIEW] By Erin Grant April 18, 2017 6:23 PM Joe Robbins/Getty Images \nI gotta tell you, One and Not Done was really good and really informative. The ESPN “30 for 30″ documentary directed by Jonathon Hock examines John Calipari the coach more than Calipari the man. \nNaturally, we learn all about his blue collar upbringing in Pittsburgh and how he got started in coaching. He grew up near the 5-Star Basketball Camp which is where all kinds of college and NBA players got their start. Calipari got called on one day to run a skill station at the camp and he knew he was destined to coach. His first major assistant job was at Kansas under Hall of Fame coach Larry Brown. Oh yeah, the documentary is framed by Calipari’s 2015 induction into the Naismith College Basketball Hall of Fame. And the frame is one tainted by Cal’s controversies. \nYes, One and Not Done is a little bit of a hit piece. Every single misstep in his career from UMass’ Marcus Camby accepting cash and gifts to Memphis’ vacating the 2007-2008 season due to then guard Derrick Rose’s academic ineligibility status. Memphis lost the national title by a last second shot in ’08 to Kansas. One important point that was brought up, Kentucky or North Carolina would never be asked to vacate a national title. What I admired about Cal is that he’s totally confident and he avoids the constant chatter about him. Andy Lyons/Getty Images \nOther random observations: \n-Cal yells and he yells A LOT, even when he was an assistant. There’s old footage of his days at Pitt and he’s sitting there with a clipboard in his hand barking away. \n-The NBA didn’t suit his style. Calipari coached the New Jersey Nets for three seasons, leading the team to the first round playoffs in his second year. \n-The “Refuse to Lose” motto came from his days at UMass. It’s also the title of his first book . \n-In the 1992 NCAA tournament in a Sweet 16 game against Kentucky, Calipari was issued a last minute technical foul for stepping what seemed like a few centimeters outside the coach’s box. UMass lost 87-77.", "external_links": [], "highlightTitle": "", "uuid": "a4c90eab7bff016baeca0877da860b29c50fee94", "highlightText": "", "rating": null}]