[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/uBQNNiLKiWarOBJfFzTgVofOoNADvX6AcQWiujlO0bO1kbjmr_YXvnYXNNeodzK3.dEPJBVI9L3E1x4Vp87oAICvemUT7oCRZMctmjFkuxvJjOgcilGmE.48UeMT1mxTsQFUXYDhoW91Rpx4S4cBCXjWW.wUB_kwh9RdhbEkH0Bj_h3aaSrTbw--", "title": "First Hospitality Group, Inc., Celebrates Grand Re-Opening of the SpringHill Suites Chicago O'Hare", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://hotelexecutive.com/rss.xml", "spam_score": 0.0, "section_title": "HotelExecutive.com - Your view from the top", "site": "hotelexecutive.com", "site_full": "hotelexecutive.com", "performance_score": 0, "uuid": "a506f709f4f2fc9f74445f2930bf2afb5aedfb43", "published": "2017-04-17T08:00:00.000+03:00", "site_categories": [], "country": "US", "title_full": "First Hospitality Group, Inc., Celebrates Grand Re-Opening of the SpringHill Suites Chicago O'Hare", "participants_count": 0, "main_image": ""}, "url": "http://omgili.com/ri/uBQNNiLKiWarOBJfFzTgVofOoNADvX6AcQWiujlO0bO1kbjmr_YXvnYXNNeodzK3.dEPJBVI9L3E1x4Vp87oAICvemUT7oCRZMctmjFkuxvJjOgcilGmE.48UeMT1mxTsQFUXYDhoW91Rpx4S4cBCXjWW.wUB_kwh9RdhbEkH0Bj_h3aaSrTbw--", "title": "First Hospitality Group, Inc., Celebrates Grand Re-Opening of the SpringHill Suites Chicago O'Hare", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:26:42.000+03:00", "language": "english", "entities": {"locations": [{"name": "forbes america", "sentiment": "none"}, {"name": "chicago o'hare  rosemont", "sentiment": "none"}, {"name": "rosemont", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "chicago o'hare international airport", "sentiment": "none"}, {"name": "rosemont theatre", "sentiment": "none"}, {"name": "outback steakhouse", "sentiment": "none"}], "persons": [{"name": "donald e stephens", "sentiment": "none"}, {"name": "w. higgins rd", "sentiment": "none"}, {"name": "robert habeeb", "sentiment": "none"}, {"name": "habeeb", "sentiment": "none"}], "organizations": [{"name": "springhill suites chicago o'hare acquisitions & hotel openings first hospitality group, inc.", "sentiment": "none"}, {"name": "first hospitality group, inc.", "sentiment": "none"}, {"name": "hotel business review", "sentiment": "none"}, {"name": "springhill suites chicago", "sentiment": "none"}, {"name": "fhg", "sentiment": "none"}, {"name": "hotelexecutive.com", "sentiment": "none"}, {"name": "first hospitality group, inc", "sentiment": "none"}, {"name": "allstate arena", "sentiment": "none"}, {"name": "rivers casino", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "a506f709f4f2fc9f74445f2930bf2afb5aedfb43", "published": "2017-04-17T08:00:00.000+03:00", "author": "", "text": "Acquisitions & Hotel Openings First Hospitality Group, Inc., Celebrates Grand Re-Opening of the SpringHill Suites Chicago O'Hare \nROSEMONT, IL. April 17, 2017 \u0096 Rosemont, Ill.-based First Hospitality Group, Inc. announced today the grand re-opening of its SpringHill Suites Chicago O\u0092Hare hotel following an extensive renovation. To celebrate, FHG hosted a grand re-opening event yesterday on Tuesday, April 11. First Hospitality Group, Inc. President and CEO Robert Habeeb made the announcement. \nThe renovation, which spanned over several months, included updates to each of the hotel\u0092s 245 guest rooms, including new décor, beds, mattresses and revamped guest bathrooms. \n\u0093Our guests\u0092 experience is always top of mind when it comes to our hotels and service,\u0094 said Habeeb. \u0093As we want to ensure our guests are comfortable and feel at home when they stay at our hotels, we are confident that the new, modern and upgraded feel to each of our guest rooms and bathrooms, will provide guests with the best experience possible. We are thrilled to re-introduce this property to the Chicago area.\u0094 \nLocated at 8101 W. Higgins Rd, the hotel is minutes from popular attractions, including the Donald E Stephens Convention center, Allstate Arena, Rosemont Theatre, Rivers Casino and the Fashion Outlets of Chicago. The hotel provides guests with a free shuttle to the Chicago O'Hare International Airport and to downtown Chicago attractions. The hotel also includes a fitness room, indoor heated pool and 8,500-square-feet of meeting space with an Outback Steakhouse located right on-site. Experience the newly renovated guest rooms for yourself by visiting http://www.marriott.com/hotels/hotel-photos/chico-springhill-suites-chicago-ohare/ \nFirst Hospitality Group, Inc. (FHG) was recognized as #1 in Travel in Forbes America\u0092s Best Midsize Employers 2016. FHG received a #28 ranking out of the 250 best midsize employers in the country and #3 amongst all of America\u0092s best travel companies. For more information about FHG, visit www.fhginc.com or follow them on Facebook at @FHGinc and Twitter at @FHGroup_Inc. Topic: In The May Online Hotel Business Review a primary issue as population growth, urbanization, pollution and wasteful consumption patterns place increasing demands on freshwater supply. Water recycling; installing low-flow fixtures; using digital sensors to control water usage; and even harvesting rainwater are just a few things that some hotels are doing to preserve this precious resource. Waste management is another major concern. Through policies of reduce, reuse and recycle, some hotels are implementing \u0093zero-waste\u0094 programs with the goal of substantially reducing their landfill waste which produces carbon dioxide and methane gases. Other hotels have established comprehensive training programs that reinforce the value of sustainability. There is employee engagement through posters and quizzes, and even contests are held to increase innovation, sensitivity and environmental awareness. Some hotels are also monitoring a guest\u0092s energy usage and rewarding those who consumed less energy with gifts and incentives. The May issue of the Hotel Business Review will document how some hotels are integrating eco-friendly practices into their operations and how they and the environment are benefiting from them. © 1996-2017. All content on HotelExecutive.com is exclusively copyright to HotelExecutive.com and cannot be republished without prior written consent by HotelExecutive.com. & Use"}]