[{"entities": {"persons": [{"sentiment": "negative", "name": "mike pence"}, {"sentiment": "none", "name": "shinzo abe"}, {"sentiment": "none", "name": "taro aso"}, {"sentiment": "none", "name": "donald trump"}, {"sentiment": "none", "name": "abe"}, {"sentiment": "none", "name": "aso"}, {"sentiment": "none", "name": "pence"}, {"sentiment": "none", "name": "trump"}], "organizations": [{"sentiment": "negative", "name": "ap"}, {"sentiment": "none", "name": "u.s.-japan economic dialogue"}, {"sentiment": "none", "name": "white house"}], "locations": [{"sentiment": "none", "name": "tokyo"}, {"sentiment": "none", "name": "u.s."}, {"sentiment": "none", "name": "asia"}, {"sentiment": "none", "name": "japan"}, {"sentiment": "none", "name": "us"}, {"sentiment": "none", "name": "sea of japan"}, {"sentiment": "none", "name": "north korea"}, {"sentiment": "none", "name": "asia-pacific"}, {"sentiment": "none", "name": "south korea"}, {"sentiment": "none", "name": "atsugi"}, {"sentiment": "none", "name": "tokyo"}, {"sentiment": "none", "name": "seoul"}, {"sentiment": "none", "name": "pacific rim"}, {"sentiment": "none", "name": "america"}, {"sentiment": "none", "name": "pyongyang"}]}, "text": "Close Image 1 of 13 U.S. Vice President Mike Pence, center, speaks to U.S. servicemen and Japanese Self-Defense Forces personnel on the flight deck of U.S. navy nuclear-powered aircraft carrier USS Ronald Reagan at the U.S. Navy's Yokosuka base in Yokosuka, south of Tokyo, Wednesday, April 19, 2017. less U.S. Vice President Mike Pence, center, speaks to U.S. servicemen and Japanese Self-Defense Forces personnel on the flight deck of U.S. navy nuclear-powered aircraft carrier USS Ronald Reagan at the U.S. Navy's ... more Photo: Eugene Hoshiko, AP Image 2 of 13 U.S. servicemen and Japanese Self-Defense Forces personnel wait for the arrival of U.S. Vice President Mike Pence on the flight deck of U.S. navy nuclear-powered aircraft carrier USS Ronald Reagan, at the U.S. Navy's Yokosuka base in Yokosuka, south of Tokyo, Wednesday, April 19, 2017. less U.S. servicemen and Japanese Self-Defense Forces personnel wait for the arrival of U.S. Vice President Mike Pence on the flight deck of U.S. navy nuclear-powered aircraft carrier USS Ronald Reagan, at the U.S. ... more Photo: Eugene Hoshiko, AP Image 3 of 13 U.S. servicemen and Japanese Self-Defense Forces personnel wait for the arrival of U.S. Vice President Mike Pence on the flight deck of U.S. navy nuclear-powered aircraft carrier USS Ronald Reagan, at the U.S. Navy's Yokosuka base in Yokosuka, south of Tokyo, Wednesday, April 19, 2017. less U.S. servicemen and Japanese Self-Defense Forces personnel wait for the arrival of U.S. Vice President Mike Pence on the flight deck of U.S. navy nuclear-powered aircraft carrier USS Ronald Reagan, at the U.S. ... more Photo: Eugene Hoshiko, AP Image 4 of 13 U.S. Vice President Mike Pence, left, and his wife Karen, second from right, with their daughters Audrey, right, and Charlotte visit the main shrine of Sensoji Buddhist temple in Tokyo, Tuesday, April 18, 2017. U.S. Vice President Mike Pence, left, and his wife Karen, second from right, with their daughters Audrey, right, and Charlotte visit the main shrine of Sensoji Buddhist temple in Tokyo, Tuesday, April 18, 2017. Photo: Shuji Kajiyama, AP Image 5 of 13 U.S. Vice President Mike Pence visits the main shrine of Sensoji Buddhist temple in Tokyo, Tuesday, April 18, 2017. U.S. Vice President Mike Pence visits the main shrine of Sensoji Buddhist temple in Tokyo, Tuesday, April 18, 2017. Photo: Shuji Kajiyama, AP Image 6 of 13 U.S. Vice President Mike Pence, left, and Japanese Deputy Prime Minister and Minister of Finance Taro Aso, right,walk in the venue of the joint press conference at the prime minister's office in Tokyo, Tuesday, April 18, 2017. less U.S. Vice President Mike Pence, left, and Japanese Deputy Prime Minister and Minister of Finance Taro Aso, right,walk in the venue of the joint press conference at the prime minister's office in Tokyo, Tuesday, ... more Photo: Eugene Hoshiko, AP Image 7 of 13 U.S. Vice President Mike Pence, left, and Japanese Deputy Prime Minister and Minister of Finance Taro Aso, third right, attend during Japan U.S. Economic Dialogue at the prime minister's office in Tokyo, Tuesday, April 18, 2017. less U.S. Vice President Mike Pence, left, and Japanese Deputy Prime Minister and Minister of Finance Taro Aso, third right, attend during Japan U.S. Economic Dialogue at the prime minister's office in Tokyo, ... more Photo: Eugene Hoshiko, AP Image 8 of 13 Japanese Prime Minister Shinzo Abe, right, and U.S. Vice President Mike Pence shake hands prior to a luncheon hosted by Abe at the prime minister's official residence in Tokyo, Tuesday, April 18, 2017. Pence arrived in Japan for talks Tuesday expected to focus largely on trade with America’s anchor ally in the region. less Japanese Prime Minister Shinzo Abe, right, and U.S. Vice President Mike Pence shake hands prior to a luncheon hosted by Abe at the prime minister's official residence in Tokyo, Tuesday, April 18, 2017. Pence ... more Photo: Eugene Hoshiko, AP Image 9 of 13 Japanese Prime Minister Shinzo Abe, right, and U.S. Vice President Mike Pence shake hands prior to a luncheon hosted by Abe at the prime minister's official residence in Tokyo, Tuesday, April 18, 2017. Pence arrived in Japan for talks Tuesday expected to focus largely on trade with America’s anchor ally in the region. less Japanese Prime Minister Shinzo Abe, right, and U.S. Vice President Mike Pence shake hands prior to a luncheon hosted by Abe at the prime minister's official residence in Tokyo, Tuesday, April 18, 2017. Pence ... more Photo: Eugene Hoshiko, AP Image 10 of 13 U.S. Vice President Mike Pence, center left, waves with his wife Karen, center right, and daughters Audrey, top left, and Charlotte, top right, on their arrival at U.S. Navy's Atsugi air facility in Ayase, southwest of Tokyo, Tuesday, April 18, 2017. less U.S. Vice President Mike Pence, center left, waves with his wife Karen, center right, and daughters Audrey, top left, and Charlotte, top right, on their arrival at U.S. Navy's Atsugi air facility in Ayase, ... more Photo: Shuji Kajiyama, AP Image 11 of 13 U.S. Vice President Mike Pence waves before leaving for Japan, at Osan Air Base in Pyeongtaek, South Korea, Tuesday, April 18, 2017. U.S. Vice President Mike Pence waves before leaving for Japan, at Osan Air Base in Pyeongtaek, South Korea, Tuesday, April 18, 2017. Photo: Lee Jin-man, AP Image 12 of 13 U.S. Vice President Mike Pence talks with members of the American Chamber of Commerce at the Grand Hyatt Hotel in Seoul, South Korea, Tuesday, April 18, 2017. U.S. Vice President Mike Pence talks with members of the American Chamber of Commerce at the Grand Hyatt Hotel in Seoul, South Korea, Tuesday, April 18, 2017. Photo: Ahn Young-joon, AP The Latest: Pence, on US carrier, pledges to defend Asia 1 / 13 ___ 9:30 a.m. Wednesday U.S. Vice President Mike Pence is on board an American aircraft carrier stationed in Japan amid heightened tension on the Korean Peninsula. A ship bell signaled his arrival Wednesday morning on the USS Ronald Reagan at the U.S. Yokosuka naval base south of Tokyo. The Nimitz-class aircraft carrier is undergoing scheduled maintenance at its home port. Pence told the ship's captain that he had spoken to President Donald Trump, and Trump \"wishes he were here.\" The vice president is on a 10-day tour of Asia. He visited South Korea earlier and will head to Indonesia after his stop in Japan. The trip so far has been dominated by U.S. and allies' concerns about North Korea's nuclear and missile development efforts. ___ 7:15 p.m. A Japanese official says a difference in approach remains with the U.S. despite an agreement on a framework for new bilateral economic talks. The official said Tuesday that Japan still hopes to bring the U.S. back into a multilateral framework such as the Trans-Pacific Partnership . President Donald Trump pulled the U.S. out of the 12-country trade agreement after his inauguration in January. The official briefed reporters on customary condition of anonymity after U.S. Vice President Mike Pence met Japanese Deputy Prime Minister Taro Aso in Tokyo to launch the U.S.-Japan Economic Dialogue. Pence said after the meeting that Trump believes it is in America's interest to negotiate economic deals on a bilateral basis. He said that the dialogue could lead to formal talks on a U.S.-Japan trade agreement, but that he would leave that decision to the future. ___ 6:50 p.m. After meeting Prime Minister Shinzo Abe and other top Japanese officials, U.S. Vice President Mike Pence is ending his first day in Tokyo with a visit to an ancient Buddhist temple. Pence, his wife Karen and two daughters walked inside the main hall of colorful Senso-ji temple Tuesday as incense burned. It's Tokyo's oldest temple, and a highly popular tourist site that attracts crowds from around the world. Japan is the second stop on a four-country trip that is taking Pence to South Korea, Indonesia and Australia. It is his first trip to Asia as vice president. ___ 5:40 p.m. U.S. Vice President Mike Pence says the U.S. will not relent until it achieves its objective of ensuring the Korean Peninsula is free of nuclear weapons. Pence told reporters President Donald Trump was confident that economic and diplomatic pressure from the \"family of nations\" had a chance of compelling North Korea to cooperate. After talks with Japan's deputy prime minister, Taro Aso, Pence said the U.S. would work with Japan, China and other nations to get Pyongyang to give up its atomic weapons program. Asked what North Korea must do, he repeated that \"all options are on the table, and there they will remain.\" ___ 4:40 p.m. Japan and the U.S. have outlined a path forward for economic talks between the countries. The announcement followed an inaugural meeting Tuesday of the U.S.-Japan Economic Dialogue in Tokyo chaired by visiting U.S. Vice President Mike Pence and Japanese Deputy Prime Minister Taro Aso. It said the dialogue would focus on three areas: trade and investment rules and issues, cooperation in macroeconomic policy and specific industry sectors. The dialogue was set up by President Donald Trump and Japanese Prime Minister Shinzo Abe during the Japanese leader's visit to the U.S. in February. ___ 3:40 p.m. U.S. Vice President Mike Pence and Japanese Deputy Prime Minister Taro Aso are kicking off a new U.S.-Japan economic dialogue that was launched during Prime Minister Shinzo Abe's meeting with President Donald Trump in the U.S. in February. As talks began Tuesday, Aso said the U.S.-Japan alliance has underpinned peace and prosperity in the Asia-Pacific region and that trade friction with the U.S. has given way to an \"age of cooperation.\" Pence said Trump sees the talks as a way to improve business ties with Japan and is hoping for quick results. The discussions are to focus on economic and structural policy and trade and investment strategies aimed at strengthening both countries' economies. ___ 2:15 p.m. U.S. Vice President Mike Pence and Japanese leaders have begun talks expected to focus largely on trade with America's anchor ally in the region, though tensions with North Korea loomed large. Pence reassured Prime Minister Shinzo Abe on Tuesday that the U.S. considers its alliance with Japan to be a cornerstone of security in the region. Pence said, \"We appreciate the challenging times in which the people of Japan live with increasing provocations from across the Sea of Japan.\" He also said, \"We are with you 100 percent,\" adding that the U.S. always seeks peace. Abe said Japan hoped for peaceful dialogue with Pyongyang, \"but at the same time, dialogue for the sake of dialogue is valueless and it is necessary for us to exercise pressure North Korea so that it comes forward and engages in this serious dialogue.\" Pence was having lunch with Abe at the prime minister's official residence after arriving in Japan earlier in the day for the second stop of a 10-day Asia tour. ___ 12:15 p.m. U.S. Vice President Mike Pence has arrived in Japan for the second stop of a 10-day Asia tour. His plane touched down Tuesday at the U.S. military's Atsugi base outside Tokyo. The focus of his trip is expected to shift in Japan to trade. North Korea's nuclear and missile development dominated the agenda on his first stop in South Korea. Pence told business leaders before leaving Seoul that the Trump administration is reviewing all trade agreements as part of its \"America First\" policy. White House officials say the meetings in Tokyo are meant to forge a framework for future discussions after the U.S. withdrew from a Pacific Rim trade pact. INSIDE SEATTLEPI", "ord_in_thread": 0, "language": "english", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "uuid": "a563de3e27fdf2fb44b414a5097b2c57d3deb897", "rating": null, "highlightTitle": "", "title": "The Latest: Japan and US set framework for economic talks", "thread": {"country": "US", "site": "seattlepi.com", "replies_count": 0, "title_full": "The Latest: Japan and US set framework for economic talks - seattlepi.com", "site_categories": [], "performance_score": 0, "section_title": "Health: News and Advice on Fitness, Nutrition and Better Living - seattlepi.com", "domain_rank": 8376, "uuid": "a563de3e27fdf2fb44b414a5097b2c57d3deb897", "main_image": "http://ww3.hdnux.com/photos/60/46/03/12738762/3/rawImage.jpg", "site_type": "news", "title": "The Latest: Japan and US set framework for economic talks", "spam_score": 0.0, "site_section": "http://www.seattlepi.com/lifestyle/health/", "url": "http://omgili.com/ri/jHIAmI4hxg8y5ia1l.boMhR7X3QMTtohCtKnrobpdPL6H6iS0OYWCOXermFwPBwSd56BbkqghNaq9jXpgWtRIZpNFNeNMnbKTgDSS11vpjKercIXb6VGLevFGYDXfudVsa2AMdWZ8mU-", "participants_count": 1, "site_full": "www.seattlepi.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T03:00:00.000+03:00"}, "crawled": "2017-04-18T11:25:16.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8y5ia1l.boMhR7X3QMTtohCtKnrobpdPL6H6iS0OYWCOXermFwPBwSd56BbkqghNaq9jXpgWtRIZpNFNeNMnbKTgDSS11vpjKercIXb6VGLevFGYDXfudVsa2AMdWZ8mU-", "highlightText": "", "published": "2017-04-18T03:00:00.000+03:00", "author": "seattlepi.com"}]