[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:33:40.000+03:00", "author": "Tom Ferrall", "entities": {"persons": [{"name": "tom ferrall", "sentiment": "none"}, {"name": "clark g. moffat", "sentiment": "none"}, {"name": "marianne martini", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "moffat", "sentiment": "none"}, {"name": "bonsall", "sentiment": "none"}, {"name": "shane gibson", "sentiment": "none"}, {"name": "lorie frame", "sentiment": "none"}, {"name": "jared s. johnson", "sentiment": "none"}, {"name": "martini", "sentiment": "none"}], "locations": [{"name": "river village", "sentiment": "none"}, {"name": "fallbrook library", "sentiment": "none"}, {"name": "south mission road", "sentiment": "none"}, {"name": "san diego county", "sentiment": "none"}], "organizations": [{"name": "moffat financial group", "sentiment": "none"}, {"name": "facebook subscribe by email print this post moffat financial group", "sentiment": "none"}, {"name": "fallbrook high schools", "sentiment": "none"}, {"name": "social security", "sentiment": "none"}, {"name": "moffat financial", "sentiment": "none"}]}, "text": "Follow on Facebook Subscribe by Email Print This Post Moffat Financial Group representatives, from left, are Lorie Frame, administrative assistant; Jared S. Johnson, financial advisor; Clark G. Moffat, founder and CEO; and Marianne Martini, financial advisor. Shane Gibson photo \nClark G. Moffat, founder and CEO of the Moffat Financial Group, has been helping people reach their goals for 35 years, including some clients that have been with him for more than three decades. \n“I have six people that I’ve work with 33 years – almost my entire career,” said Moffat. “I have many clients that I’ve had for 25 to 30 years.” \nTrust and results are the foundation of successful long-term relationships in the financial world and Moffat and his team provide both, giving clients peace of mind regarding their investments. \n“We hear from clients all the time that say, ‘I don’t worry about it,'” said Moffat. \nMoffat and his staff – financial advisors Jared S. Johnson and Marianne Martini and administrative assistant Lorie Frame – like their clients to be both comfortable and involved. \n“We like people that are willing to roll their sleeves up and take responsibility for their future, and we’ll help them achieve what their vision of their future is,” said Moffat, who has advised more than 1,500 clients during his long career in finance. \nThe team at Moffat Financial uses a process called the “Foundation Process” to help clients identify their financial goals. \n“We lead with the planning process, and through that we help people identify both their goals, and also their values,” said Johnson. “When people are clear about their values, it helps them make smart decisions because they’re driven by the things that are most important to them.” \n“It’s all about aligning our clients’ goals and values so that we are doing the best by them,” said Martini of the Foundation Process. \nAfter a client’s goals and values have been identified, Moffat Financial tailors a long-term financial strategy specific to that client. The plan is constantly monitored and review meetings are held. \n“It (a review meeting) can be just one time a year depending on the complexity of the situation, to as many as three or four times a year depending on the complexity and the desire of the client,” said Moffat. \n“We’ll put all the numbers back in and we’ll go fully over everything and make sure our clients are still on track,” said Johnson of the review process. \nAn independent and proactive firm, Moffat Financial has created a systematic process that is reassuring to clients and also helps them stay on course toward achieving the things most important to them. \n“Clients know there’s a process that we’re going to go through and it’s the same and that we do this every time,” said Moffat. “And as they begin reaching their goals, they begin seeing it. But the fact that is systematized, and that it is a very specific process we go through, it builds trust.” \nIn another effort to maintain trust and keep clients comfortable, Moffat Financial works to make sure each individual is content with their investment strategy. \n“We just sent out a three-page questionnaire to our clients to reevaluate what their risk tolerance is, because what they stated or implied a year or two years ago isn’t necessarily the same thing to \n“And some of them have changed,” said Moffat. “Some of them have significantly changed their risk tolerance. We start with it (the questionnaire) – it’s part of the initial process – and then periodically send it out again because of age and stage of life changes.” \nThe Moffat Financial team believes everyone – from teenagers to seniors – should be in tune with financial matters and thus spends time in the community. \n“We do a lot of educational events because we do want to make sure people – whether they’re our clients or members of our community – have a better understanding of their finances,” said Martini. “From teen financial issues all the way up to Social Security questions, we want to give back to our community by providing them with that education.” \nMoffat Financial has given presentations at both Bonsall and Fallbrook High Schools and has conducted seminars on Social Security at Fallbrook Library. \n“The more you get the information out there, the better,” said Moffat. “It’s about making smart choices. But you have to understand the choices before you can make a smart decision.” \nSeeing clients reap the rewards of smart decisions is something Moffat and his associates always enjoy. \n“It’s fun to watch clients achieve goals,” said Moffat. “It’s fun to watch clients do the things they want to do.” \nMoffat Financial Group, which has been based in north San Diego County since 1990, is located in Bonsall’s River Village, 5256 South Mission Road, Suite 903. For a free consultation, call (760) 731-0489 or toll free (800) 999-6001. For more information, visit www.moffatfinancialgroup.com. \nMoffat Financial Group team helps people reach their goals added by Tom Ferrall on April 15, 2017", "url": "http://omgili.com/ri/vkc1Z8ITDMvYnOyTMOBLhblQFNAiNCYV.6xuUGdHpf9jsqyDH5pIxIrDcu_eOQ.KAp4GQa7ALV9c1U_HYZVp4ekbKpouOLngtHqMyKW6Hs3Rj2TB2zG8Ew--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:33:40.000+03:00", "language": "english", "title": "Moffat Financial Group team helps people reach their goals", "thread": {"title_full": "Moffat Financial Group team helps people reach their goals", "site_full": "villagenews.com", "site": "villagenews.com", "site_section": "http://live.thevillagenews.com/feed", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "news", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Village News", "url": "http://omgili.com/ri/vkc1Z8ITDMvYnOyTMOBLhblQFNAiNCYV.6xuUGdHpf9jsqyDH5pIxIrDcu_eOQ.KAp4GQa7ALV9c1U_HYZVp4ekbKpouOLngtHqMyKW6Hs3Rj2TB2zG8Ew--", "published": "2017-04-16T09:33:40.000+03:00", "title": "Moffat Financial Group team helps people reach their goals", "uuid": "a70e13f3f29afea78704653527be8f541bf2f72c", "main_image": "http://villagenews.com/wp-content/uploads/2017/04/04-13-17-biz-Moffat-Financial-Group.jpg"}, "uuid": "a70e13f3f29afea78704653527be8f541bf2f72c", "ord_in_thread": 0}]