[{"uuid": "a8894dc7b12df7b1849fb95ec0e15fd40d64652e", "url": "http://omgili.com/ri/jHIAmI4hxg8tFV.2eEwFn5LmwH8BXiBvfI11HVmI2GhrNEmg9UDw9j2LM5DnJwAwQExCZcQNoQv_r9JcV04vVI2l5fMAWM1zfiYOGbXXvuPXftQA.iy3Qk7g6Gkr9AP0", "title": "&apos;Building the Wall,&apos; Robert Schenkkan&apos;s anti-Trump protest play, is one of L.A.&apos;s hottest tickets", "author": "Craig Nakano", "rating": null, "published": "2017-04-18T17:50:00.000+03:00", "highlightText": "", "entities": {"organizations": [], "locations": [], "persons": []}, "highlightTitle": "", "thread": {"uuid": "a8894dc7b12df7b1849fb95ec0e15fd40d64652e", "url": "http://omgili.com/ri/jHIAmI4hxg8tFV.2eEwFn5LmwH8BXiBvfI11HVmI2GhrNEmg9UDw9j2LM5DnJwAwQExCZcQNoQv_r9JcV04vVI2l5fMAWM1zfiYOGbXXvuPXftQA.iy3Qk7g6Gkr9AP0", "site_full": "www.latimes.com", "title": "&apos;Building the Wall,&apos; Robert Schenkkan&apos;s anti-Trump protest play, is one of L.A.&apos;s hottest tickets", "site_section": "http://feeds.latimes.com/CultureMonster", "domain_rank": 609, "published": "2017-04-18T17:50:00.000+03:00", "title_full": "&apos;Building the Wall,&apos; Robert Schenkkan&apos;s anti-Trump protest play, is one of L.A.&apos;s hottest tickets - LA Times", "participants_count": 1, "replies_count": 0, "spam_score": 0.005, "section_title": "CULTURE MONSTER - Los Angeles Times", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 2}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 248, "likes": 248, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 2, "main_image": "http://www.trbimg.com/img-58f6542c/turbine/la-et-cm-building-wall-play-20170418", "site": "latimes.com"}, "external_links": ["http://www.tribpub.com/privacy-policy-and-your-privacy-rights/", "https://twitter.com/cnakano", "http://www.trbimg.com/img-58dd69f7/turbine/la-et-mn-chang-ghost-in-the-shell-20170330", "http://www.trbimg.com/img-58eeb331/turbine/la-et-mn-chang-fate-of-the-furious-20170412", "http://www.trbimg.com/img-58d8beca/turbine/la-et-hc-westworld-paleyfest-hbo-james-marsden-video-20170326", "http://www.trbimg.com/img-58eff9f0/turbine/la-en-emmy-chat-minnie-driver-speechless-full-20170411", "https://api.nlr.tronc.com/v3/newsletters/subscriptions&newsletterApiKey=t2RIwsHk5p8RFZ0sPKLEr2M0Rh64DNz69BDRyGQa&grecaptchaSiteKey=6LeLkgoUAAAAALGXqOHElPreIs6Z9DwMgVDgB13j&allurl=http://newsletters.latimes.com/", "http://www.trbimg.com/img-58d8c17d/turbine/la-et-hc-westworld-paleyfest-hbo-evan-rachel-wood-video-20170326"], "language": "english", "text": "Among his opposition, President Trump likely triggers daily episodes of anger, frustration and fear. But he also sells tickets.\n“Building the Wall,” Pulitzer Prize winner Robert Schenkkan’s new political play written in response to what he calls Trump’s dangerous rhetoric and authoritarian tendencies, has become one of the best-selling shows in the 27-year history of the Fountain Theatre in Los Angeles, Artistic Director Stephen Sachs said.\nThe production has been selling out three weeks in advance, he said, and the Fountain announced Monday that it is extending the run through June 18 after originally planning to close May 21.\nTimes theater critic Charles McNulty described \"Building the Wall\" as an exploration of the banality of evil. Set in the near future, the Trump administration ratchets up the war against terrorism and permits the rounding up of immigrants, which leads to detention centers beset with managerial problems and inevitable human catastrophe.\nThe play does lapse into rhetoric, McNulty noted in his March 21 review , but “the theater historically has provided a forum for citizens to contemplate the agonizing issues of the day, and it's heartening to see Schenkkan and the Fountain respond with such celerity to present dangers.”\nSIGN UP for the free Essential Arts & Culture newsletter »\nSchenkkan won the 1992 Pulitzer for drama for “The Kentucky Cycle” and the 2014 Tony Award for best play for “All the Way.” His credits also include the 2016 film “Hacksaw Ridge.” The esteemed writer’s track record and his choice of subjects for this latest world premiere have led to news coverage from the New York Times, Washington Post and BBC News Hour.\n“Building the Wall” is scheduled to open later this year in New York, Tucson and Denver, among other places. In Washington, D.C., a Forum Theatre production is set to begin performances April 27 in one of the Arena Stage’s three theaters.\n\"We hope it triggers a flurry of midnight tweets from the White House,” Sachs said. “That would be our most coveted review yet.\"\nCaption 'The Fate of the Furious' movie review by Justin Chang Justin Chang reviews \"The Fate of the Furious,\" directed by F. Gary Gray and starring Vin Diesel, Charlize Theron, Dwayne Johnson, Michelle Rodriguez, Ludacris, Tyrese Gibson, Jason Statham, Kurt Russell, Scott Eastwood and Nathalie Emmanuel. Video by Jason H. Neubert\nJustin Chang reviews \"The Fate of the Furious,\" directed by F. Gary Gray and starring Vin Diesel, Charlize Theron, Dwayne Johnson, Michelle Rodriguez, Ludacris, Tyrese Gibson, Jason Statham, Kurt Russell, Scott Eastwood and Nathalie Emmanuel. Video by Jason H. Neubert\nCaption 'The Fate of the Furious' movie review by Justin Chang Justin Chang reviews \"The Fate of the Furious,\" directed by F. Gary Gray and starring Vin Diesel, Charlize Theron, Dwayne Johnson, Michelle Rodriguez, Ludacris, Tyrese Gibson, Jason Statham, Kurt Russell, Scott Eastwood and Nathalie Emmanuel. Video by Jason H. Neubert\nJustin Chang reviews \"The Fate of the Furious,\" directed by F. Gary Gray and starring Vin Diesel, Charlize Theron, Dwayne Johnson, Michelle Rodriguez, Ludacris, Tyrese Gibson, Jason Statham, Kurt Russell, Scott Eastwood and Nathalie Emmanuel. Video by Jason H. Neubert\nCaption Emmy Chat: Why Minnie Driver’s so committed to her 'Speechless' family Minnie Driver talks about her role as fearless mom Maya, showing disability on-screen and the irreverent comedy on \"Speechless.\"\nMinnie Driver talks about her role as fearless mom Maya, showing disability on-screen and the irreverent comedy on \"Speechless.\"\nCaption 'Ghost In The Shell' movie review by Justin Chang Justin Chang reviews \"Ghost In The Shell,\" directed by Rupert Sanders, starring Scarlett Johansson, Juliette Binoche, Takeshi Kitano, Michael Pitt, Pilou Asbaek and Chin Han. Video by Jason H. Neubert.\nJustin Chang reviews \"Ghost In The Shell,\" directed by Rupert Sanders, starring Scarlett Johansson, Juliette Binoche, Takeshi Kitano, Michael Pitt, Pilou Asbaek and Chin Han. Video by Jason H. Neubert.\nCaption PaleyFest 2017: Evan Rachel Wood of ‘Westworld’ Evan Rachel Wood, who plays Dolores Abernathy on HBO’s “Westworld,” discusses her character’s direction at the end of Season One.\nEvan Rachel Wood, who plays Dolores Abernathy on HBO’s “Westworld,” discusses her character’s direction at the end of Season One.\nCaption PaleyFest 2017: James Marsden of ‘Westworld’ James Marsden who plays Terry Flood on HBO’s “Westworld,” talks about his hopes for what may come next for his character.\nJames Marsden who plays Terry Flood on HBO’s “Westworld,” talks about his hopes for what may come next for his character.\ncraig.nakano@latimes.com\n@cnakano\nSupport coverage of the arts. Share this article.\nYOU ALSO MAY LIKE ...\nThe review: “Building the Wall”\nWhat a play about Antonin Scalia tells us about this moment in American history\nWhy Hillary Clinton's next big stage should be at the Tony Awards\nLin-Manuel Miranda's 'Hamilton,' as vital as ever, opens in San Francisco\nPrivacy Policy", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:55.000+03:00"}]