[{"entities": {"locations": [{"name": "new york", "sentiment": "none"}, {"name": "mcdonald's", "sentiment": "none"}, {"name": "erie", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "cincinnati", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "fresno", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mark gillispieassociated press  erie", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "columbus", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "toledo", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "grand canyon national park", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "cleveland police", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "gmt police", "sentiment": "none"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "wjw-tv", "sentiment": "none"}, {"name": "state police", "sentiment": "none"}, {"name": "ap photo/james h. collins", "sentiment": "none"}, {"name": "erie times-news", "sentiment": "none"}], "persons": [{"name": "dake kang", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "delano massey", "sentiment": "none"}, {"name": "erie", "sentiment": "none"}, {"name": "kantele franko", "sentiment": "none"}, {"name": "george h.w. bush", "sentiment": "none"}, {"name": "robert godwin sr.", "sentiment": "none"}, {"name": "mike householder", "sentiment": "none"}, {"name": "john seewer", "sentiment": "none"}, {"name": "michael rubinkam", "sentiment": "none"}, {"name": "william teper jr.", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "wheeler", "sentiment": "none"}, {"name": "gail wheeler", "sentiment": "none"}, {"name": "gillispie", "sentiment": "none"}, {"name": "steve stephens", "sentiment": "none"}, {"name": "stephens", "sentiment": "none"}, {"name": "thomas ducharme jr.", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "dan sewell", "sentiment": "none"}, {"name": "calvin williams", "sentiment": "none"}, {"name": "ivanka trump", "sentiment": "none"}, {"name": "godwin", "sentiment": "none"}, {"name": "debbie godwin", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "joy lane", "sentiment": "none"}, {"name": "ducharme", "sentiment": "none"}, {"name": "robert godwin", "sentiment": "none"}, {"name": "jon ossoff", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.newson6.com", "site_section": "http://www.newson6.com/category/13530/national-news?clienttype=rss", "domain_rank": 33730, "replies_count": 0, "country": "US", "section_title": "News On 6 - National - Headline", "title": "Facebook killer takes his own life as police close in", "title_full": "Facebook killer takes his own life as police close in", "published": "2017-04-19T08:40:08.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_XCqqqI7R4P6K5g4XUY3PUPfsFl4DhiOK7zAqQdflj49aJFZ66sIR7zA.UiOAoIXDH9rgEWUheIFs81Tat7tCeVkLJKvpvioX6DxEj8IXCRQdJP2XlEeQL", "site": "newson6.com", "main_image": "http://images.worldnow.com/AP/images/13643786_G.jpg", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 0, "performance_score": 0, "spam_score": 0.0, "uuid": "a893864e1747c9c6eb1025667b8e09741e8f49a2", "site_type": "news"}, "title": "Facebook killer takes his own life as police close in", "published": "2017-04-19T08:40:08.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_XCqqqI7R4P6K5g4XUY3PUPfsFl4DhiOK7zAqQdflj49aJFZ66sIR7zA.UiOAoIXDH9rgEWUheIFs81Tat7tCeVkLJKvpvioX6DxEj8IXCRQdJP2XlEeQL", "author": "", "crawled": "2017-04-19T08:40:08.000+03:00", "language": "english", "text": "Facebook killer takes his own life as police close in Posted: Updated: (Cleveland Police via AP). CORRECTS TO CLARIFY THE VIDEO WAS NOT BROADCAST ON FACEBOOK LIVE AS POLICE INITIALLY INDICATED, BUT POSTED AFTER THE KILLING - This undated photo provided by the Cleveland Police shows Steve Stephens. Cleveland police said th... (AP Photo/Mike Householder). A makeshift memorial sits along a fence Monday, April 17, 2017, near where Robert Godwin Sr., was killed in Cleveland. Police said Steve Stephens killed Godwin on Sunday and posted the video on Facebook. (Facebook via AP). This Sunday, April 16, 2017 frame from video posted on Facebook shows Robert Godwin Sr. in Cleveland moments before being fatally shot. The search for murder suspect Steve Stephens put authorities in surrounding states on the lookout... (AP Photo/James H. Collins, File). FILE - In this Wednesday, May 16, 2012, file photo, a Facebook logo is displayed on the screen of an iPad, in New York. A Facebook video of an Ohio man shooting a 74-year-old retiree in Cleveland was up for three hour... (Cleveland Police via AP). CORRECTS TO CLARIFY THE VIDEO WAS NOT BROADCAST ON FACEBOOK LIVE AS POLICE INITIALLY INDICATED, BUT POSTED AFTER THE KILLING - This undated photo provided by the Cleveland Police shows Steve Stephens. Cleveland police said th...  14  14:56 GMT She wasn't in her home state, but U.S. Sen. Elizabeth Warren couldn't have asked for a friendlier audience to launch her book tour. More >> She wasn't in her home state, but U.S. Sen. Elizabeth Warren couldn't have asked for a friendlier audience to launch her book tour.  14  14:52 GMT Ivanka Trump has tried to distance herself from the brand that bears her name, to separate business from politics in her new position at the White House. More >> Ivanka Trump has tried to distance herself from the brand that bears her name, to separate business from politics in her new position at the White House.  14  14:23 GMT Lawyers for Arkansas inmates condemned to die Thursday in a planned double execution are claiming they are innocent and one of them says advanced DNA techniques could show he didn't kill a woman in 1993. More >> Lawyers for Arkansas inmates condemned to die Thursday in a planned double execution are claiming they are innocent and one of them says advanced DNA techniques could show he didn't kill a woman in 1993.  14  14:21 GMT A 23-year-old man sues the federal government Tuesday over his deportation to Mexico, saying he was entitled to remain in the United States under a program that shields people who came to the country as young... More >> A 23-year-old man sues the federal government Tuesday over his deportation to Mexico, saying he was entitled to remain in the United States under a program that shields people who came to the country as young children.  14  14:16 GMT An Associated Press examination has revealed federal and state managers made a series of questionable decisions and missteps before and during a crisis at the nation's tallest dam in February. More >> An Associated Press examination has revealed federal and state managers made a series of questionable decisions and missteps before and during a crisis at the nation's tallest dam in February. More >>    08  08:03 GMT A Georgia congressional election in a historically conservative district is headed to a runoff that raises the stakes in an early measure for President Donald Trump and both major parties ahead of the 2018 midterm... More >> A Georgia congressional election in a historically conservative district is headed to a runoff that raises the stakes in an early measure for President Donald Trump and both major parties ahead of the 2018 midterm elections. More >> Trump   By MIKE HOUSEHOLDER and MARK GILLISPIEAssociated Press \nERIE, Pa. (AP) - The man who randomly gunned down a Cleveland retiree and posted video of the crime on Facebook killed himself Tuesday during a police chase in Pennsylvania that began when a McDonald's drive-thru attendant recognized him. \nIt marked a violent end to the nearly 48-hour multistate manhunt for Steve Stephens, whose case brought another round of criticism down on Facebook over how responsibly it polices objectionable material posted by users. \nActing on a tip from the McDonald's, state troopers spotted Stephens leaving the restaurant in Erie and went after him, bumping his car to try to get it to stop, authorities said. He shot himself in the head after the car spun and came to a stop, police said. \n\"This started with one tragedy and ended with another person taking their own life,\" said Cleveland Police Chief Calvin Williams. \"We would have liked to have brought Steve in peacefully and really talked to him about why this happened.\" \nStephens, a 37-year-old job counselor who worked with young people, was wanted on murder charges in the killing of Robert Godwin Sr., 74, a former foundry worker and father of 10 who was picking up aluminum cans on Sunday when he was shot. \nThe chilling video was on Facebook for three hours before it was taken down. It was just the latest instance of crime footage being shared on social media. \nAt a Silicon Valley conference Tuesday, Facebook CEO Mark Zuckerberg briefly addressed the Cleveland case, saying Facebook has \"a lot of work to do\" and \"we will keep doing all we can to prevent tragedies like this.\" \nPolice would not speculate on what triggered the killing, but in the video and other footage he posted, Stephens talked about having trouble with his girlfriend and losing everything he had to gambling. He said he \"just snapped.\" \nOne of Godwin's daughters, Debbie Godwin, said she wished Stephens had been captured. \n\"I'm not happy he's dead at all, not at all. If you did it, you have to face your crime,\" she said. \nThe break in the case came when police received a tip that Stephens was at the McDonald's in Erie, in far western Pennsylvania about 100 miles east of Cleveland, where he ordered a 20-piece Chicken McNuggets and fries. \nThe drive-thru attendant thought she recognized Stephens and called state police, restaurant owner Thomas DuCharme Jr. told the Erie Times-News. State Police Maj. William Teper Jr. would say only that the tip came from a \"concerned citizen.\" \nThe McDonald's employees tried to \"buy some time for the cops\" by telling Stephens his fries were delayed, but he said he had no time to wait and drove off, according to DuCharme. \nPolice picked up the trail in a chase that lasted 2 miles before Stephens took his own life, authorities said. \nGail Wheeler, of Erie, said she was stopped at a light at the McDonald's when Stephens came \"whipping out\" of the parking lot, nearly hitting her. She said state troopers weren't far behind. \nWheeler said she followed the chase and saw a trooper clip Stephens' rear bumper. His car did a half-turn and came to rest against the curb, and she heard a gunshot, she said. She then saw officers approach the car. \nThe officer closest to the car \"just shook his head,\" she said. \"They had their guns out, but when he shook his head, they lowered their guns.\" \nPolice said it wasn't clear whether Stephens had any help while he was on the run or where he had been and that investigators will try to retrace his steps. Stephens' cellphone had been tracked Sunday afternoon near Erie, officials said on Monday. \nFacebook said it removed the video of the shooting 23 minutes after learning of it. The company has since announced it is launching a review for reporting harmful content. \n\"This is something that should not have been shared around the world. Period,\" Cleveland's police chief said. \nIn the video, Stephens told Godwin the name of his girlfriend and said, \"She's the reason that this is about to happen to you.\" Godwin did not seem to recognize the name. \nThe woman, Joy Lane, told WJW-TV in Cleveland that she last talked with Stephens on Saturday night, when he told her he had quit his job and was moving out of state. \nInvestigators said that Godwin was the only victim so far linked to Stephens, despite his claim on Facebook that he killed over a dozen people. \nDetectives spoke with the suspect on Sunday by cellphone and tried to persuade him to surrender, police said. Within a day, authorities expanded the search nationwide and offered a $50,000 reward for information leading to his capture. \n___ \nAssociated Press reporters Michael Rubinkam in Pennsylvania; Dake Kang and Delano Massey in Cleveland; Kantele Franko in Columbus; John Seewer in Toledo; and Dan Sewell in Cincinnati contributed to this report. Gillispie reported from Cleveland. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. News On 6", "external_links": [], "highlightTitle": "", "uuid": "a893864e1747c9c6eb1025667b8e09741e8f49a2", "highlightText": "", "rating": null}]