[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/DyQaNGXlfMpoME4ghvMV4AUfPowfrYIxcUIs.a0gAxpPCV6CpLf5W0Ru3wBZFA2SGug8H9GbaB91ofvJmMGwU.va3CNeD2ZurxknGqDkcUhKw9t78I6eUg--", "title": "The other side of Obong Umana Okon Umana we did not know", "site_type": "blogs", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://theinknewspaper.blogspot.com/", "spam_score": 0.0, "section_title": "Welcome to the Official Blog of THE INK Newspaper- Uyo, Akwa Ibom State.", "site": "blogspot.com", "site_full": "theinknewspaper.blogspot.com", "performance_score": 0, "uuid": "abcfba3d212bdcf049498b82c2b782de84068970", "published": "2017-04-17T11:24:59.000+03:00", "site_categories": [], "country": "US", "title_full": "The other side of Obong Umana Okon Umana we did not know", "participants_count": 1, "main_image": null}, "url": "http://omgili.com/ri/DyQaNGXlfMpoME4ghvMV4AUfPowfrYIxcUIs.a0gAxpPCV6CpLf5W0Ru3wBZFA2SGug8H9GbaB91ofvJmMGwU.va3CNeD2ZurxknGqDkcUhKw9t78I6eUg--", "title": "The other side of Obong Umana Okon Umana we did not know", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:24:59.000+03:00", "language": "english", "entities": {"locations": [{"name": "gas free zone", "sentiment": "none"}, {"name": "doha", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "gas free zone authority", "sentiment": "none"}, {"name": "uyo", "sentiment": "none"}, {"name": "nigeris", "sentiment": "none"}, {"name": "ogfza", "sentiment": "none"}], "persons": [{"name": "obong umana okon umana", "sentiment": "none"}, {"name": "ikot abasi", "sentiment": "none"}, {"name": "umana umana", "sentiment": "none"}, {"name": "udom emmanuel", "sentiment": "none"}, {"name": "muhhamadu buhari", "sentiment": "none"}, {"name": "umana", "sentiment": "none"}, {"name": "umana okon umana", "sentiment": "none"}], "organizations": [{"name": "all progressives congress", "sentiment": "none"}, {"name": "apc", "sentiment": "none"}, {"name": "liberty oil", "sentiment": "none"}, {"name": "akwa ibom state government", "sentiment": "none"}, {"name": "gas free zone authority", "sentiment": "none"}, {"name": "joint implementation committee", "sentiment": "none"}, {"name": "akwa ibom", "sentiment": "none"}, {"name": "ogfza", "sentiment": "none"}, {"name": "liberty oil and gas free zone authority", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "abcfba3d212bdcf049498b82c2b782de84068970", "published": "2017-04-17T11:24:59.000+03:00", "author": "theinknewspaper (noreply@blogger.com)", "text": "\nBY EMMANUEL SAM  \nBarely two years after the  heavily rigged 2015 gov ernorship election in the state which saw the emergence of Mr. Udom Emmanuel as Governor , many within and outside the state had thought the Governorship candidate for All Progressives Congress, APC, Mr. Umana Umana would liaise with APC led Federal Government to either stall projects coming into the state or sponsor attacks on Governor Udom Emmanuel, instead the former secretary to the state government has demonstrated a true spirit of a statesman ever since he assumed office as the Managing Director, Oil and Gas Free Zone.  \nAfter taking charge of his new office in September 2016, he took a tour of States with potentials for Oil and Gas Free Zone Authority, OGFZA.  \nUnlike a typical politically wounded Nigerian officer seeker, he visited the man that was once his opponent in the contest of serving Akwa Ibom interest, Governor Udom Emmanuel and offered opportunity for Akwa Ibom to establish Oil and Gas Free Zone Authority. Mr. Umana did not stop at submitting the proposal, but set up structure within his agency to liaise with Akwa Ibom State Government’s committee to ensure the actualisation of this dream.  \n\nJust last week, the managing director of OGFZA, Mr. Umana Okon Umana, said he was impressed at the pace and level of mobilisation and promotion by the state government to attract investors to the project and efforts to build and secure a licence for the proposed Liberty Oil and Gas Free Zone in Ikot Abasi. The commendation came after a careful review of work progress on the proposed free zone by Joint Implementation Committee at the end of a review meeting in Uyo by Mr. Umana Umana.  \nA careful appraisal of events since Umana Umana mounted the podium of management at OGFZA, has galvanised many Akwa Ibom persons to ask if this is the same Umana Umana who was presented to Akwa Ibom people during the 2015 Governorship Election as pharaoh, wicked person who looted the state to a fault, is actually doing all these.  \nThe truth is now clear that Akwa Ibom people were persuaded to believe a different thing from who the man, Umana Umana is. That also means that Mr. Umana vision of becoming Akwa Ibom State Governor was not borne out of selfishness as put forth by his enemies, but a strong desire and commitment to bring development to the state. It also shows that with the wide range of contacts Mr. Umana has, if he were on the saddle of state leadership, the idea of industrialising the state would have been the easiest thing. \nRight from when he was a civil servant in the state civil service, both retired and current serving staff of budget office still testify of Mr. Umana’s commitment and passion for every assigned duty while in active service. Even when he launched into the political sphere of the state, he still demonstrated strong commitment in getting government work done on time. If Mr. Umana was not imbued with this sense of transparency and commitment to duty with interest of the masses at heart, I don’t think President Muhhamadu Buhari would have appointed him to lead a critical agency like OGFZA. \nWith the coming on board of Liberty Oil and Gas Free Zone Authority orchestrated by Mr. Umana selfless interest to contribute to the development of the state, many Akwa Ibom youths will be employed and that will invariably halt incessant cases of youth restiveness in the state. As a humble man with good tact on human relations, this gentleman has created bond with Akwa Ibom millions of Akwa Ibom people. \nWithout any gainsay, one of the strong traits of a good leader is capacity to let go. This is an important corollary to measure how mature a good leader or potential leader is. Mr. Umana has demonstrated this trait by letting go in totality the unwholesome experience he passed through on to a bigger challenge. He has compulsively worked his network. One of the most consistently common traits of a successful leader is the ability to relentlessly work his network because all success is built on a network of human connections that need to be nurtured and reinforced. Few days ago,MD/ CEO, OGFZA, Mr. Umana Umana, was invited to address 15th World Free Zones Convention in Doha, Qatar where he seized the opportunity to build more network that will attract investors to the state and Nigeris at large.  \nThe success story of Umana Umana cannot be ostracized from the prayer of his committed wife whose pieces of advice have contributed to the making of the MD/CEO of OGFZA. \nToday, Umana Umana is one of living legends Akwa Ibom State people will always remember. He has demonstrated that beyond politics somebody can still offer service to his people. Just like the Bible says “He that is faithful in little will be faithful in all”, it is the honest belief of Akwa Ibom people that since Mr. Umana Umana has been faithful in making good use of his office to better the state, he will be faithful to still serve Akwa Ibom people when a bigger opportunity comes his way. \n"}]