[{"entities": {"organizations": [], "locations": [], "persons": []}, "uuid": "ad0f3d0523912b279e892a0bea77d8c63a876744", "highlightText": "", "title": "", "thread": {"site": "spacebattles.com", "country": "US", "participants_count": 11, "site_full": "forums.spacebattles.com", "section_title": "Whitehall - The SB Politics Forum! | Spacebattles Forums", "uuid": "ae6ce81831d87336d6263345c61ef88f81b63671", "site_section": "https://forums.spacebattles.com/forums/whitehall-the-sb-politics-forum.64/", "domain_rank": 29444, "main_image": "https://forums.spacebattles.com/data/avatars/m/287/287632.jpg?1391915339", "performance_score": 0, "published": "2017-04-16T11:51:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZShcLv2AiNvM_EISCDvjT.e47bw5ErTXQFRz6HopCHm6bpFNeFTpvkBE9U7FFtbVz0NRqGwpbwWEDrxEIRofeVoL7cGNZn2JJsiTvKFvj8Ek.47_LiaU.mH", "title_full": "How do you Beat Nostalgia in Politics? | Page 2 | Spacebattles Forums", "title": "How do you Beat Nostalgia in Politics? | Page 2", "site_type": "discussions", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.011, "site_categories": [], "replies_count": 15}, "language": "english", "published": "2017-04-16T11:51:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZShcLv2AiNvM_EISCDvjT.e47bw5ErTXQFRz6HopCHm6bpFNeFTpvkBE9U7FFtbVz0NRqGwpbwWEDrxEIRofeVoL7cGNZn2JJsiTvKFvj8Ek5.h.uLQoEgVnSKY_.sWptQ-", "ord_in_thread": 15, "crawled": "2017-04-16T23:20:55.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "TheMagisKing", "text": "You need catchy videos that get people in rural areas to like new technologies, showcasing how much better technology has made their lives in many different ways, things like various methods that lead to better crop yields, less people getting crippled or killed or diseased from factory or resource extraction work, vehicles that are less deadly in a crash and need less gas, better shipping and online shopping that can get them things they want from basically anywhere quickly and of high quality and the best prices, and their kids being able to find out something they want to know in seconds via wikipedia and google rather than hours of research in a library that may not even have the information and how some of that information can help their lives.\nBeing able to find houses and apartments and compare prices more easily with online tools that even if you aren't using, your realtor might. Their kids being able to find new jobs or be recruited based on their skills for new jobs more easily with online applications and job searches, check reviews from past and current employees, and the like. These things being shown will help make the lack of coal and manufacturing jobs coming back seem less threatening, because it will make moving and getting a new job elsewhere seem easier and safer.\nShow them new technologies that might be coming down the road that will make their lives better if only they participate in the new economy, rather than resisting it, methods to create more energy safer, cleaner, cheaper, and easier and more efficiently than coal ever could, internet based systems letting people have jobs over high-speed internet without the commute anywhere they want for many sorts of office type jobs, even living in rural areas if they want, so long as they vote to let the government expand high speed internet. Show them ways to improve farming, making it need less water, get that water that they need more easily, farm in more diverse climates, test their soil qualities to know what is best to plant or how to fix the soil problems they might have and improve crop yields.\nShow them how new or believed to be upcoming medical technologies can help issues in their neighborhoods, like heroin addictions and overdoses of pain meds.\nShow them how much better things are after environmental regulations, reminding them of things like smog choked areas making people sick. Show them how violent crime rates have gone down and intelligence tests gone up at the same rates as lead removal in various parts of the world a generation down the road from it. Show them how much more local businesses can grow by more easily expanding their customer bases overseas while not held back by retaliatory tariffs.\nShow them the new tools that we have to let people with less intelligence do jobs that they could not do previously, like being able to ask google and wikipedia things, calculators that are more convenient and easier to use, smart-phone apps, specialized programs and more advanced tools created for certain jobs.\nShow them how things no longer in mass production can be more easily ordered in the future or to a degree even now thanks to 3d printing, so they can fix old stuff they like that gets broken or needs simple maintenance with no longer created parts and tools.\nThen, if they are still being stubborn, how them how most of the easy to get coal is already mined out, and how coal is now being beaten by gas and fracking (rather than renewables which they like to blame). Show them crops withering on the vine or robots being used rather than managing to get american citizens to do farm labor after scaring migrant labor away with threats of deportation and the like. Show them how American manufacturing output has actually gone up, and relatively few companies have gone overseas. Show them how shipping costs mean that you need to locate factories either near resource extraction, energy, or customers, and the resource extraction has been all extracted in many older areas, the energy isn't coal anymore, so also located elsewhere, and the customers are in cities, so new factories are being built in different locations than the old ones, so there is no reason for jobs to go back to their towns, and coal really is dead, so they, or their children, need to move where the jobs are going to now, and how that is something that has always happened, showing various ghost towns based on resource extraction when the resources involved dried up. Show them how many more people we can feed now with new farming methods compared to old ones, and how much we can expect to improve things if we adopt various already tested methods better and across more farms.\nYou need to be careful with how all this is presented, and make sure it gets to the target audiences by putting it in advertisements in the media they do consume, including local channels and even newspapers and stuff, or attaching it to their facebook and twitter feeds with targeted advertising methods or something, even if it goes against their normal politics, or actually get some of their normally partisan newscasters on board in sneaky ways not letting them realize the goals behind the videos you are producing might turn their people away from the Republicans or encourage rural Democrats to vote, possibly by couching things in the right terms showing off American stuff or warning about the threats of the new economy or showing off oil/fracking rather than hating on coal, etc. Things need to be shown in short segments in various aspects to the same audiences that illustrate the points involved clearly without directly threatening their biases and instead carefully shifting things within the context of their normal biases in ways they can recognize and not directly reject as lies. Lots of individual videos and adds and such, rather than single long ones they probably wouldn't watch or listen to or read in the first place, or would tune out of and not get the whole thing."}]