[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/.wHSUbtEfZTKSmliJaVAQTn.m7_W0oyrM_nQzwByDa8jHK5SF1w8UJYHZD9mIdjnhrgX7CIOoV7ttVHbszBWfMwAgWFC4U8MkR6sn41Gmmd9vA0rPlwSJw--", "title": "How I celebrated my birthday!", "site_type": "blogs", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "https://wrinklewrinklelittlestar.wordpress.com", "spam_score": 0.0, "section_title": "How I celebrated my birthday! – Wrinkle Wrinkle Little Star", "site": "wordpress.com", "site_full": "wrinklewrinklelittlestar.wordpress.com", "performance_score": 0, "uuid": "ad91eac0f93bff7a2710f4e3afc308af9b898601", "published": "2017-04-17T11:25:20.000+03:00", "site_categories": [], "country": "US", "title_full": "How I celebrated my birthday!", "participants_count": 1, "main_image": null}, "url": "http://omgili.com/ri/.wHSUbtEfZTKSmliJaVAQTn.m7_W0oyrM_nQzwByDa8jHK5SF1w8UJYHZD9mIdjnhrgX7CIOoV7ttVHbszBWfMwAgWFC4U8MkR6sn41Gmmd9vA0rPlwSJw--", "title": "How I celebrated my birthday!", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:25:20.000+03:00", "language": "english", "entities": {"locations": [{"name": "costa", "sentiment": "none"}], "persons": [{"name": "elliott", "sentiment": "none"}, {"name": "samantha", "sentiment": "none"}], "organizations": [{"name": "primark", "sentiment": "none"}, {"name": "apley farm shop", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "ad91eac0f93bff7a2710f4e3afc308af9b898601", "published": "2017-04-17T11:25:20.000+03:00", "author": "sh", "text": "You may have seen my ‘What I Got For My Birthday’ video in a previous post. If you’re curious on how I spent my 37th birthday, take a look here…\n\nAs I don’t do a lot of talking in the video, I thought I’d give you a quick written summary too! Here goes…\nMy birthday was on a Friday, but I decided to book the Thursday off work too and make a really long weekend of it. Elliott was at nursery so I headed to our local shopping centre. I was originally planning on having a massage first thing, followed by some retail therapy. However, my therapist had called in poorly, so my appointment had to be moved until later in the day.\nI breakfasted in Costa and caught up on blog stuff. It might seem strange to blog on a relaxing day, but I enjoy being creative so it kind of is my way of chilling out.\nI then headed to Primark before meeting up with my mom and heading around the shops. I didn’t buy much at all. In fact, apart from some underwear and a book that I will review in a blog post very soon, I actually can’t remember what I purchased. Mom and I had lunch in Five Guys. This was my first Five Guys experience and I have to say it was yummy. Particularly the strawberry milkshake! It’s probably a good job I didn’t know about them when I was pregnant, otherwise I would have always been in there!\nWe then did more mooching before I headed off for my spa appointment. The spa at my local shopping centre is gorgeous. I arrived early and sat on the comfy sofas and read my new book. When I was taken through to my treatment room it had been carefully prepared with low-lighting; soft, calm and relaxing music; buddhas and flowers. There was even a little sign which read ‘This room has been prepared for Samantha’. I had a 60-minute Swedish Massage and it was bliss. I thought I would fall asleep, but actually I lay there thinking. Again, this might not sound the most relaxing, but it’s not very often I get to zone out and just let my brain meander.\nOn my birthday itself we headed to the park for breakfast as I adore their pancakes. We didn’t really have a set agenda for the rest of the day, but quickly made the decision to head to Apley Farm Shop. This was a great plan. Enough of a drive to give Elliott a bit of a nap, a gorgeous on-site farm shop, classy soft play, a small farm area, a gorgeous flower and gift shop and a fabulous and very child friendly restaurant where we had lunch.\nElliott napped again as we headed home ready to open presents. As my birthday falls on St. Patricks Day I decided to put on some Irish music when we arrived at home and me and Elliott quite happily spent about half-an-hour jigging around to it. Unfortunately Elliott’s signature dance move was to spin round-and-round in circles until he got dizzy and fell over.\nGift time – with Elliott helping me to open my presents (you can take a look at what I got for my birthday here ) was soon followed by cake time. A delicious cake which combined my love of chocolate and my adoration of stars.\nAll in all a fabulous day :)"}]