[{"rating": null, "external_links": [], "crawled": "2017-04-16T08:41:42.000+03:00", "author": "condo land", "entities": {"persons": [{"name": "stephanie diana wilson", "sentiment": "none"}], "locations": [], "organizations": [{"name": "fannie mae", "sentiment": "none"}, {"name": "fnma", "sentiment": "none"}, {"name": "fha", "sentiment": "none"}, {"name": "ltv", "sentiment": "none"}]}, "text": "By: Stephanie Diana Wilson \nSite Condos have always been a tricky subject particularly regarding USDA and FHA loans. However, conventional guidelines have changed recently providing lenders more clarity on the difference between a Site Condo and a Detached Condo. And before it is asked yes this post is an extension to last week’s topic post on “It Is Not a Condo It’s a Townhouse”. Much like the confusion between Planned Unit Developments or PUDs and the various styles of condo units the style of detached condos which look a lot like a detached PUD within a sub division can look a lot like a Single-Family Home or SFR. \nNow before we start on this journey our normal CYOB moment. As a reminder guidelines change frequently and we are talking about guidelines posted online at the time of writing this article. If you have more in-depth questions be sure to contact your local mortgage loan officer or underwriting professional. Now that’s out of the way let us move on back to the topic at hand. \nThe issue becomes when the title shows that your subject unit is in fact a condo in a condo project is it detached or not. Normally an appraisal will show pictures but; I must admit sometimes it is hard to tell in the pictures. So, my advice to underwriters is never be afraid to ask the appraiser to verify if your subject unit is 100% detached. Once it has been defined as both condo and if it is attached or detached the next big question to ask is if the unit is a detached unit in a project of detached units or is this a detached unit in a project that has both attached and detached units? \n\nThen we move on to trying to define if the unit is a site condo or a detached condo. Now Fannie Mae (FNMA) has made a list of defining factors that a site condo must meet. This info can be foud on the FNMA guidelines dated 3/28/17 at https://www.fanniemae.com/content/guide/sel032817.pdf on page 763 . \nSite Condo Definition A site condo is a detached condo unit in a condo project that meets all of the following: \n• Project consists of all single-family detached units where the unit owners own the land and the improvements on the land. \n• Project has minimal common elements, which may include project signage and limited undeveloped green space. \n• Project does not own any common amenities including, but not limited to, swimming pool, fitness or recreational facility, playground, laundry facility, or clubhouse. \n• Project does not own or have responsibility for maintaining its own infrastructure such as roads, street signage, electricity, water and sewage, snow removal, or garbage disposal. \n• Project has minimal or no involvement with a homeowners’ association, including no or little \ndues; no special assessments; and no road, amenity, or common element maintenance.\n• Unit owners are required, per the condo legal documents, to carry their own individual hazard and other applicable insurance coverage, which may include flood and liability insurance. – (Fannie Mae seller guide dated 3/28/17) \nNow part of the reason that the defining the difference between a detached condo and a site condo is because they are underwritten differently. Detached condos that do not meet all the above noted items to be defined as a site condo are underwritten as a condo through limited review. Detached condos per the current guidelines do not limit the ability to do detached units based on Loan To Value ratios or LTV. Which we have discussed in other articles. So, regardless of the LTV detached condos are currently underwritten as a limited review. \nNow much like a PUD site condos do not require condo review process. Also, like a PUD a site condo is underwritten like an SFR. However, the current guidelines require that lenders must verify more info. Page 764 of the Fannie Mae guidelines updated 3/28/17 found online at https://www.fanniemae.com/content/guide/sel032817.pdf reads: \nFor site condos that meet all the criteria listed above, a project review is not required. Instead, lenders must confirm the following requirements are met: \n• The project follows Fannie Mae’s requirements for priority of common expense assessments; \n• The project is following Fannie Mae’s requirements for projects located on land zoned as legal, non-conforming land use; and \n• The appraisal, completed using either Form 1004 or Form 1073, must confirm the local market treats units in such a project as comparable to owning a unit in a single-family detached housing development that has not been organized as a condo. \nHopefully this info has helped you. Remember sharing is caring so share the article. Also, you can find me on twitter at @ sdgwwgds and on facebook just search condo land blog. If you have questions or topics you would like address send us a message or comment at facebook or twitter. \n", "url": "http://omgili.com/ri/.wHSUbtEfZTFef_6AARHNAnsXBTP_3S9OvazPQ1I_ljun1AHvhZo8NdNRlRbkrwvrsTMqORQpfapSqoU3SjjX5yhvHJyWduKvElrDrHjXAw-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T08:41:42.000+03:00", "language": "english", "title": "Site Vs. Detached Condos", "thread": {"title_full": "Site Vs. Detached Condos", "site_full": "stephaniewilsongast.wordpress.com", "site": "wordpress.com", "site_section": "https://stephaniewilsongast.wordpress.com", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Site Vs. Detached Condos – Condo Land", "url": "http://omgili.com/ri/.wHSUbtEfZTFef_6AARHNAnsXBTP_3S9OvazPQ1I_ljun1AHvhZo8NdNRlRbkrwvrsTMqORQpfapSqoU3SjjX5yhvHJyWduKvElrDrHjXAw-", "published": "2017-04-16T08:41:42.000+03:00", "title": "Site Vs. Detached Condos", "uuid": "ae6a07d96c74655674f903a5d977a0e0651b5172", "main_image": null}, "uuid": "ae6a07d96c74655674f903a5d977a0e0651b5172", "ord_in_thread": 0}]