[{"entities": {"locations": [{"name": "phoenix", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "colorado city", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "hildale", "sentiment": "none"}, {"name": "fresno", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "grand canyon national park", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "gmt police", "sentiment": "none"}, {"name": "jacques billeaudassociated press", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "u.s. justice department", "sentiment": "none"}, {"name": "colorado city marshal's office", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ccmo", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}], "persons": [{"name": "jeff matura", "sentiment": "none"}, {"name": "steve stephens", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "blake hamilton", "sentiment": "none"}, {"name": "george h.w. bush", "sentiment": "none"}, {"name": "jesus christ", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "peter carr", "sentiment": "none"}, {"name": "ivanka trump", "sentiment": "none"}, {"name": "jacques billeaud", "sentiment": "none"}, {"name": "matura", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "h. russel holland", "sentiment": "none"}, {"name": "jeffs", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "warren jeffs", "sentiment": "none"}, {"name": "jon ossoff", "sentiment": "none"}, {"name": "holland", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.newson6.com", "site_section": "http://www.newson6.com/category/13530/national-news?clienttype=rss", "domain_rank": 33730, "replies_count": 0, "country": "US", "section_title": "News On 6 - National - Headline", "title": "Judge denies bid to disband polygamous towns' police agency", "title_full": "Judge denies bid to disband polygamous towns' police agency", "published": "2017-04-19T08:40:13.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_XCqqqI7R4P6K5g4XUY3PUPfsFl4DhiOKy.DzphKt0JNos0hJ6ZOSFYISleZMIopnfYBd.2yp5RSc_Wb3R6orUa2DNLQkip1dRWDPyY1Xf.pS5ylabbb2NjcMa.PKa0ro-", "site": "newson6.com", "main_image": "", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 0, "performance_score": 0, "spam_score": 0.0, "uuid": "af1289cd4b4ce181104d63191cf3f412bc056444", "site_type": "news"}, "title": "Judge denies bid to disband polygamous towns' police agency", "published": "2017-04-19T08:40:13.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_XCqqqI7R4P6K5g4XUY3PUPfsFl4DhiOKy.DzphKt0JNos0hJ6ZOSFYISleZMIopnfYBd.2yp5RSc_Wb3R6orUa2DNLQkip1dRWDPyY1Xf.pS5ylabbb2NjcMa.PKa0ro-", "author": "", "crawled": "2017-04-19T08:40:13.000+03:00", "language": "english", "text": "Judge denies bid to disband polygamous towns' police agency Posted:  15  15:16 GMT Lawyers for Arkansas inmates condemned to die Thursday in a planned double execution are claiming they are innocent and one of them says advanced DNA techniques could show he didn't kill a woman in 1993. More >> Lawyers for Arkansas inmates condemned to die Thursday in a planned double execution are claiming they are innocent and one of them says advanced DNA techniques could show he didn't kill a woman in 1993.  15  15:14 GMT An Associated Press examination has revealed federal and state managers made a series of questionable decisions and missteps before and during a crisis at the nation's tallest dam in February. More >> An Associated Press examination has revealed federal and state managers made a series of questionable decisions and missteps before and during a crisis at the nation's tallest dam in February.  07  07:37 GMT Massachusetts prison officials say former NFL star Aaron Hernandez has hanged himself in his cell and pronounced dead at a hospital. More >> Massachusetts prison officials say former NFL star Aaron Hernandez has hanged himself in his cell and pronounced dead at a hospital.  14  14:56 GMT She wasn't in her home state, but U.S. Sen. Elizabeth Warren couldn't have asked for a friendlier audience to launch her book tour. More >> She wasn't in her home state, but U.S. Sen. Elizabeth Warren couldn't have asked for a friendlier audience to launch her book tour.  14  14:52 GMT Ivanka Trump has tried to distance herself from the brand that bears her name, to separate business from politics in her new position at the White House. More >> Ivanka Trump has tried to distance herself from the brand that bears her name, to separate business from politics in her new position at the White House.  14  14:21 GMT A 23-year-old man sues the federal government Tuesday over his deportation to Mexico, saying he was entitled to remain in the United States under a program that shields people who came to the country as young... More >> A 23-year-old man sues the federal government Tuesday over his deportation to Mexico, saying he was entitled to remain in the United States under a program that shields people who came to the country as young children. More >>   Trump   By JACQUES BILLEAUDAssociated Press \nPHOENIX (AP) - A judge has rejected a bid to disband a shared police department in a polygamous community on the Arizona-Utah border as a punishment for discriminating against people who aren't members of the dominant religious sect in the sister cities. \nInstead, U.S. District Judge H. Russel Holland issued an order Tuesday requiring police procedures to be revised and an independent mentor be appointed to advise the police chief in Colorado City, Arizona, and Hildale, Utah. The judge said he wasn't persuaded by the U.S. Justice Department's arguments to disband the Colorado City Marshal's Office. \n\"The court deems disbandment of the CCMO as a last resort that should be employed only if less drastic remedies fail,\" Holland said. \nThe judge said other police departments accused of wrongdoing that included serious injuries and deaths weren't disbanded in the past. Holland said hiring an outside agency to police the towns also would be twice as expensive and would probably result in a lower level of police protection. \nThe disbandment request was a response to a March 2016 jury verdict in Arizona that found the towns denied nonbelievers police protection, building permits and water hookups in the adjacent towns. \nHolland also ordered the appointment of an official who will monitor the towns on behalf of the court. The monitor will review municipal decisions that involve housing, as well as how the towns handle utility applications and citizen complaints that affect housing rights. \nJeff Matura, attorney for Colorado City, said disbandment would have been an extreme change. \"Today's ruling is a victory for municipalities throughout the country that have pushed back against overt government intrusion,\" Matura said in a statement. \nBlake Hamilton, an attorney representing Hildale, said in an email that \"we are hopeful that the tools provided in the injunction - including a monitor, mentor and consultant - will be used in a way that enables the cities to move toward a better future.\" \nJustice Department spokesman Peter Carr declined comment on the decision. \nThe civil rights case marked one of the boldest attempts to confront what critics have said was a corrupt regime in both towns. It provided a rare glimpse into the inner workings of secluded towns that are shrouded in secrecy and distrustful of the government and outsiders. \nThe Justice Department said the towns were operating as an arm of the Fundamentalist Church of Jesus Christ of Latter Day Saints, a radical offshoot of mainstream Mormonism, which disavowed polygamy more than 100 years ago. \nThe jury found the Colorado City Marshal's Office violated the rights of nonbelievers by breaking the First Amendment's promise that the government won't show preference to a particular faith and force religion upon people. \nJurors also concluded officers treated nonbelievers inequitably when providing police protection, arrested them without having probable cause and made unreasonable searches of their property. \nAuthorities say the sect's activities are dictated by the commands of their jailed leader and prophet, Warren Jeffs, who is serving a life sentence in a Texas for sexually assaulting underage girls he considered wives. \nFederal authorities said officers from the shared department claimed to have no information on Jeffs' whereabouts while he was a fugitive, even though it was later discovered that some of them had written letters to the church leader during that time. \nThe Justice Department thought the disbandment was necessary because the church has in the past used the agency to enforce religious edicts. The leader of a trust that owns most of the real estate in the twin towns has said officers work against his group in carrying out evictions on homes and commercial properties in the towns. \nThe towns acknowledged that the police department has had problems in the past, but they said no officers have been decertified since 2007. The Justice Department has said 30 percent of the officers over the last 15 years have been decertified, including four police chiefs. \nIf the disbandment request had been granted, it would have marked the first time that a police agency had been folded as a result of a civil rights case brought by the Justice Department. \n___ \nFollow Jacques Billeaud at twitter.com/jacquesbilleaud. His work can be found at https://www.apnews.com/search/jacques%20billeaud. Copyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. News On 6", "external_links": [], "highlightTitle": "", "uuid": "af1289cd4b4ce181104d63191cf3f412bc056444", "highlightText": "", "rating": null}]