[{"uuid": "b0bf54b60b2b3bde28b3f296dd6018471796ebe2", "url": "http://omgili.com/ri/jHIAmI4hxg8tFV.2eEwFn5LmwH8BXiBvfI11HVmI2GhrNEmg9UDw9j2LM5DnJwAwbuFTK1u5S3nLeCO.U6Cwlh.Se5NXG1mJNK..Y9FsdxUvSFsRPqt8nhUs48T2ZjJI", "title": "With a heroic performance by its injured star, 'Groundhog Day' limps through opening night", "author": "Charles McNulty", "rating": null, "published": "2017-04-18T23:25:10.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "shell", "sentiment": "none"}, {"name": "hbo", "sentiment": "none"}, {"name": "andie macdowell", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "broadway", "sentiment": "none"}, {"name": "old vic", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "charlize theron", "sentiment": "none"}], "persons": [{"name": "andy karl", "sentiment": "positive"}, {"name": "f. gary gray", "sentiment": "none"}, {"name": "john sanders", "sentiment": "none"}, {"name": "ludacris", "sentiment": "none"}, {"name": "joan marcus andy karl", "sentiment": "none"}, {"name": "rebecca faulkenberry", "sentiment": "none"}, {"name": "joan marcus", "sentiment": "none"}, {"name": "ned ryerson", "sentiment": "none"}, {"name": "juliette binoche", "sentiment": "none"}, {"name": "jason h. neubert", "sentiment": "none"}, {"name": "karl", "sentiment": "none"}, {"name": "maya", "sentiment": "none"}, {"name": "michael pitt", "sentiment": "none"}, {"name": "minnie driver", "sentiment": "none"}, {"name": "phil", "sentiment": "none"}, {"name": "bill murray", "sentiment": "none"}, {"name": "rita", "sentiment": "none"}, {"name": "justin chang", "sentiment": "none"}, {"name": "matthew warchus", "sentiment": "none"}, {"name": "joan marcus barrett doss", "sentiment": "none"}, {"name": "tyrese gibson", "sentiment": "none"}, {"name": "charles mcnulty", "sentiment": "none"}, {"name": "jason statham", "sentiment": "none"}, {"name": "harold ramis", "sentiment": "none"}, {"name": "kurt russell", "sentiment": "none"}, {"name": "joan marcus)  barrett doss", "sentiment": "none"}, {"name": "evan rachel wood", "sentiment": "none"}, {"name": "phil connors", "sentiment": "none"}, {"name": "justin chang  justin chang", "sentiment": "none"}, {"name": "nancy", "sentiment": "none"}, {"name": "pilou asbaek", "sentiment": "none"}, {"name": "murray", "sentiment": "none"}, {"name": "scarlett johansson", "sentiment": "none"}, {"name": "james marsden", "sentiment": "none"}, {"name": "minchin", "sentiment": "none"}, {"name": "rupert sanders", "sentiment": "none"}, {"name": "michelle rodriguez", "sentiment": "none"}, {"name": "dwayne johnson", "sentiment": "none"}, {"name": "scott eastwood", "sentiment": "none"}, {"name": "nathalie emmanuel", "sentiment": "none"}, {"name": "barrett doss", "sentiment": "none"}, {"name": "takeshi kitano", "sentiment": "none"}, {"name": "jason h. neubert  justin chang", "sentiment": "none"}, {"name": "dolores abernathy", "sentiment": "none"}, {"name": "vin diesel", "sentiment": "none"}, {"name": "minnie", "sentiment": "none"}, {"name": "punxsutawney phil", "sentiment": "none"}, {"name": "rita hanson", "sentiment": "none"}, {"name": "terry flood", "sentiment": "none"}, {"name": "chin han", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "b0bf54b60b2b3bde28b3f296dd6018471796ebe2", "url": "http://omgili.com/ri/jHIAmI4hxg8tFV.2eEwFn5LmwH8BXiBvfI11HVmI2GhrNEmg9UDw9j2LM5DnJwAwbuFTK1u5S3nLeCO.U6Cwlh.Se5NXG1mJNK..Y9FsdxUvSFsRPqt8nhUs48T2ZjJI", "site_full": "www.latimes.com", "title": "With a heroic performance by its injured star, 'Groundhog Day' limps through opening night", "site_section": "http://feeds.latimes.com/latimes/sports/college/basketball/", "domain_rank": 609, "published": "2017-04-18T23:25:10.000+03:00", "title_full": "With a heroic performance by its injured star, 'Groundhog Day' limps through opening night", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "L.A. Times - College Basketball", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 59, "likes": 59, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://www.trbimg.com/img-58f66ab1/turbine/la-et-cm-groundhog-day-review-20170417", "site": "latimes.com"}, "external_links": [], "language": "english", "text": "With a heroic performance by its injured star, 'Groundhog Day' limps through opening night Andy Karl in \"Groundhog Day\" Joan Marcus Andy Karl plays Phil Connors in \"Groundhog Day\" at the August Wilson Theatre in New York. Andy Karl plays Phil Connors in \"Groundhog Day\" at the August Wilson Theatre in New York. (Joan Marcus) Charles McNulty (the composer and lyricist of the musical “Matilda”), is built around Karl as much as the 1993 Harold Ramis film was built around Bill Murray. Yet no one would confuse their characters.\nWhereas Murray’s Phil was reflexively arrogant in a way that suggested he needed a strong antidepressant and some talk therapy, Karl is cocky in the handsome TV star mode. He’s still hatefully seductive, but the charm of this egotistical frat boy has curdled with age. (In real estate terms, he’d be a gorgeous fixer-upper with peeling wallpaper, mice in the walls and a rank garden.) \nA much-beloved modern fable with a sardonic twist, “Groundhog Day” has the narrative makings of a successful musical comedy. The tale is repetitive and made for the screen, but the moral is theatrically satisfying and the mix of jaundiced wisecracks and romantic feeling is perfect for today’s Broadway. Andy Karl and the company of \"Groundhog Day.\" Joan Marcus Andy Karl and the company of \"Groundhog Day.\" Andy Karl and the company of \"Groundhog Day.\" (Joan Marcus) \nSo what’s gone wrong — or should I say only half right? The production by Matthew Warchus (artistic director of London’s Old Vic, where the musical had its world premiere) finds clever theatrical solutions to deal with the inherently cinematic nature of the material. A car chase scene begins with actors crammed into a jokey stage vehicle and culminates in a drag race of toy cars. \nThe logistical trickery that manages to get Phil back into his room at the kitschy bed-and-breakfast for each new iteration of this never-ending day is astonishing. No matter how wild the preceding escapade, he still magically wakes up again in the same bed to the same radio news chatter about Punxsutawney Phil , the celebrity groundhog of this hick Pennsylvania town that Forecaster Phil has traveled to in an annual rite he openly scorns. \nThe fundamental problem with the show has to do with the monotony of musical storytelling. The first act has these numbers that are as tediously imprisoning as the situation Phil finds himself in. They’re not so much songs as musical loops that reinforce what we already know about small-town Punxsutawney. \nMinchin can’t figure out how to interest us musically or lyrically in the situation of a character who is meant to be shallow and disagreeable for the first half of the show. The musical numbers get better in the second half, but the most introspective songs are assigned to secondary characters, such as pesky insurance agent Ned Ryerson (John Sanders) and the lonely and misused town beauty, Nancy (Rebecca Faulkenberry). \nKarl, who is musically defined more by his bizarre circumstances than by his personality, gets a couple of rousing numbers in the second act as his character moves through arrogance and despair to humility and hope. But I found myself more drawn into Karl’s predicament than to Phil’s. A line from the darkly manic number “Hope” — “There will be mornings you’ll be utterly defeated by your laces” — was delivered with a conspiratorial wink that elicited laughter and cheers from the opening night crowd. A number demanding a good deal of running was stylishly mimed to spare Karl’s wonky knee. Barrett Doss as Rita and Andy Karl as Phil. Joan Marcus Barrett Doss as Rita and Andy Karl as Phil. Barrett Doss as Rita and Andy Karl as Phil. (Joan Marcus) \nBarrett Doss, who plays Rita Hanson, the associate producer on assignment with Phil, has a lovely singing voice that magnifies the character’s emotional attractiveness. But this love match seems more theoretical than actual. Rita’s goodness and Phil’s eventual desire to improve his nature seem on paper like a good combination, but the actors don’t have much chemistry. The emotional X-factor that connected Murray with Andie MacDowell in the movie is missing in the musical. \n“Groundhog Day” is ultimately a vehicle for Karl’s virtuosity. Even moving gingerly, he has no problem anchoring this large-scale production. A sexy musical comedy screwball with a voice that can hold its own with Broadway’s best, he found a show that fully exploits his unique combination of gifts. He has proved himself a trouper and deserves all the hip hip hoorays coming his way. But let’s hope fate eventually frees him up for a more satisfying musical. \nSIGN UP for the free Essential Arts & Culture newsletter » Caption 'The Fate of the Furious' movie review by Justin Chang \nJustin Chang reviews \"The Fate of the Furious,\" directed by F. Gary Gray and starring Vin Diesel, Charlize Theron, Dwayne Johnson, Michelle Rodriguez, Ludacris, Tyrese Gibson, Jason Statham, Kurt Russell, Scott Eastwood and Nathalie Emmanuel. Video by Jason H. Neubert \nJustin Chang reviews \"The Fate of the Furious,\" directed by F. Gary Gray and starring Vin Diesel, Charlize Theron, Dwayne Johnson, Michelle Rodriguez, Ludacris, Tyrese Gibson, Jason Statham, Kurt Russell, Scott Eastwood and Nathalie Emmanuel. Video by Jason H. Neubert Caption 'The Fate of the Furious' movie review by Justin Chang \nJustin Chang reviews \"The Fate of the Furious,\" directed by F. Gary Gray and starring Vin Diesel, Charlize Theron, Dwayne Johnson, Michelle Rodriguez, Ludacris, Tyrese Gibson, Jason Statham, Kurt Russell, Scott Eastwood and Nathalie Emmanuel. Video by Jason H. Neubert \nJustin Chang reviews \"The Fate of the Furious,\" directed by F. Gary Gray and starring Vin Diesel, Charlize Theron, Dwayne Johnson, Michelle Rodriguez, Ludacris, Tyrese Gibson, Jason Statham, Kurt Russell, Scott Eastwood and Nathalie Emmanuel. Video by Jason H. Neubert Caption Emmy Chat: Why Minnie Driver’s so committed to her 'Speechless' family \nMinnie Driver talks about her role as fearless mom Maya, showing disability on-screen and the irreverent comedy on \"Speechless.\" \nMinnie Driver talks about her role as fearless mom Maya, showing disability on-screen and the irreverent comedy on \"Speechless.\" Caption 'Ghost In The Shell' movie review by Justin Chang \nJustin Chang reviews \"Ghost In The Shell,\" directed by Rupert Sanders, starring Scarlett Johansson, Juliette Binoche, Takeshi Kitano, Michael Pitt, Pilou Asbaek and Chin Han. Video by Jason H. Neubert. \nJustin Chang reviews \"Ghost In The Shell,\" directed by Rupert Sanders, starring Scarlett Johansson, Juliette Binoche, Takeshi Kitano, Michael Pitt, Pilou Asbaek and Chin Han. Video by Jason H. Neubert. Caption PaleyFest 2017: Evan Rachel Wood of ‘Westworld’ \nEvan Rachel Wood, who plays Dolores Abernathy on HBO’s “Westworld,” discusses her character’s direction at the end of Season One. \nEvan Rachel Wood, who plays Dolores Abernathy on HBO’s “Westworld,” discusses her character’s direction at the end of Season One. Caption PaleyFest 2017: James Marsden of ‘Westworld’ \nJames Marsden who plays Terry Flood on HBO’s “Westworld,” talks about his hopes for what may come next for his character. \nJames Marsden who plays Terry Flood on HBO’s “Westworld,” talks about his hopes for what may come next for his character. \nFollow me @charlesmcnulty \nALSO", "ord_in_thread": 0, "crawled": "2017-04-18T23:25:10.000+03:00"}]