[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:49:34.000+03:00", "author": "surprizedbythespirit", "entities": {"persons": [{"name": "chaitanya", "sentiment": "none"}, {"name": "rao", "sentiment": "none"}, {"name": "pastor chaitanya", "sentiment": "none"}, {"name": "linda smallwood", "sentiment": "none"}], "locations": [{"name": "cleveland", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}]}, "text": "Just after I put up my post last week, I was delighted to see that a long-time American missionary friend I had met on my first trip to India had written about her “entry” into a whole, ‘nuther world….India. I happened to see it on Facebook and was delighted. Having her permission to republish it, I thought you might enjoy reading it. I was particularly amazed by the most accurate description of the “exotic scents” of India l I ever heard!\nI am glad to be able to reconnect with her as well after 10 years!\nLet her take you with her during her first few hours in India……\n………………………………………………………………………………………………\nLinda Smallwood..her account of her first contact with India…..\n“Oh, the depth of the riches of the wisdom and knowledge of God! How unsearchable his judgments, and his paths beyond tracing out! ‘Who has known the mind of the Lord? Or who has been his counselor? ’”\n(Romans 11:33-34)\nI was worshiping prostrate on the roof — as was my habit every morning in India — when I noticed a spotted jumping spider moving toward me. I brushed it away with my hand, but it turned around and started toward me again. I reached out and brushed it away again, this time a little more firmly.\nThen I noticed it was kicking and moving around in a circle, and I realized I had hurt it. “Ohhh!” I spoke to it. “I’m so sorry. I didn’t mean to hurt you.” I knew I had to kill it. It was the “humane” thing to do.\nJust as I killed it with my shoe, I felt a twinge of sadness. I shook my head. “A spider?! I’m sad about killing a spider?!” I rolled over on my back, stretched out my arm and pointed to God. “Are You kidding me?! That is not funny!”\nMy thoughts returned to a day three years earlier when I first arrived in India.\nMy host, Pastor Chaitanya, and his brother, Rao, had met me at the airport. As we stepped outside, my senses were immediately assaulted by a barrage of nauseating stimuli, the likes of which I had never experienced before nor even dared anticipate.\nThe calendar said it was November, and even though I knew I was going to a “tropical” area of the world, I honestly did not expect to encounter the suffocating heat and humidity that awaited me outside the air-conditioned terminal. I immediately staggered under the weight of it and had to stop to catch my breath. But, how do you “catch your breath” when the air you’re trying to breathe is polluted with reddish-golden sand and dust, and every molecule is filled with the stench of gasoline-and-diesel exhaust, human and animal urine and feces, mounds of rotting vermin-infested edible waste and animal carcasses, and sour vinegary body odors? As I gasped for air, I wondered for a few seconds if I would ever breathe normally again . . . . and I wondered if I really wanted to!\nLater, I marveled at the sights of the city that boasted a population of more than 6½ million souls in only 250 square miles. I had never seen such an improbable and yet existent display of successful, albeit overwhelmingly challenging, cohabitation! Multi-storied concrete buildings towered above crumbling and abandoned shacks and lean-tos, leprous and crippled beggars huddled in small groups under bridges and in alleys, wild pigs and homeless dump dwellers vied for both space and for edible scraps among the many garbage sites throughout the city.\nThe too-narrow streets were congested with countless automobiles, dilapidated crowded city buses, overloaded lorries and camions, motorcycles, scooters, bicycles, auto- and bike-rickshaws, thousands of shoppers and meandering city dwellers, water buffalo and oxen taking their rest in the center of the streets, shepherds herding their goats amidst the motorized vehicles, wandering packs of malnourished street dogs, and prankish wild monkeys.\nThe sights and sounds of the city were as much an affront to my intellect and all human reason as the odors, horrendous stench, and heat were to my physical senses.\nAs we rode along, Chaitanya excitedly chatted about everything he had planned for me in the coming days. “Mom, I got you wahtel with yaysee!” he exclaimed with great glee and pride. “A what with what?” I asked.\n“A wahtel with yaysee!” he answered. I had no idea what he was saying. As he tried to explain the meaning of the words, I finally understood that “wahtel” was “hotel”; but “yaysee” proved to be a little more challenging until he spotted a small sign that finally unlocked the mystery. The sign read: “A/C”. I said, “Ohhh. A C!” He said, “Yes! Yaysee! Yaysee!”\nSo, he had gotten me a hotel room with air conditioning. I really liked that idea! I could hardly wait to get to it, cool off, clean up, and rest.\nA few minutes later, we were carrying my suitcases up a flight of crumbling steps in the train station, stepping past and over beggars and prostitutes, making our way down a dingy hallway toward my “hotel room” — and I was liking the idea less and less with every step. Finally, we arrived at a door with a huge 2-pound padlock on it. Chaitanya removed the lock, swung the door open to my hotel room, and motioned for me to go in.\nI peered into the room and the scene shocked me so much that I honestly wondered if there might be a hidden camera somewhere and if someone was going to suddenly exclaim — and explain — “You’re on ‘Candid Camera’!”\nChaitanya took my hand and pulled me into the room. It’s not that I was fighting him, but I certainly wasn’t rushing in with great anticipation. The first thing I noticed was an old vanity dressing table with a badly pitted mirror. Next was the bed with a 2-inch straw mattress covered by a once-white sheet. The “air conditioner”, which was propped up in a hole in the wall, sputtered, spit, and spewed something that was supposed to be cool air but was about as effective as I would be spitting into a fan.\nChaitanya pointed out a floor fan that he thought would help. I was encouraged. When he turned it on, the head of the fan immediately dropped pointing straight down to the floor, and the bent fan blades noisily clanked against the frame. No matter what we did, we couldn’t get the head of the fan to stay up. Yippee!\nI sat on the bed and thought, “What in the world have I gotten myself into?” I threw my head back and started to lie down when I saw them. Spiders! Hundreds of spiders! Every size and shape and mostly in the corners, not bothering anyone or anything and yet bothering me beyond words! Even though the ceiling was at least 10 feet high, I couldn’t help but bow down suddenly, as if that would prevent them from falling or jumping on me. Isn’t it funny, the things we do instinctively, whether they make sense or not?\nChaitanya called me into the bathroom and somehow I managed to stand up in that room of spiders and walk to the bathroom. I stepped up into a room with a marble sink, one tap sticking out of the wall, and a few hundred ants crawling around the edges. On the opposite wall was a toilet with no water in it, and Chaitanya showed me how to flush it with a bucket of water from a spigot on the wall next to it. As I looked around for a shower, my eyes finally rested on a gaping hole in the ceiling full of — you guessed it — more spiders!\n\nAs I crouched there, Chaitanya called to me from the other room, “Mom, we go now and come back in a couple hours to take you for dinner. Okay?”\n“Uh-huh,” I half-muttered.\n“Shall I lock the door?” he asked.\n“Uh-huh.”\nI heard the door shut and the padlock being locked on the outside of it before it dawned on me that I was actually locked in. I ran to the door and yelled for Chaitanya, but he couldn’t hear me because of the noise from the trains. I turned around and quickly surveyed my situation, thinking I could at least clean up and try to rest. After all, I’d been in there with the spiders for almost an hour now and not a single one had assaulted me yet, so maybe it would be okay. Plus, once I calmed down I realized that the “hundreds” of spiders I’d seen before really were only about 20 or 30. That’s still 20 or 30 more than I cared for, but certainly not hundreds.\nI went back into the bathroom to clean up. Let’s see… Soap? Wash cloth? Towel? Nope. Nope. Nope. Toilet tissue? Nope. Heavy sigh…! [Note: Indians do not use toilet paper. They have an ancient system of using water exclusively. The other reason is is that they don’t have the septic system to handle all the paper, either. In many ways, India is still an ancient culture.]\nOkay. Let’s review… An asthmatic air conditioner and broken fan. No soap, wash cloth or towel, no toilet tissue, no shower, no phone, and no way out. Now I was starting to panic.\nI thought about my apartment back in Cleveland that I’d left just three days earlier. I thought about my nice clean carpeted and tiled floors . . . . and no spiders. I thought about my bathroom with hot and cold running water, a tub and shower, a working toilet . . . . and no spiders. I thought about my fully-stocked linen closet with towels and all the toiletries I needed . . . . and no spiders. I thought about my nice air conditioner and awesome fans . . . . and no spiders. I thought about my big comfy bed with an extra thick mattress . . . . and no spiders. And I thought about being able to walk out of my apartment and not be knocked over by heat and smells and sounds that defy all reason . . . . and, you guessed it. No spiders!\nI slumped against the bathroom door frame and started crying. I had left Cleveland filled with joy and eager anticipation of all the Lord might have me do. Three days earlier there was no doubt in my mind and heart that He wanted me to come to India. Now . . . . I wasn’t so sure. I needed to be sure. I needed to know. But how?! Finally, I wept, “I’m sorry, Lord, but I don’t think I can do this. You didn’t prepare me for this!”\nI felt His arm wrap around my shoulders and pull me close. His love flowed over me and so filled and overwhelmed me that my knees began to buckle. He spoke softly, “My child, I left behind a lot more than you did when I came here for you. And I didn’t have any of the things you’re complaining about…”\nOhh! I fell to my knees crying in repentance. “I’m so sorry, Lord! Ohh, yes, yes, yes! I will go where You lead, do what You ask me to do, be what You want me to be, say whatever You want me to say. Where You lead me, I will follow!” And I worshiped.\nAfter several minutes, I stood up, dried my eyes, breathed in His sweet peace and love, and then added, “But . . . . You gotta do something about the spiders!”\nNow . . . . here I was three-and-a-half years later, worshiping on the roof, and feeling badly because I had hurt a spider. “That’s not funny!” I shouted. “You were supposed to get rid of them . . . . not make me love them!”\nHe smiled.", "url": "http://omgili.com/ri/.wHSUbtEfZQ6TeVyjG6o2moEtrUPOFKsaMQ2mWW2mcf5T0z2HZHh2bau3O2zaYES5E8vrWwNxLqcqeKXYxo12pfeIiQFV8Tc", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:49:34.000+03:00", "language": "english", "title": "“….And No Spiders!”", "thread": {"title_full": "“….And No Spiders!”", "site_full": "surprizedbythespirit.wordpress.com", "site": "wordpress.com", "site_section": "https://surprizedbythespirit.wordpress.com", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "“….And No Spiders!” – Surprized by the Spirit", "url": "http://omgili.com/ri/.wHSUbtEfZQ6TeVyjG6o2moEtrUPOFKsaMQ2mWW2mcf5T0z2HZHh2bau3O2zaYES5E8vrWwNxLqcqeKXYxo12pfeIiQFV8Tc", "published": "2017-04-16T09:49:34.000+03:00", "title": "“….And No Spiders!”", "uuid": "b2ca4dbaf619616d87d75a6a54c80dd3fc0448a5", "main_image": null}, "uuid": "b2ca4dbaf619616d87d75a6a54c80dd3fc0448a5", "ord_in_thread": 0}]