[{"entities": {"locations": [{"name": "south korea", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "adata", "sentiment": "none"}], "organizations": [{"name": "adata technology co., ltd.", "sentiment": "none"}, {"name": "utc", "sentiment": "none"}, {"name": "adata", "sentiment": "none"}, {"name": "dram", "sentiment": "none"}], "persons": []}, "ord_in_thread": 0, "thread": {"site_full": "couponrao.blogspot.com", "site_section": "http://couponrao.blogspot.com/", "domain_rank": null, "replies_count": 0, "country": "US", "section_title": "COUPON RAO", "title": "ADATA: Post a review/unboxing video and Win", "title_full": "ADATA: Post a review/unboxing video and Win", "published": "2017-04-19T08:39:32.000+03:00", "url": "http://omgili.com/ri/0xd.sZhj5jcfrafAffxWJByXd2Of8HTmuOYA4YECzxHD05gxSKXZTiDZzJ3ss0DE3zaLSqidm5CM4n3ePfQsWS9CIAJf9qc0FXuSVUG8xR6EtnW8wEY9QA--", "site": "blogspot.com", "main_image": null, "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "b3b98b44b507529ed5a8ff674ac86a6bdd74d42e", "site_type": "blogs"}, "title": "ADATA: Post a review/unboxing video and Win", "published": "2017-04-19T08:39:32.000+03:00", "url": "http://omgili.com/ri/0xd.sZhj5jcfrafAffxWJByXd2Of8HTmuOYA4YECzxHD05gxSKXZTiDZzJ3ss0DE3zaLSqidm5CM4n3ePfQsWS9CIAJf9qc0FXuSVUG8xR6EtnW8wEY9QA--", "author": "Mallangi krishna kanth reddy (noreply@blogger.com)", "crawled": "2017-04-19T08:39:32.000+03:00", "language": "english", "text": "Adata! This is a well known brand to most of the people around the world with its wide range of products like Sd cards,SSD's,DRAM's,HDD's. This brand has been in the market since 16 years and so they chose to celebrate their 16th Anniversary with their customers by giving away a lot of prizes. So let us get into further details about this contest and participate in it.\n\n\nContest Source: This is a world wide contest valid through out the world except in South Korea. \nHow to participate in this contest? Click on the below button to fill the form and make an entry. Now fill the form with details like: Name,Review Username,Email,Where did you buy the product,Review URL, and also paste your review here. \nThe review must be given only after 17th April,2017. Then click on Submit button to complete your entry. That's it, your entry is complete and now you have entered the lucky draw. You can submit multiple entries and the more the umber of entries you submit, more the chances of winning. Participants can enter using multiple accounts or under different user names provided each account submits content for a different ADATA product. Whole process can be known from the below image: \nContest Dates: Contest Starts from 17th April 2017 and ends on 17th July 2017 (UTC+8) Prizes: List of Prizes: 1x Soy PS4 Pro 1x Beats Solo3 Wireless On-Ear Headphones 1x Razer Keyboard & Gaming Mouse 3x SX950 Solid State Drive 256GB 6x SD700 External Solid State Drive 256GB 6x HD710 External Hard Drive 1 TB 30x Drawstring Bag 30x Gaming Cap 30x Gaming Lanyard with badge Winners: The Winners will be selected in 3 Phases on lucky draw basis. If an user didn't win the first phase his entry will be carried to the next phase. And if an user wins in a phase he/she shall not be eligible to win in the next phase.  Phase 1 Lucky Draw Announced on May 19th Razer Mechanical Keyboard & Gaming Mouse XPG SX950 Solid State Drive 256GB SD700 External Solid State Drive 256GB HD710 External Hard Drive 1TB XPG Drawstring Bag XPG Gaming Lanyard with badge XPG Gaming Cap Phase 2 Lucky Draw Announced on June 19th Beats Solo3 Wireless On-Ear Headphones XPG SX950 Solid State Drive 256GB SD700 External Solid State Drive 256GB HD710 External Hard Drive 1TB XPG Drawstring Bag XPG Gaming Lanyard with badge XPG Gaming Cap Phas e 3 Lucky Draw Announced on July 19th Sony PS4 Pro XPG SX950 Solid State Drive 256GB SD700 External Solid State Drive 256GB HD710 External Hard Drive 1TB XPG Drawstring Bag XPG Gaming Lanyard with badge XPG Gaming Cap You can check the winners list by clicking on the below button. \n\n\nTerms & Conditions: Event organized by ADATA Technology Co., Ltd., at its sole discretion, between  April 17, 2017 and July 17, 2017 23:59 (UTC+8) Event applicable worldwide except in South Korea. Event participants must ensure that information they provide in any form is entirely accurate. If any information is found to be untrue, inaccurate, or incomplete, participants will be disqualified. If harm is caused to the event organizers or any third party, participants may face civil and criminal charges. ADATA is in no way legally responsible for any dishonest or improper information provided by participants Lucky winners will be randomly selected and announced on  May 19, June 19, and July 19 2017  via this event site. ADATA will notify the winners via email after each announcement date. If winners do not reply to their winning status notification within a month, they forfeit any claim to prizes. In such an event, ADATA reserves the right to redraw a new winner for the prize in any manner it deems fit, at its sole discretion All prizes will be delivered to addresses provided by winners following event conclusion. Prize shipping times may vary based on destination. If any factor causes the user content posted by the winner (mechanism for prize draw admittance) to be withdrawn from the host platform prior to event conclusion, the winner will be disqualified. Factors may include product return, evident intellectual property violation in user content, or other violation of external party rights. ADATA reserves the right to redraw a new winner for the prize in any manner it deems fit, at its sole discretion Participants agree to ensure that their content submitted for this activity does not and cannot infringe on the rights of any other parties or involve any illegal behavior or actions. This includes but is not limited to intellectual property rights, portrait rights, customs and trade regulations, and so forth. All participants thereby agree that they have entered the event of their own volition and only represent themselves. All participant-submitted content must be original, and may not contain items deemed by ADATA or relevant authorities as obscene. Participants accept responsibility for any legal implications of their submitted content. Participants found to be violating event rules will be disqualified and their uploaded content shall be deleted. Participants agree to have any submitted content published and provide ADATA reproduction and promotion rights free of charge with no time or location limitations Event participants become eligible for prizes by submitting online product reviews and/or product unboxing videos or articles, provided they meet the stated requirements. Qualified participants who do not win in the first lucky draw phase will automatically be entered into the next phase, until the final lucky draw on July 17 2017. Participants can enter using multiple accounts or under different user names provided each account submits content for a different ADATA product. The more products a participant reviews, the greater their odds of winning a prize Prizes are subject to availability, non-transferable, and cannot be exchanged for cash unless otherwise specified. In the event ADATA is unable to provide a stated prize, ADATA reserves the right to award a different prize at its sole discretion ADATA shall not be responsible for any inaccuracy in any information, and/or personal or contact particulars provided by the participant, and shall not be liable for any such errors or any loss suffered by the participant as a result These Terms and Conditions are to be construed, governed, and interpreted in accordance with the laws of Taiwan and all parties agree to submit to the exclusive jurisdiction of Taiwan courts Employees of ADATA, its respective subsidiaries, divisions, affiliates, authorized dealers/distributors, and agents are not eligible to enter the event. ADATA reserves the right to disqualify any such person from receipt of any prize and/or require the return of any such prizes awarded. In such an event, ADATA reserves the right to redraw a new winner for the prize in any manner it deems fit, at its sole discretion In the event where the use of any cheating or unfair practices by participants are found, ADATA reserves the right to disqualify any such person from the event. The validity of final results will be further verified before the official announcement of prize winners ADATA reserves the right to amend, revise, delete, edit, add to and/or withdraw these Terms and Conditions and the prizes to be awarded at any time without notice, in which event ADATA shall have no liability whatsoever to any person and/or entity as a result thereof ADATA may ask prize winners to provide a passport copy for identity verification purposes within one month of winning status notification. In the event winners fail to do so, ADATA reserves the right to withdraw their prize eligibility ", "external_links": [], "highlightTitle": "", "uuid": "b3b98b44b507529ed5a8ff674ac86a6bdd74d42e", "highlightText": "", "rating": null}]