[{"entities": {"organizations": [{"name": "la jaquita baya", "sentiment": "none"}, {"name": "santurce es ley", "sentiment": "none"}, {"name": "mofongo ny", "sentiment": "none"}, {"name": "medalla", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}], "locations": [{"name": "san juan", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "puerto rico", "sentiment": "none"}, {"name": "aguada", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "la placita de santurce", "sentiment": "none"}, {"name": "smorgasburg", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "miramar", "sentiment": "none"}, {"name": "el baoricua", "sentiment": "none"}, {"name": "el departamento de la comida", "sentiment": "none"}, {"name": "santurce", "sentiment": "none"}], "persons": [{"name": "manolo lopez", "sentiment": "negative"}, {"name": "alicia kennedy", "sentiment": "negative"}, {"name": "lote", "sentiment": "none"}, {"name": "lopez", "sentiment": "none"}, {"name": "luis a. febles", "sentiment": "none"}, {"name": "cosa nuestra", "sentiment": "none"}, {"name": "xavier pacheco", "sentiment": "none"}, {"name": "josé enrique", "sentiment": "none"}, {"name": "paxx caraballo moll", "sentiment": "none"}, {"name": "calle cerra", "sentiment": "none"}, {"name": "sumaza", "sentiment": "none"}, {"name": "cristina sumaza", "sentiment": "none"}]}, "uuid": "b858949af158ecaa8dc8740e5036e794e9ac159c", "highlightText": "", "title": "Why this Puerto Rican chef is bringing his famous NYC mofongo to", "thread": {"site": "wcax.com", "country": "US", "participants_count": 1, "site_full": "www.wcax.com", "section_title": "Food &amp; recipe ideas and tips for dinner or any family meal - WCAX.COM Local Vermont News, Weather and Sports-", "uuid": "b858949af158ecaa8dc8740e5036e794e9ac159c", "site_section": "http://www.wcax.com/category/39546/food", "domain_rank": 39491, "main_image": "http://bonnier.images.worldnow.com/images/13622118_G.jpeg", "performance_score": 0, "published": "2017-04-14T03:00:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9Z7_wcLEXDUV5GG9_BQHyexHKvAmR0ks3LZM.08_CgoiqR7K4I1Pq_1GosKQXSPuFQdCa1Ch3M7S2xXhq3sM13RoXKMQLFV97KvnpEwBm5wHl32oDTm9Wh3yUAk3026CSzze7R.Z41HQ--", "title_full": "Why this Puerto Rican chef is bringing his famous NYC mofongo to - WCAX.COM Local Vermont News, Weather and Sports-", "title": "Why this Puerto Rican chef is bringing his famous NYC mofongo to", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.427, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-14T03:00:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9Z7_wcLEXDUV5GG9_BQHyexHKvAmR0ks3LZM.08_CgoiqR7K4I1Pq_1GosKQXSPuFQdCa1Ch3M7S2xXhq3sM13RoXKMQLFV97KvnpEwBm5wHl32oDTm9Wh3yUAk3026CSzze7R.Z41HQ--", "ord_in_thread": 0, "crawled": "2017-04-16T23:54:27.000+03:00", "rating": null, "external_links": ["http://BONNIER.images.worldnow.com/images/477530_G.jpg", "http://www.conprmetidos.org/?cmpid=wrld", "http://lote23.com/?cmpid=wrld", "https://www.instagram.com/mofongo_ny/?cmpid=wrld", "http://www.saveur.com/article/Recipes/Mofongo-con-Salsa-de-Tomate-Mashed-Plantains-with-Tomato-Salsa?cmpid=wrld", "http://www.mofongony.com/?cmpid=wrld", "http://BONNIER.images.worldnow.com/images/477523_G.jpg", "https://www.facebook.com/La-Placita-de-Santurce-1625829314330396/?rf=610245772326755?cmpid=wrld", "https://www.facebook.com/librosac/?cmpid=wrld", "http://www.santurceesley.com/?cmpid=wrld", "http://www.saveur.com/authors/alicia-kennedy?cmpid=wrld"], "highlightTitle": "", "author": "wcax.com", "text": "By Alicia Kennedy\n“I’m a bit of a frustrated artist,” Manolo Lopez tells me, his English accent touched with a surfer’s lilt. We’re on a walk through his new home of Old San Juan, Puerto Rico, and he’s bringing me to one of his favorite spots, where the ocean meets a cemetery filled with bright-white headstones. Lopez chose the neighborhood so he could be inspired by the candy-colored colonial architecture that lines the hilly, cobblestone-paved streets. He’s here to run a business, to reconnect with family and old friends, but he also needs to sketch.\nThe admission shouldn’t be shocking to anyone who’s queued up for his Mofongo NY pop-up since its debut at the massive Brooklyn outdoor food market Smorgasburg in 2014. From the bright green pilón that illustrates its logo to the similarly saturated photos that populate its Instagram feed , it’s clear that whoever’s behind the brand has a deliberate artistic vision—one that aims to bring Puerto Rican cuisine to the kind of audience who’s seduced by a tight concept. Lopez, in running his business, has taken on the role of de facto cultural ambassador for Puerto Rico. He’s taken Mofongo NY to Japan, and he organizes a yearly New York City party with a group of other island-based creatives called Cosa Nuestra that he hopes to take global.\nThe concept worked in Brooklyn of course, where Lopez had moved in 2011 from western Puerto Rico, to work in marketing and design until growing restless and coming up with the idea of serving a twist on his grandmother’s mofongo —the traditional Puerto Rican dish of fried and mashed plantains topped with a protein, usually pork—to those strolling by.\nThis year, though, he’s brought his new-school take on mofongo back to his home island to sell—oddly enough—at a new open-air market much like Smorgasburg. The skills he honed in Brooklyn dealing with long lines and fast turn-arounds have come in handy, but here he doesn’t have to set up shop anew each weekend; the kiosks are stand-alone structures, making for a much more streamlined experience. A fresh concept for San Juan, it’s called Lote 23 and vendors are selling everything from cold brew tonics to bao buns to pizzas. Lopez’s food is the most traditional on the roster.\nServing mofongo to New Yorkers and tourists is one thing; for the most part, they didn’t grow up with the dish. Here in Puerto Rico, there’s no such luxury of ignorance. So he’s sweating the details and choosing to do his own take. His ropa vieja, braised for 12 hours, is gently added to the bowl with a pair of tweezers; pork loin is cooked sous vide. While it’s still traditional, this preparation shows off what he’s learned from years of eating in New York: to justify your existence, you have to offer a new twist.\nThe idea, Lopez says, is to introduce Puerto Ricans not just to mofongo, but to Mofongo NY, the brand, which he would like to expand into restaurants of various levels—from the street food at the base to a fine-dining take on the island’s cuisine—but that’s just what he’s thinking today. He “could never have a straight answer” for what he wants. “It’s constantly changing,” he tells me.\n“I feel like I have more opportunity in Puerto Rico than I have in New York,” he adds. Though he’s only guaranteed to pop up at Lote 23 for two months and has one season left on his Smorgasburg contract, he sees himself staying on the island, near family who still live where he grew up, on the west side of the island in Aguada. He’s just become an uncle for the first time.\nLote 23 was founded by another young Puerto Rican who spent years in New York City working in marketing: Cristina Sumaza. While there, she had a part in founding the nonprofit ConPRmetidos , which was dedicated with connecting the diaspora to the island, but when she moved back she joined her family’s real estate development business. Sumaza and Lopez are part of a generation that is seeking to revive the island’s cultural life as a means of empowering it economically, in spite of, or in direct opposition of the ongoing debt crisis.\n“When you compare Puerto Rico to the U.S., basically everywhere is a low-income community,” Sumaza says. “Coming from New York, I would go to tons of restaurants and markets. Here I was living in Santurce, where there are all these amazing chefs and artists,” and she wanted to create a space to support and highlight local talent. “They all have their own followers and fans,” she says, which helps create traffic for everyone. “The collective impact that they can all have is what makes this really special.”\nLote 23 has provided a launch pad for that potential impact, providing space mainly for concepts that are brand-new to the area. Established chefs, such as Xavier Pacheco, whose restaurant La Jaquita Baya is a few miles away in the Miramar area, here serves tacos he’s calling “bigotes.” Paxx Caraballo Moll, a chef who used to cook at El Departamento de La Comida and José Enrique, had trouble getting a food truck off the ground on the island, but regularly sells out at El Baoricua’s Lote kiosk.\n“You wouldn’t go to Santurce five years ago,” Lopez tells me, but that’s changed. The Santurce Es Ley arts festival has brought tourists in who take pictures of the street-art-covered block Calle Cerra, and the nearby Libros AC bookstore offers music programming and readings. During the lunch hours, Lote 23 is populated mostly by office workers in suits from the nearby banks.\nThere are still worries that Lote 23 will be a gentrifying force; many locals initially took to the Facebook page find the food and concept to be excellent, but the prices high. One bowl of mofongo here goes for $10, and a Medalla (the ubiquitous local beer) costs $3. Lopez points out that you can get one in La Placita de Santurce , a popular hangout, for as low as $1, and in the more downtrodden Tras Talleres for even $.50. A focus on engaging community programming could at least help change the conversation, Lopez believes, and they are offering free weekly movie nights and yoga classes. Something seems to be working: As Lote has been open longer, some of the sticker shock has dissipated and five-star reviews have rolled in. “Excellent ambiance,” raves Luis A. Febles in Spanish on the page. “I went with my family and had a great time. We’ll definitely return!”\nAt the kiosk, Lopez is all business while he explains the menu to curious customers and roosters casually strut in from the parking lot. He and an employee are both decked out in logo-embroidered guayaberas and aprons made especially for this pop-up: “Born in Puerto Rico. Back in Puerto Rico.” The branding, as usual, is flawless.\n“I learned how to fail over there and how to develop a product that was true to what I was doing, and it takes time to develop that—to the point now where I feel confident,” Lopez says of his time in New York City. But here, the mission has taken on new meaning. “We know how to brand things, we know how to make them look appealing, but can we make them taste good? Are we really being true to what our ancestors did?” Back home now, that has been revealed: This season will be Mofongo NY’s last in Smorgasburg, and the lease at Lote 23 was extended.\n© 2017 SAVEUR\nAll rights reserved."}]