[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:30:38.000+03:00", "author": "Andrew Anthony", "entities": {"persons": [{"name": "robinson", "sentiment": "negative"}, {"name": "nick robinson", "sentiment": "negative"}, {"name": "paxman", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "andy beckett", "sentiment": "none"}, {"name": "josé mourinho", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jeremy paxman", "sentiment": "none"}, {"name": "frank gardner", "sentiment": "none"}, {"name": "zlatan [ibrahimović", "sentiment": "none"}, {"name": "steve hewlett", "sentiment": "none"}, {"name": "brian redhead", "sentiment": "none"}], "locations": [{"name": "belgium", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "holland", "sentiment": "none"}, {"name": "old trafford", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "negative"}, {"name": "bbc.co.uk  topics nick robinson the new review q&a cancer radio", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}, {"name": "itn", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}]}, "text": "N ick Robinson was born in 1963 and is a presenter on Radio 4’s Today programme, which he joined in November 2015. That year, he underwent surgery for a tumour on his lung. With the exception of a three-year stint as ITN’s political editor, he has worked for the BBC since 1986. He recently started a weekly podcast called Political Thinking .\nOne reason your doctor tested you for cancer was because you’d lost weight and got yourself a new slimline suit. Does it still fit?\nIt’s my favourite, but it only fits because secretly, after I had my cancer treatment, I had an inch let out of the waist. Normally, you’d be depressed as a middle-aged guy to have an inch let out on your suit. I have to say it felt like a doubly good moment.\nYour vocal cords were damaged during surgery and you’ve undergone a lot of speech therapy. How is the voice now?\nIt’s almost there. Physically, it will never be quite the same as it was. There was damage to the laryngeal nerve that connects to your vocal cords. We’ve all only got two of them and if one doesn’t work, well, that’s a problem. Anyway, it’s working a lot better and it’s only noticeable to other people when I’ve got a bad cold or am very tired. I used to have to wake up and put my head under a towel with lots of steam and make funny noises, miaowing like a cat. Now I’m pretty much behaving like everyone else .\nHaving been through your cancer experience and witnessed the death of your good friend Steve Hewlett , how do you think the health system could improve cancer treatment?\nI did a feature about that for the Today programme. The NHS has been much less successful at catching cancer early. Generally, the treatment people have after they realise they’ve got cancer has been good in this country, but we’re much too slow to catch it. The figures are really quite shocking. Thousands would live each year if we treated people with cancer as well as they do in Holland, Belgium, France or Germany. The key thing is to get people diagnosed much quicker.\nWe too rarely come across stuff that makes us reconsider, or at least flesh out our view\nHow has having cancer affected your outlook as a journalist and in life in general?\nIt made me realise how many people have their own experience of serious illness, either themselves or close family. People come up to you all the time and tell you: “I’ve got cancer” or: “My wife has”. It really underlined to me that there is a value in talking about it. Not for look-at-me reasons, but because people draw comfort from the fact that other people are having experiences like the ones they’re going through; it reduces one of the hardest thing about serious illness, which is the loneliness of it.\nDo you ever get used to getting up at 3.30am (to work on Today )?\nI think you can learn to live with it rather than get used to it. One doctor very helpfully said to me: “You do realise that more people die at that time than any other…” The time between three and four is a low for the body and that’s when lots of people take their last breath. I joke sometimes that I’ve never worked fewer hours, which is technically true, but I’m knackered a lot of the time because it gives you a kind of jetlag getting up at this time of the day.\nWhy did you want to return to radio?\nThe reason I wanted to be a journalist – there’s nobody from that background in my family – was because my best friend’s dad , Brian Redhead, was presenter of the Today programme. That’s where I got the bug. The first job I ever did as a journalist was on radio. The joy of radio is that it’s much less mannered and much less theatrical than telly. Don’t get me wrong, I love TV. For impact, it beats everything. But there is a sort of artificiality about television. I often think that people on TV – and I include myself in this – look as if we’re impersonating people appearing on television. With the job I’m doing now, it feels like you’re having a chat. That’s lovely.\nYou were in last week’s Spectator debating bias over Brexit at the BBC. Do you feel the BBC is an organisation that comes in for too much criticism?\nYou can never criticise too much an organisation that takes a lot of public money and has a privileged position. Everyone has to pay the license fee. We get a couple billion quid of public money, so we’ve got to take criticism, but equally we’ve got to stand up to it when it’s unfair and doesn’t have a proper basis. We’re in unchartered terrritory with Brexit, and most people, including me, didn’t see the results coming. So, boy, do we have to look at ourselves and ask ourselves tough questions about whether we’re interviewing the right people, asking the right questions.\nYour podcast, Political Thinking, allows for some in-depth debate. Are you persuaded by what people say or are your views already established?\nI think you’re always shaping them. We all come with our own prejudices to all subjects. The joy of doing a longer discussion is that you discover things you didn’t know. The danger with short conversations – social media has made everything boil down to 140 characters or a headline – is that we too rarely come across stuff that makes us reconsider or at least flesh out our view. One of the reasons I wanted to do these discussions was that politicians often complained to me that there was no real value in them thinking out loud because they just got pounced on by journalists like me.\nJeremy Paxman famously said of interviewing politicians that he wanted to find out why these bastards were lying to him. Do you think that aggressive style of questioning has had its day?\nI’m a great Paxman fan, personally and professionally, but it’s one of the few things Jeremy said that I didn’t just disagree with but loathed. I don’t think that they’re sitting there lying and I don’t want to convey to the public that they’re lying. I’m quite unfashionable among journalists, maybe among people. In the classic conversation in the back of a cab, where people say they’re all liars and on the take, I’m afraid that cab drivers find themselves having their ears bent my me, saying that is not true, it’s lazy, it’s cheap and it’s just the way to guarantee that we have worse people doing these important jobs.\nYou studied PPE at Oxford. In a recent Guardian piece, Andy Beckett suggested PPE graduates run Britain. Do you agree?\nIf you’re not in the PPE club, people might think it is literally that: a funny handshake, knowing look and secret membership card. I don’t think it’s made a lot of difference to what I’ve done or achieved, save this: I think PPE is probably the degree for people who are great on their feet or, to put it another way, great bullshitters.\nWhat are you reading?\nFrank Gardner, the BBC security correspondent, has a thriller out [ Crisis ] which is a cracking read and has that insider’s feel. I’ve gone back to thrillers. I was a big thriller reader as a kid and then gave it up. Sometimes, when I’m trying to distract myself, my wife jokes that I need endless plot. So it’s a bit of endless plot I’m after.\nYou’re a Manchester United fan. What’s the verdict on José Mourinho?\nHe’s making United good to watch again, but it’s a pity about the results. For the past few seasons, I wasn’t sure if I was pleased to be going to Old Trafford or pleased to be not going. I now love going again because there’s excitement and buzz, particularly because of Zlatan [Ibrahimović] – but, boy, does he need to get someone else scoring and a few more wins.\nPolitical Thinking is available to download weekly at bbc.co.uk\nTopics Nick Robinson The New Review Q&A Cancer Radio 4 BBC Radio industry Jeremy Paxman interviews Share on Facebook Share on Twitter Share via Email Share on LinkedIn Share on Pinterest Share on Google+ Share on WhatsApp Share on Messenger Reuse this content", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nIlGLQMub.V2.KfNvj6F4.0mHyDA9hQDytHi2XQN3XgLSzhWA2ifUZBFkVWCvm.sQVtRMfPGjVFUyIpALCYS9FgT7BeZLAylhfKJbaf7_4_pBFV2eK6lS5w--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:30:38.000+03:00", "language": "english", "title": "Nick Robinson: ‘The BBC gets a lot of public money – we have to take criticism’ | Media", "thread": {"title_full": "Nick Robinson: ‘The BBC gets a lot of public money – we have to take criticism’ | Media | The Guardian", "site_full": "www.theguardian.com", "site": "theguardian.com", "site_section": "http://www.theguardian.com/uk/rss", "performance_score": 3, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 330, "shares": 330, "comments": 0}, "linkedin": {"shares": 3}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 4, "site_type": "news", "spam_score": 0.0, "domain_rank": 170, "replies_count": 3, "site_categories": [], "country": "US", "section_title": "The Guardian", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nIlGLQMub.V2.KfNvj6F4.0mHyDA9hQDytHi2XQN3XgLSzhWA2ifUZBFkVWCvm.sQVtRMfPGjVFUyIpALCYS9FgT7BeZLAylhfKJbaf7_4_pBFV2eK6lS5w--", "published": "2017-04-16T11:30:38.000+03:00", "title": "Nick Robinson: ‘The BBC gets a lot of public money – we have to take criticism’ | Media", "uuid": "bcf73f2f14cf6523c0669e04c330b5581da7d042", "main_image": "https://i.guim.co.uk/img/media/8490fda8fa307b80aea366db4c64bb45cf372fc1/0_225_4870_2921/master/4870.jpg?w=1200&amp;h=630&amp;q=55&amp;auto=format&amp;usm=12&amp;fit=crop&amp;crop=faces%2Centropy&amp;bm=normal&amp;ba=bottom%2Cleft&amp;blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&amp;s=cb8e2a343f47ff0041e5ac5de6389f22"}, "uuid": "bcf73f2f14cf6523c0669e04c330b5581da7d042", "ord_in_thread": 0}]