[{"entities": {"locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "calles", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [], "persons": [{"name": "cri", "sentiment": "none"}, {"name": "vega", "sentiment": "none"}, {"name": "enrique gorostieta", "sentiment": "none"}, {"name": "christopher", "sentiment": "none"}, {"name": "santiago cabrera", "sentiment": "none"}, {"name": "andy garcia", "sentiment": "none"}, {"name": "victoriano", "sentiment": "none"}, {"name": "mauricio kuri", "sentiment": "none"}, {"name": "eva longoria", "sentiment": "none"}, {"name": "wright", "sentiment": "none"}, {"name": "ramírez", "sentiment": "none"}, {"name": "dean wright", "sentiment": "none"}, {"name": "father christopher", "sentiment": "none"}, {"name": "peter o'toole", "sentiment": "none"}, {"name": "tulita", "sentiment": "none"}, {"name": "calles", "sentiment": "none"}, {"name": "josé", "sentiment": "none"}, {"name": "gorostieta", "sentiment": "none"}, {"name": "oscar isaac", "sentiment": "none"}, {"name": "morrow", "sentiment": "none"}, {"name": "bruce greenwood", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.theaceblackblog.com", "site_section": "http://www.theaceblackblog.com/rss.xml", "domain_rank": null, "replies_count": 0, "country": "US", "section_title": "The Ace Black Blog", "title": "Movie Review: For Greater Glory (2012)", "title_full": "Movie Review: For Greater Glory (2012)", "published": "2017-04-19T08:38:17.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8BPitgA8Gq7ZKefyge_MCyxCXtDUCTRkBf8vN44LjQ12lM7oJ3t_OZm41tFKB_yhxst3ZCtrfanaPcwCBvLs4h9lqikCc0MVA-", "site": "theaceblackblog.com", "main_image": "https://2.bp.blogspot.com/-KHMDsehc6qE/WPbr3YaVrPI/AAAAAAAARlo/cwpJ1y51L80RrxUOWfGvhY2WpEJjveevwCLcB/w1200-h630-p-k-no-nu/For%2BGreater%2BGlory%2B1.jpg", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "be1a523587e1f176f1ab1d04e50ce9a424e86b04", "site_type": "blogs"}, "title": "Movie Review: For Greater Glory (2012)", "published": "2017-04-19T08:38:17.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8BPitgA8Gq7ZKefyge_MCyxCXtDUCTRkBf8vN44LjQ12lM7oJ3t_OZm41tFKB_yhxst3ZCtrfanaPcwCBvLs4h9lqikCc0MVA-", "author": "noreply@blogger.com (aceblackblog.)", "crawled": "2017-04-19T08:38:17.000+03:00", "language": "english", "text": "\nA well-produced historical war epic, For Greater Glory (also known as Cristiada ) shines a welcome light on a little-known but ugly conflict. The film is old-fashioned in scale and scope, but leans too far towards sanctifying pro-Catholic sentiment to be taken seriously.\n\nIt's 1926 in Mexico, and secular President Calles (Rubén Blades) insists that anti-Catholic provisions in the 1917 Constitution be enforced. Protestors demanding religious freedoms take to the streets, and the subsequent government crackdown includes the deportation of priests and the killing of others, including Father Christopher (Peter O'Toole). The violence triggers a rebellion, with ragtag militias known as the Cristeros squaring off against federal soldiers. The rebel leaders include the militant Father Vega (Santiago Cabrera), ostensibly responsible for a civilian massacre, and legendary peasant commander Victoriano \"El Catorce\" Ramírez (Oscar Isaac), known for single-handedly killing fourteen federalist soldiers.\n\nNeeding better organization, the Cristeros approach retired General Enrique Gorostieta (Andy Garcia) and offer him the opportunity to forge the disparate anti-government troops into a cohesive fighting force. Over the protests of his wife Tulita (Eva Longoria), he agrees to leave his comfortable life as a soap magnate and heads to the hills to lead the rebellion. A young boy José (Mauricio Kuri) joins the rebels and becomes Gorostieta's surrogate son. The war drags on for years, until the American government through Ambassador Morrow (Bruce Greenwood) decides to intervene while keeping an eye on American interests in the Mexican oil fields.\n\nA lavish Mexican production directed by Dean Wright, For Greater Glory recalls Hollywood's epics of the 1950s and 1960s, with a grand scope, multiple storylines, serious characterizations, armies of extras and grand battles. For Greater Glory is also unfortunately encumbered by a lack of subtlety that may have been acceptable in a different era, but now borders on propaganda. The film treats the conflict as an almost straightforward battle between good (the Catholic church) and evil (President Calles), and there is no attempt to introduce shades of grey or nuanced context.\n\nThe obtuse tone is unfortunate, because there is a lot to enjoy in the movie. Wright, the visual effects producer for Titanic , two Lord of the Rings movies and two Narnia movies, knows how to make a scene look good, and despite the long 145 minutes of running time the film never lacks for visual splendor or energy. The action scenes are particularly well handled, Wright navigating the chaos of battle with fluid expertise.\n\nLess impressive is an overemphasis on the story of young José, a fable that creeps into consecration territory, impressive for the devout but otherwise overcooked into a chewy mess of miraculous manipulation.\n\nAndy Garcia leads a large cast and delivers a distinguished performance as General Enrique Gorostieta, a man who believes in freedom, family and finances, and therefore triangulates his way into leading the Cristeros despite being a confirmed atheist. Peter O'Toole, at 80 years old, is much more theatrically divine as Father Christopher.\n\nUnabashedly one-sided, For Greater Glory  preaches to the converted and allows its tone-deaf stance to compromise an otherwise worthwhile retelling of a largely forgotten civil war.\n\nAll Ace Black Blog Movie Reviews are here . ", "external_links": [], "highlightTitle": "", "uuid": "be1a523587e1f176f1ab1d04e50ce9a424e86b04", "highlightText": "", "rating": null}]