[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/8HG_hanVOKzMJOKE7lBM6vnUT6x3YgqXMoKZxoSeufkVqDuDKo0h0PWRx4_Zge5gFXQAuC0NmOGkyn6F.IoCVvvDAy9KqfHh6qG9DNIXy9B1ksOVIMtE4w--", "title": "Absences, fitness, atmosphere - new ways to track schools", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://panow.com/taxonomy/term/25/feed", "spam_score": 0.0, "section_title": "paNOW - World", "site": "panow.com", "site_full": "panow.com", "performance_score": 0, "uuid": "be6572b70fcf21d95c56c876960f8a85f4ee78ab", "published": "2017-04-17T11:25:52.000+03:00", "site_categories": [], "country": "US", "title_full": "Absences, fitness, atmosphere - new ways to track schools", "participants_count": 1, "main_image": ""}, "url": "http://omgili.com/ri/8HG_hanVOKzMJOKE7lBM6vnUT6x3YgqXMoKZxoSeufkVqDuDKo0h0PWRx4_Zge5gFXQAuC0NmOGkyn6F.IoCVvvDAy9KqfHh6qG9DNIXy9B1ksOVIMtE4w--", "title": "Absences, fitness, atmosphere - new ways to track schools", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:25:52.000+03:00", "language": "english", "entities": {"locations": [{"name": "washington", "sentiment": "none"}, {"name": "vermont", "sentiment": "none"}, {"name": "district of columbia", "sentiment": "none"}, {"name": "oklahoma city", "sentiment": "none"}, {"name": "sacramento", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "albuquerque", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "delaware", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}, {"name": "new america", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "persons": [{"name": "kirsten carr", "sentiment": "none"}, {"name": "susan montoya bryan", "sentiment": "none"}, {"name": "marc magee", "sentiment": "none"}, {"name": "tepe", "sentiment": "none"}, {"name": "betsy devos", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "lindsey tepe", "sentiment": "none"}, {"name": "steve karnowski", "sentiment": "none"}, {"name": "sally ho", "sentiment": "none"}, {"name": "maria danilova", "sentiment": "none"}, {"name": "candice mcqueen", "sentiment": "none"}, {"name": "sophia bollag", "sentiment": "none"}, {"name": "sean murphy", "sentiment": "none"}, {"name": "mike petrilli", "sentiment": "none"}, {"name": "sheila burke", "sentiment": "none"}, {"name": "natasha ushomirsky", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "thomas b. fordham institute", "sentiment": "none"}, {"name": "education department", "sentiment": "none"}, {"name": "council of chief state school officers", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "education trust", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "be6572b70fcf21d95c56c876960f8a85f4ee78ab", "published": "2017-04-17T11:25:52.000+03:00", "author": "The Canadian Press", "text": "Absences, fitness, atmosphere - new ways to track schools April 17, 2017 - 2:15am \nWASHINGTON — How often do students miss school? Are they ready for college? Are they physically fit? Is their school a welcoming place? \nStates are beginning to outline new ways to evaluate their schools, rather than relying just on traditional measures such as test scores. \nThe plans are required under a new federal education law, the Every Student Succeeds Act, which takes effect in the coming school year. \nUnder the new law, states are focusing more on academic growth, meaning not just whether students have achieved a certain academic level in reading and math, but whether they have improved over time. \nMike Petrilli, president of the Thomas B. Fordham Institute, said that's a big change from the No Child Left Behind Act, the previous version of the education law. \"Schools and educators should feel good about that; that will be a fairer way to measure school quality,\" he said. \nBut while most experts praised the flexibility and innovation offered by the new law, some think that in the absence of federal guidelines some states may overlook groups of students who need additional support, such as minorities, students with disabilities and English-language learners. The Republican-controlled Congress moved swiftly this year to rescind key federal accountability guidelines passed by the Obama administration to help states implement the new law. \nSo far, nine states and the District of Columbia have submitted their accountability plans to the Education Department for review, and seven states are completing their blueprints. The remaining states will submit their plans in September. Education Secretary Betsy DeVos will decide whether to accept or reject them. She has said her goal is state and local flexibility in education and indicated that she might use the process to advance school choice. \nWhen evaluating school quality, states are experimenting with new indicators. Almost all of the first-round states have adopted chronic absenteeism, or how many students miss more than 10 per cent of the school year, as a key metric. \nConnecticut and Delaware, among others, also will be tracking college readiness, or whether high school students are taking advanced classes and how successful they are on college admission tests like the SAT. \nTennessee wants to give every public school in the state a grade from A to F, which state Education Commissioner Candice McQueen says would give parents better information about schools. The grade will take into account such things as how well English language learners are doing and whether disabled students are being served. The schools will also be graded on chronic absenteeism rates, and if students are ready for college or the military and whether traditionally underserved students are performing well. Graduation rates also will count. \nNevada outlined a system that focuses on student growth measures, including test scores, English language proficiency, and graduation rates. Massachusetts will be paying attention to academic results in ninth grade. \nIn New Mexico, the state will begin tracking the need for additional tutoring in college and linking those back to high schools where the students studied. The state also will look at how students do in science in ranking schools. \nSome states are getting creative. Vermont and Connecticut want to make physical fitness another sign of school quality, while Connecticut also believes access to arts education should be another measure. Illinois wants to conduct \"climate surveys\" asking whether children feel they are in a safe and welcoming environment. \n\"There is a lot more than just tests that matter for student success,\" said Natasha Ushomirsky with the Education Trust. \"Tests are important and looking at progress is important, but states are getting a better picture of how schools are serving students.\" \nAnother common thread that has emerged from the first round: States are doing a better job of involving parents, teachers and community activists in the process. \"They've been very proactive to engage anybody who has an interest in the plans,\" said Kirsten Carr with the Council of Chief State School Officers. \nBut Marc Magee, CEO of 50Can, an education non-profit , expressed concern that \"if everybody doesn't hold up their end of the bargain, we could go back to that era where certain populations of students become invisible inside schools even if they are struggling mightily and not getting the opportunity that they deserve.\" \nAnd Lindsey Tepe, senior education policy analyst at New America, said there is so much variation in how states want to evaluate their schools that national comparisons could be difficult. \"Without the guidance, there isn't really a recipe to follow,\" said Tepe. \n__ \nAssociated Press writers Sheila Burke in Nashville, Tennessee; Susan Montoya Bryan in Albuquerque, New Mexico; Sally Ho in Las Vegas; Sophia Bollag in Sacramento, California; Steve Karnowski in Minneapolis; and Sean Murphy in Oklahoma City contributed to this report. \nMaria Danilova, The Associated Press"}]