[{"entities": {"persons": [{"sentiment": "none", "name": "julie james goodreads"}, {"sentiment": "none", "name": "john shepperd"}, {"sentiment": "none", "name": "julie james"}, {"sentiment": "none", "name": "john"}, {"sentiment": "none", "name": "john shepherd"}, {"sentiment": "none", "name": "jessica"}, {"sentiment": "none", "name": "jessica harlow"}], "organizations": [{"sentiment": "none", "name": "fbi"}, {"sentiment": "none", "name": "hostage rescue team"}, {"sentiment": "none", "name": "new york times"}, {"sentiment": "none", "name": "army ranger"}], "locations": [{"sentiment": "none", "name": "quantico"}, {"sentiment": "none", "name": "hollywood"}, {"sentiment": "none", "name": "chicago"}, {"sentiment": "none", "name": "florida"}]}, "text": "Goodreads \nTwo undercover FBI agents can hide who they are from everyone but each other in the latest novel from the New York Times bestselling author of Suddenly One Summer . FBI agents Jessica Harlow and John Shepherd have a past. The former lawyer and cocky Army ranger clashed during their training at Quantico, gladly going their separate ways after graduating from the Academy. Six years later, the last thing either of them expects is to run into each other again–assigned to work as partners in a high-profile undercover sting. For both of them, being paired with a former rival couldn’t come at a worse time. Recently divorced from a Hollywood producer and looking for a fresh start, Jessica is eager to prove herself at her new field office. And John is just one case away from his dream assignment to the FBI’s elite Hostage Rescue Team. In order to nail a corrupt Florida politician, they’ll have to find a way to work as a team–a task that becomes even trickier when they’re forced to hole up at a romantic, beachfront resort as part of the investigation. Suddenly, the heat behind their nonstop sparring threatens to make the job a whole lot more complicated. . . \nCocktails and Books received this book for free from NetGalley in exchange for an honest review. This does not affect our opinion of the book or the content of our review. \nI thoroughly enjoyed this fun and flirty story. What makes it so captivating are the well-developed characters and the witty, snappy dialogue. I enjoyed the main characters and all the entertaining secondary characters. This is a fast paced story with a hunky, alpha male hero and a sassy heroine. \nSpecial agent John Shepperd and special agent Jessica Harlow first meet when they go through the FBI academy in Quantico together. They spend twenty-one weeks trying to outwit each other and compete over everything. By the end of their training, they loathe each other and hope they never meet again. Before joining the FBI, John was an Army Ranger and is the biggest, most athletic in their training group. While Jessica, an attorney, is one of two women in their class and feels she has to constantly prove herself. \nNow, six years later, Jessica moves back to her hometown of Chicago and finds herself partnered with her former nemesis, John. Neither of them is happy to be working undercover together and find themselves falling right back into their old habit of competing over everything. I was laughing out loud, enjoying their snarky remarks and how they continually try to one-up each other. All the while, pretending to everyone else, they get along. As they work on the case, they grudgingly start to admire each other and find themselves having to fight their mutual attraction. \nI loved the chemistry between John and Jessica. They have a dry wit and there is a lot of verbal bantering and funny lines. Julie James has an easy, breezy, carefree style of writing that is so hard for most writers to achieve but she seems to do it effortlessly. I was immediately transported into John and Jessica’s world and I never wanted to leave.", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "be66bf7afca0d4f34278f2c0b0b1a977ae45ce8d", "rating": null, "highlightTitle": "", "title": "Review: The Thing About Love by Julie James", "thread": {"country": "US", "site": "cocktailsandbooks.com", "replies_count": 0, "title_full": "Review: The Thing About Love by Julie James", "site_categories": [], "performance_score": 0, "section_title": "Cocktails and Books", "domain_rank": null, "uuid": "be66bf7afca0d4f34278f2c0b0b1a977ae45ce8d", "main_image": "https://images.gr-assets.com/books/1467222882l/27246123.jpg", "site_type": "blogs", "title": "Review: The Thing About Love by Julie James", "spam_score": 0.0, "site_section": "http://www.cocktailsandbooks.com/feed", "url": "http://omgili.com/ri/jHIAmI4hxg.qTK8pmX2kDVRpyMSM5FbBXU1rZerkumcgR7SSQQHPWudQ3wgpqpqcFbftwA2AE_ovgiDwvr8YWx.DPTo_PWCpT9TRVb_sUAM-", "participants_count": 1, "site_full": "www.cocktailsandbooks.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:26:08.000+03:00"}, "crawled": "2017-04-18T11:26:08.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg.qTK8pmX2kDVRpyMSM5FbBXU1rZerkumcgR7SSQQHPWudQ3wgpqpqcFbftwA2AE_ovgiDwvr8YWx.DPTo_PWCpT9TRVb_sUAM-", "highlightText": "", "published": "2017-04-18T11:26:08.000+03:00", "author": "Karen"}]