[{"entities": {"organizations": [{"name": "fairbanks airheads.org", "sentiment": "none"}, {"name": "mmsc", "sentiment": "none"}, {"name": "akb", "sentiment": "none"}, {"name": "good times roll", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "minneapolis motorcycle show", "sentiment": "none"}, {"name": "honda", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "picton", "sentiment": "none"}, {"name": "silver gulch", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "great salt lake", "sentiment": "none"}, {"name": "africa twin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "persons": [{"name": "yvonne stagg", "sentiment": "none"}, {"name": "robert smithson", "sentiment": "none"}, {"name": "lois pryce", "sentiment": "none"}]}, "uuid": "bfafb13effa1dd16a7877a18b602285fcf85d4e7", "highlightText": "", "title": "Every Game's an Adventure", "thread": {"site": "blogspot.com", "country": "US", "participants_count": 1, "site_full": "invictamoto.blogspot.com", "section_title": "On the Road  Again", "uuid": "bfafb13effa1dd16a7877a18b602285fcf85d4e7", "site_section": "http://invictamoto.blogspot.com/feeds/posts/default", "domain_rank": null, "main_image": "https://lh3.googleusercontent.com/-OB7tHdHvVgc/WO6OHnVmBAI/AAAAAAAA66A/XXDG-iypiw8/w1200-h630-p-k-no-nu/2017-04-12%25252018.25.38.jpg", "performance_score": 0, "published": "2017-04-13T04:49:00.000+03:00", "url": "http://omgili.com/ri/m1nCBNv_pozyvGtnZV3MnaVxXmDaeh7UddNsa_99UwkvgkM_VgWyqvLKwAoJZaMboPKgztfQX7Uv3aMHQF2gNTEJp5V5pVfv", "title_full": "Every Game's an Adventure", "title": "Every Game's an Adventure", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-13T04:49:00.000+03:00", "url": "http://omgili.com/ri/m1nCBNv_pozyvGtnZV3MnaVxXmDaeh7UddNsa_99UwkvgkM_VgWyqvLKwAoJZaMboPKgztfQX7Uv3aMHQF2gNTEJp5V5pVfv", "ord_in_thread": 0, "crawled": "2017-04-16T23:37:09.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "noreply@blogger.com (Paul Devall)", "text": "Sometimes it's good to be German - We stumbled upon a recent survey called visa restriction index, and learned that it pays off to hold a passport of Germany. Us Germans have the privilege... 1 day ago The Spiral Jetty - In 1970 artist Robert Smithson created the Spiral Jetty on the shore of the Great Salt Lake. He used over 6,000 tons of black basalt rock to form the spira... 3 days ago Let the Good Times Roll - I think that I am friends on Facebook with most of the folks who read this blog and therefore this won't be surprising news, but if you haven't yet heard I... 5 days ago Baja 2017 - The Spring Return - The Baja and motorcycles were meant for each other and this was our 3rd visit in the past 16 months. A group of friends rode our bikes from San Diego to S... 1 week ago Hanging Out with Airheads - I think that SB enjoyed meeting with the Fairbanks Airheads.org group at their monthly get together aka \"Barley Therapy\" at the Silver Gulch microbrewery.... 1 week ago Honda CRF250 Rally - Review - [image: IMG_20170402_201814_935] My Africa Twin was going in to Two Wheels in Edinburgh for some warranty work and while it was there I was given the new C... 1 week ago TT2000 Write-up - Day 15 - Fifteen days on the road and I 'spose it was time I should think about heading home... With a 2pm sailing I had plenty of time to get to Picton so I decide... 3 weeks ago 2017 Minneapolis Motorcycle Show - This month the International Motorcycle Show came to Minneapolis. I worked the MMSC booth encouraging riders to take training and handing out the coveted “... 2 months ago A Short Ride... - I finally got a ride in; the recent weather has been rather winter-ish. The freezing temperatures, snow, and the ice gave way to warm rain, and 53º tod... 2 months ago 50 Years On Two Wheels - I stopped updating 40on2 back in 2014, ten years of rambling on here seemed like enough. Never the less, the riding and bikes have continued so I thought ... 4 months ago Flies in your Teeth Why one-way motorcycle touring on your own bike makes sense - No, this isn’t a crafty plan to relieve you of your pride-and-joy at the end of a tour, but a clever way of letting you maximise the great times you have ... 5 months ago Twitter, The Bane Of The AKB's And WOB's - Let's have it right, the terms AKB or WOB are a fucking embarrassment. Whenever I stick my nut on Twitter and see someone having a pop at someone else, an... 11 months ago What Goes on Behind my Round the World Travel that People Do Not See. - A silly idea mentioned over a casual conversation came to fruition two months ago. The allure of travelling around the world seems like an enticing dream t... 1 year ago Yvonne Stagg and Dreamland revisited by Lois Pryce - Photo from The Independent 17 June 2015 My fellow rider and friend Lois Pryce has written a wonderful article on Yvonne Stagg, who owned and rode Dreamland... 1 year ago"}]