[{"entities": {"organizations": [], "locations": [], "persons": []}, "uuid": "c0d4c8e93c59f9bed08e3df3e4de714a59411231", "highlightText": "", "title": "POL Trump\u0092s Use of the Congressional Review Act Is a Legislative Milestone", "thread": {"site": "timebomb2000.com", "country": "US", "participants_count": 3, "site_full": "www.timebomb2000.com", "section_title": "Timebomb2000", "uuid": "c0d4c8e93c59f9bed08e3df3e4de714a59411231", "site_section": "http://www.timebomb2000.com/vb/forumdisplay.php?9", "domain_rank": null, "main_image": "", "performance_score": 0, "published": "2017-04-17T00:07:23.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8c71yJUs090AMPADeQH5akAwq18JqA9Uvx1WoMEUM.aT_CfuSYi62_T6IkpL9Pz98-", "title_full": "POL Trump\u0092s Use of the Congressional Review Act Is a Legislative Milestone", "title": "POL Trump\u0092s Use of the Congressional Review Act Is a Legislative Milestone", "site_type": "discussions", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 3}, "language": "english", "published": "2017-04-17T00:07:23.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8c71yJUs090AMPADeQH5akAwq18JqA9Uvx1WoMEUM.aT_CfuSYi62_T6IkpL9Pz98-", "ord_in_thread": 0, "crawled": "2017-04-17T00:07:23.000+03:00", "rating": null, "external_links": ["http://www.breitbart.com/big-government/2017/04/15/trump-congressional-review-act-legislative-milestone/"], "highlightTitle": "", "author": "Millwright", "text": "Trump\u0092s Use of the Congressional Review Act Is a Legislative Milestone On the campaign trail, President Donald Trump promised to roll back federal regulations. And at the Conservative Political Action Conference (CPAC) in February, chief strategist Steve Bannon said that the goal of the administration was the “deconstruction of the administrative state.”\nTrump has delivered on those pledges, signing over a dozen laws reversing Obama-era regulations, marking the most substantial legislative achievement of his first 100 days in office.\nPolitico has downplayed Trump’s slew of repeal laws, describing them as “the only substantive bills Trump has signed so far.” And, in keeping with a media-wide effort to separate Trump from his voting base, Politico claims that “none of them evoke the drain-the-swamp anti-establishment populism that Trump rode to the presidency.”\nThe opposite is true, on both counts: Trump has permanently removed some of the regulatory muck that the “swamp” uses to feed itself.\nHis weapon has been the Congressional Review Act (CRA), which Politico calls “obscure.” It was signed by President Bill Clinton in 1996, when he was campaigning for re-election and determined to prove he had learned the lessons of the 1994 midterm elections — that “the era of big government is over.” The CRA allows Congress to overturn rules by a federal agency 60 days after they are reported to Congress. It was aimed at rules made by “lame duck” presidents.\nBut as the Wall Street Journal‘s Kimberly Strassel noted in January, two factors make the CRA particularly powerful. One is inherent to the legislation itself, which provides that a regulation, once repealed, cannot be promulgated again without a new act of Congress.\nThe other factor is the arrogance and incompetence of the Obama administration, which failed to report many rules to Congress — meaning the 60-day window never began even for some earlier Obama rules.\nHere is the list of Obama-era regulations that President Trump has managed to repeal using the CRA so far:\nOverzealous transparency: H.J. Res. 41 reversed a Securities and Exchange Commission rule that was crafted as an anti-corruption measure under the Dodd-Frank regulations but energy companies considered too onerous. Critics complained that the regulation gave foreign energy companies a pass while hurting domestic companies.\nCoal mining: H.J. Res. 38 ended the “Stream Protection Rule,” a Department of the Interior rule that hurt coal.\nGun control: H.J. Res. 40 reversed a rule by the Social Security Administration, which had yet to take effect, restricting gun purchases by the mentally ill through the use of additional firearms background checks.\nLabor “blacklisting”: H.J. Res 37 ended a “blacklisting” rule, under several agencies, that required federal contractors to disclose any violations of 14 other labor regulations within the previous three years.\nLand use: H. J. Res 44 ended a Department of the Interior rule, “Bureau of Land Management Planning 2.0,” that gave the federal government more, and state and local government less, authority in land use decisions.\nFederal education standards: H. J. Res 57 and H.J. Res 58 reversed new federal standards for new teachers that the Department of Education had sought to impose under legislation signed by President Obama in 2015.\nDrug testing for unemployment: H.J. Res. 42 overturned a Department of Labor regulation that had restricted the use of drug testing to determine workers’ eligibility to receive unemployment compensation.\nHunting predators: H.J. Res. 69 reversed a Department of the Interior rule, pushed by animal rights activists, banning non-subsistence hunting of predator species for population control in wildlife refuges in Alaska.\nInjury paperwork: H. J. Res. 83 nullified a Department of Labor rule requiring more records of worker injuries.\nBroadband privacy: S. J. Res 34 repeals an FCC rule requiring Internet Service Providers to ask customers before sharing private information with advertisers — which Google and Facebook could still do under the rule.\nForced savings: H. J. Res. 67 reverses a Department of Labor rule allowing states to force workers to save.\nPlanned Parenthood: H. J. Res 43 repeals a mandate that all but required states to fund the abortion provider.\nThe window for repealing rules from the last several months of Obama’s presidency closes in May — though some argue that President Trump may have the power to repeal regulations dating back to the start of Obama’s first term.\nRegardless, the use of the CRA to repeal regulations has put future administrations on notice that there is a limit to government’s regulatory reach, and that given the opportunity by the voters, conservatives will enforce those limits.\nIt is true that the Trump administration has not yet signed a major, signature piece of legislation. Neither had Obama in the first 100 days — unless one counts the stimulus, which wasted nearly a trillion dollars and inspired the Tea Party. The “failure” of the American Health Care Act, which intended to repeal and replace Obamacare, may be temporary, as Republicans are determined to revisit the issue and propose new legislation that can be signed by the 2018 midterms.\nEven without the CRA, the Trump administration can claim it scored two other major achievements in the confirmation of Supreme Court Justice Neil Gorsuch and the renewal of America’s military deterrent after the recent attack on Syria.\nBut the use of the CRA is no small accomplishment. Future administrations will never be as careless in expanding the executive authority of the federal government far beyond the scope of the authority envisioned in the U.S. Constitution.\nhttp://www.breitbart.com/big-governm...ive-milestone/ Proud Infidel and Cracker\nMember : Nowski Brigade\nDeplorable"}]