[{"entities": {"organizations": [{"name": "colourpop ultra matte", "sentiment": "none"}, {"name": "huda beauty lip contour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}], "locations": [{"name": "youtube", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "stuttafords", "sentiment": "none"}], "persons": [{"name": "huda beauty", "sentiment": "none"}, {"name": "rimmel", "sentiment": "none"}, {"name": "huda", "sentiment": "none"}, {"name": "—huda kattan", "sentiment": "none"}, {"name": "nerissa naidoo", "sentiment": "none"}]}, "uuid": "c1547de1fcb20ff465d85c77fb47799e395e99c9", "highlightText": "", "title": "My all time favourite liquid lipstick- Huda Beauty Liquid matte", "thread": {"site": "wordpress.com", "country": "US", "participants_count": 1, "site_full": "missdhanusha.wordpress.com", "section_title": "My all time favourite liquid lipstick- Huda Beauty Liquid matte – Dhanusha", "uuid": "c1547de1fcb20ff465d85c77fb47799e395e99c9", "site_section": "https://missdhanusha.wordpress.com", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T22:34:07.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZS0H0MPG3PvY2M8t5FxZVkPWIAO5WIlUH20wbAaaau_gMCXnuqn5Qny6rzj6oUExX57F54oa8OSY1rRuQlctKVknarGhr.o8uYUHGbYnmbIyyN2dahf65Q1RyGX6OsHwgm.aHA1S0uvaQ--", "title_full": "My all time favourite liquid lipstick- Huda Beauty Liquid matte", "title": "My all time favourite liquid lipstick- Huda Beauty Liquid matte", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T22:34:07.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZS0H0MPG3PvY2M8t5FxZVkPWIAO5WIlUH20wbAaaau_gMCXnuqn5Qny6rzj6oUExX57F54oa8OSY1rRuQlctKVknarGhr.o8uYUHGbYnmbIyyN2dahf65Q1RyGX6OsHwgm.aHA1S0uvaQ--", "ord_in_thread": 0, "crawled": "2017-04-16T22:34:07.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "missdhanusha", "text": "Hello weirdos! \nI hope you ate more Easter eggs than I did, even one would be more than I had this weekend. Speaking of Easter, bunnies are the cutest animals ever, however many brands still test on bunnies. I am quite ashamed to admit that not everything I own is cruelty free but I do try to keep my purchases bunny friendly unless there is no cruelty free similar product. These are two sites you can check for cruelty free products: http://www.leapingbunny.org / and   http://www.bwcsa.co.za/ . I will of course do a more extensive post about this soon.\nLipsticks are my favourite beauty product, there is something about putting on lipstick even without any other make up that just brightens up your face. I am still obsessed with liquid lipsticks particularly those that dry matte but I will say while there are many formulas out there, this is only one thus far, that I place on a high pedestal for the simple reason that it does not dry down my lips or flake.\nThe Huda Beauty liquid mattes by far outshine every other liquid lipstick that I have tried. Not only is Huda Kattan an extremely successful make up artist, beauty blogging extraordinaire, influencer and Youtube sensation but she also has her own make up line. At 33, this talented woman has the world at her feet. She is one of my favourite bloggers if not my favourite. You can check her out at-  http://hudabeauty.com/meet/huda \nHUDA BEAUTY LIQUID MATTE LIPSTICK REVIEW \nProduct description(website shophudabeauty.com): \nIntroducing Huda Beauty’s latest lip lo lobeautifier: the Liquid Matte, an unrivaled take on the liquid lipstick. The tried and true comfort-wear formula is infused with an exclusive complex to help maintain the lips’ hydration. The lightweight formula glides on a thin coat of color that intensifies as it sets to a matte, transfer-free finish with amazing staying power. You might even forget you’re wearing anything on your lips at all! Pair it with a complementary Huda Beauty Lip Contour to set off your look.\nWhat it is formulated WITHOUT:\n– Parabens\n– Phthalates\nWhat else you need to know:\n“I created these because I could never find a liquid lipstick that suited my needs. This formula is so light, it feels like you’re wearing nothing at all, but gives you a long-lasting, transfer-free finish in shades to die for.”—Huda Kattan\nThis product is cruelty-free and free of gluten. Please note: the color’s appearance may vary based on skintone once set.\nIngredients: \n\nPackaging:  \nEach liquid lipstick comes beautifully packaged in a cardboard sliding out carton with transparent plastic outer covering. The biting lips is on the box with the lipstick in between allows you to see the colour from the carton. The lip gloss like tube is square shaped and has a matte look. It is the most stunning liquid lipstick I have owned. It has a doe-foot applicator like most liquid lipsticks. I particularly like the wand applicator which is long enough to give you control of the application. Most people would discard the box for better storage but its way too pretty for me to throw away.\n\nPrice: \n20$ in countries that it retails. R550- R650 in South Africa from importers.\nColor:  \nThe two shades I own are Famous which is a dark vampy red and Heartbreaker, a pinky bright red. Famous is my ‘famous’ lip colour, it is my all time favourite but both shades would suit all skin tones. It does dry down a shade or two darker post application. The range is quite extensive with nudes, pinks, reds and browns, there is a shade for everyone. She also recently released 3 new nudes.\n\nFormula: \nFirstly the smell of this lipstick is like vanilla cake batter, I love the smell so much. The formula itself is very thin and lightweight but not runny like Colourpop Ultra Matte for instance. It takes about a minute to dry down which makes it perfect for ombre lip looks.  The best part about these lipsticks is it does not cling to dry patches, it looks even whether I have dry lips or not. It does transfer a bit however when you apply a second layer your lips will not look or feel cakey. It is comfortable on the lips and there is no stickiness to it.\nPigmentation: \nIt is very pigmented and one stroke on the lips could cover well. Two strokes will give you a full even coverage. It glides on effortlessly and does not look streaky or patchy. Neither does it sink into the fine lines on the lips. If you use a thin layer there is less chance of transference but you still get that “wow” pigmentation.\nWith flash No flash, under light Staying power: \nI applied this lipstick before 1pm and it was still on after 8pm and I was drinking in between. I find this last pretty well on my lips, estimated about 6-8 hours. If you are eating you may need to reapply but when it does fade it does so evenly, it does not crumble or flake off. No liquid lipstick would last you through an entire make out session and I am not sure why people expect it too. It doesn’t last less than 4-5 hours. Ofcourse, using a lipscrub and lip balm would help it last longer, you can read what I use  here .\nOverall experience and thoughts: \nI truly love these liquid lipsticks because they are so pigmented and work effortlessly. I don’t usually need to reapply but if I do then they are easy to build upon. It is the most hydrating and wearable formula I have used. The only other formula I have used that compares is the Limecrime but that was slightly drying and more tacky. I understand it is pricey and not that easy to get ahold of. So is it worth it? I give this a 9.5/10, I think it it could last slightly longer. I would recommend it if you can afford it. If not the closest dupe a friend Nerissa Naidoo suggested is The Balm matte liquid sticks you can purchase from Stuttafords. I personally recommend Rimmel provocalips or Colourpop Ultra mattes it you are looking for a drugstore or budget friendly alternative.\nYou can purchase Huda beauty liquid mattes lipsticks from http://www.musebeauty.co.za , http://www.samika.co.za and VanityLine on Facebook .\nHere are some swatches on my lips:\nFamous Heartbreaker Looks created with these liquid lipsticks:\nFamous with white eyeshadow Heartbreaker and famous mixed Thank you for reading. Do you own Huda Beauty liquid mattes? What do you think of them?\nP.S. I took all these pictures at night hence the flash. Apologies.\nDon’t forget to subscribe to my blog, many more posts coming soon :) \nLove your lips <3 \nxoxo Miss Dhanusha    "}]