[{"uuid": "c2d330dad0c4d854b969b6fbe7103a9f0b275336", "url": "http://omgili.com/ri/jHIAmI4hxg97SxyS0bD4Hupgpv4tnrwADo38_AAb5R3izVRgyQIOLgCER0Itkv9SRef3fKtV8z.67i5MPQElw1ny9YzPLA.1I56uSZeYpBva4F.N1x5i4Q--", "title": "Umps may soon take to mic to explain replays", "author": "", "rating": null, "published": "2017-04-18T23:25:01.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "mlb", "sentiment": "none"}, {"name": "cubs", "sentiment": "none"}, {"name": "nba", "sentiment": "none"}, {"name": "major league baseball", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "new york yankees", "sentiment": "none"}, {"name": "nhl", "sentiment": "none"}, {"name": "texas rangers", "sentiment": "none"}, {"name": "nfl", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "jets", "sentiment": "none"}, {"name": "buffalo", "sentiment": "none"}, {"name": "marlins", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "coors field", "sentiment": "none"}, {"name": "camden yards", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "persons": [{"name": "steven wine", "sentiment": "none"}, {"name": "christian yelich", "sentiment": "none"}, {"name": "dale scott", "sentiment": "none"}, {"name": "ben dreith", "sentiment": "none"}, {"name": "lance berkman", "sentiment": "none"}, {"name": "brad ziegler", "sentiment": "none"}, {"name": "ken powtak", "sentiment": "none"}, {"name": "willens", "sentiment": "none"}, {"name": "willson contreras", "sentiment": "none"}, {"name": "ted barrett", "sentiment": "none"}, {"name": "jim kelly", "sentiment": "none"}, {"name": "david price", "sentiment": "none"}, {"name": "adrian gonzalez", "sentiment": "none"}, {"name": "marty lyons", "sentiment": "none"}, {"name": "joe west", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "c2d330dad0c4d854b969b6fbe7103a9f0b275336", "url": "http://omgili.com/ri/jHIAmI4hxg97SxyS0bD4Hupgpv4tnrwADo38_AAb5R3izVRgyQIOLgCER0Itkv9SRef3fKtV8z.67i5MPQElw1ny9YzPLA.1I56uSZeYpBva4F.N1x5i4Q--", "site_full": "www.ithacajournal.com", "title": "Umps may soon take to mic to explain replays", "site_section": "http://rssfeeds.ithacajournal.com/ithaca/sports", "domain_rank": null, "published": "2017-04-18T23:25:01.000+03:00", "title_full": "Umps may soon take to mic to explain replays", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "GANNETT Syndication Service", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "https://www.gannett-cdn.com/-mm-/1f6a6246cdb2392268279f5f3ca308c979520d01/c=0-48-512-336&amp;r=x633&amp;c=1200x630/local/-/media/2017/04/18/Ithaca/B9327223575Z.1_20170418125542_000_GDTI3UIVH.2-0.jpg", "site": "ithacajournal.com"}, "external_links": [], "language": "english", "text": "Activate your digital access. Umps may soon take to mic to explain replays BEN WALKER, AP Baseball Writer Published 12:55 p.m. ET April 18, 2017 | Updated 1:18 p.m. ET April 18, 2017 FILE - This Oct. 19, 2010, file photo shows umpires huddling after an apparent home run by New York Yankees' Lance Berkman in the second inning of Game 4 of baseball's American League Championship Series against the Texas Rangers in New York. Major League Baseball umpires could start explaining replay decisions to the players and fans _ the way NFL referees do _ later this season if the sides can reach agreement. Under one possible scenario, the crew chief could wear a microphone beginning at the All-Star Game. (AP Photo/Kathy Willens, File) (Photo: ASSOCIATED PRESS) 8 CONNECT COMMENT EMAIL MORE \nAdrian Gonzalez dives headfirst into home, seems to beat the tag by Cubs catcher Willson Contreras, but is called out. Safe, shout fans at Dodger Stadium who see replays on the board. \nUmpires go to their headsets for a video review, and nearly three minutes later, the signal comes: Out! \nWant to hear exactly how disputed calls get decided, like that one in last year’s NL Championship Series? \nSoon, we might. \nWhile nothing is set, Major League Baseball and umps are expected to discuss a plan — most prominently used in the NFL — for crew chiefs to wear a microphone and explain replay rulings. \nUnder one possible scenario, they would start at the All-Star Game on July 11 in Miami, tweak the process over the season’s second half and then go forward with the experiment in the playoffs. \nPeople familiar with the talks spoke to The Associated Press on condition of anonymity because an agreement has not yet been reached. \nLast year, MLB asked for the plate ump to wear a mic at the All-Star Game, but there wasn’t enough time to do it. \nThe umpires are in the middle of their five-year labor deal and any change would involve negotiations, plus a comfort level on both sides that the system would be efficient, accurate and easy. \nSo no way to say for sure if fans at Camden Yards, Coors Field and ballparks across the majors will become familiar with the voices of veteran crew chiefs — be it country singer Joe West, ordained minister Ted Barrett or Dale Scott, once a Top 40 AM radio disc jockey. \n“It probably would be nice to get a little more explanation,” Marlins reliever Brad Ziegler said. “They’re supposed to say the call stands or the call’s confirmed. ‘The call stands’ means you can’t tell. A lot of times we don’t get that … they just signal out or safe. That’s all we get on the field. \n“They may announce it on the PA, but it doesn’t seem like that is consistent in all parks. And the acoustics in the stadium here — we have a hard time hearing what’s on the PA in the bullpen,” he said. \nIn the NFL, hearing refs announce “upon further review” has long been part of the lexicon. The lore includes what Ben Dreith said in a 1986 game, when Jets lineman Marty Lyons tangled with Buffalo quarterback Jim Kelly and was penalized for “giving him the business down there.” \nThe NHL for some time has mic’ed up officials to explain coach’s challenges, based on what the central replay booth tells them. \nNBA crew chiefs put on headsets to watch reviews and talk with the replay center. Decisions are explained to the official scorer’s table and the benches, and the public address announcers inform the crowd. \nMLB has tried to speed up reviews this year, aiming for the umpires in the New York replay booth to relay the final calls to the field in under 2 minutes. \n“It’ll take more time,” Boston pitcher David Price said. “It’s not going to make them any shorter.” \nAs for making the replay system more informative and entertaining, “Yeah, until they have a problem with the umpire’s mic,” he said. \nMarlins star Christian Yelich said a switch wouldn’t affect him. \n“The call’s the call,” he said. “Just because they tell you what they decided isn’t going to change it.” \n——— \nAP Sports Writer Steven Wine and AP freelance writer Ken Powtak contributed to this report. 8 CONNECT COMMENT EMAIL MORE \nCopyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. TOP VIDEOS", "ord_in_thread": 0, "crawled": "2017-04-18T23:25:01.000+03:00"}]