[{"uuid": "c77494e2e153dfe1d85a067c5a707d789f07f63d", "url": "http://omgili.com/ri/jHIAmI4hxg.iJPgI2z6a7enpVQ9s33LsMTXCYlX7iP7N2XPRSSt9cmbTeXZLsBDGwEC4YRRAL66qpgYPTupkSM7z22CcKPcdaJj_l1ceu3w-", "title": "Pentagon to test ability to shoot down North Korean missiles in long-planned tests", "author": "", "rating": null, "published": "2017-04-18T23:25:04.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "pentagon", "sentiment": "negative"}, {"name": "navy", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "standard missile", "sentiment": "none"}, {"name": "national security council", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "defense department", "sentiment": "none"}, {"name": "vandenberg air force base", "sentiment": "none"}, {"name": "nsc", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "pacific", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "pacific region", "sentiment": "none"}, {"name": "korean peninsula", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "pacific ocean", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "persons": []}, "highlightTitle": "", "thread": {"uuid": "c77494e2e153dfe1d85a067c5a707d789f07f63d", "url": "http://omgili.com/ri/jHIAmI4hxg.iJPgI2z6a7enpVQ9s33LsMTXCYlX7iP7N2XPRSSt9cmbTeXZLsBDGwEC4YRRAL66qpgYPTupkSM7z22CcKPcdaJj_l1ceu3w-", "site_full": "www.cnn.com", "title": "Pentagon to test ability to shoot down North Korean missiles in long-planned tests", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics.rss&author=CNN&title=Politics", "domain_rank": 81, "published": "2017-04-18T23:25:04.000+03:00", "title_full": "Pentagon to test ability to shoot down North Korean missiles in long-planned tests", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "CNN.com - RSS Channel - Politics", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://i2.cdn.cnn.com/cnnnext/dam/assets/130316021024-u-s-interceptor-test-launch-super-tease.jpg", "site": "cnn.com"}, "external_links": [], "language": "english", "text": "The US military will test-fire an improved Standard Missile off a Navy ship The program has been in development with Japan (CNN) The Pentagon will conduct two major high-stakes tests in May of its ability to shoot down missiles launched out of North Korea. The long-scheduled tests in the Pacific are part of the US military's overall ballistic missile defense program to defend against North Korean or Iranian threats -- but are, for now at least, aimed at ensuring the US can defend against a threat from North Korea, US defense officials said. One of the actions will involve test-firing an improved Standard Missile off a Navy ship, a defense official said. The tests are taking place over the Pacific because that's where the test ranges are large enough to accommodate them. The upgraded missile has only been tested once before . The new version has an improved booster and warhead. That means the missile could fire at longer ranges, presumably farther from the North Korean coastline, and have a greater chance of hitting the threatening incoming missile. The program has been in development with Japan and is aimed at shooting down intermediate-range North Korean missiles that pose a threat to the US ally. Read More A separate critical test in the Pacific region, to be held at the end of May, will examine the ability of the US to shoot down a future North Korean intercontinental ballistic missile that could threaten the US. That test involves long-range ground-based interceptor missiles based in Alaska and California. That program has also been in existence for over a decade, but only about half the tests have been successful, according to the Defense Department. In the most recent Pentagon report on weapons testing across the department, the long-range system was criticized. The report said it \"demonstrates a limited capability to defend the US homeland from small numbers of simple intermediate-range or intercontinental ballistic missile threats launched from North Korea or Iran.\" The report went on to say that the Pentagon continued to discover new failures during testing. In the upcoming test, a missile will be launched from the Vandenberg Air Force Base in California and attempt to intercept a simulated missile over the Pacific Ocean. As part of a broader National Security Council review of options for dealing with North Korea, the Pentagon has been considering its military options for more than a month in case the White House were to decide to take such action, a defense official said. The NSC effort is also looking at diplomatic and economic options. The official pointed out the recent engagement with the Chinese, and the stronger language calling for more Chinese pressure on North Korea, is the most immediate impact of that review. The review of military options is essentially \"due diligence,\" the official said. Top military and civilian Pentagon officials are \"thinking through every course of action.\" That also involves updating any analysis on the latest thinking of how North Korea might militarily react if the US were to take military steps. The official emphasized that all of the ongoing work doesn't change the administration -- and Pentagon's -- emphasis on the need for a peaceful diplomatic solution. JUST WATCHED", "ord_in_thread": 0, "crawled": "2017-04-18T23:25:04.000+03:00"}]