[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:09:53.000+03:00", "author": "", "entities": {"persons": [{"name": "dicarlo", "sentiment": "none"}, {"name": "sushchin", "sentiment": "none"}, {"name": "graham", "sentiment": "none"}, {"name": "igor sushchin", "sentiment": "none"}, {"name": "akhmet tokbergenov", "sentiment": "none"}, {"name": "amedeo dicarlo", "sentiment": "none"}, {"name": "karim baratov", "sentiment": "none"}, {"name": "austin martin", "sentiment": "none"}, {"name": "rob gillies", "sentiment": "none"}, {"name": "belan", "sentiment": "none"}, {"name": "dmitry dokuchaev", "sentiment": "none"}, {"name": "evie", "sentiment": "none"}, {"name": "anick jesdanun", "sentiment": "none"}, {"name": "v. verizon", "sentiment": "none"}, {"name": "dokuchaev", "sentiment": "none"}, {"name": "alexsey belan", "sentiment": "none"}, {"name": "evie launcher", "sentiment": "none"}, {"name": "baratov", "sentiment": "none"}, {"name": "heather graham", "sentiment": "none"}, {"name": "appflash", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "fandango", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "imdb", "sentiment": "none"}, {"name": "netflix", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "russian federal security service", "sentiment": "none"}, {"name": "mercedes benz", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "yahoo", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "electronic frontier foundation", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "verizon", "sentiment": "none"}, {"name": "lg", "sentiment": "none"}, {"name": "aol", "sentiment": "none"}]}, "text": "For Half the Cost Enterprise Cloud Computing On Force.com Privacy Concern Raised Over Search Service on Verizon Phones By Anick Jesdanun 03 2017 Is Verizon planning to spy on its customers? You might conclude that it is after reading Verizon's privacy policy on an upcoming AppFlash service, which promises easier access to search and apps on Android phones. The policy says Verizon may share data on features and services you use, along with the list of apps you have installed on your phone, with other Verizon businesses to target ads. \nThe privacy watchdog Electronic Frontier Foundation described AppFlash as \"spyware.\" \nNot so fast, Verizon says. In a statement to clarify its intentions, Verizon says users must explicitly grant permission before using AppFlash. Verizon says customers will be able to easily disable the service, and no one will be required to use it. \nThe statement, however, doesn't say exactly what permission Verizon is seeking. The privacy policy says users can control AppFlash's access to your location and contact information, but says nothing about giving control over broader usage data. At most, users can turn off ad tracking on the phone by digging through the settings. \nThe EFF has since retracted Thursday's blog post, pending further investigation. The group had said AppFlash represents Verizon's intention \"to start monetizing its customers' private data as soon as possible.\" The post came just days after Congress voted to block Obama-era restrictions on what internet-access companies like Verizon could do with information about you. \nVerizon has gotten heat over user privacy before. Last year, Verizon agreed to pay a $1.35 million fine over a \"supercookie\" that federal regulators said followed phone customers on the internet without their permission. \nThe complaints come as Verizon evolves into an advertising business, with the purchase of AOL in 2015 and the upcoming acquisition of Yahoo's internet businesses. Verizon, in knowing what web sites and apps you use, could charge companies more for ads that are targeted to your personal habits. \nAndroid phones and iPhones already come with search services similar to AppFlash. The main difference is when people use AppFlash, Verizon gets more data on your interactions and can target ads accordingly. \nAppFlash is a Verizon-branded version of Evie Launcher, which people can already get through the Android app store. After installation, one swipe from a phone edge brings up a search bar; one search pulls content from the web and installed apps at once. For instance, after searching for the movie \"Beauty and the Beast,\" Evie offers one-tap access to buy tickets through Fandango or to read reviews through IMDB or Rotten Tomatoes. \nVerizon says AppFlash will be tested initially on a single phone, LG's K20 V. Verizon has offered no details on its plans beyond that, though the app is for Android only and Apple forbids carriers from shipping iPhones with their own apps already installed. \nWhile Verizon promises to seek permission, it's not yet known how Verizon will do that and how clear it will be in explaining what's being collected and how it will be used. \nEvie Launcher does ask permission to access location and contact information, and you can say no. It also asks for permission to replace the regular home screen experience for launching individual apps. However, Evie says nothing about privacy during the setup; its privacy policy online says personal information such as usage activity and search queries will be collected, but not shared with third parties. \nFor those who use AppFlash, Verizon says data collected may be shared with other Verizon businesses for ad targeting. AOL, which Verizon owns, can place ads tailored web users on many other sites, too. © 2017 Associated Press under contract with NewsEdge/Acquire Media. All rights reserved. Tell Us What You Think Comment: \n5. Netflix Looking for a Thumbs Up MAY INTEREST YOU More than 70% of data center incidents are caused by human error. Find out how you can avoid that. Discover the most essential attributes to consider when selecting a colocation provider. MORE IN CUSTOMER DATA Canadian Accused in Yahoo Hack Has Bail Hearing By Rob Gillies 05 2017 A Canadian man accused in a massive hack of Yahoo emails said Wednesday he'll live with his parents and forgo access to phones and any electronic equipment if he's allowed out on bail. \nOfficials allege that Karim Baratov poses an \"extremely high flight risk\" because of his alleged ties to Russian agents. \nBut his lawyer Amedeo DiCarlo said that Baratov has never been to Russia and he will not flee if freed on bail. Baratov arrived in court for his bail wearing a black shirt and sweat pants with his legs shackled. His parents provided him with a dress jacket. \n\"Flight risk is the issue,\" DiCarlo told reporters after arriving at the courthouse in a chauffeured Rolls Royce. \"We are going to have measures put in place so that is not going to happen.\" \nBaratov's parents have agreed to act as their son's sureties. His father, Akhmet Tokbergenov, has agreed to turn off the internet in the family home if that's what the court requests. \nBaratov, 22, said he registered an internet business in 2014 that made about $81,000 ($110,000 Canadian) that year registering websites, renting web spaces and preventing web servers from hack attempts. He said he made less in in 2015 and 2016. He was not asked directly about the allegations against him. \nU.S. law enforcement officials call Baratov a \"hacker-for-hire\" paid by Russian Federal Security Service members. He has Kazakh origins, arriving in Canada in 2007 and becoming a citizen in 2011. \nBaratov was arrested last month and faces extradition to the U.S. The breach at Yahoo affected at least a half billion user accounts. \nHe was indicted in the United States for computer hacking along with three other people, including two alleged Russian intelligence agents. \nOfficials have said Baratov has the money to leave Canada and the ability to destroy evidence related to his alleged activities while on the run. \nProsecutor Heather Graham said police seized about $22,000 ($30,000 Canadian) cash from his home and another $670 ($900 Canadian) from his wallet when he was arrested. \nBaratov said he had virtually nothing in his bank accounts and testified that he largely financed a string of luxury cars that included a Lamborghini Diablo, an Austin Martin and a Mercedes Benz. He said half of the money he paid for the cars came from his parents. He also said half the $95,000 ($128,000 Canadian) down payment on a three-bedroom house came from his parents. \nSocial media pictures of Baratov show him as an exotic car buff. His Facebook and Instagram profiles were peppered with photos of cars. \nGraham noted that Baratov posted online that he travels to Russia often but Baratov testified he has never been to Russia and only posted that on behalf of a friend to get advice. \nIn a scheme that prosecutors say blended intelligence gathering with old-fashioned financial greed, the four men targeted the email accounts of Russian and U.S. government officials, Russian journalists and employees of financial services and other private businesses, American officials said. \nIn some cases using a technique known as \"spear-phishing\" to dupe Yahoo users into thinking they were receiving legitimate emails, the hackers broke into at least 500 million accounts in search of personal information and financial data such as gift card and credit card numbers, prosecutors said. \nThe case, announced amid continued U.S. intelligence agency skepticism of their Russian counterparts, comes as American authorities investigate Russian interference through hacking in the 2016 presidential election. Officials said those investigations are separate. \nAlexsey Belan, one of the others accused, is on the list of the FBI's most wanted cyber criminals and has been indicted multiple times in the United States. It's not clear whether he or the other two defendants, Dmitry Dokuchaev and Igor Sushchin, will ever step foot in an American courtroom because there's no extradition treaty with Russia. \nThe indictment identifies Dokuchaev and Sushchin as officers of the Russian Federal Security Service, or FSB. Belan and Baratov were paid hackers directed by the FSB to break into the accounts, prosecutors said. \n© 2017 Associated Press under contract with NewsEdge/Acquire Media. All rights reserved.", "url": "http://omgili.com/ri/jHIAmI4hxg_gp0Lxu81bkdjnT_HcX8mizutndVv8j35MFnBnewDI001EQ8u8oUroqI27998Ym.rCCWo7Q21KFA--", "highlightText": "", "highlightTitle": "", "published": "2017-04-03T08:00:00.000+03:00", "language": "english", "title": "Privacy Concern Raised Over Search Service on Verizon Phones", "thread": {"title_full": "Privacy Concern Raised Over Search Service on Verizon Phones", "site_full": "www.crm-daily.com", "site": "crm-daily.com", "site_section": "http://crmdaily.com/share/rss_feed.php", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "news", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "CRM Daily", "url": "http://omgili.com/ri/jHIAmI4hxg_gp0Lxu81bkdjnT_HcX8mizutndVv8j35MFnBnewDI001EQ8u8oUroqI27998Ym.rCCWo7Q21KFA--", "published": "2017-04-03T08:00:00.000+03:00", "title": "Privacy Concern Raised Over Search Service on Verizon Phones", "uuid": "ce396fb58a71308a65d3bc134ec4f4068179aee5", "main_image": "http://www.crm-daily.com/images/super/larger-14-SECURITY-phones-lock2.jpg"}, "uuid": "ce396fb58a71308a65d3bc134ec4f4068179aee5", "ord_in_thread": 0}]