[{"rating": null, "external_links": [], "crawled": "2017-04-16T08:47:28.000+03:00", "author": "washingtonpost blogs", "entities": {"persons": [{"name": "michele sexton", "sentiment": "neutral"}, {"name": "ryan hogan", "sentiment": "none"}, {"name": "mueller", "sentiment": "none"}, {"name": "derrick smith", "sentiment": "none"}, {"name": "sexton", "sentiment": "none"}, {"name": "hogan", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "jess brandt", "sentiment": "none"}, {"name": "adam mueller", "sentiment": "none"}, {"name": "kyle andersen", "sentiment": "none"}, {"name": "birchbox", "sentiment": "none"}, {"name": "jo ­rothermal", "sentiment": "none"}, {"name": "brandt", "sentiment": "none"}, {"name": "— baltimore sun", "sentiment": "none"}, {"name": "henning", "sentiment": "none"}, {"name": "krystal henning", "sentiment": "none"}], "locations": [{"name": "harford county", "sentiment": "none"}, {"name": "mich.", "sentiment": "none"}, {"name": "perryville", "sentiment": "none"}, {"name": "frederick county", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}, {"name": "adamstown", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}, {"name": "camp ramblewood", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "baltimore", "sentiment": "none"}, {"name": "westland", "sentiment": "none"}, {"name": "hamilton", "sentiment": "none"}, {"name": "abbotsford", "sentiment": "none"}], "organizations": [{"name": "bel air", "sentiment": "none"}, {"name": "baltimore sun", "sentiment": "none"}, {"name": "towson university", "sentiment": "none"}, {"name": "investigation discovery", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "text": "April 15 After weeks of waiting, Michele Sexton finally receives the piece of mail she’s been waiting for.\nThe Perryville resident pulls out a large orange envelope filled with a crumbled paper ramekin, a map, a redacted news article.\nShe fumbles with a smaller already-opened envelope labeled “friend” and removes an eerie letter. It’s written by a serial killer-type, and this won’t be the last she hears from him.\nLuckily, it’s all just a game — and Sexton, 45, is just one of around 7,000 players of this monthly mystery subscription box.\nLaunched in October 2016 by Ryan Hogan and Derrick Smith, co-founders of Essex-based entertainment company Hunt a Killer, the mystery box program sends members monthly boxes that are carefully curated with an array of clues and a letter from a Hannibal Lecter-esque narrator. Each box plays into an indefinite story line, creating a community of “hunters” from across the world who hope to get to the bottom of the mystery.\nHogan, a Bel Air native who now resides in San Diego, compares the concept to a TV show, with the boxes acting as episodes that will eventually be categorized into “seasons” or chapters.\n“You’ve got television, you’ve got movies, you’ve got books — a few short mediums [and] ways to communicate to tell stories and absorb stories. We’re kind of reinventing the way of storytelling, and we’re telling it through touch and smell and actual physical items,” said Hogan, 32.\nThe membership program, which ranges from $25 to $30 per month, is an expansion of the Hunt a Killer company that Hogan and Smith launched last year. Hoping to capitalize on the growing interest in true-crime storytelling, interactive entertainment like escape rooms, and the fanfare surrounding projects such as the “Serial” podcast, Hunt a Killer hosted a live event at Camp Ramblewood in Darlington, where participants worked to solve a murder mystery.\nKnowing some people couldn’t make the event, Hogan and Smith began to brainstorm other ways to reach customers. They decided on a subscription-based box, joining companies like beauty product sample service Birchbox and snack curating company Graze that deliver products and experiences directly to their customers.\nSmith, 33, of Hamilton, thought of a plot line and enlisted Towson University graduate student Adam Mueller, 32, to be the senior writer behind the mystery boxes, which launched in mid-October. As of April, around 7,000 members from all over the world are playing the game, and more than 25,000 users are convening on the company’s private Facebook group, which acts as a place to trade tips and information and an introduction to many new “hunters.”\n“There’s a great community that you can build,” said Jo ­Rothermal of Abbotsford in British Columbia, Canada, a player who also created an online forum on the Hunt a Killer website for hunters to chat about their findings and experiences.\nRothermal, 47, said the game has been a great alternative to escape rooms, which is often more enjoyable with friends. Hunt a Killer’s mystery box can be done individually or with the aid of a group or the growing online community. Either way, the boxes are challenging, she said.\n“If you want a quick fix, something that you can cancel at any time, this is not for you. You have to be dedicated to it,” she said.\nSubscription members receive a boxed-set of clues from a fictional one-sided pen-pal, who sends photographs, maps, articles, investigative tools and other objects, many of which have links to the Baltimore area and real-life organizations and events. (A Baltimore Sun article about a Mount Vernon sinkhole is included in Box 1).\nEach box is just one part of an indefinite story that players have to piece together; meaning that, although there are payoffs, the mystery never ends, Hogan said. (He likened it to an ongoing television series.)\n“You could assume some crazy stuff if you look at what’s in the boxes,” said Sexton, of Perryville. “It tests your mental capabilities in a different way. It’s not just a clean, solve-this puzzle. You have to think.”\nKrystal Henning, an avid viewer of true-crime shows including “Cops” and the Investigation Discovery channel, said she has spent at least a few hours a night for about three weeks on the first two boxes. Now she’s awaiting the third.\n“There’s been quite a bit of ‘aha!’ moments. . . . My favorite part is being able to open the box with my kids. It’s a whole family moment of ‘Ooh, what did we get this month?’ They want to analyze everything,” said Henning, 32, of Adamstown in Frederick County.\nThe mastermind behind many of these boxes is Mueller, who said he conducts a lot of research before beginning to write, sometimes using codes.\n“I try to make sure we don’t repeat anything we’ve done before. There are themes that pop up again and again. . . . It forces us to think outside of the box,” Mueller said.\nAs far as channeling Hunt a Killer’s sinister narrator, “I kind of just get into a really dark place,” Mueller said. “All of the horror movies as a kid, anything that’s scared me growing up. . . . There’s a little bit of acting involved.”\nNeedless to say, the game is not for the faint of heart. Within the first month of launching the subscription box, on Oct. 26, Hogan said the company received a message from the Harford County sheriff’s office about an older woman who became frightened after receiving one of the boxes at her home. Harford County police spokesperson Kyle Andersen confirmed that the police responded to her home and took the box in for further investigation, only to later find that a relative sent the game as a gift.\nTo avoid such situations, Hogan said potential players have to apply online and are encouraged to join the Hunt a Killer’s official, private Facebook group, which has up to 500 people joining daily, to take a look around while the game organizers review their application, Hogan said.\n“It allows us to control growth . . . and the last thing we want is for people to join, have no idea what it is and when they have the first box, throw it out,” Hogan said.\nThe company, which employs 13 people, plans to expand the Hunt a Killer experience with a three-day live event in October, which will transform a 200-acre campground in Darlington into a live crime scene that immerses participants in an alternative reality. Around 3,400 people are expected to attend, he said. (The story line is separate but might show some parallels to the subscription boxes, Hogan said.)\nAnd for those who prefer to explore the mystery in bulk, the company has recently announced its premium one-time mystery box “Hunt a Killer 1934,” which is set in the 1930s. For now, it’s available only to current subscribers.\nJess Brandt of Westland, Mich., who is awaiting the sixth box, said while she probably won’t make it to the live event later this year, the game has and will continue to be a pastime for her, her friends and her family — especially during the bitter Michigan winter, when there isn’t much to do.\n“A lot of times we’ll meet up at a coffee shop, or someone’s house. It’ll be two to three weeks of going through everything to make sure we covered everything,” said Brandt, 31.\nFor her, it’s a gift that keeps on giving, she said — an experience that lasts longer than something like a dinner date or going to the movies.\n“It’s not all solvable in one box or episode. I can go back and . . . see if I missed anything. There’s still stuff in Episode 5 that I haven’t figured out,” Brandt said. “It’s probably one of the top things, as far as the value, that I’ve had in a while.”\n— Baltimore Sun", "url": "http://omgili.com/ri/.wHSUbtEfZQwU97HLU2a07uKU_WMx1OgKY0rWge.rra3ckGicTsMNAQlEBsMnYcJ5m5mYNMMrMqlwrI6Lv0GwECKJ2Yt4N6uIY7yPTuhV6mgHngut.YozfX2DdKpiDTeSGLGN6vCze5A2D4XegxlpoR8Ynd0m1PKhTLDTFxVej.OjnLxHQgo_B9ribrtRxeRMBFo_USl6hk5zazUJJZMWfSpbZwEOkNC", "highlightText": "", "highlightTitle": "", "published": "2017-04-15T03:00:00.000+03:00", "language": "english", "title": "Murder mystery subscription box challenges players to ‘Hunt a Killer’", "thread": {"title_full": "Murder mystery subscription box challenges players to ‘Hunt a Killer’ - The Washington Post", "site_full": "www.washingtonpost.com", "site": "washingtonpost.com", "site_section": "https://www.washingtonpost.com/local/", "performance_score": 0, "social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "facebook": {"likes": 23, "shares": 23, "comments": 0}, "linkedin": {"shares": 3}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.002, "domain_rank": 177, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Local - The Washington Post", "url": "http://omgili.com/ri/.wHSUbtEfZQwU97HLU2a07uKU_WMx1OgKY0rWge.rra3ckGicTsMNAQlEBsMnYcJ5m5mYNMMrMqlwrI6Lv0GwECKJ2Yt4N6uIY7yPTuhV6mgHngut.YozfX2DdKpiDTeSGLGN6vCze5A2D4XegxlpoR8Ynd0m1PKhTLDTFxVej.OjnLxHQgo_B9ribrtRxeRMBFo_USl6hk5zazUJJZMWfSpbZwEOkNC", "published": "2017-04-15T03:00:00.000+03:00", "title": "Murder mystery subscription box challenges players to ‘Hunt a Killer’", "uuid": "cea683f6e052ea5a25df2f707623f440f26d707c", "main_image": "https://images.washingtonpost.com/?url=https://img.washingtonpost.com/pb/resources/img/twp-social-share.png&amp;w=1484&amp;op=resize&amp;opt=1&amp;filter=antialias"}, "uuid": "cea683f6e052ea5a25df2f707623f440f26d707c", "ord_in_thread": 0}]