[{"uuid": "d198e8738cf0d6125ac9ecca8e4a693616cf5870", "url": "http://omgili.com/ri/WOapK6QZrmld9yBEEZ5rnxJAMBjYit2uOmpr9Jqdxoq4ZiI6Ii2qu1bD7HYlsnOpRqyaZuxN92L4CDWKwaaLYBbFWY7VIlMi.obVkLWrXf1jVzGBRnwBgOkCQasTbhc3VGRLizEKav5X3uIMEh8zoA--", "title": "The Latest: Man Sought In Cleveland Facebook Killing Is Dead", "author": "Review Times", "rating": null, "published": "2017-04-18T23:24:52.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "cleveland facebook", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "pennsylvania state police", "sentiment": "none"}, {"name": "cleveland.com", "sentiment": "none"}, {"name": "u.s. marshal", "sentiment": "none"}], "locations": [{"name": "cleveland", "sentiment": "none"}, {"name": "willoughby", "sentiment": "none"}, {"name": "sherwin shooting sports", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "erie county", "sentiment": "none"}], "persons": [{"name": "blake frederick", "sentiment": "none"}, {"name": "frederick", "sentiment": "none"}, {"name": "steve stephens", "sentiment": "none"}, {"name": "stephens", "sentiment": "none"}, {"name": "stephen", "sentiment": "none"}, {"name": "calvin williams", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "d198e8738cf0d6125ac9ecca8e4a693616cf5870", "url": "http://omgili.com/ri/WOapK6QZrmld9yBEEZ5rnxJAMBjYit2uOmpr9Jqdxoq4ZiI6Ii2qu1bD7HYlsnOpRqyaZuxN92L4CDWKwaaLYBbFWY7VIlMi.obVkLWrXf1jVzGBRnwBgOkCQasTbhc3VGRLizEKav5X3uIMEh8zoA--", "site_full": "reviewtimes.com", "title": "The Latest: Man Sought In Cleveland Facebook Killing Is Dead", "site_section": "http://reviewtimes.com/feed", "domain_rank": null, "published": "2017-04-18T23:24:52.000+03:00", "title_full": "The Latest: Man Sought In Cleveland Facebook Killing Is Dead", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "Review Times", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://reviewtimes.com/wp-content/uploads/2016/12/mann.jpg", "site": "reviewtimes.com"}, "external_links": [], "language": "english", "text": "CLEVELAND (AP) — The Latest on a fatal shooting captured on video and later shared on Facebook (all times local): \n11:55 a.m. \nPennsylvania State Police say the suspect in the random killing of a Cleveland retiree posted on Facebook has shot and killed himself after a brief pursuit. \nState police say Steve Stephens was spotted Tuesday morning by state police in Erie County, in the state’s northwest corner. Authorities say police tried to pull Stephens over and, after a brief pursuit, he shot and killed himself. \nStephens was wanted on an aggravated murder charge in the shooting death of a 74-year-old retired man in Cleveland on Sunday. \nHe posted video of that shooting on Facebook. \n___ \n10 a.m. \nAuthorities in Cleveland leading a nationwide search for a man wanted in a random killing that was recorded and posted to Facebook are again appealing to the public for help. \nCleveland’s police chief said Tuesday they’ve received more than 400 tips from as far away as Texas, but so far they’ve been unable to narrow down the manhunt. \nThe search for 37-year-old Steve Stephens is entering its third day. He’s wanted on an aggravated murder charge in the shooting death of a 74-year-old retired man in Cleveland on Sunday. \nPolice Chief Calvin Williams says anyone who thinks they’ve seen Stephens should call 911. \nThe head of the U.S. Marshal’s office in Cleveland says he’s confident Stephens will be found. But he says these searches can take days, weeks or even longer. \n___ \n7:15 a.m. \nA gun range owner says the suspect in a random Cleveland killing that was recorded and posted to Facebook had shot at his facility, and video shows he was warned for breaking rules by practicing “rapid fire.” \nOwner Blake Frederick says suspect Steve Stephens visited Sherwin Shooting Sports within the past year. Frederick tells Cleveland.com he recalls Stephens as nice and jovial, not negative. \nWEWS-TV reports that a video Stephens posted to Facebook last year showed him rapidly firing at targets at the range in Willoughby and being warned to stop by an employee. \nPolice say the 37-year-old Stephens had a permit to carry a concealed weapon. \nThe multistate manhunt for him stretched into a third day Tuesday. He’s wanted on an aggravated murder charge in the Sunday shooting death of a 74-year-old retiree. \n___ \n1 a.m. \nA multistate manhunt for the suspect in a random killing that Cleveland police say he recorded and posted to Facebook is entering its third day. \nAuthorities say it’s now a nationwide search for 37-year-old Steve Stephens, who’s wanted on an aggravated murder charge in the shooting death of a 74-year-old retired man in Cleveland on Sunday. \nVideos Stephens shared show him talking about his despair over gambling debts and trouble with his girlfriend. \nOn Monday evening, Facebook announced that it was launching a review for reporting harmful content following the killing. The company says it disabled Stephen’s account within 23 minutes of receiving the first report about the video of the fatal shooting and two hours after receiving any report. Facebook says, “we know we need to do better.”", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:52.000+03:00"}]