[{"entities": {"locations": [{"name": "iran", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "vienna", "sentiment": "none"}, {"name": "vienna international center", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "islamic republic", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}, {"name": "yemen", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "hezbollah", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "joint comprehensive plan of action", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. department of state", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}, {"name": "defense", "sentiment": "none"}], "persons": [{"name": "trump", "sentiment": "negative"}, {"name": "tillerson", "sentiment": "none"}, {"name": "ryan", "sentiment": "none"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "lesley wroughton", "sentiment": "none"}, {"name": "donald j. trump", "sentiment": "none"}, {"name": "simon cameron-moore", "sentiment": "none"}, {"name": "james mattis", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.channelnewsasia.com", "site_section": "http://www.channelnewsasia.com/flipboard.xml", "domain_rank": 6036, "replies_count": 0, "country": "US", "section_title": "Channel NewsAsia", "title": "US says Iran complies with nuke deal but orders review on lifting sanctions", "title_full": "US says Iran complies with nuke deal but orders review on lifting sanctions", "published": "2017-04-19T08:39:42.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg90XV3OsZ1yecjVXH0razWUF0fjqN7wiOIjSOos.Ei0XAAjWsxPZVyA7CHoYhoknHPWzrybglAl.ARSDi6Ph7.clcsBJ0EsTMKJNFs7u_kLQeXUiPkXmChebrso8aY7a2wHcHw4TZaIs8YA600Q7bKo", "site": "channelnewsasia.com", "main_image": "http://www.channelnewsasia.com/image/3688730/1492571419000/large16x9/640/360/file-photo-a-staff-member-removes-the-iranian-flag-from-the.jpg", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 0, "performance_score": 0, "spam_score": 0.0, "uuid": "d23a467cd25c2d5b30accc3eee946bdb7d99f0d9", "site_type": "news"}, "title": "US says Iran complies with nuke deal but orders review on lifting sanctions", "published": "2017-04-19T08:39:42.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg90XV3OsZ1yecjVXH0razWUF0fjqN7wiOIjSOos.Ei0XAAjWsxPZVyA7CHoYhoknHPWzrybglAl.ARSDi6Ph7.clcsBJ0EsTMKJNFs7u_kLQeXUiPkXmChebrso8aY7a2wHcHw4TZaIs8YA600Q7bKo", "author": "", "crawled": "2017-04-19T08:39:42.000+03:00", "language": "english", "text": "World US says Iran complies with nuke deal but orders review on lifting sanctions The Trump administration said on Tuesday it was launching an inter-agency review of whether the lifting of sanctions against Iran was in the United States' national security interests, while acknowledging that Tehran was complying with a deal to rein in its nuclear programme. Posted 19 Apr 2017 11:10 Updated 19 Apr 2017 13:10 FILE PHOTO - A staff member removes the Iranian flag from the stage after a group picture with foreign ministers and representatives during the Iran nuclear talks at the Vienna International Center in Vienna A \nWASHINGTON: The Trump administration said on Tuesday it was launching an inter-agency review of whether the lifting of sanctions against Iran was in the United States' national security interests, while acknowledging that Tehran was complying with a deal to rein in its nuclear programme. \nIn a letter to U.S. House of Representatives Speaker Paul Ryan, the top Republican in Congress, on Tuesday U.S. Secretary of State Rex Tillerson said Iran remained compliant with the 2015 deal, but said there were concerns about its role as a state sponsor of terrorism. \nUnder the deal, the State Department must notify Congress every 90 days on Iran's compliance under the so-called Joint Comprehensive Plan of Action (JCPOA). It is the first such notification under U.S. President Donald Trump. \n\"The U.S. Department of State certified to U.S. House Speaker Paul Ryan today that Iran is compliant through April 18 with its commitments under the Joint Comprehensive Plan of Action,\" Tillerson said in a statement. \n\"President Donald J. Trump has directed a National Security Council-led interagency review of the Joint Comprehensive Plan of Action that will evaluate whether suspension of sanctions related to Iran pursuant to the JCPOA is vital to the national security interests of the United States,\" Tillerson added. \nHe did not say how long the review would take but said in the letter to Ryan that the administration looked forward to working with Congress on the issue. \nDuring his presidential campaign, Trump called the agreement \"the worst deal ever negotiated,\" raising questions over whether he would rip up the agreement once he took office. \nThe historic deal between Iran and six major powers restricts Tehran's nuclear programme in exchange for the lifting of international oil and financial sanctions against the Islamic Republic. \nIran denies ever having considered developing atomic weapons although nuclear experts have warned that any U.S. violation of the nuclear deal would allow Iran also to pull back from its commitments to curb nuclear development. \nThose commitments include reducing the number of its centrifuges by two-thirds, capping its level of uranium enrichment well below the level needed for bomb-grade material, reducing its enriched uranium stockpile from around 10,000 kg to 300 kg for 15 years, and submitting to international inspections to verify its compliance. \nLast month Trump's Defense Secretary James Mattis said Iran continued to behave as an exporter of terrorism and still sponsors militant activity. \nThe United States has long accused Iran of being the world's biggest state sponsor of terrorism, saying Tehran supported conflicts in Syria, Iraq and Yemen, and backed groups such as Hezbollah, its Lebanon-based ally. \n(Reporting by Lesley Wroughton; Editing by Simon Cameron-Moore) - Reuters", "external_links": [], "highlightTitle": "", "uuid": "d23a467cd25c2d5b30accc3eee946bdb7d99f0d9", "highlightText": "", "rating": null}]