[{"uuid": "d32590f3889e0da8a562b2ac871669ee0d59ce5c", "url": "http://omgili.com/ri/jHIAmI4hxg_ZZEJxw_HVLIVMnaJd1bQMlnaaNDSg36OZw3qbPZovHAwus7Ke6ke_0bq.iuxAzrDMQR1OJhHtQgVLP5yP16QghOQo5JLWRGOYSpT73w3BPyQGWuDqis418P.JpddZI_WS1bt.ONWRSWbb3VbR.1kSCpKcp5HNiLA-", "title": "Weight Watchers Announces First Quarter 2017 Earnings Conference Call", "author": "", "rating": null, "published": "2017-04-18T23:24:05.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "united states securities and exchange commission", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "interim office of the chief executive officer", "sentiment": "none"}, {"name": "edgar", "sentiment": "none"}, {"name": "weight watchers international, inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "about weight watchers international, inc", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}], "persons": []}, "highlightTitle": "", "thread": {"uuid": "d32590f3889e0da8a562b2ac871669ee0d59ce5c", "url": "http://omgili.com/ri/jHIAmI4hxg_ZZEJxw_HVLIVMnaJd1bQMlnaaNDSg36OZw3qbPZovHAwus7Ke6ke_0bq.iuxAzrDMQR1OJhHtQgVLP5yP16QghOQo5JLWRGOYSpT73w3BPyQGWuDqis418P.JpddZI_WS1bt.ONWRSWbb3VbR.1kSCpKcp5HNiLA-", "site_full": "www.prnewswire.com", "title": "Weight Watchers Announces First Quarter 2017 Earnings Conference Call", "site_section": "http://www.prnewswire.com/rss/rss/usa/kansas-news.rss", "domain_rank": 3190, "published": "2017-04-18T23:24:05.000+03:00", "title_full": "Weight Watchers Announces First Quarter 2017 Earnings Conference Call", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "PR Newswire:", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://content.prnewswire.com/images/prn_facebook_sharing_logo.jpg  ", "site": "prnewswire.com"}, "external_links": [], "language": "english", "text": "NEW YORK - Weight Watchers International, Inc. (NYSE: WTW ) will release its results for the first quarter 2017 after the NYSE closes on Tuesday, May 2, 2017 .\nThe Company has also scheduled a conference call on May 2 at 5:00 p.m. ET . During the conference call, the members of the Interim Office of the Chief Executive Officer will discuss the first quarter 2017 results and answer questions from the investment community.\nLive audio of the conference call will be simultaneously webcast over the Internet on the Company's corporate website, www.weightwatchersinternational.com . A replay of the webcast will be available on this site for approximately 90 days.\nAbout Weight Watchers International, Inc.\nWeight Watchers International, Inc. is one of the most recognized and trusted brand names among weight-conscious consumers. Weight Watchers provides commercial weight management services through a global network of Company-owned and franchise operations and offers innovative, digital weight management products through its websites, mobile sites and apps. These services and products are built on the Company's weight management program, which helps millions of people around the world lose weight through sensible and sustainable food plans, activity, behavior modification and group support. Weight Watchers has an unparalleled network of service providers to assist members on their journey and also offers a wide range of products, publications and programs for those interested in weight loss and healthier living.\nThis news release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on management's current expectations and beliefs, as well as a number of assumptions concerning future events. These statements are subject to risks, uncertainties, assumptions and other important factors. Readers are cautioned not to put undue reliance on such forward-looking statements because actual results may vary materially from those expressed or implied. The reports filed by the Company pursuant to United States securities laws contain discussions of these risks and uncertainties. The Company assumes no obligation to, and expressly disclaims any obligation to, update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Readers are advised to review the Company's filings with the United States Securities and Exchange Commission (which are available from the SEC's EDGAR database at www.sec.gov , at various SEC reference facilities in the United States and via the Company's website at www.weightwatchersinternational.com ).\nContact Information:\nInvestors:\nBrainerd Communicators, Inc.\nCorey Kinger\n(212) 986-6667\nkinger@braincomm.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/weight-watchers-announces-first-quarter-2017-earnings-conference-call-300441032.html\nSOURCE Weight Watchers International, Inc.\nRelated Links\nhttp://www.weightwatchersinternational.com", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:05.000+03:00"}]