[{"entities": {"organizations": [], "locations": [], "persons": []}, "uuid": "d353af1afb7de98fb2e45661760c11fc6e2b7e58", "highlightText": "", "title": "A Month of Islam and Multiculturalism in Britain: March 2017 by Soeren Kern", "thread": {"site": "ruthfullyyours.com", "country": "US", "participants_count": 1, "site_full": "www.ruthfullyyours.com", "section_title": "RUTHFULLY YOURS", "uuid": "d353af1afb7de98fb2e45661760c11fc6e2b7e58", "site_section": "http://www.ruthfullyyours.com/feed/", "domain_rank": null, "main_image": "", "performance_score": 0, "published": "2017-04-16T18:37:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9I33IPmfauMvvshfP4_rLVOUSWB4yPtQWoak.TQJoxh6RxyBi_nmPHHsaWgVPGhllvPYX_2Chevrgp2aN7CfMqJAyvazu5suHlHqQD24jnQUdY5ONYbuvBsNOtEzg9h6_AL26m7fGg.aKRZh8dA1OK", "title_full": "A Month of Islam and Multiculturalism in Britain: March 2017 by Soeren Kern", "title": "A Month of Islam and Multiculturalism in Britain: March 2017 by Soeren Kern", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T18:37:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9I33IPmfauMvvshfP4_rLVOUSWB4yPtQWoak.TQJoxh6RxyBi_nmPHHsaWgVPGhllvPYX_2Chevrgp2aN7CfMqJAyvazu5suHlHqQD24jnQUdY5ONYbuvBsNOtEzg9h6_AL26m7fGg.aKRZh8dA1OK", "ord_in_thread": 0, "crawled": "2017-04-16T22:40:20.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Ruth King", "text": "A Month of Islam and Multiculturalism in Britain: March 2017 by Soeren Kern Posted By Ruth King on April 16th, 2017 \nhttps://www.gatestoneinstitute.org/10215/islam-multiculturalism-britain-march “Have you seen some of those ISIS propaganda videos, they are cut like action movies. Where is the counter narrative?” — Riz Ahmed, actor. Britain’s foreign aid budget is reportedly funding at least two dozen Palestinian schools, some of which are named after terrorists and murderers and which openly promote terrorism and encourage pupils to see child killers as role models. An estimated 400 home-grown jihadis have returned to the United Kingdom after fighting in Syria, but only 54 of those have been prosecuted, according to a Mail on Sunday investigation, which also discovered that some returned jihadis are roaming free on the streets of Britain. \nMarch 1. A new Channel 4 documentary series called “ Extremely British Muslims ” showed the inner workings of a sharia court inside Birmingham’s Central Mosque. In the first episode, viewers witnessed the case of mother-of-four Fatima, 33, as she sought permission to divorce her drug dealer husband she says has abused her throughout their 14-year marriage. According to sharia law, Muslim women must plead their divorce cases in court, while Muslim men need only to say the words “I divorce you” three times to obtain a divorce. Birmingham Central Mosque said it allowed the sharia proceedings to be filmed in an effort to “break down misconceptions about Islam.” Some 100 sharia courts in Britain are now dispensing Islamic justice outside the remit of the British legal system. \nMarch 2. English actor Riz Ahmed warned that the lack of Muslim faces on British television was alienating young people, driving them towards extremism and into the arms of the Islamic State. Delivering Channel 4’s annual diversity lecture in Parliament, Ahmed said that television had a pivotal role to play in ensuring that Muslims felt heard, and valued, in British society: \n“If we fail to represent, we are in danger of losing people to extremism. In the mind of the ISIS recruit, he’s the next James Bond right? Have you seen some of those ISIS propaganda videos, they are cut like action movies. Where is the counter narrative? Where are we telling these kids they can be heroes in our stories — that they are valued? If we don’t step up and tell a representative story we are going to start losing British teenagers to the story that the next chapter in their lives is written with ISIS in Syria.” \nMarch 3. The Amateur Swimming Association changed its swimsuit regulations to allow Muslim women to wear full body outfits, after a request from the Muslim Women’s Sport Foundation. The rule was changed to encourage more Muslim women to take part in the sport. Rimla Akhtar, from the Muslim Women’s Sport Foundation, said: \n“Participation in sport amongst Muslim women is increasing at a rapid pace. It is imperative that governing bodies adapt and tailor their offerings to suit the changing landscape of sport, including those who access their sport.” \nMarch 4. Ryan Counsell, 28, a jihadist from Nottingham who left his wife and two small children to fight with the Abu Sayyaf Islamist group in the Philippines, blamed his behavior on the Brexit vote. He told the Woolwich Crown Court that increased tension within the local Muslim community after Brexit sparked his decision to leave. He said that he wanted to escape Britain’s political climate and seek an “idyllic life” under sharia law. He was arrested at Stansted airport in July 2016 and was later sentenced to eight years in prison. \nMarch 5. Homegrown terrorism inspired by the Islamic State poses the dominant threat to the national security of the United Kingdom, according to a comprehensive new report on violent Islamism in Britain. The 1,000-page report — “Islamist Terrorism: Analysis of Offenses and Attacks in the UK (1998–2015)” — was published by the Henry Jackson Society, a foreign policy think tank based in London. \nThe report found that number of Islamism-related offenses (IROs) in Britain doubled between 2011 and 2015 from 12 to 23 a year. More than half (52%) of IROs were committed by individuals of South Asian ancestry: British-Pakistanis (25%) and British-Bangladeshis (8%). Other offenders had family ties to countries in Africa, the Middle East and the Caribbean. Forty-seven percent of IROs were committed by individuals born in the UK. \nThe also report showed a clear link between terrorism and growing up in Muslim-dominated neighborhoods. London was the place of residence of 43% of IROs, followed by West Midlands, with 18%. Of the latter, 80% of IROs were in Birmingham. The third most common region was North West England, with 10% of IROs. Together, these three regions contained the residences in almost three-quarters (72%) of cases. East London was home to half (50%) the London-based offenders, while the three most common boroughs — Tower Hamlets, Newham and Waltham Forest — contained the residence of offenders’ in 38% of all London IROs (and 16% overall). \nMarch 6. British security services have prevented 13 potential terror attacks since June 2013, according to Assistant Commissioner Mark Rowley, the UK’s most senior counter-terrorism police officer. He also said that there were 500 live counter-terror investigations at any given time, and that investigators have been arresting terror suspects at a rate of close to one a day since 2014. The official threat level for international terrorism in the UK has stood at severe — meaning an attack is “highly likely” — for more than two years. \nMarch 7. The National Health Service (NHS) revealed that there were 2,332 new cases of female genital mutilation (FGM) in Britain between October and December 2016. That brought the total of new cases in 2016 to nearly 5,500. \nMarch 7. The managers of the cash-strapped Sandwell General Hospital near Birmingham are considering the construction of a special kitchen for preparing halal meals for Muslim patients and staff. The move follows complaints about the quality of halal meals that the hospital has outsourced to local vendors. A spokesman said: “We are still reviewing options around creating a separate halal kitchen and the best ways to provide a range of healthy halal options to patients and staff who want them.” \nMarch 10. The BBC announced that it would begin outsourcing production of Songs of Praise, a Sunday worship program that has been produced in-house for 55 years. Critics of the move said they feared that Songs of Praise will lose its Christian focus in favor of Islam. Anglican priest Lynda Rose said a recent Songs of Praise episode featuring a segment about the Muslim faith, including Church of England children visiting a mosque, exemplified the “Islamization of the BBC.” More than 6,000 people have signed an online petition calling for MPs to investigate the BBC after it appointed Fatima Salaria as the BBC’s head of religious programming — the second Muslim in a row to hold the post. \nMarch 11. Britain’s foreign aid budget is reportedly funding at least two dozen Palestinian schools, some of which are named after terrorists and murderers and which openly promote terrorism and encourage pupils to see child killers as role models. A Mail on Sunday investigation found pictures of “martyrs” posted on school walls, revolutionary slogans and symbols painted on premises used by youngsters, sports events named after teenage terrorists and children encouraged to act out shooting Israeli soldiers in plays. \nHead teachers openly admitted to flouting attempts by British and European donors to control the curriculum at schools. They reportedly print overtly political study aids for pupils, some even denying the existence of Israel, while teachers boast of encouraging pupils to emulate teenage “martyrs” killed in terrorist attacks in the region. \nOne senior teacher from a prominent West Bank school, when asked what he would say to a pupil threatening to attack Israelis, said: “I would tell them go in the name of Allah.” \nMarch 11. Islamic preachers may be asked to begin delivering their sermons in English under measures being prepared to rid Britain of hate preaching. The Telegraph reported that the government’s counter-extremism taskforce is working on the plans amid concern that preaching in foreign languages enforces divisions between Islam and mainstream British society and can foster radicalization. \nMarch 12. An Islamic bookstore in Alum Rock, a predominately Muslim suburb of Birmingham that has produced 10% of all of Britain’s convicted terrorists, was found to be openly selling books promoting jihad. The Sunday Express visited the Madina Book Centre and bought a copy of the 440-page “Bringing up Children in Islam” for £5 ($6). The book encourages parents to “keep alive in the children the spirit of jihad.” It says: \n“They [your children] may be inspired to strive for the restoration of the glory of Islam and Muslims. Jihad of warfare is where all humans spend their energies to stop a tyrant from being oppressive, for example when a tyrant makes it difficult for people to fulfill the commands of Allah to propagate Islam. \n“Tyrants must be subdued whether they rule in an Islamic or non-Islamic land, or whether they are on a battlefield. \n“It is the duty of Muslims to divert people from worshipping created things to the worship of the Almighty Allah alone.” \nThe book also rails against cinema and theater, arguing they are the work of “evil-minded” Jews, and warns of a Jewish conspiracy to take over the world. The book supports adulterers being stoned to death and Muslim schoolchildren being kept separate from others: “Education under unbelieving and atheist teachers results in them going astray. Dangerous, communistic and materialistic ideas grow in their minds.” \nMarch 14. A father who describes himself as “Anglo-Saxon” lost a legal battle to prevent his Muslim ex-wife from sending their 10-year-old son to an Islamic secondary school. The man, who was not named for legal reasons, said he wanted to prevent his son from attending a “school inside a mosque” on the grounds that he would be “marginalized” by his son if he enrolled at the London-based school. The man’s lawyer said that the mother and father had “different world views” and that it was client’s wish that his son be educated in a “neutral” environment. The man and his ex-wife, both in their 40s, had divorced more than three years ago following a nine-year marriage. The man had converted to Islam but renounced his faith following the separation. The lawyer argued that the boy’s Muslim faith could be adequately catered for at a secular school. A High Court judge dismissed the man’s appeal on the grounds that an earlier ruling made by a judge at a family court — that the man would not be marginalized by his son — was correct. \nMarch 15. Lawyers warned that a landmark ruling by the European Court of Justice (ECJ), which allows employers to ban staff from wearing Islamic headscarves at work under certain conditions, will not automatically apply in Britain. The ECJ ruled that prohibiting the visible wearing of any political, philosophical or religious sign does not constitute direct discrimination. The judgment was delivered in cases brought by two employees, one in Belgium and one in France, who were dismissed for refusing to remove headscarves. Lawyers said that British companies adopting the ban could easily be sued for discrimination. The Muslim Council of Britain, the country’s largest Islamic organization, condemned the ruling: \n“At a time when populism and bigotry are at an all-time high, we fear that this ruling will serve as a green light to those wishing to normalize discrimination against faith communities. Many will be worried that this action will prevent Muslim women who choose to wear the scarf from securing jobs. And it sends a message that we cannot accept a plural society that recognizes and celebrates religious differences.” \nPrime Minister Theresa May said that the government should not tell women what to wear: \n“We have a strong tradition in this country of freedom of expression, and it is the right of all women to choose how they dress and we don’t intend to legislate on this issue. There will be times when it is right for a veil to be asked to be removed, such as border security or perhaps in courts, and individual institutions can make their own policies, but it is not for government to tell women what they can and can’t wear.” \nMarch 17. The former owners of a bookstore in Bradford apologized after copies of the Koran and other Islamic literature were found in a garbage dumpster outside the store. Police were called to the store after a group of Muslim males began shouting at and abusing staff. The imbroglio began after the bookstore’s 80-year-old owner decided to close down his business, and the new owners gave him a month to move out the stock, which included a number of Korans and other Islamic books. A spokesman for the bookstore said: \n“It has come to our attention that some Islamic materials were found in a skip [garbage dumpster] next to Book Centre. While the Book Centre site is being cleared, no Islamic material of any sort was purposefully disposed of. A small workforce was instructed to clear two storerooms from which some material made its way into the skip. This is wrong, unacceptable and a genuine mistake. The skip will be looked at as a matter of urgency and any materials removed.” \nA spokesman for Baker Reign Solicitors, which represents the new owners, said: \n“Should our client have been aware that the previous owner would have sought to dispose of the Holy Koran and other books in this manner, they would have assisted in distributing the books to various mosques throughout the city. \n“Our client now hopes that the previous owner takes a more responsible course of action by distributing the books to those less fortunate and in need of Islamic guidance.” \nMarch 17. Zameer Ghumra, a 37-year-old Leicester pharmacist accused of showing a beheading video to two young children, was released on bail until his trial begins at Nottingham Crown Court on September 25. He has been charged with distributing terrorist publications under section two of the Terrorism Act 2006. \nMarch 18. The BBC apologized after a tweet from the BBC Asian Network account asked, “What is the right punishment for blasphemy?” The tweet provoked criticism that the BBC appeared to be endorsing harsh restrictions on speech. In an apology posted on Twitter, the network said it had intended to debate concerns about blasphemy on social media in Pakistan. “We never intended to imply that blasphemy should be punished,” it said. On March 18, the British taxpayer-funded BBC Asian Network account asked, “What is the right punishment for blasphemy?” \nMarch 19. A British jihadist reportedly used social welfare payments to move his family to Syria to join the Islamic State. Shahan Choudhury, 30, who was radicalized at Belmarsh Prison while serving an 18-month sentence for allegedly stabbing to death a 17-year-old hospital worker over an alleged £15 ($18) drug debt, vanished from his apartment in London and has since used social media to urge other British Muslims to carry out terror attacks in the UK. \nMarch 20. Mohammed Karamat, 45, an imam at a mosque in Coventry who assaulted four children as young as nine, was spared jail time. Magistrates watched footage of Karamat twisting a child’s arm, slapping a child, and using a pen to stab a child and pricking a child’s hand with the lid of a pen. He was filmed attacking the children during a six-day period. Karamat, who admitted to four counts of assault by beating, was ordered to do 100 hours unpaid work. \nMarch 21. Minister for Higher Education, Jo Johnson, ordered British universities to include a clear commitment to freedom of speech in their governance documents to counter the culture of censorship and so-called safe spaces. In a letter, Johnson wrote that it was the “legal duty” of universities to ensure as far as practicable that freedom of speech is secured for “members, students, employees and visiting speakers.” This meant that all university premises should not be “denied to any individual or body on any grounds connected with their beliefs or views, policy or objective.” \nMarch 22. Khalid Masood, 52, drove a car at pedestrians on London’s Westminster Bridge and, armed with two knives, stormed the parliamentary estate. He killed five people and injured more than 50 before he was shot dead by police. Masood, a convert to Islam, was born in Kent as Adrian Elms. During his school years, he used his stepfather’s surname, Adrian Russell Ajao. A former English tutor, he was unemployed at the time of the attack and had been living on social welfare benefits. Masood, who had a history of criminality — he had previous convictions for assaults, including grievous bodily harm, possession of offensive weapons and public order offences — was reportedly radicalized in prison. \nMarch 23. A total of 29 people were charged after girls as young as 11 were raped and sexually abused in Huddersfield. West Yorkshire Police said the 27 men and two women men face numerous offences including rape, trafficking with intent to engage in sexual exploitation, sexual activity with a child, child neglect, child abduction, supply of Class A drugs and the possession and making of indecent images of children. They are accused of committing the crimes against 18 girls in Huddersfield when they were aged between 11 and 17, between 2004 and 2011. \nMarch 23. The Islamic State claimed responsibility for the Westminster attack. “The perpetrator of the attacks yesterday in front of the British parliament in London is an Islamic State soldier and he carried out the operation in response to calls to target citizens of the coalition,” the group’s Amaq news agency said in a statement. \nMarch 23. Prime Minister Theresa May said that it would be “wrong” to describe the jihadist attack on Westminster Bridge and Parliament as “Islamic terrorism.” Instead, she said, it should be referred to as “Islamist terrorism” and “a perversion of a great faith.” \nMarch 25. Mark Ashdown, a childhood friend of Westminster terrorist Khalid Masood, described how Masood had completely changed after prison, where he converted to Islam. Ashdown said : \n“When he first came out he told me he’d become a Muslim in prison and I thought he was joking. Then I saw he was quieter and much more serious. I gave him some cash-in-hand work for a few months as a laborer. He said he needed time to pray and read the Koran — something about finding inner peace. I heard he’d split from his partner and got even more deeply into religion.” \nMarch 25. Police investigating the Westminster attack concluded that Khalid Masood acted entirely alone for reasons that may never be known. “We must all accept that there is a possibility we will never understand why he did this,” deputy assistant Metropolitan police commissioner Neil Basu said. “That understanding may have died with him.” Meanwhile, British security services reportedly do not like the term “lone wolf” because they feel it glamorizes an attacker. They prefer using “lone actor” instead. \nMarch 25. An estimated 400 home-grown jihadis have returned to the United Kingdom after fighting in Syria, but only 54 of those have been prosecuted, according to a Mail on Sunday investigation, which also discovered that some returned jihadis are roaming free on the streets of Britain. \nMarch 28. Kevin Lane, a convicted murderer who spent 20 years in British prisons, including HMP Woodhill and HMP Frankland, told the BBC that he saw many inmates pressured to convert to Islam and carry out attacks on other prisoners. “I have seen many attacks within the prison system,” he said. “One man boiled fat and poured it over someone’s head because of an insult to Islam.” A spokesman for the Ministry of Justice said: “The allegations put forward by the former prisoner are historic.” \nMarch 29. The BBC tried to downplay Westminster attacker Khalid Masood’s ties to radical Islam by airing an interview with a former employer of Massood. The man, identified only as Farasat, was a manager at an English language school where Massood worked between 2010 and 2012: The interview follows: \nQ: Who was the man that you knew? \nA: As a teacher, a very professional man. He was an excellent teacher. He got on well with his non-Muslim colleagues. A very friendly, stable kind of guy, really. He was not interested in the politicized version of Islam. He had no contact with any of the extremist groups. He was more a practicing Muslim who was committed to his faith, committed to his family and was focused on his career. I don’t think he was influenced by extremist groups at all…. In fact, I’d go as far to say that he was the antithesis of a violent radical. \nMasood was, in fact, known to police and security services and had once been investigated by MI5 over concerns about violent extremism. \nMarch 30. Acting Metropolitan Police Commissioner Craig Mackey said there was a slight increase in “Islamophobic incidents” following the Westminster terror attack. Breitbart London reported : “The statement which New Scotland Yard sent along with its figures suggests the rise may not be due to a genuine increase in Islamophobia, but could instead be due to a ‘community engagement plan’ which sees the authorities actively encourage Muslims to come forward with allegations following what they describe as ‘trigger events.'” The Met, the police service for the Greater London area, now employs 900 specialists focused on monitoring so-called Islamophobia. \nMarch 31. A new biography of Prince Charles revealed that the heir to the British throne tried to halt the U.S. invasion of Afghanistan to “honor” Ramadan. He made the plea in an “urgent call” to William Farish, the American ambassador to London, four weeks into the huge military operation launched after the 9/11 terror attacks. Farish recalled: “Prince Charles asked me if it would be possible to stop the invasion to honor Ramadan, and if I could convey that request to President Bush.” The ambassador replied that it would be difficult to halt a military invasion already in full swing, but the prince allegedly protested: “But Americans can do anything!” Farish asked: “Sir, are you really serious?” Prince Charles replied: “Yes I am.” \nSoeren Kern is a Senior Fellow at the New York-based Gatestone Institute . Follow Soeren Kern on Twitter and Facebook"}]