[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:45:19.000+03:00", "author": "CBS San Francisco", "entities": {"persons": [{"name": "milo yiannopoulos", "sentiment": "none"}, {"name": "tom marcianno", "sentiment": "none"}], "locations": [{"name": "berkeley", "sentiment": "none"}, {"name": "berkeley", "sentiment": "none"}, {"name": "berkeley’s civic center park", "sentiment": "none"}, {"name": "fremont", "sentiment": "none"}], "organizations": [{"name": "pro-trump rally in liberal berkeley were ‘proud boys’ organizers of pro-trump rally in liberal berkeley were ‘proud boys", "sentiment": "neutral"}, {"name": "cbs sf", "sentiment": "none"}, {"name": "proud boys", "sentiment": "none"}, {"name": "the proud boys", "sentiment": "none"}, {"name": "kpix", "sentiment": "none"}, {"name": "uc berkeley", "sentiment": "none"}]}, "text": "Organizers Of Pro-Trump Rally In Liberal Berkeley Were ‘Proud Boys’ April 15, 2017 8:19 PM Filed Under: Berkeley , Counter-Demonstration , Pro-Trump , Protest , Proud Boys \nBERKELEY (CBS SF) — A pro-Trump group known as the Proud Boys sponsored the protest that descended into bloody violence at Berkeley’s Civic Center Park on Saturday. They say they have a right to bring their views to liberal Berkeley. \nAccording to the description on their Facebook page , “The Proud Boys are a fraternal organization founded on a system of beliefs and values of minimal government, maximum freedom, anti-political correctness, anti-racial guilt, pro-gun rights, anti-Drug War, closed borders, anti-masturbation, venerating entrepreneurs, venerating housewives, and reinstating a spirit of Western chauvinism during an age of globalism and multiculturalism.” \nSaturday’s melee in Berkeley, was similar to recent clashes between left and right-wing factions in the recent past. There is almost a script to how these rallies and counter-protests go in Berkeley. \nKPIX 5 asked Tom Marcianno of Fremont, who took part in Saturday’s rally, if his group was intentionally trying to provoke a reaction by bringing a pro-Trump message and gathering to the heart of liberal Berkeley. \nQ: Coming to Berkeley, isn’t that like poking the bear? \nA: Well, it is in a way, but, we’re not doing it to be gleeful about it or to deliberately upset people who are against us. We have every right to be here. \nQ: But you are going to upset people by your presence. \nA: But, that’s their problem. They seem to be upset about a lot of things that are completely irrational. We don’t have an answer for that. If they want to hold a rally where I’m from, they’re welcome to do it. There might be a counter demonstration But, we’re not going to stop them from exercising their freedom of speech. \nAccording to Berkeley police, the organizers did not seek or obtain a permit for Saturday’s rally, but they “widely advertised the rally.” \nIn all, some 20 people were arrested, and “more arrests will be pursued” when police review footage posted on social media. \nCharges include assault with a deadly weapon and other felony assaults. \nPolice said 11 people suffered injuries and required medical treatment. Seven were taken to local hospitals. \nREAD: Protest Turns Violent, Bloody As Pro-Trump, Anti-Trump Camps Clash In Berkeley \nSimilar violence broke out last month at the very same park between pro-Trump and anti-Trump protesters. Ten people were arrested. \nIn February, then-Breitbart editor Milo Yiannopoulos was set to speak to UC Berkeley. That event was shut down in advance because it was met with similar protests. Protesters threw rocks, broke windows and set fires on campus.", "url": "http://omgili.com/ri/7aBdisT0NOqZHvX2B0CQOzbbtdi7KkU7YzzcKj9dKTohALDxB7b9KvWovSC9d2kDsEbyy26qEbZrXYyI6qH7aurwzFqUzI2IDFN4KxBMej8dOFFEf0PSyFp0GfaaVaEM42O9DhN7ve7sb.oQq9SzPg--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:45:19.000+03:00", "language": "english", "title": "Organizers Of Pro-Trump Rally In Liberal Berkeley Were ‘Proud Boys’", "thread": {"title_full": "Organizers Of Pro-Trump Rally In Liberal Berkeley Were ‘Proud Boys’", "site_full": "sanfrancisco.cbslocal.com", "site": "cbslocal.com", "site_section": "http://sanfrancisco.cbslocal.com/comments/feed/", "performance_score": 6, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 652, "shares": 652, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "news", "spam_score": 0.0, "domain_rank": 1192, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "CBS San Francisco", "url": "http://omgili.com/ri/7aBdisT0NOqZHvX2B0CQOzbbtdi7KkU7YzzcKj9dKTohALDxB7b9KvWovSC9d2kDsEbyy26qEbZrXYyI6qH7aurwzFqUzI2IDFN4KxBMej8dOFFEf0PSyFp0GfaaVaEM42O9DhN7ve7sb.oQq9SzPg--", "published": "2017-04-16T09:45:19.000+03:00", "title": "Organizers Of Pro-Trump Rally In Liberal Berkeley Were ‘Proud Boys’", "uuid": "d37678ad286dd377bb27cf11fbea934875d268b7", "main_image": "https://cbssanfran.files.wordpress.com/2017/04/berkeley-groundclash.jpg?w=960"}, "uuid": "d37678ad286dd377bb27cf11fbea934875d268b7", "ord_in_thread": 0}]