[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/.0rSU5LtMgzJTnq.XBNh8j3cPkoBkE2TcxtB.K.zhJ9Qc9V7oUM1eKAJNQ2SoASVlgojL4Zdv1oVaBTJZUsO0OzUx77XwL6DBvnuhvCvmos-", "title": "A Slack for bots: now they have their own hangout to chat and collaborate", "site_type": "blogs", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "https://www.techinasia.com", "spam_score": 0.0, "section_title": "Tech in Asia", "site": "google.com", "site_full": "feedproxy.google.com", "performance_score": 0, "uuid": "d3d5dabba5e543f6a44fd0c2577684757fd3607f", "published": "2017-04-17T10:32:00.000+03:00", "site_categories": [], "country": "US", "title_full": "A Slack for bots: now they have their own hangout to chat and collaborate", "participants_count": 1, "main_image": null}, "url": "http://omgili.com/ri/.0rSU5LtMgzJTnq.XBNh8j3cPkoBkE2TcxtB.K.zhJ9Qc9V7oUM1eKAJNQ2SoASVlgojL4Zdv1oVaBTJZUsO0OzUx77XwL6DBvnuhvCvmos-", "title": "A Slack for bots: now they have their own hangout to chat and collaborate", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:25:48.000+03:00", "language": "english", "entities": {"locations": [{"name": "interbot", "sentiment": "none"}, {"name": "gupshup", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}, {"name": "cortana", "sentiment": "none"}], "persons": [{"name": "einstein", "sentiment": "none"}, {"name": "beerud", "sentiment": "none"}, {"name": "interbot", "sentiment": "none"}, {"name": "interbot beerud sheth", "sentiment": "none"}, {"name": "beerud sheth", "sentiment": "none"}, {"name": "gupshup", "sentiment": "none"}, {"name": "alexa", "sentiment": "none"}, {"name": "radbots", "sentiment": "none"}, {"name": "mckinsey", "sentiment": "none"}, {"name": "watson", "sentiment": "none"}, {"name": "webaroo", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "verisign", "sentiment": "none"}, {"name": "facebook m", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "ibm watson", "sentiment": "none"}, {"name": "facebook messenger", "sentiment": "none"}, {"name": "interbot", "sentiment": "none"}, {"name": "citibank", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}, {"name": "mit", "sentiment": "none"}, {"name": "harvard business review", "sentiment": "none"}, {"name": "amazon alexa", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "starbucks", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "d3d5dabba5e543f6a44fd0c2577684757fd3607f", "published": "2017-04-17T10:32:00.000+03:00", "author": "Sumit Chakraberty", "text": "Photo credit: Pixabay.\nThink of it as a Slack for bots. A hangout where an ecommerce shopping bot could chat with hundreds of merchant bots to figure out where to get the cheapest iPhone 7, and even negotiate its price. Or a group of bots could play a game of poker in minutes to earn points or money for their owners. A brand could have multiple bots working together to respond to a customer query.\nThat’s Interbot , a fortnight-old channel where bots can talk to one another and collaborate.\nSoon there will be over a million bots. Imagine what they can do if they collaborate. We’re getting used to encountering bots in messaging apps and business websites. And although they often suck at communicating with humans, they’re getting better at it with advances in natural language processing. But bot-to-bot communication is a new paradigm.\nIt’s the latest from the stable of Beerud Sheth, founder of Elance and Gupshup.\nBeerud has been dabbling in bots for years, long before they became a buzzword. His company, Gupshup, based in Silicon Valley and Mumbai, provides tools and services to build bots and connects them to multiple channels.\nSome time back, Beerud’s preoccupation shifted from building more and more advanced bots to getting bots to collaborate with one another to offer more powerful capabilities. This led to the creation of Interbot.\n“Bots have massive ability to process information, and many bots are proving highly effective in multiple domains, from banking and ecommerce to customer engagement for enterprises,” Beerud tells Tech in Asia . “Soon there will be over a million bots. Imagine what they can do if they collaborate. We have created a channel to enable this and hope to make it a standard for interoperability between bots.”\nMasterbots and minion bots GIF source: GIPHY\nThe artificially intelligent Google Assistant, Amazon Alexa, and Facebook M (currently being rolled out) already have the capability to redirect queries to other bots to fetch requirements for anything from booking a ride to making a payment. In that sense, they act as masterbots with minion bots at their service. But this is restricted to bots that the Google, Amazon, or Facebook masterbot chooses to work with.\nWhat Interbot has done is to create a channel where anybody can publish a bot in minutes – just like they would do on a channel like Facebook Messenger or Telegram to interact with humans. It will handle the messaging protocols between bots, as well as provide the context to help the bots figure which message relates to what.\nOnce published on Interbot, a bot can start chatting and collaborating with the other bots on the channel. Many more masterbots can emerge in this open space for different purposes, instead of just a handful from the tech giants.\nMost developers don’t want to build different bots for Cortana, Einstein, Watson, and so on – they want to build it once and connect to everything. Every brand can have a masterbot to serve its customers. Large corporations, points out Beerud, would have bots in every division and location, but only one customer-facing bot. Now, an enterprise can put all its bots on Interbot and have them serving the brand’s masterbot.\nTake Citibank, for example. Its superbot can chat with other bots from its mortgage, insurance, and currency divisions, to respond fast to customer queries. It can also chat with bots from third parties, like a payment app, to serve customers.\nCurrently, collaboration between apps happens through API (application programming interface) calls from one app to another. There can also be a bot-to-bot handoff, as in a user being redirected from Alexa to another bot. But “Interbot is a much more elegant framework to drive interoperability,” says Beerud. Unlike API calls, for example, bot-to-bot interaction will be bi-directional. API calls also require coding which can be time-consuming.\nChicken-and-egg question When I point out that the interoperability is restricted to bots published on the Interbot channel, Beerud admits that the fortnight-old channel needs to demonstrate its usefulness before bots congregate there in large numbers. It’s a chicken-and-egg question: the more bots there are, the more useful will be the hangout for bots, and vice versa.\nBeerud wants to maintain “bot neutrality” by keeping the channel open to all, even if they compete with bots his own company helps to build. He’s hoping for network effects to kick in and make Interbot the open standard for interoperability. Right now, apart from bots not talking to one another directly, the space is fragmented.\nThe tech giants are in a race to offer their AI suites for developers of bots to leverage, like IBM Watson and Microsoft Bot Framework. They’re also building their masterbots, like Google Assistant, Amazon Alexa, and Facebook M. But it’s hard for these rivals to come together to create an interoperable standard for the bots, even though Facebook, Google, Microsoft, Amazon, and IBM formed an AI alliance last year.\nSee: Startups react with hope and fear to AI alliance \nThat’s where Interbot comes in. Its parent, Gupshup, already has partnerships with Google and others. Developers can use Gupshup to build voice-activated bots to work with Google Assistant, simplifying home automation with voice commands. Beerud is now working on getting the tech giants to partner with Interbot.\nOne idea is to have Interbot proxy bots to get on to a channel like Facebook Messenger and interact with all the bots there – 30,000 at last count. But social media apps are designed for human communication, with tight controls on messaging to prevent spamming – they’re not made for bots that will exchange millions of messages when they talk to their kind.\nDoing away with pesky API calls The other possibility is for the tech giants’ masterbots to come to Interbot, which would enable bot developers to interact with all of them in one place instead of pushing a different bot on each channel. Developers would also be freed from API calls to the AI suites opened up by the biggies. “Most developers don’t want to build different bots for Cortana, Einstein, Watson, and so on – they want to build it once and connect to everything,” points out Beerud.\nStill, why would any of the tech giants partner with Interbot, instead of building an interoperable platform themselves? The answer is simple: it would be very hard for a committee of rival giants to agree on who will set the standard. A neutral player, whose primary role is to enable connections, may be the glue they need for collaboration.\nBesides, Interbot can potentially help them connect with a very large network of bots, expand the capabilities of their own bots, and get more traffic. So Beerud is hoping to forge some partnerships soon, which would have a multiplier effect on the power of Interbot.\nSee: Why Microsoft is asking startups to dance with it into the new year \nFor now, he’s happy to see how developers and brands use the channel for their bots to interact. Perhaps my Uber bot will talk to the Starbucks bot so that my Kenyan coffee is ready when I reach Starbucks. And the Starbucks bot can talk to a movie bot to buy a ticket to a nearby show.\nDevelopers can also combine bots to build more advanced bots faster. For example, a translation bot could be connected with a natural language processing bot and finally to a pizza ordering bot. The customer would then get a multilingual, intelligent pizza bot. Beerud likens it to Legos – joining a set of bots to create a powerful bot.\nA bot built up like this could also upgrade itself simply by replacing one of the bots. For example, the translate bot in the pizza bot could be replaced by a new one that offers more languages.\nBot clutter \nOne problem in the bot world is the clutter, with a plethora of junk bots that only waste a user’s time. Most of them are simply using menu-based algorithms which take care of a limited set of scenarios. Many use basic machine learning that can parse inputs and learn from them to improve responses, but they soon require human intervention.\nSee: An absolute beginner’s guide to machine learning, deep learning, and AI \nThe best ones have deep learning with neural networks replicating how the human brain works. The AI suites opened up for developers by tech giants like IBM and Microsoft are helping them to build more intelligent bots. Beerud believes the rubbish bots will be cleared out over time, just as better search algorithms and certification services like Verisign sorted out some of the chaos in the early days of the world wide web.\nFor Interbot, he’s already talking to developers who can build review bots that can interact with other bots on the channel as well as users for a rating system. As of now, it has a registry where all bots on the channel will be listed and described. And it has documentation and services to enable messaging between the bots.\nThe devil is in the details Beerud’s company started working on this around nine months ago with a broad idea “to realize the true potential of the powerful capabilities of bots.” Practical ways of doing it became clearer in conversations with clients for whom Gupshup helps build and service bots.\nPayroll and accounting software maker, Sage, for example has multiple bots and they use different tools from IBM Watson, Microsoft’s AI services, and more. Why can’t all these things be used in a plug-and-play way instead of the time-consuming process of writing code for different API calls? That was the question that kept coming up.\nThus the idea of a channel where bots can interact was born. Then the tech stack was built up to handle the connections and communication between bots on the channel. For example, Bot A needs to know the context of a message from Bot B – that it’s in reply to an earlier message from Bot A, for instance.\nSome of our coworkers and managers may soon be bots. The next level is a semantic layer. For example, if an accounting bot sends an invoice in the European format, another bot using the American format may not understand it. “So we’ll have third party bots that enforce standards,” says Beerud.\nThere’s a long way to go for Interbot to mature. First it has to work cleanly and seamlessly. Then there will be new issues related to scale. Gupshup handles 4 billion messages a month for the bots it services.\n“It’s hard when you dig into the details,” says Beerud. “That’s why we haven’t seen a deployment of inter-bot capability until now, even though people have been talking about it for some time.” Apart from Interbot, Radbots has announced it is building a “network” for bots to work together.\nAs bots continue to proliferate and become more enmeshed in our lives, AI researchers are exploring different ways of getting them to talk to one another and collaborate. One initiative at OpenAI aims to create a whole new language for bots instead of trying to mimic human language. That could be handy for the bots on Interbot to chat away with each other in bot lingo.\nFrom Elance to Interbot Beerud Sheth, co-founder and CEO of Webaroo. Photo credit: Beerud Sheth.\nIt’s not the first time the IIT Bombay alumnus with a master’s in computer science from MIT has come up with something new. After a stint on Wall Street as an investment banker, Beerud founded Elance in the late nineties when such platforms for outsourcing tech jobs were only subjects of speculation. The name Elance was borrowed from the title of a Harvard Business Review article titled, “The Dawn of the E-Lance Economy.”\nHe created Teamchat and Gupshup after exiting Elance in 2005. Tech-enabled communication and collaboration have been his preoccupations for nearly two decades. First it was between humans, and then between bots and humans. Now he takes that into the brave new world of bot-to-bot chat, and it seems like the right time for it.\n“Some of our coworkers and managers may soon be bots,” Beerud points out.\nSee: Half the work people do can be automated: McKinsey \nThis post Humans are optional: bots can now gang up on their own to become superbots appeared first on Tech in Asia.\n"}]