[{"uuid": "d5bec30d22e8e601b6fb6716397d83f34786ba3a", "url": "http://omgili.com/ri/SEMpReyPU46QTAsQM2b8MYzMvlGkKLFnGR96TfKTjOl8cOGcbtI.mGFxcyXQg6nOtMDdL19rqoJTxW5BE3iFAgaQhLdc3uEgK9YJ9TZtzpfIhy4jksVK3akm5nuR7xOj9Phri6FpoqyGDaTUqWoydXlkv_2ci0.w", "title": "In aftermath of rape scandal, Baylor hires its first female president", "author": "newsengin", "rating": null, "published": "2017-04-18T23:23:01.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "texas tribune", "sentiment": "negative"}, {"name": "baylor", "sentiment": "negative"}, {"name": "george washington university", "sentiment": "none"}, {"name": "texas rangers", "sentiment": "none"}, {"name": "baylor university", "sentiment": "none"}, {"name": "pepperdine university", "sentiment": "none"}, {"name": "u.s. department of education’s office of civil rights", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "waco", "sentiment": "none"}], "persons": [{"name": "david garland", "sentiment": "none"}, {"name": "linda livingstone", "sentiment": "none"}, {"name": "ken starr", "sentiment": "none"}, {"name": "bob brewton", "sentiment": "none"}, {"name": "livingstone", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "d5bec30d22e8e601b6fb6716397d83f34786ba3a", "url": "http://omgili.com/ri/SEMpReyPU46QTAsQM2b8MYzMvlGkKLFnGR96TfKTjOl8cOGcbtI.mGFxcyXQg6nOtMDdL19rqoJTxW5BE3iFAgaQhLdc3uEgK9YJ9TZtzpfIhy4jksVK3akm5nuR7xOj9Phri6FpoqyGDaTUqWoydXlkv_2ci0.w", "site_full": "lubbockonline.com", "title": "In aftermath of rape scandal, Baylor hires its first female president", "site_section": "http://m.lubbockonline.com/rss.xml", "domain_rank": 73097, "published": "2017-04-18T23:23:01.000+03:00", "title_full": "In aftermath of rape scandal, Baylor hires its first female president", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "Lubbock Online | Lubbock Avalanche-Journal", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://lubbockonline.com/sites/default/files/image2115111_web1_04-19-BAYLOR.jpg", "site": "lubbockonline.com"}, "external_links": [], "language": "english", "text": " 11 pm By Texas Tribune In aftermath of rape scandal, Baylor hires its first female president \nAs it struggles to move past a scandal over its handling of sexual assault on campus, Baylor University has hired its first female president. \nLinda Livingstone, a management professor and dean of George Washington University’s business school, will take over the top job at the private Baptist university on June 1. She’ll replace David Garland, who has been serving as interim president since his predecessor, Ken Starr, was fired last year. \nLivingstone previously taught at Baylor from 1991 to 2002, and served as associate dean of graduate programs at Baylor’s business school for her last four years in Waco. She has also worked as an administrator at Pepperdine University. \nShe’ll take over a school that’s still dealing with a crisis. Last year, it fired its president, athletic director and football coach after a university-commissioned inquiry found that the school failed to properly investigate numerous allegations of rape. At times, the inquiry found, the perpetrators faced little punishment, while the women who reported the assaults faced victim blaming and received little help. \nThe problems were especially pronounced on the football team. Baylor regents have said that 19 football players were accused or assault or rape since 2011. A lawsuit against the school said that football players committed 52 rapes in four years. The school is facing investigations from the Texas Rangers, the U.S. Department of Education’s Office of Civil Rights and the Big 12 athletic conference. Numerous lawsuits have been settled or are making their way through the courts. \nIn addition, a power struggle has dragged on at the school, with prominent boosters vying for the removal of some Baylor regents. \nThe press release announcing Livingstone’s hire didn’t mention those troubles. Instead, it focused on her qualifications. \nShe said she was excited to be returning to Texas. \n“Baylor’s unique culture of care and compassion – that I experienced personally from my colleagues and that I saw demonstrated among faculty, staff and students – continues to inspire and influence me as an administrator,” she said. “Continuing to strengthen Baylor’s culture where faculty, staff and students are encouraged, inspired and cared for by one another is a priority.” \nDespite Baylor’s recent struggles, Livingstone will also return to a school that has prospered in other ways. Prior to the scandal, the school’s national prominence was growing. Even with recent problems, the 16,000-student school continues to rise in national rankings. \nSchool officials said they reviewed more than 400 possible candidates and interviewed 61 candidates. \n“In the end, Dr. Livingstone’s experience uniquely fit the profile of the dynamic faith and transformational leader which Baylor needs at this point in time in our history,” said Bob Brewton, chairman of the school’s search committee. Advertisement", "ord_in_thread": 0, "crawled": "2017-04-18T23:23:01.000+03:00"}]