[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:16:47.000+03:00", "author": "Jay Rayner", "entities": {"persons": [{"name": "carg", "sentiment": "negative"}, {"name": "keith floyd", "sentiment": "none"}, {"name": "jay", "sentiment": "none"}, {"name": "marmite", "sentiment": "none"}, {"name": "elliott lidstone", "sentiment": "none"}, {"name": "lidstone", "sentiment": "none"}, {"name": "adrian sherratt", "sentiment": "none"}, {"name": "l’ortolan", "sentiment": "none"}, {"name": "tessa", "sentiment": "none"}], "locations": [{"name": "bristol", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "middle america", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "hackney", "sentiment": "none"}, {"name": "jersey royal", "sentiment": "none"}, {"name": "box-e", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "long beach", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "forbes", "sentiment": "none"}, {"name": "unilever", "sentiment": "none"}, {"name": "wilsons", "sentiment": "none"}, {"name": "ikea", "sentiment": "none"}, {"name": "wapping wharf", "sentiment": "none"}, {"name": "cornish pasty company", "sentiment": "none"}]}, "text": "Box-E, Unit 10, Cargo 1, Wapping Wharf, Bristol BS1 6WP. Meal for two, including drinks and service: £85 \nTo understand Box-E in Bristol it’s worth knowing a little about the recent history of globalisation. From the late 90s onwards Middle America became the recipient of increasing volumes of cheap consumer goods, transported by sea from China to Long Beach, California, and then onwards by rail in shipping containers. They were the product of China’s economic boom and the comparative advantage of their cheaper workforce. At first it was too expensive to ship the containers back to China and so most were scrapped once they reached Chicago.\n\nSoon the price of steel shot up as global demand increased, and scrapping them was no longer viable. They needed to go back but empty containers are unstable on ships. So now they were filled with old newspapers as ballast. Illinois was sending yesterday’s news to China. However, one of the outcomes of China’s huge economic growth was an expansion of the middle classes and, with that, of meat consumption. What the Chinese needed was lots of grain to feed to their cattle, which just happened to be something Illinois had in abundance. And so what had been a one-way trade became two-way: consumer goods from China in return for grain from America.\n\nFacebook Twitter Pinterest Lick the plate clean: ox tongue with Jersey royals. Photograph: Adrian Sherratt for the Observer \nIt was a simple exchange, which fuelled 21st-century globalisation and which, in turn, made the shipping container the icon of the new mercantile age. Sure, they had been around since shortly after the Second World War, but now the modular, easy-to-handle, extremely robust system came into its own. It’s unsurprising that enterprising types soon noticed that, with a tweak here or there, they could become buildings. And so it is that the driver of the most steely, hardcore form of global mass trade should also became the driver of small-scale independent business.\nBristol, like many other cities in the UK, is littered with the things. They are home to offices for small enterprises, to tiny retail units and, of course, start-up food ventures. Plumb in a sink, hook up some gas, build a plywood bar, buy some chairs from Ikea and away you go. Box-E, part of the relatively new Cargo 1 stack on Bristol’s Wapping Wharf, is unusual for the ambition of its offering. Containers may be sturdy, but they also smack of the temporary. Much of the time that translates into food that is equally casual.\n\nFacebook Twitter Pinterest The rock god of the vegetable world: charred hispi cabbage. Photograph: Adrian Sherratt for the Observer \nBox-E, set up by Elliott Lidstone, former head chef of L’Ortolan and then of the Empress pub in Hackney, is sodden with a quiet, very Bristolian form of ambition. There are just 14 seats, at bare, spindly, wipe-clean tables, plus four seats at the counter. There is just Lidstone in the extremely open galley-style kitchen and his partner Tessa on the other side of it. Much of the interior is still lined with the blond plywood in which the unit came fitted out at the start. It’s all utilitarian. But their crusted sweet white bread, served warm, comes with a quenelle of whipped butter flavoured with seaweed. Suddenly it’s clear they are here to feed you and feed you well.\nThe setting may be quite different, but Box-E still has an awful lot in common with Wilsons , reviewed on this page three weeks ago. I’d go so far as to say there’s a defined Bristolian style. It’s rooted in the love of the small bistros of France, championed by the late Keith Floyd in his glorious pomp, who made his name here. The cooking is led by ingredients and seasonality and any other ethical markers that could make you feel better about yourself.\nOne friend who knows the Bristol restaurant sector well applauds it all, but identifies a certain earnestness, and I get their point. Witness: the handmade pottery plates at Box-E with a rough, gnarly glaze that makes a scratchy noise as the knife is dragged across them.\n\nFacebook Twitter Pinterest ‘Winning harmonies’: hake with lentils. Photograph: Adrian Sherratt for the Observer \nWhat matters is the food on those plates, which is mostly very good. As with Wilsons, it’s a limited menu. There are just four starters and three mains. There’s a wedge of hispi cabbage, the rock god of the vegetable world right now, charred and smeared with an unembarrassed anchovy butter and dried seaweed for extra ooh and ah. Thick slabs of ox tongue, the crisped surface yielding to something altogether softer within, lie on cubes of Jersey Royal potatoes, the two introduced to each other courtesy of a dressing made with dollops of nose-tickling Dijon mustard. A duck egg, as rich as the top 10 of a Forbes magazine billionaires list, is baked with truffle oil and a bird’s nest of crisp, shredded leeks. All of these are £6 or £6.50.\nThe three mains cover the dietary needs of a Bristol dinner party: one meat, one fish, one vegetarian. The meat and fish dishes, both priced in the mid-teens, are variants on each other. Slices of onglet, a fleshy, butcher’s shop pink inside, dark and charred without, are layered with radicchio, wilted in the pan and dribbled with a powerful savoury jus. Below the meat are braised cannellini beans and then below that a salsa verde to give the whole thing power and meaning.\nThe same salsa verde provides the winning harmonies on a dish of hake. In such a small kitchen, this looks less like lack of imagination than common sense. The ingredients belong together on both plates. The fish is cooked precisely and is snowfield white, its surface glazed and golden and smeared with fennel, cooked down to a cheery caramelised jam, with a big anise hit. A heap of lightly stewed black lentils plays a supporting role.\n\nFacebook Twitter Pinterest ‘No place for pastry work’: panna cotta. Photograph: Adrian Sherratt for the Observer \nDessert is low key compared to the punch and push of what has gone before, and extremely familiar from my meal at The Other Naughty Piglet . The crème caramel there is here a panna cotta. And there’s a chocolate mousse. The panna cotta is an exemplar of its kind; the mousse comes pelted with pomegranate seeds. But still it’s mildly disappointing. This is the downside to a one-person kitchen. Lidstone needs dessert to be something he can plate up, between taking care of stove-top business. There’s no place for pastry work.\nIt is, I think, a small price to pay for such a poised, bespoke operation. Against the scale of over-financed over-engineered big city openings, there’s something beguiling about Box-E. It’s the sense of people doing the thing they love their way, by finding an environment in which to make it work. That environment just happens to be a shipping container. \nJay’s news bites Downstairs from Box-E, occupying three containers, is Pigsty, a porker-orientated café that grew out of the Jolly Hog range of sausages and bacon. At breakfast they serve a killer sandwich made with their impeccable black treacle-cured bacon. The lunch/dinner menu includes slow-roast pork shoulder croquettes, baps filled with pork belly and crackling, and pork burgers with pulled pork and baconaise. Other branches are on the cards ( pigstyuk.com ).\nWant to know what you’re missing now it’s Easter? For a second year Unilever has unleashed its Marmite Easter egg. Not only is the chocolate in the shape of a Marmite jar, it’s flavoured with Marmite, too. Brand new is the Pot Noodle Bombay Bad Boy Easter egg: a Pot Noodle-branded mug with a chilli chocolate egg.\nMore Easter news: the Cornish Pasty Company has revealed that this year’s April Fools gag – the announcement of pasties in the shape of Easter Eggs – was so positively received that next year they’re doing it for real. And that’s no joke. Or yolk. I’m so sorry ( thecornishbakery.com ). Email Jay at jay.rayner@observer.co.uk or follow him on Twitter @jayrayner1 \nTopics Food & drink Jay Rayner on restaurants Restaurants (Life and style) Restaurants (Travel) Bristol holidays features  ", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nxRVSxDLeMLrhzhN2Ks1oMV2gpY2N2dZPhFE2AJUBX2JAtgF6FZeCbqCesIo_hZrjOFgekNOgsuv7mjA0N1VZHtDFigqM9x5J", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T10:16:47.000+03:00", "language": "english", "title": "Box-E, Bristol: restaurant review | Life and style | The Guardian", "thread": {"title_full": "Box-E, Bristol: restaurant review | Life and style | The Guardian", "site_full": "www.theguardian.com", "site": "theguardian.com", "site_section": "", "performance_score": 9, "social": {"gplus": {"shares": 1}, "pinterest": {"shares": 1}, "facebook": {"likes": 944, "shares": 944, "comments": 0}, "linkedin": {"shares": 6}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "news", "spam_score": 0.934, "domain_rank": 170, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nxRVSxDLeMLrhzhN2Ks1oMV2gpY2N2dZPhFE2AJUBX2JAtgF6FZeCbqCesIo_hZrjOFgekNOgsuv7mjA0N1VZHtDFigqM9x5J", "published": "2017-04-16T10:16:47.000+03:00", "title": "Box-E, Bristol: restaurant review | Life and style | The Guardian", "uuid": "d7c351ae7275bb7793e52ced909d5f12c30c0a09", "main_image": "https://i.guim.co.uk/img/media/343d0b7f9e054bde7d70019d6b074ea004be6d9f/489_683_6871_4123/master/6871.jpg?w=1200&amp;h=630&amp;q=55&amp;auto=format&amp;usm=12&amp;fit=crop&amp;crop=faces%2Centropy&amp;bm=normal&amp;ba=bottom%2Cleft&amp;blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&amp;s=8b7d38613f82e03d00d761ecd59ccc30"}, "uuid": "d7c351ae7275bb7793e52ced909d5f12c30c0a09", "ord_in_thread": 0}]