[{"uuid": "dc501a472785836167258639a56b8a717d334478", "url": "http://omgili.com/ri/.wHSUbtEfZTv24tdi_eGhlbj_QvGqW_1hsHftZ9TYCtZlBoUVvCj7XwrFwhrXB9bP7xVsKURxqVf7bfoKBjiefmlSL.yjkAs", "title": "Seven iOS MIDI Sequencers Worth Considering", "author": "", "rating": null, "published": "2017-04-18T23:23:42.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "garageband  apple", "sentiment": "neutral"}, {"name": "mpc", "sentiment": "none"}, {"name": "garageband", "sentiment": "none"}, {"name": "akai", "sentiment": "none"}, {"name": "osc", "sentiment": "none"}, {"name": "orbital", "sentiment": "none"}], "locations": [{"name": "auria pro", "sentiment": "none"}, {"name": "auria", "sentiment": "none"}, {"name": "tabletop", "sentiment": "none"}], "persons": [{"name": "bjork", "sentiment": "none"}, {"name": "tabletop", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "dc501a472785836167258639a56b8a717d334478", "url": "http://omgili.com/ri/.wHSUbtEfZTv24tdi_eGhlbj_QvGqW_1hsHftZ9TYCtZlBoUVvCj7XwrFwhrXB9bP7xVsKURxqVf7bfoKBjiefmlSL.yjkAs", "site_full": "ask.audio", "title": "Seven iOS MIDI Sequencers Worth Considering", "site_section": "http://www.askaudiomag.com/rss", "domain_rank": 58401, "published": "2017-04-18T23:23:42.000+03:00", "title_full": "Seven iOS MIDI Sequencers Worth Considering", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "AskAudio Magazine", "site_type": "blogs", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "https://macprovid.vo.llnwd.net/o43/hub/media/1093/13653/tabletop.jpg", "site": "ask.audio"}, "external_links": [], "language": "english", "text": "Hollin Jones on Apr 18, 2017 in Review 0 comments Share: With iOS now firmly established as a serious music-making platform, the apps you can get to program and produce have gone from strength to strength. Here are some of the best MIDI sequencers for iPad 1 Modstep 2 Cubasis 3 GarageBand 4 Auria Pro 5 Lemur 6 iMPC Pro 7 Tabletop 1. Modstep \nModstep has been built from the ground up to work on iOS, so it’s not a port or a version of a desktop DAW. Although initially a little overwhelming, it makes a lot of sense when you get into it. It provides multiple ways to program MIDI using linear or step input methods, chord pads, drum pads, scales, chromatic note grids and more. It has a built in synth and sample player with many presets and both are fully tweakable, plus there’s extensive modulation available. \nIt supports Inter App Audio and Audio Unit compatible instruments and effects on iOS meaning it can act as your main sequencer even for other apps, and it can import and export MIDI as well as recording audio parts and song sequencing. Connection to MIDI hardware is easy, as it networked MIDI and there are templates to control many popular hardware synths. Possibly unlike anything you have used before, it’s a very powerful music-making tool. \nPlatform: iPad \nWeb: www.modstep.net 2. Cubasis \nOK, so there are going to be some in this list that aren’t purely MIDI sequencers, but where MIDI is a big part of the story. Cubasis does audio tracking too, but its MIDI tools are among the best in the business. You get a bunch of bundled instruments and synths derived from the desktop version of Cubase, plus one of the most intuitive and powerful MIDI piano roll editors around. Pinch to zoom and scroll, add notes using your finger, the pen tool or hardware input. Draw around notes and edit them however you like: quantize, move, add all kinds of envelopes for automation. It’s perfectly possible to produce whole tracks since IAA is supported but you can also export a project to work on it with Cubase for Mac or PC as well. Truly, an all-round performer with an incredible depth of features. \nPlatform: iPad \nWeb: https://www.steinberg.net/en/products/mobile_apps/cubasis/start.html 3. GarageBand \nApple’s very affordable iOS app isn’t the most heavyweight in this list, at least in terms of its MIDI capabilities. There is note editing, chord input into the many instruments and of course MIDI loops that you can edit. What does set it apart though is the slick user experience of the app as a whole. If you haven’t looked at it since its early days, re-download it and you might be surprised by how much more capable and professional it is now. With the ability to transfer projects easily to GarageBand and Logic Pro on the desktop as well as comprehensive iCloud Drive syncing support, it’s a great proposition if your MIDI needs are more modest but you’re looking for an all-round mobile DAW. It works just as well on the iPhone too. \nPlatform: iPad and iPhone \nWeb: www.apple.com/garageband 4. Auria Pro \nThe basic version of Auria has far fewer features than the Pro version, and full MIDI tracking and editing is one of the many things that does require the advanced version. That said, Auria Pro is arguably the most advanced all-round mobile DAW. Its MIDI capabilities include editing, quantizing and processing using tools like velocity compression, legato, transposition and so on. If you’re buying Auria Pro you’ll also be doing so to get the very advanced audio and instrument plug-in features as well as the complex channel strips and other tools. \nPlatform: iPad \nWeb: http://auriaapp.com/Products/auria 5. Lemur \nLemur started off as a touchscreen app before iPhones even existed, and ran on special but very expensive hardware. Reborn for iOS and now at version 5, it brings many years of MIDI / OSC control experience to the platform, providing advanced multitouch control of almost any software. Admittedly there is a learning curve, but it’s found favour with some big names including Daft Punk, Orbital and Bjork amongst others. It’s especially useful when paired with Ableton Live, which has helped it to gain more prominence. \nPlatform: iPad and iPhone \nWeb: https://itunes.apple.com/app/lemur/id481290621 6. iMPC Pro \nAKAI’s iMPC Pro is a self-contained sampling and sequencing workstation but it has some great MIDI features and is also compatible with Inter-App Audio meaning you can connect it to other apps inside your iPad. With a strong emphasis on loops and beat making, you get the workflow of the hardware MPC family with the convenience of a software format. As well as loop programming and editing there are some really powerful tools available for working with velocity, swing, quantization and sample editing. With a clean, stripped-back design it won’t blind you with options – just let you get on with making beats the way you want to. \nPlatform: iPad \nWeb: https://itunes.apple.com/app/impc-pro/id888946092 7. Tabletop \nRetronyms’ Tabletop is almost unique in that it attempts to provide a whole environment inside iOS in which you can build music setups: route, add plug-ins, mix sound from different sources, program and edit MIDI and so on. It works differently from a DAW in that it lets you buy extra modules as you go, or buy many as a bundle to save money. Some apps are also Tabletop-ready, meaning that if you buy them for your iPad they will also be available inside this app. Advanced and powerful, Tabletop foreshadowed some technologies that would later be incorporated into iOS and a range of different apps. Specifically: plugin support, Inter-App Audio and Inter-App MIDI, which are all now much more widely used thanks partly to ideas introduced in Tabletop. \nPlatform: iPad", "ord_in_thread": 0, "crawled": "2017-04-18T23:23:42.000+03:00"}]