[{"uuid": "dca6c3856ea8684d577bdc236c5618e809bd4877", "url": "http://omgili.com/ri/2wGaacqxApuXOfMEin41f9acn.0m5FH7qZULlzZ.Smr4ZtePUC0khXSxVLVeexjTpovEGuL_zd1keQfGgR7YS3D.k0RzN_wz", "title": "Former Pentagon Staffer: ‘Syria Gas Attack Was Staged!’", "author": "Heisenberg", "rating": null, "published": "2017-04-18T23:24:24.000+03:00", "highlightText": "", "entities": {"organizations": [], "locations": [], "persons": []}, "highlightTitle": "", "thread": {"uuid": "dca6c3856ea8684d577bdc236c5618e809bd4877", "url": "http://omgili.com/ri/2wGaacqxApuXOfMEin41f9acn.0m5FH7qZULlzZ.Smr4ZtePUC0khXSxVLVeexjTpovEGuL_zd1keQfGgR7YS3D.k0RzN_wz", "site_full": "maganews.co", "title": "Former Pentagon Staffer: ‘Syria Gas Attack Was Staged!’", "site_section": "http://dcposts.com/feed", "domain_rank": null, "published": "2017-04-18T23:24:24.000+03:00", "title_full": "Former Pentagon Staffer: ‘Syria Gas Attack Was Staged!’", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "Departed", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "https://i1.wp.com/maganews.co/wp-content/uploads/2017/04/moab-1-320x181.jpg?resize=320%2C181", "site": "maganews.co"}, "external_links": [], "language": "english", "text": "Home / News / Former Pentagon Staffer: ‘Syria Gas Attack Was Staged!’ Former Pentagon Staffer: ‘Syria Gas Attack Was Staged!’ Heisenberg 4   Former Pentagon Staffer: ‘Syria Gas Attack Was Staged!’ \nA former Pentagon scientist claims to have proof that the recent gas attack in Syria was staged, saying that Syrian President Bashar al-Assad cannot have been responsible based on the facts uncovered. \nTheodore Postol, professor emeritus at the Massachusetts Institute of Technology (MIT) and former Pentagon scientist, issued a series of three detailed reports in response to the White House’s claim that Assad perpetrated the attack. \nAccording to Postol, the Trump administration has failed to provided any concrete evidence that Assad is responsible, and claims that the attack was very likely perpetrated by rebels on the ground.Postol said: “I have reviewed the [White House’s] document carefully, and I believe it can be shown, without doubt, that the document does not provide any evidence whatsoever that the US government has concrete knowledge that the government of Syria was the source of the chemical attack in Khan Sheikhoun, Syria at roughly 6am to 7am on 4 April, 2017. \n“In fact, a main piece of evidence that is cited in the document point to an attack that was executed by individuals on the ground, not from an aircraft, on the morning of 4 April. \n“This conclusion is based on an assumption made by the White House when it cited the source of the sarin release and the photographs of that source. My own assessment is that the source was very likely tampered with or staged, so no serious conclusion could be made from the photographs cited by the White House.” \nPostol is pointing out how the images used by the White House, to justify launching 59 missiles at a sovereign nation, actually show enough evidence to debunk the official story from the start. \nPostol notes that the canister appears to have been clearly smashed on the ground and not launched from a plane as the United States contests. \n“The explosive acted on the pipe as a blunt crushing mallet,” Postol said. “It drove the pipe into the ground while at the same time creating the crater. \n“Since the pipe was filled with sarin, which is an incompressible fluid, as the pipe was flattened, the sarin acted on the walls and ends of the pipe causing a crack along the length of the pipe and also the failure of the cap on the back end.” \nAs the IB Times points out, Postol, formerly a scientific advisor at the Department of Defense (DoD), has previously outlined similar inconsistencies with US intelligence reports. Following the 2013 chemical weapons attack in eastern Ghouta. Postol again said the evidence did not suggest Assad was responsible – a finding that was later corroborated by the United Nations. \nAfter easily blowing apart the official narrative on the alleged attacks, Postol’s new report goes on to call attention to the politicized aspect of the intelligence findings. \nPostol said: “No competent analyst would miss the fact that the alleged sarin canister was forcefully crushed from above, rather than exploded by a munition within it. \n“All of these highly amateurish mistakes indicate that this White House report, like the earlier Obama White House Report [from Ghouta in 2013], was not properly vetted by the intelligence community as claimed. \n“I have worked with the intelligence community in the past, and I have grave concerns about the politicisation of intelligence that seems to be occurring with more frequency in recent times – but I know that the intelligence community has highly capable analysts in it. \n“And if those analysts were properly consulted about the claims in the White House document they would have not approved the document going forward.” \nAfter reading Postol’s report, the idea of the Sarin gas attack being a false flag — as multiple high-level experts, politicians, and former intelligence officers have claimed — becomes far more plausible than the United States’ official narrative. \nPlease share this article with your friends and families so that they may see the what the real experts, who don’t have an interest in spreading empire and war, are saying. Loading...", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:24.000+03:00"}]