[{"uuid": "e05ee4e91c042839cadd87cd7ecda62421cb2de0", "url": "http://omgili.com/ri/jHIAmI4hxg.eJXK_yAdfkadTZr6k13Qfg26C.VfP1BCQyJOLr8H3iC7rKLKnzhdJJZiBAm77FExOruPTRX3lh0dfasHh6f96sF9xltOSaLBBIejrvwXZt_Dbw5qXXxfYvsTghTTYtgA-", "title": "AP Explains: Behind the visa program targeted by Trump", "author": "ANICK JESDANUN", "rating": null, "published": "2017-04-18T23:24:54.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "justice", "sentiment": "none"}, {"name": "wipro", "sentiment": "none"}, {"name": "infosys", "sentiment": "none"}, {"name": "u.s. citizenship and immigration services", "sentiment": "none"}, {"name": "general mitchell international airport", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}, {"name": "labor department", "sentiment": "none"}, {"name": "hcl technologies", "sentiment": "none"}, {"name": "labor and state", "sentiment": "none"}, {"name": "homeland security", "sentiment": "none"}], "locations": [{"name": "milwaukee", "sentiment": "none"}, {"name": "wis.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "tata", "sentiment": "none"}, {"name": "kenosha", "sentiment": "none"}], "persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "michael liedtke", "sentiment": "none"}, {"name": "paul wiseman", "sentiment": "none"}, {"name": "charles grassley", "sentiment": "none"}, {"name": "zoe lofgren", "sentiment": "none"}, {"name": "dick durbin", "sentiment": "none"}, {"name": "scott peters", "sentiment": "none"}, {"name": "darrell issa", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "e05ee4e91c042839cadd87cd7ecda62421cb2de0", "url": "http://omgili.com/ri/jHIAmI4hxg.eJXK_yAdfkadTZr6k13Qfg26C.VfP1BCQyJOLr8H3iC7rKLKnzhdJJZiBAm77FExOruPTRX3lh0dfasHh6f96sF9xltOSaLBBIejrvwXZt_Dbw5qXXxfYvsTghTTYtgA-", "site_full": "www.washingtontimes.com", "title": "AP Explains: Behind the visa program targeted by Trump", "site_section": "http://washingtontimes.com/rss/headlines/news/politics/", "domain_rank": 3106, "published": "2017-04-18T23:24:54.000+03:00", "title_full": "AP Explains: Behind the visa program targeted by Trump", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "www.washingtontimes.com stories: Politics", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2017/04/18/trump_89043.jpg", "site": "washingtontimes.com"}, "external_links": [], "language": "english", "text": "More... President Donald Trump picks up a baby as he greets people after arriving on Air Force One at General Mitchell International Airport in Milwaukee, Tuesday, April 18, 2017. Trump is heading to Kenosha, Wis., to visit the headquarters of tool ... more > Print By ANICK JESDANUN - Associated Press - Tuesday, April 18, 2017 \nNEW YORK (AP) - President Donald Trump is targeting a visa program cherished by tech companies for bringing in programmers and other specialized workers from other countries. \nAlthough these visas, known as H-1B, aren’t supposed to displace American workers, critics say the program mostly benefits consulting firms that let tech companies save money by contracting out their jobs to foreign workers. \nTrump signed an order Tuesday to direct the departments of Homeland Security, Justice, Labor and State to propose new rules to prevent immigration fraud and abuse. Those departments would also be asked to offer changes so that H-1B visas are awarded to the “most-skilled or highest-paid applicants.” \nHere’s a look at how the H-1B visa program works. \n___ \nIS THIS A TECH VISA PROGRAM? \nThe H-1B program is open to a broad range of occupations, including architects, professors and even fashion models. It’s meant for jobs requiring specialty skills that cannot be filled by a U.S. worker. Many of these jobs happen to be in tech. According to the Labor Department, the top three H-1B occupations are computer systems analysts, application software developers and computer programmers - and those three account for roughly half of the department’s H-1B certifications. \nThe tech industry says that companies have trouble filling positions with American workers and must turn to other countries through this program. Supporters have sought to expand the number of visas allowed each year, something unlikely to happen. \n___ \nBY THE NUMBERS \nAlthough the program is capped at 85,000 new H-1B visas each year, more than 100,000 workers are allowed in annually because of exemptions for university-related positions. Recipients can stay up to six years. Demand is usually higher than the cap, so the government holds an annual lottery. This year, the government received nearly 200,000 applications for the available spots in less than a week. \n___ \nWHAT ABOUT AMERICAN JOBS? \nBy law, companies are required to pay at least the prevailing wage for that occupation. In practice, critics say companies can pay less by classifying jobs at the lowest skill levels, even if the specific workers hired have more experience. Many of the overseas workers are willing to work for as little as $60,000 annually, far less than $100,000-plus salaries typically paid to U.S. technology workers. \nAs a result, many U.S. companies find it cheaper simply to contract out help desks, programming and other basic tasks to consulting companies such as Wipro, Infosys, HCL Technologies and Tata in India and IBM and Cognizant in the U.S. These consulting companies hire foreign workers, often from India, and contract them out to U.S. employers looking to save money. Tech workers losing their jobs sometimes have sometimes been required to train their foreign replacements to qualify for severance packages. \nIn some cases, companies must make a good faith effort to hire a U.S. worker before turning to an H-1B worker, but there are many exceptions to this requirement. \n___ \nTRUMP ‘S CARDS \nThe Trump administration can do a few things on its own. \nA few weeks ago, the Trump administration issued a stern warning to U.S. companies that it would investigate and prosecute those who overlook qualified American workers for jobs. An official with the U.S. Citizenship and Immigration Services also circulated a memo intended to reserve approvals for computer programming to more senior positions. Although the memo doesn’t have the force of law and is merely intended as guidance for employees reviewing individual cases, it could make it more difficult for entry-level workers to get approved. \nBeyond that, the administration could scrap the current lottery approach and give priority to higher-paying jobs, thereby weeding out lower-paying, entry-level positions. Trump wants individual departments in his administration to come up with proposals. \n___ \nWHAT ABOUT CONGRESS? \nOne bill, proposed by Sens. Dick Durbin, an Illinois Democrat, and Charles Grassley, a Republican from Iowa, would require companies seeking H-1B visas to first make a good-faith effort to hire Americans, a requirement that applies to only some companies under the current system. It would also give the Labor Department more power to investigate and sanction H-1B abuses and give “the best and brightest” foreign students studying in the U.S. priority in getting H-1B visas. \nReps. Darrell Issa and Scott Peters - a Republican and a Democrat, both from California- propose raising the minimum annual salary for certain exemptions to $100,000, from $60,000. The change could make even more companies subject to the requirement to try to hire U.S. workers first. \nRep. Zoe Lofgren, a California Democrat and former immigration lawyer whose district includes the heart of Silicon Valley, has proposed raising the minimum salary even higher, to $130,000. Her bill also would give priority to higher-paying jobs, while setting aside 20 percent of spots to smaller businesses, which might not be able to pay as much. \n___ \nAP Technology Writer Michael Liedtke in San Francisco and Business Writer Paul Wiseman in Washington contributed to this story.  ", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:54.000+03:00"}]