[{"entities": {"locations": [], "organizations": [], "persons": []}, "ord_in_thread": 0, "thread": {"site_full": "www.thereporter.com", "site_section": "http://www.thereporter.com/section?template=RSS&profile=4004890&mime=xml", "domain_rank": null, "replies_count": 0, "country": "US", "section_title": "RSS Feed from The Reporter: http://www.thereporter.com", "title": "Iowa State ROTC accuses cadet of making up sex assault claim", "title_full": "Iowa State ROTC accuses cadet of making up sex assault claim", "published": "2017-04-19T03:38:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9soV4T7Mg_PbxO07jDhw.PoPKRmue4J3knYAoLUs4p56i4.m26lwLFZDQPVyxUimt5zju1nZD6Pw--", "site": "thereporter.com", "main_image": "http://local.thereporter.com/common/dfm/assets/logos/small/thereporter.png?042017", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "e06179b253b75b17f44cadb5d3a4703922aace9f", "site_type": "news"}, "title": "Iowa State ROTC accuses cadet of making up sex assault claim", "published": "2017-04-19T03:38:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9soV4T7Mg_PbxO07jDhw.PoPKRmue4J3knYAoLUs4p56i4.m26lwLFZDQPVyxUimt5zju1nZD6Pw--", "author": "Ryan J. Foley, Associated Press", "crawled": "2017-04-19T08:38:54.000+03:00", "language": "english", "text": "Iowa State ROTC accuses cadet of making up sex assault claim By Ryan J. Foley, Associated Press Posted: # Comments \nIOWA CITY, Iowa (AP) \u0097 Iowa State University's military training program has expelled a promising cadet, accusing him of falsely claiming that he was sexually assaulted during an altercation that left him hospitalized. \nThe cadet testified that during a July 4 bonfire near his family's lake house in Nebraska, a 19-year-old acquaintance rubbed the cadet's genitals and inner legs with a beer bottle against his wishes. He said he pushed the man away, and that the man hit him on the head with a bottle. The cadet went to the hospital in need of several stitches on his face. \nISU Navy ROTC commanding officer Capt. Scott Curtis alleges that the cadet, his lawyer and supporters concocted the sexual assault claim to win sympathy from military officials and paper over that the cadet had been in a fight while drinking underage \u0097 he was 20 at the time. Curtis has adopted a panel's recommendations to expel the student from the ROTC program and require him to pay back 2 ½ years of out-of-state tuition and stipends, which is expected to amount to about $100,000. \nSupporters of the cadet, who'd long dreamed of becoming a Marine Corps officer, say the conspiracy claim is outrageous and that the sexual assault did occur, noting that a friend of the cadet who was there corroborated his story in testimony. They're calling on the Navy to reinstate him and investigate the program, which is dealing with an unrelated scandal in which seven members were involved in taking and posting explicit photos of themselves on Facebook. Advertisement \nThe student's attorney, Sean Timmons, said the case shows how male-on-male sexual assault in the military isn't taken seriously. \n\"Instead of being concerned about his injury, they mocked him,\" said Timmons, who specializes in military law. \"They only looked at it from the point-of-view that this had to be two drunken guys fighting. Everything we say is fiction and a lie and some kind of conspiracy.\" \nHe said his client is being treated more harshly than those involved in the Facebook case, who remain with the program. His appeal has remained pending for months without action from Navy leaders. An inquiry by the university into the program's treatment of the cadet, who is in his junior year, is also open. \nCurtis declined to comment Tuesday. \nA Nebraska sheriff's investigation of the incident was inconclusive and led to no charges. The other man involved told investigators that he swung the bottle in self-defense after the cadet punched him for no reason. \nDuring training in California days after the incident, the cadet told military officials that his injuries were work-related and was cleared to participate. \nThe ROTC launched a review after learning from the sheriff's office that he had been assaulted and hospitalized, alleging he hadn't been forthcoming about what happened. The cadet later told the ROTC that he'd been embarrassed to report the improper touching. \nThe cadet declined to cooperate with police or pursue charges, saying he wanted to put the matter behind him. He admits he consumed alcohol earlier that evening. \nThe Associated Press isn't naming him under a policy of generally not identifying sexual assault victims. Improper touching qualifies as assault under military rules. \nIn his removal decision, Curtis wrote that the cadet is smart, disciplined, fit and has significant officer potential. He said underage drinking and fighting alone wouldn't end his career. But Curtis accused the cadet of going along with an unethical legal strategy that attempted to take advantage of the sensitivity surrounding sexual assault, calling that a disservice to actual victims. \nTimmons, his lawyer, said that claim had no factual basis and revealed bias against his client, adding that a female making the same report would've been taken seriously. \n___", "external_links": [], "highlightTitle": "", "uuid": "e06179b253b75b17f44cadb5d3a4703922aace9f", "highlightText": "", "rating": null}]