[{"uuid": "e07c9fac736eea9717c3beccd87c2ce5ae53453a", "url": "http://omgili.com/ri/jHIAmI4hxg_qs.PqEroUOAqNp6Hi30iXbdMizOFMnU4kVBQy4IMeh9Vv.QR9M7QrHu8EHuXGXqs-", "title": "Stephen Gottlieb: The Future Of Jobs", "author": "Stephen Gottlieb", "rating": null, "published": "2017-04-18T23:25:10.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "wamc", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "american politics", "sentiment": "none"}, {"name": "tea party", "sentiment": "none"}, {"name": "alumni house", "sentiment": "none"}, {"name": "civilian conservation corps", "sentiment": "none"}, {"name": "yale", "sentiment": "none"}, {"name": "us peace corps", "sentiment": "none"}, {"name": "works progress administration", "sentiment": "none"}, {"name": "roberts court", "sentiment": "none"}, {"name": "albany law school", "sentiment": "none"}, {"name": "board of the new york civil liberties union", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "persons": [{"name": "stephen gottlieb", "sentiment": "none"}, {"name": "steve gottlieb", "sentiment": "none"}, {"name": "jay", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "ruth caplan", "sentiment": "none"}, {"name": "john adrian witt", "sentiment": "none"}, {"name": "franklin roosevelt", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "e07c9fac736eea9717c3beccd87c2ce5ae53453a", "url": "http://omgili.com/ri/jHIAmI4hxg_qs.PqEroUOAqNp6Hi30iXbdMizOFMnU4kVBQy4IMeh9Vv.QR9M7QrHu8EHuXGXqs-", "site_full": "wamc.org", "title": "Stephen Gottlieb: The Future Of Jobs", "site_section": "http://wamc.org/rss.xml", "domain_rank": null, "published": "2017-04-18T23:25:10.000+03:00", "title_full": "Stephen Gottlieb: The Future Of Jobs", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "US", "performance_score": 0, "main_image": "http://mediad.publicbroadcasting.net/p/wamc/files/201606/WAMClogo2016-fbavatar.png", "site": "wamc.org"}, "external_links": [], "language": "english", "text": "/ 4:41 \nAutomation is changing the workforce. It creates some highly skilled jobs but eliminates many others, from service jobs like taxis to previously professional tasks like document review. Factory jobs are decimated by automation. \nThe industrial revolution was largely built on repetitive factory production lines, based on physical dexterity, repetition and obedience, not higher education. Automation handles repetitive tasks well. Eliminating them affects people very unequally. \nHow can we deal with that change? The historic Republican free-market approach, now pushed by Tea Party Republicans who control Congress, is that it’s none of our business. For them, it’s every man, woman and child for him- or herself. Millions in breaks for big corporations and no security for the workers whose lives and livelihoods are the playthings of markets, financial institutions and corporate interests. But woe to countries that forget their people, engulfed in power struggles and bloody civil wars with the fate of ordinary, hard-working and decent people as talking points and engines of recruitment. \nSome jobs have been divided into a large class of “aids.” In Iran everyone from middle class up had a bagi, their term for servant. It’s a world of dependency, power, and deep social division, a world in which people can be taken advantage of. The market, so sacred to the ideologues, is pushing more and more people to join the service economy as maids, waiters, servants and sometimes as sex workers. Notice the contrary pressures on the women’s movement, with some vying for the few high-end jobs and others being pressured into demeaning and dangerous activity. \nWe might share good jobs. Labor unions once looked toward a five-hour day. Or we might create jobs, keeping everyone busy and satisfying more of the community’s needs, from building and repairing bridges, roads, water systems and electric and internet grids, to watching over playgrounds. But actually we’re going the other way. Jobs that can create opportunities are being dropped. The pressures are all on workers to find or create ways to survive. We all feel the taxes but don’t notice the benefits. \nI see our separation by wealth, color and origin blinding us to common problems. John Adrian Witt, a Yale historian speaking at Alumni House last week, sees organizational failure, like the 1920s before unions and public service organizations finally jelled, leading toward the New Deal reforms in the 1930s. \nThe New Deal gave us a powerful administrative state, capable of opposing and controlling corporate greed that demeaned and poisoned workers with dangerous equipment, noxious chemicals and contaminated foods. But that effective administrative state became the Republican target, stated theoretically as “regulation” – regulation everyone can be against unless broken down to the safety and honesty it is designed to protect. \nThere is also an ideological issue, especially when the unchecked power of the market is pushing the public to turn on each other and itself. \nWorkers are entitled to security. Graduates of high school, colleges, and universities are entitled to good jobs. Our job should not be to ask workers to justify their lives to the market; it should be to employ people to make a better America, much as the New Deal of Franklin Roosevelt founded the Civilian Conservation Corps, the Works Progress Administration and many others. We can support each other, and make a better America for all of us. The market isn’t the answer; the market is the problem. When it doesn’t do what we need, we need to do what it screwed up. \nSteve Gottlieb is Jay and Ruth Caplan Distinguished Professor of Law at Albany Law School and author of Unfit for Democracy: The Roberts Court and the Breakdown of American Politics . He has served on the Board of the New York Civil Liberties Union, and in the US Peace Corps in Iran. Steve maintains a blog: constitutionalismanddemocracy.wordpress.com \nThe views expressed by commentators are solely those of the authors. They do not necessarily reflect the views of this station or its management. Tags:", "ord_in_thread": 0, "crawled": "2017-04-18T23:25:10.000+03:00"}]