[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:16:28.000+03:00", "author": "Lanre Bakare", "entities": {"persons": [{"name": "emma mcintyre/get", "sentiment": "negative"}, {"name": "drake", "sentiment": "negative"}, {"name": "mojave will toledo", "sentiment": "none"}, {"name": "sam shepherd", "sentiment": "none"}, {"name": "anthony pidgeon/redferns", "sentiment": "none"}, {"name": "zaytoven", "sentiment": "none"}, {"name": "tabatha", "sentiment": "none"}, {"name": "denton", "sentiment": "none"}, {"name": "justin vernon", "sentiment": "none"}, {"name": "mitski miyawaki", "sentiment": "none"}, {"name": "michael mcdonald", "sentiment": "none"}, {"name": "eddie vedder", "sentiment": "none"}, {"name": "jk  mitski", "sentiment": "none"}, {"name": "dan medhurst", "sentiment": "none"}, {"name": "francis", "sentiment": "none"}, {"name": "jk  roísín murphy", "sentiment": "none"}, {"name": "murphy", "sentiment": "none"}, {"name": "radiohead", "sentiment": "none"}, {"name": "donald glover-endorsed", "sentiment": "none"}, {"name": "migos", "sentiment": "none"}, {"name": "bon iver", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "bougie", "sentiment": "none"}, {"name": "aleksandra denton", "sentiment": "none"}, {"name": "kieran hebden", "sentiment": "none"}, {"name": "vernon", "sentiment": "none"}, {"name": "dan snaith", "sentiment": "none"}, {"name": "kevin", "sentiment": "none"}, {"name": "thundercat", "sentiment": "none"}, {"name": "valerie", "sentiment": "none"}, {"name": "roísín murphy", "sentiment": "none"}, {"name": "madonna", "sentiment": "none"}, {"name": "mitski", "sentiment": "none"}, {"name": "kendrick lamar", "sentiment": "none"}, {"name": "victoria ruiz", "sentiment": "none"}], "locations": [{"name": "daphni", "sentiment": "none"}, {"name": "coachella  atlanta", "sentiment": "none"}, {"name": "la", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "monto", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "yuma", "sentiment": "none"}, {"name": "mojave", "sentiment": "none"}, {"name": "sonora", "sentiment": "none"}, {"name": "car seat headrest", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "mojave  facebook twitter pinterest shura", "sentiment": "neutral"}, {"name": "emi", "sentiment": "none"}, {"name": "weezer", "sentiment": "none"}, {"name": "yuma  facebook twitter pinterest", "sentiment": "none"}, {"name": "house of glass", "sentiment": "none"}, {"name": "jk  warpaint", "sentiment": "none"}, {"name": "mojave  facebook twitter pinterest", "sentiment": "none"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "gobi  facebook twitter pinterest mitski", "sentiment": "none"}, {"name": "gobi  facebook twitter pinterest disaffected", "sentiment": "none"}, {"name": "st vincent", "sentiment": "none"}, {"name": "facebook twitter pinterest roísín murphy", "sentiment": "none"}, {"name": "sonora  facebook twitter pinterest victoria ruiz of downtown boys", "sentiment": "none"}, {"name": "radiohead", "sentiment": "none"}]}, "text": "Shura – Mojave\nFacebook Twitter Pinterest Shura … shoegazey dream-pop Photograph: Emma McIntyre/Getty Images for Coachella\nIf Madonna was in a shoegaze band, it would sound a bit like Shura . Armed with sequencer and synth, denim jacket, and seapunk green streaks, the 25-year-old Aleksandra Denton connected with her impressive midday crowd by bashing through acclaimed debut album Nothing’s Real with equal parts sugar and grit.\nWith drums and guitar for support, Denton flitted through myriad voices of dream-pop, new wave, even a touch of 90s r’n’b, but she closed the set bashing her sequencer with closed fists and right hooks with real triumphant rock’n’roll vigor. It’s rare you see any aggression on stage nowadays, but Smith was thrashing around like a particularly ornery Eddie Vedder at the finale.\nJK\nMitski – Gobi\nFacebook Twitter Pinterest Mitski delivered reflections on modern American teenhood. Photograph: Valerie Macon/AFP/Getty Images\nFor the early risers Mitski’s blend of Morrissey-style self reflection and pop punk was a soothing start to a day when many hangovers were being nursed. Mitski Miyawaki’s fragile songs – which lyrically are somewhere between the Smiths and St Vincent, while musically owe a debt to Weezer and Teenage Fanclub – might not sound like aural electrolytes but despite the heavy content it’s her subtle delivery that makes them soothing. Backed by just a drummer and guitarist, she runs through songs from her two most recent critically lauded albums , including Francis Forever and Happy that provide a downcast look at the state of American teenhood.\nFor the quiet crowd that saw more people sitting down than standing, it was a gentle, if slightly sombre start to the day that picked up speed only with the pop punk of Townie. The screeching guitar solo of that song was in stark contrast to some of her slower numbers but on the second day of a grueling desert festival it was no bad thing.\nLB\nDowntown Boys – Sonora\nFacebook Twitter Pinterest Victoria Ruiz of Downtown Boys. Photograph: Matt Cowan/Getty Images for Coachella\nThere was a distinctly mellow vibe to yesterday’s proceedings, the calm before the sandstorm that was to follow. An early afternoon spot for a band that describe themselves as a “bi bilingual political dance sax punk party” acted as an early sign that Saturday was heading in a very different direction.\nPlaying to just a handful of festival-goers, the Downtown Boys were at least perfectly suited to their stage, the brand new Sonora tent that felt like a grimy club on the lower east side of Manhattan. Their frenetic set allowed for some enthused moshing at the front but it remained difficult to distinguish each song from the next and while lead singer Victoria Ruiz tried to inject political sentiment to her riffing between songs, it was a mixed bag of buzzwords and little else. As she dedicated a later song to those who just want to say no to “a mom who doesn’t understand them”, the lone cheer suggested that even the millennials on site were a bit too old for this rather empty brand of musical anger.\nBL\nCar Seat Headrest – Mojave Will Toledo’s turquoise suit was the most entertaining part of Car Seat Headrest’s languid daytime strum-along in the Mojave. Hawking Sonic Youth and The Silver Jews in equal amount, the set was hackneyed, backwards-looking and didn’t feel very much like “ the future of US rock ” as some have suggested.\nWith all that’s going on in the world right now, bedroom indie rock, a genre defined by mopey dudes lamenting the minutiae of their love lives and hamming the same three chords for decades, has very little to offer. But then again, maybe that’s the appeal? Rock’n’roll may never truly die, but if it lives on for now in limp facsimiles like Car Seat Headrest, it’ll be a very long road to reincarnation.\nJK\nThundercat – Mojave\nFacebook Twitter Pinterest Drunk-en master … Thundercat. Photograph: Anthony Pidgeon/Redferns\nA packed-out Mojave crowd impatiently awaited the arrival of Thundercat , whose new album Drunk has brought the multi-genre talent more critical and commercial success than he’s experienced before. His atmospheric funk proved to be easily digestible sunset listening although he couldn’t resist extending the brief running time of his new tracks (the majority of which are under three minutes), each drifting into jazzy freestyling longer then needed.\nGiven the starry lineup of Drunk (and his impressive resumé), there was also a lingering sense of anticipation over who might join him on stage (frequent collaborator Kendrick Lamar is tomorrow’s headliner after all). But, in a joyfully unexpected move, he brought on Michael McDonald to the stage, much to the confusion of a twentysomething crowd largely unaware of his work. The pair performed album track Show Me the Way before McDonald, assisted by Thundercat, stormed through a crowd-pleasing rendition of What A Fool Believes, its hook remaining as effective as ever. It was a perfect moment in a set that contained slick highs and a bit too much instrumental overindulgence.\nBL\nFour Tet/Daphni/Floating Points – Yuma\nFacebook Twitter Pinterest A busy man … Floating Points aka Sam Shepherd. Photograph: Dan Medhurst\nFour Tet , Daphni , and Floating Points are like the three wise men of indie-informed electronic music. Four Tet AKA Kieran Hebden could headline anywhere from Low End Theory in LA to Fabric in London, Daphni AKA Dan Snaith has already conquered the indie world with his adored Caribou moniker, and Floating Points AKA Sam Shepherd was fresh from a set in the Mojave Tent playing analog synth in the jazzy, jammy post-rock trio that forms the live iteration of his act. Suffice to say, their modus operandi favors chinstroking more than fistpumping.\nWhen these three get together, there’s a tendency towards disco. They used the genre as a launchpad to explore the fringes of beat-driven music, from soul to minimal techno, for almost four hours – a marathon session by Coachella standards. Their intellectual bent did not obscure from the euphoria of their selections, and the Yuma tent was brimming with positive energy and questionable dance moves –two requirements for any good party.\nJK\nRoísín Murphy – Gobi In a noticeably quiet tent, Roísín Murphy appeared on stage dressed in one of many costumes that would play a huge part in her late afternoon set. Competing against local favourite Thundercat, who was in the adjacent tent, meant there was an intimate feel to a performance that was anything but low-key. Last year her album Take Her Up to Monto was deemed “ still too strange for the bigtime ” and her tendency toward the experimental, rather than the mainstream was on display in the desert.\nFacebook Twitter Pinterest Roísín Murphy … experimental excellence. Photograph: Rich Fury/Getty Images for Coachella\nFrom set opener Thoughts Wasted, the crowd were given a set that felt more like experimental theatre at times than the pop starlet EMI thought they had signed 10 years ago. A slew of onstage props and costumes were casually draped over synths and mic stands, with Murphy picking and choosing at will as if in a thrift store stocked exclusively with paraphernalia from the most out-there of theatre companies.\nNods to her earlier more poppy phase featured, such as Tell Everybody during which she picked up a bag that came in the shape of a bear, unzipped it and proceeded to pull about 25ft of red ribbon from inside it. Those choices and her set which included newer more avant garde material such as Gone Fishing, which was inspired by the classic voguing documentary Paris Is Burning, made for a show that was at times more challenging than accessible to even a clearly committed crowd. For Murphy, clearly performance comes before anything else, and when the spell was broken by a roadie who adjusted a bell she was playing during the low-slung new track Whatever, the annoyance was clear to see .\nThe last portion of the set saw a 4/4 beat finally feature with House of Glass raising the tempo and giving a crowd which was clearly champing at the bit for something to dance to, a chance to do just that. But rather than running through songs from Overpowered, the set finished with a eight-minute jam of Exploitation with Murphy swapping outfits, finally finished up with an archery target mask. It was a slightly manic end to a set that was possibly the most experimental performance Coachella will see.\nLB\nFuture – Main Stage\nFacebook Twitter Pinterest Fake love? Drake and Future. Photograph: Kevin Winter/Getty Images for Coachella\nAtlanta trap iconoclast Future drew a crowd almost as big as Radiohead’s the night before at the main stage. Heavy on visual and sartorial style, Future’s oversized persona fit the massive setting, even if his music failed to match that stature . Future’s tunes sat somewhere between softball hip-hop and radio-appropriate pop hooks. His overtures towards the abstract flatter to deceive any semblance of depth.\nFuture brought out fellow Atlanta rappers Migos for a shouty rendition of their Donald Glover-endorsed hit Bad and Bougie, with beatmaker Zaytoven also in the mix. But that was not the extent of the surprises. When Drake appeared to perform their collaboration Jumpman, a cacophony of squeals erupted from the audience and bodies rushed towards the stage from all sides. Drake took the lead for three tracks – including ubiquitous radio hit Fake Love – and led the crowd in a sporting round of sing-along of the track before leaving the stage to Future, who delivered one more song as the crowd began to leave after Drake departed.\nJK\nWarpaint – Gobi\nFacebook Twitter Pinterest Disaffected, if proficient … Warpaint. Photograph: Tabatha Fireman/Redferns\nAs a band who often feel uncomfortable on a big stage (they were particularly ill-suited as a headliner for 2014’s Field Day in London), Warpaint were wisely picked for the more intimate Gobi tent, which when darkness sets in, feels almost like a four-walled gig venue. They were also accompanied by a compellingly flashy stage yet despite the efforts, there’s still something unavoidably flat about their presence when live.\nIt certainly can’t be traced back to their instrumental skills with all four members providing a technically accomplished performance. But while the choice of stage might have forced a level of intimacy, there’s still a spark missing. It doesn’t help that so many of their songs, intriguing individual elements aside, are incredibly difficult to remember once they’re over. It resulted in a set that felt lost within a festival packed with more distinctive acts, working hard to gain new fans. Warpaint’s disaffected, if proficient, shtick is for their hardcore following only.\nBL\nBon Iver – Main Stage On Friday, the xx struggled to make the difficult second-from-top spot their own, but on Saturday Bon Iver managed to put together a complex, layered set that managed to entertain while staying true to his latest album, 22, a Million . That record, with its focus on big production, numerology and lavish use of auto-tune divided fans, but as a big stage production its lofty ambition was realised. With a full horn section and backing band with huge screens plastered in visuals, numbers and hieroglyphs, this version of Bon Iver was very different from the one who emerged with delicate songs about heartbreak from a cabin in the woods back in 2008.\nHere tracks like 715 – CRΣΣKS with its stuttering composition and moments of pained auto-tune were received with shouts of appreciation. Bon Iver AKA Justin Vernon looked more like a record store employee with his ever-present headphones and T-shirt sporting the name of DJ collective Discwoman. But despite the dressed-down attire, songs like 29 #Strafford APTS and 33 “GOD”, felt huge with Vernon’s well-honed live set that wasn’t hampered by any of the technical difficulties Radiohead suffered.\nLB\nTopics Drake Bon Iver Festivals Thundercat Warpaint reviews ", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_njnmhMw67pA208b..J16JpQ5Q83kGO4pZV6yeKrK00NKNZ_1174Y1ZEsTZChthQZOcZo_jiuWGOkoTTsNWw9DIzj6AnY9yzz0hg0FBktJcwu8g0TSzAE98GLsx._onbJxRCgs8enDCzM-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:16:28.000+03:00", "language": "english", "title": "Coachella 2017: Saturday acts Bon Iver, Future, Drake and more reviewed | Music", "thread": {"title_full": "Coachella 2017: Saturday acts Bon Iver, Future, Drake and more reviewed | Music | The Guardian", "site_full": "www.theguardian.com", "site": "theguardian.com", "site_section": "http://www.theguardian.com/theguardian/2014/aug/11/mainsection/rss", "performance_score": 0, "social": {"gplus": {"shares": 1}, "pinterest": {"shares": 2}, "facebook": {"likes": 30, "shares": 30, "comments": 0}, "linkedin": {"shares": 1}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "news", "spam_score": 0.0, "domain_rank": 170, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "The Guardian", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_njnmhMw67pA208b..J16JpQ5Q83kGO4pZV6yeKrK00NKNZ_1174Y1ZEsTZChthQZOcZo_jiuWGOkoTTsNWw9DIzj6AnY9yzz0hg0FBktJcwu8g0TSzAE98GLsx._onbJxRCgs8enDCzM-", "published": "2017-04-16T09:16:28.000+03:00", "title": "Coachella 2017: Saturday acts Bon Iver, Future, Drake and more reviewed | Music", "uuid": "e2e4f6e275158d4d6f3fcedd10c59cc285639545", "main_image": "https://i.guim.co.uk/img/media/3532198738c9cb0d50bd21f65154781eff134394/0_175_4718_2830/master/4718.jpg?w=1200&amp;h=630&amp;q=55&amp;auto=format&amp;usm=12&amp;fit=crop&amp;crop=faces%2Centropy&amp;bm=normal&amp;ba=bottom%2Cleft&amp;blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&amp;s=64e96093c21fae979c52c535aa132c83"}, "uuid": "e2e4f6e275158d4d6f3fcedd10c59cc285639545", "ord_in_thread": 0}]