[{"entities": {"organizations": [{"name": "facebook", "sentiment": "none"}, {"name": "youtube channel", "sentiment": "none"}], "locations": [{"name": "korea", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "kim il-sung square", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "persons": [{"name": "kim jong-un", "sentiment": "none"}, {"name": "subsribe", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "rick wells", "sentiment": "none"}, {"name": "kim il-sung", "sentiment": "none"}]}, "uuid": "e3c40907a53ff45fd3c6e12fb8b59e51bf3abea6", "highlightText": "", "title": "Most Urgent, Troubling Kim Jong-un Questions Still Unanswered In N Korea", "thread": {"site": "rickwells.us", "country": "US", "participants_count": 0, "site_full": "rickwells.us", "section_title": "", "uuid": "e3c40907a53ff45fd3c6e12fb8b59e51bf3abea6", "site_section": "", "domain_rank": null, "main_image": "http://rickwells.us/wp-content/uploads/2017/04/844-kim-jong-un-1200.png", "performance_score": 0, "published": "2017-04-16T15:39:00.000+03:00", "url": "http://omgili.com/ri/WOapK6QZrmkFUx8LdG.RHhQubzLIvd5XessCTf3o9wBqiTk.OARWczDRcoI8NopvTYf_LKZS4Sv0jwYylkTKB18uP6EOPSKirJDbWemRbyw-", "title_full": "Most Urgent, Troubling Kim Jong-un Questions Still Unanswered In N Korea", "title": "Most Urgent, Troubling Kim Jong-un Questions Still Unanswered In N Korea", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.001, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T15:39:00.000+03:00", "url": "http://omgili.com/ri/WOapK6QZrmkFUx8LdG.RHhQubzLIvd5XessCTf3o9wBqiTk.OARWczDRcoI8NopvTYf_LKZS4Sv0jwYylkTKB18uP6EOPSKirJDbWemRbyw-", "ord_in_thread": 0, "crawled": "2017-04-16T23:04:38.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Rick Wells", "text": "Most Urgent, Troubling Kim Jong-un Questions Still Unanswered In N Korea Posted on April 16, 2017 by Rick Wells in Foreign Policy // 4 Comments Share With Your Friends On Facebook, Twitter, Everywhere 4 Shares \nThe most perplexing question about Kim Jong-un was never addressed in the report of the festivities Saturday celebrating his own “greatness” and that of his grandfather and father who preceded him in the brutal family business of dictatorship. That question is a multifaceted one, primarily focused on how a dictator whose hair looks like somebody pinched one off on his head is able to determine when he’s got it just right. How does he know when it looks good? When is the flip angle perfect, the amount of curl just right? What happens to people who call him Sh*thead? \nFailing to address that important issue, the rest of the report on festivities was of the customary communist template that we’ve seen countless times before. Military might was front and center as the procession passed in front of the reviewing stand of officials. \nThe celebration took place in Kim Il-sung Square, in the center of the North Korean capitol city, Pyongyang, marking the 105th anniversary of the birth of Kim Il-sung. The reporter points to the seated Kim Jong-un watching all that is unfolding before him. Talk about pressure, those human statues know if they make one wrong move their dear leader will have them put down. It’s a bad time for their allergies to be acting up. \nKim leans over the railing to wave to the adoring masses below and feed his little, reality-challenged porkchop ego with assurances that he is in fact as great as all of those participation trophies, awards and medals he’s received throughout his life have said he is. \nThe official event proved to the world that North Korea is not the primitive, bland and hopeless society we’ve been led to believe here in the West. They do have balloons, as we learned from watching the aerial display. They also have pink and red flowers or colored toilet paper on a stick – it’s tough to tell which. They’re probably flowers, it’s unlikely they’ve progressed to the point of having toilet paper, or of mastering its use. The balloons are surely imported too. Some will be brought over to Kim’s playroom when all of this is over. \nThe centerpiece of the function, the North Korean missiles, are all theirs. Grandpa’s meaningless birthday, the waving to the crowds, the marchers, all of that is sideshow. The missiles were what they wanted us to see, and they brought the attention of the entire world through their provocations, to view them. We were also treated to the implied and overt threats. \nThis guy really knows how to throw a party. \n\nThank you for reading and sharing my work – P lease look for me, Rick Wells, at http:// www.facebook.com/RickRWells/ , http://www.gab.ai/RickRWells , https://plus.google.com/u/0/+RickwellsUs and on my website http://RickWells.US – Please SUBSCRIBE in the right sidebar at RickWells.US – not dot com. I’m also at Stop The Takeover, https://www.facebook.com/StopTheTakeover/ and please follow me on Twitter @RickRWells . Subsribe also on my YouTube Channel. Share With Your Friends On Facebook, Twitter, Everywhere "}]