[{"entities": {"persons": [{"sentiment": "none", "name": "kulasekara pandian"}, {"sentiment": "none", "name": "sulthan alauddin badusha"}, {"sentiment": "none", "name": "deivayanai"}, {"sentiment": "none", "name": "gandhi"}, {"sentiment": "none", "name": "buddha"}, {"sentiment": "none", "name": "goddess parvati"}, {"sentiment": "none", "name": "sulthan shamsuddin badusha"}, {"sentiment": "none", "name": "surapadman"}, {"sentiment": "none", "name": "samanar malai"}, {"sentiment": "none", "name": "rani"}, {"sentiment": "none", "name": "murugan"}, {"sentiment": "none", "name": "jain"}], "organizations": [{"sentiment": "none", "name": "gandhi museum"}, {"sentiment": "none", "name": "sree meenakshi amman temple"}, {"sentiment": "none", "name": "samanar hills"}, {"sentiment": "none", "name": "svr"}], "locations": [{"sentiment": "none", "name": "madurai"}, {"sentiment": "none", "name": "pandyas"}, {"sentiment": "none", "name": "chennai"}, {"sentiment": "none", "name": "thirupparankundram murugan temple"}, {"sentiment": "none", "name": "tamil nadu"}, {"sentiment": "none", "name": "keelakuyilkudi"}, {"sentiment": "none", "name": "azhaga hills"}, {"sentiment": "none", "name": "india"}]}, "text": "5 Enchanting Places in Madurai 0 Download Flag as Inappropriate \nPlease select the category that most closely reflects your concern about the presentation, so that we can review it and determine whether it violates our Terms of Use or isn't appropriate for all viewers. Submit Embed this comment into your blog: Comment URL: Top 5 Enchanting Places to Visit in Madurai www.ticketgoose.com Slide 2 What comes to mind when you think of Madurai? Take a survey to check what people would say and I bet it’s going to be “Temples” and why not? Madurai is known for its marvellous sculptures carved very intricately but besides this, there are few other things that make Madurai the most visited place in Tamil Nadu; the Dravidian art and culture that has become the hub of the entire southern India, the bustling city whose chatter never ends, the famous bull-taming sport called “Jallikattu”, the sensational greenery and the Arabian or Indian Jasmine Slide 3 All these are by-products of this famous city. With such a flawless and spectacular creation, your visit to this place should never be missed and that too, it being just 462 km from Chennai. If you ever plan to visit, ensure that you make up to these five places; Slide 4 Sree Meenakshi Amman Temple:Madurai city is built around this temple. The city’s structure is shaped in the form of a lotus with the temple in the center and streets in a concentric manner. Slide 5 The city’s structure is shaped in the form of a lotus with the temple in the center and streets in a concentric manner Constructed by the Pandya King Kulasekara Pandian, the temple is dedicated to Goddess Parvati and Lord Shiva. The extensive premises with 1000 pillars inside the temple is an example of architectural brilliance thus making this conception as one of the ideal specimens of the Dravidian architecture. Slide 6 Thirupparankundram Murugan Temple :this temple is considered to be one of the six abodes of Lord Murugan where he slew the evil Surapadman and married Deivayanai. It is built in rock-cut architecture and is believed to have been constructed by the Pandyas during the 6th century. Slide 7 Gandhi Museum : the building that houses the museum was constructed by Queen Rani in the year 1670 AD but was later transformed to Gandhi’s memorial place after his assassination in the year 1959. There is a library in there that holds a vast collection of India’s culture and books written by Gandhi. Also, there is an exhibition section that includes the 265 illustrations of our freedom struggle. Slide 8 Samanar Hills :  also called as Samanar Malai is hill- rock architecture located in Keelakuyilkudi village some 15 km from Madurai city. The hills have caves where Jain monks were believed to have lived. With numerous stone beds and sculptures, this place is worth sight-seeing. Slide 9 Gorippalayam Mosque : Gorippalayam comes from the Persian word “gor” meaning “grave”. Built in the 13th century, it is one of the largest mosques in Madurai housing the tombs of two great rulers; Sulthan Alauddin Badusha and Sulthan Shamsuddin Badusha. Its dome is 70 feet in diameter and 20 feet in height and is made of a single black stone which was brought from the Azhaga Hills. Slide 10 Now, how to reach this vibrant city with such rich cultural heritage also matters because as said by Buddha, “It is better to travel well than to arrive” and for you to travel well ticketgoose.com will be your only buddy. From online bus ticket booking to availing offers, your every move will be at ease. Some of the travel operators providing bus services are National Travels,Universal Travels,KalladaTravels and SVR Travels Slide 11 Being one of the best online bus ticket booking platforms in the nation, ticketgoose.com not only helps you in deciding your bus operator but helps you in availing irresistible bus ticket offers as well so that your entire journey can be delighted and fun-filled. Go places with ticketgoose.com. \nby swathu | Modified: 14 minutes ago \nTopic: Travel & Places Summary: Travel from Chennai to Madurai at lowest fare at ticket goose. Book the tickets at ticket goose and get the discount on booking http://www.ticketgoose.com/bus-tickets/chennai-to-madurai", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "e41ae2af6cba87be27365a63dee37fcb4391be26", "rating": null, "highlightTitle": "", "title": "5 Enchanting Places in Madurai", "thread": {"country": "US", "site": "slideboom.com", "replies_count": 0, "title_full": "5 Enchanting Places in Madurai", "site_categories": [], "performance_score": 0, "section_title": "Latest Presentations", "domain_rank": 14826, "uuid": "e41ae2af6cba87be27365a63dee37fcb4391be26", "main_image": "", "site_type": "blogs", "title": "5 Enchanting Places in Madurai", "spam_score": 0.0, "site_section": "http://www.slideboom.com/rss/latest_presentations.xml", "url": "http://omgili.com/ri/jHIAmI4hxg9YzcRC9uJoIph4LNQkMW6e75FqEy9fKBeNnYQPSg2iqiZJ92HKaXgn", "participants_count": 1, "site_full": "www.slideboom.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:26:22.000+03:00"}, "crawled": "2017-04-18T11:26:22.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9YzcRC9uJoIph4LNQkMW6e75FqEy9fKBeNnYQPSg2iqiZJ92HKaXgn", "highlightText": "", "published": "2017-04-18T11:26:22.000+03:00", "author": "swathu"}]