[{"entities": {"organizations": [{"name": "man wanted for broadcasting cleveland killing on facebook live", "sentiment": "neutral"}, {"name": "man wanted for broadcasting cleveland killing on faceb", "sentiment": "neutral"}, {"name": "facebook live", "sentiment": "none"}, {"name": "cleveland police department", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}], "persons": [{"name": "steve stephens", "sentiment": "none"}]}, "uuid": "e4b41fa5c28f76e4386d8dd9501da7d92bfb8a38", "highlightText": "", "title": "Man Wanted for Broadcasting Cleveland Killing on Facebook Live: Police | NBC New York", "thread": {"site": "nbcnewyork.com", "country": "US", "participants_count": 0, "site_full": "www.nbcnewyork.com", "section_title": "", "uuid": "e4b41fa5c28f76e4386d8dd9501da7d92bfb8a38", "site_section": "", "domain_rank": 20648, "main_image": "http://media.nbcnewyork.com/images/1200*675/police-stock-breaking-119818994.jpg", "performance_score": 0, "published": "2017-04-16T23:16:06.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9i7Tq_O5OR_uhNlys99s5XZ6IsxSRbSM0wSiynE2F38AmIWZC_jIk1Z5Fd4KFzdFvBVUZlskg2_GjOj_4b6YEjOpUAc59xt.1JAHWLY88qh1bNkpSFBdFJCa8XCwKeC3800Hjaoo7Hfg--", "title_full": "Man Wanted for Broadcasting Cleveland Killing on Facebook Live: Police | NBC New York", "title": "Man Wanted for Broadcasting Cleveland Killing on Facebook Live: Police | NBC New York", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.002, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T23:16:06.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg9i7Tq_O5OR_uhNlys99s5XZ6IsxSRbSM0wSiynE2F38AmIWZC_jIk1Z5Fd4KFzdFvBVUZlskg2_GjOj_4b6YEjOpUAc59xt.1JAHWLY88qh1bNkpSFBdFJCa8XCwKeC3800Hjaoo7Hfg--", "ord_in_thread": 0, "crawled": "2017-04-16T23:16:06.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "", "text": "Close Embed this video <script type=\"text/javascript\" charset=\"UTF-8\" src=\"http://www.nbcdfw.com/portableplayer/?cmsID=419573453&videoID=Ntsk6tpaMO_h&origin=nbcdfw.com&sec=news&subsec=national-international&width=600&height=360\"></script> More videos (1 of 9) « » \nPolice are searching for a man who they say committed a murder on Facebook Live in Cleveland, Ohio. Officials are looking for Steve Stephens and they believe he is driving a white colored Ford Fusion. Stephens is armed and dangerous, police said. (Published Sunday, April 16, 2017) Police in Cleveland are searching for a man they said broadcast a killing on Facebook and who claims to have killed other people, authorities said Sunday. The man, named Steve Stephens, is considered armed and dangerous, according to a Cleveland Police Department statement. He was last seen wearing a dark, striped polo shirt. Actual photo of Steve Stephens, homicide suspect's, actual vehicle. Please call 9-1-1 if seen. Plate not yet available. pic.twitter.com/hn8a8nQEAP — Cleveland Police (@CLEpolice) April 16, 2017 The suspect has been described as a black male with medium complexion, 6\"1' in height, 240 lbs in weight and he is currently bald with a beard. Stephens is believed to be driving a recently purchased white Ford Fusion with Ohio temporary tag E363630, which may have been switched out, Cleveland police chief Calvin Williams said at a news conference Sunday afternoon. Arkansas Inmates Scheduled for Execution Ask Court to Review Williams is urging Stephens to turn himself in and not to \"do anymore harm to anybody.\" A video was posted Sunday to a Facebook account apparently belonging to Stephens — the user's name is listed as Stevie Steve, and a city representative confirmed it belongs to him. In the video, the man filming walks up to an older man and, after asking him a question, shoots him. The video, which was posted about 2 p.m. ET and was later taken down, was captioned, in part, \"Easter day slaughter.\" AP Photo/Reed Saxon The homicide that's been confirmed took place at 635 E. 93, police said. The victim has been identified as 74-year-old Robert Goodwin Sr., but police say they don't know the suspect's motive in choosing the victim. Mass Evacuation Postponed After Blast Kills Over 120 Syrians In other videos posted to the same Facebook page, the man filming discusses the killings. \"I'm at the point where I snapped,\" the man says in one video. He added that he's killed 13 people. Pope Decries 'Vile' Attack on Syrians in Easter Address \"And I'm about to keep killing until they catch me,\" he says. He says in comments that he's killed 15 people in the area of 105 freeway. The account was last active about 3:30 p.m. ET. Police have yet to confirm more than one homicide. The FBI has joined Cleveland police in search for Stephens, NBC News reports. Demonstrators Across US Demand Trump Release Tax Returns Facebook has issued a statement stating: “This is a horrific crime and we do not allow this kind of content on Facebook. We work hard to keep a safe environment on Facebook, and are in touch with law enforcement in emergencies when there are direct threats to physical safety.” A Facebook spokesperson said that the murder was not broadcast live on Facebook, as previously reported. The video was later uploaded. \"Although, the suspect did go live at one point during the day,\" the spokesperson said. Chief Williams said anyone with information is asked to call 911."}]