[{"entities": {"organizations": [{"name": "little house of reviews", "sentiment": "none"}, {"name": "downer", "sentiment": "none"}, {"name": "mfa", "sentiment": "none"}, {"name": "durgan", "sentiment": "none"}, {"name": "goodreads / amazon / barnes & noble  excerpt", "sentiment": "none"}], "locations": [{"name": "black river", "sentiment": "none"}, {"name": "brakken", "sentiment": "none"}, {"name": "ny", "sentiment": "none"}, {"name": "durgan", "sentiment": "none"}, {"name": "ungstah", "sentiment": "none"}], "persons": [{"name": "scott keen", "sentiment": "none"}, {"name": "scott keen    rise", "sentiment": "none"}, {"name": "crik", "sentiment": "none"}, {"name": "brakken", "sentiment": "none"}, {"name": "rukmush", "sentiment": "none"}, {"name": "koval", "sentiment": "none"}, {"name": "bio", "sentiment": "none"}, {"name": "durgan", "sentiment": "none"}, {"name": "lori", "sentiment": "none"}, {"name": "hegg", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}]}, "uuid": "e7560d3631a84e1d8a31086135503c4f1ae546ab", "highlightText": "", "title": "Blazing #BlogTour: Rise Of The Branded by Scott Keen", "thread": {"site": "wordpress.com", "country": "US", "participants_count": 1, "site_full": "lovesgreatreadsblog.wordpress.com", "section_title": "Blazing #BlogTour: Rise Of The Branded by Scott Keen – Loves Great Reads Blog", "uuid": "e7560d3631a84e1d8a31086135503c4f1ae546ab", "site_section": "https://lovesgreatreadsblog.wordpress.com", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-11T20:53:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZQle34fKQf9QdfTRWUVhPdORhzFU7oeaSq8worb.Lugwz6.z2swwwEF4hfwxXCcUH_n7kbrbp4k78FkPmaITcgmArYqxtaySFFzX5lW1pNLPjBVtGzpxMIOPYfXFD.HQjY-", "title_full": "Blazing #BlogTour: Rise Of The Branded by Scott Keen", "title": "Blazing #BlogTour: Rise Of The Branded by Scott Keen", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 1}, "language": "english", "published": "2017-04-11T20:53:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZQle34fKQf9QdfTRWUVhPdORhzFU7oeaSq8worb.Lugwz6.z2swwwEF4hfwxXCcUH_n7kbrbp4k78FkPmaITcgmArYqxtaySFFzX5lW1pNLPjBVtGzpxMIOPYfXFD.HQjY-", "ord_in_thread": 0, "crawled": "2017-04-16T23:19:26.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "lovesgreatreadsblog", "text": "\n\n\nRise of the Branded \nScott Keen \n(Scar of the Downers, #2)\nPublication date: November 22nd 2016\nGenres: Fantasy, Young Adult\nPursued into the wild by the soldiers of Ungstah, former slave Crik and the other freed Downers encounter the magical and terrifying nature of their world. They face spectral Shepherds, man-eating Rukmush, and the ancient giants of the earth. When two of their group are captured, Crik is distraught and powerless. \nMeanwhile back in the city, Durgan, former Captain of the King’s Guard who allowed Crik and his friends to escape from Ungstah, is now a Downer, one of the Branded. Amid the murmurings of an uprising among the Branded, Durgan just wants to be left alone to search for his missing son. But in the process, he discovers how dark the powers of Sulfus the king truly are. Durgan must take a stand in the coming war between the Branded and the powerful armies of Sulfus.\nTo kill any hope of escape for the city’s Branded, the army comes after Crik and his friends to make an example of them. The answers for Durgan, Crik and freedom for all Downers lie hidden in the dark recesses of the Northern Reaches, in the treacherous places Crik and his companions are about to enter.\nGoodreads / Amazon / Barnes & Noble \nEXCERPT:\nThey reached the bottom of the stairs and plunged through an open door into a dust-filled atrium. A gray sunlight flowed into the shattered windows, highlighting the smoke from the Pit that found its way in, but was unable to find its way out. Brakken pushed open the outer doors and glimpsed into a courtyard. A few Downers were scattered about. One was sitting in the corner wrapped in a porous blanket, while a few others were standing and whispering in a noonday shadow. Several more unsavory looking Downers were watching them from a balcony.\n“Where are we?” asked Durgan.\n“You’ll see,” said Brakken.\nOne behind the other, with Brakken in front, they walked through the courtyard, opened up a black walnut door, and bounded up several flights of stairs until they came to yet another door. Brakken knocked and waited. Durgan surveyed the area and knew they were not in the part of the Waste he would feel comfortable visiting without Brakken. A minute passed and Brakken knocked again. This time it opened, and standing before Durgan was a young man who looked to be about the age of seventeen. He was short, stocky, with dark hair.\n“Who’s this?” asked the young man.\n“I’d rather not tell you standing out here,” said Brakken.\nThe young man eyed Durgan up and down, and then stepped out of the way to allow them to enter. Before the young man could ask his question again, Brakken smiled and said, “This, Hegg, is Durgan, captain of the city’s watch.”\nHegg smiled at Brakken, and then glanced at Durgan. Suddenly, however, he stumbled back, his young eyes widening in recognition. “I know you!” he cried out, pointing his finger at Durgan and tripping over his own feet. “You are the captain of the city’s watch. What’d you do, Brakken? You led him right to us!”\n“Oh, shut-up!” Brakken smiled, clearly enjoying the reaction. “What I meant to say is that he used to be the captain of the city’s watch. Now!” Brakken lifted up Durgan’s sleeve. “He’s a Downer. And he’s going to help us.”\n“Help you?” cried Durgan. “Help you do what?”\nBrakken ignored the question. “Get Koval.”\nHegg glared at Durgan out of the corner of his eye before he left, leaving Durgan and Brakken alone.\n“What are you talking about?” hissed Durgan. “What is all of this? Who’s that boy? Who’s Koval?”\n“Just be patient,” smiled Brakken. “I’ll let you know in a minute.”\nGrabbing Brakken by the shirt, Durgan wrenched him close, but the smile never left the young man’s freckled face. “Tell me now or I’m out of here. My wife is alone in your house, defenseless. I don’t have time for these games.”\nSomeone behind Durgan coughed, and when he spun around, he spotted Hegg standing next to another young man. Durgan released Brakken and scowled at them.\n“Who are you?” he snarled.\nBrakken spread his arms wide open and grinned. “We, Durgan, are the Branded. You met Hegg. The other one is Koval. We are the beginning of your army.”\n\nAuthor Bio: \nScott grew up in Black River, NY, the youngest of three children. While in law school, he realized he didn’t want to be a lawyer. So he did the practical thing – he became a writer. Now, many years later with an MFA in script and screenwriting, he is married with four daughters, two of whom he home schools.\nWebsite / Goodreads \nGIVEAWAY! \na Rafflecopter giveaway \n\nBlog Tour Schedule: April 10th \n– The Page Unbound >> Excerpt\n– 2 girls who love books >> Review\n– BooksChatter >> Interview\nApril 11th \n– BrizzleLass Books >> Guest post\n– Padme’s Library >> Interview\n– Bibliofagista >> Review\n– Loves Great Reads >> Excerpt \nApril 12th \n– The Avid Reader >> Excerpt\n– reviewsbyang >> Review\n– So Few Book >> Interview\nApril 13th \n– Lori’s Little House of Reviews >> Review\n– Reading for the Stars and Moon >> Review\n– Brooke Blogs >> Guest post\nApril 14th \n– LILbooKlovers >> Guest post\n– The Pursuit Of Bookiness >> Review\n– Cranky TBC >> Review\n– CBY Book Club >> Excerpt\n\n\n♥ Facebook ♥ Twitter ♥ Tumblr ♥ GoodReads ♥ DON’T FORGET TO FOLLOW OUR BLOG. \n. "}]