[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:04:52.000+03:00", "author": "", "entities": {"persons": [{"name": "oklaho", "sentiment": "negative"}, {"name": "johnson", "sentiment": "none"}, {"name": "christopher p. reen", "sentiment": "none"}, {"name": "glen johnson", "sentiment": "none"}, {"name": "gary pierson", "sentiment": "none"}], "locations": [{"name": "oklahoma", "sentiment": "none"}], "organizations": [{"name": "oklahoman editorial board", "sentiment": "none"}, {"name": "legislature", "sentiment": "none"}, {"name": "georgetown university", "sentiment": "none"}, {"name": "the oklahoma publishing company", "sentiment": "none"}]}, "text": "You are viewing a commentary from a contributor to The Oklahoman. After two rough years, will Oklahoma higher ed budget fare better this year? Published: April 16, 2017 12:00 AM CDT Updated: April 16, 2017 12:00 AM CDT 0 shares facebook twitter email comments Advertisement \nTHE Legislature last year cut the state's higher education budget by 16 percent, a clear message that lawmakers felt higher ed could absorb the blow easier than other core government agencies. Will they send a different message this year? \nChancellor Glen Johnson hopes so, and even says he has “reasonable” optimism that higher ed's budget might even stay flat. That may be overly optimistic in a year when the state has an $878 million budget hole to fill, but it's encouraging that Johnson says the tone of his conversations with legislators has improved over last year. \nAt that time, while the state faced a budget deficit exceeding $1 billion, a campaign was underway that would ask voters to approve a 1-cent increase in the state sales tax. The primary pitch was that it would fund pay raises for K-12 teachers, but higher education also stood to get a large slice of the annual revenue. That effort irked some lawmakers. \nVoters in November overwhelmingly rejected the initiative, thus turning the funding of teacher pay raises into a front-burner issue for this session. But lawmakers should keep higher ed's needs and challenges in mind as they craft this year's budget. \nThe $157 million cut from higher education for this fiscal year followed a cut of $116 million the year before. Higher ed's appropriation of $810 million for the current fiscal year, which ends June 30, is within a few million dollars of what it received from the Legislature for fiscal 2001. \nAmong other things, this year's cuts resulted in the elimination of some academic and athletic programs, reduced funding for financial aid programs such as the concurrent enrollment efforts that involve roughly 10,000 high school students, and meant fewer tutoring and counseling services. They also have produced changes such as schools finding ways to share faculty — something Johnson says has been positive and wouldn't have been considered a decade ago. \nJohnson says he expects suggestions for further streamlining and innovation could result from a review of higher ed to be conducted this year by a special task force. It's certainly fair to ask whether the system needs as many branch campuses as it has today, or whether online opportunities should expand at a faster rate, to name just two examples. \nHowever, Johnson also makes a good point when he notes a Georgetown University study showing that two-thirds of all jobs created in Oklahoma by 2020 will require some college, a long-term certificate or a college degree. Thirty-seven percent of all jobs created in the state by then will require at least an associate's degree. Higher education will need to produce those job applicants. \nThe number of science, technology, engineering and math (STEM) degrees awarded by state colleges and universities has grown by 32 percent in the past five years. Oklahoma needs for that percentage to continue to increase. It also needs more college graduates, period — 24.6 percent of our adult population has a bachelor's degree or more, compared with 30.6 percent nationally. \nA robust higher education system is important to any state that wants to grow and prosper. Lawmakers should remember that as the FY '18 budget takes shape. You might also be interested in... Show more The Oklahoman Editorial Board The Oklahoman Editorial Board consists of Gary Pierson, President and CEO of The Oklahoma Publishing Company; Christopher P. Reen, president and... read more ›", "url": "http://omgili.com/ri/snFTpiOKdJUi35S95bs2owLetWe5QnInBv9A7eP3opQqzsDeQVKAxQ--", "highlightText": "", "highlightTitle": "", "published": "2017-04-15T04:00:00.000+03:00", "language": "english", "title": "After two rough years, will Oklahoma higher ed budget fare better this year?", "thread": {"title_full": "After two rough years, will Oklahoma higher ed budget fare better this year?", "site_full": "newsok.com", "site": "newsok.com", "site_section": "http://www.newsok.com//rss/home", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "news", "spam_score": 0.0, "domain_rank": 12795, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "NewsOK.com RSS - home >> !The Oklahoman", "url": "http://omgili.com/ri/snFTpiOKdJUi35S95bs2owLetWe5QnInBv9A7eP3opQqzsDeQVKAxQ--", "published": "2017-04-15T04:00:00.000+03:00", "title": "After two rough years, will Oklahoma higher ed budget fare better this year?", "uuid": "e895e62ec905573917bb82e58d8a099383d0d888", "main_image": "//s3.amazonaws.com/content.newsok.com/newsok/images/newsok_facebook.jpg"}, "uuid": "e895e62ec905573917bb82e58d8a099383d0d888", "ord_in_thread": 0}]