[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:17:18.000+03:00", "author": "Ben Valencia", "entities": {"persons": [{"name": "tony katigbak", "sentiment": "none"}, {"name": "shabnam shaik", "sentiment": "none"}, {"name": "lee", "sentiment": "none"}, {"name": "tim berners", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}], "organizations": [{"name": "battle against fake news", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "philippine star", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "text": "Does it ever irritate you reading fake news? And also wonder how these spread all over the internet? \nWell, you are not alone! Although there are a lot, A LOT, of trolls sharing and believing those lies and alternative facts, there is still hope for there are still us who wants to fight for the truth.\nSo what is really a fake news? \nFake news are articles published by someone over the internet that contains false information about something for the purpose of playing on gullible people who do not check sources and will just pass the news on as if it were really true. I know you have seen a lot, scanning your news feed on Facebook. You may even see your own friends sharing these.\nNow, does it really affect us? \nThe answer is yes! Definitely, a yes. In the Philippine setting alone, fake news are rampant. Any information that they found online supporting their own ideology, they would consider as true and even spread it to others without checking the facts. This serves as a proof that the spread of misinformation has not only been overlooked but also celebrated.\nThe rise of fake news in the country has grown into a larger scale on the 2016 National Elections.\nAccording to Tony Katigbak of The Philippine Star,\n“With the rise of two main camps with conflicting opinions in our political arena, it has become a bit of a “war” in the headlines as each try to disparage the other.”\nWho are taking actions? \nTim Berners – Lee, the inventor of the World Wide Web, was one of the persons who was alarmed by its effects. He said that the effect of fake news is increasingly concerning and disclosed plans to fight it.\nThese alarming occurrences has also alarmed big tech companies such as Facebook, Google and Twitter. On September last year, they joined a group of more than 30 news and technology companies to talk about the spread of fake news. Now, they have already made significant steps in battling this.\nFacebook \n\nYou may have noticed in your news feed the notification above from Facebook. That is just one of the steps Facebook is doing to battle the spread of fake news. They started publishing notifications about its “ 10 tips to spot fake news “at the top of every user’s news feed.\nAnother feature that Facebook has in its website is the fact-checking done by its partner organizations. These partner organizations are signatories of the code of principles of the International Fact-Checking Network (IFCN). What they do is that they flag news stories as either fake or not. Also, Facebook has introduced long ago the feature that allows all users to report the presence of fake news.\n\nJust recently, Facebook has also cracked down 30, 000 fake accounts in France ahead of their presidential election. They said that the accounts were spreading fake news stories, spam, misinformation or other deceptive content. Facebook security manager Shabnam Shaik said,\n“Our priority, of course, is to remove the accounts with the largest footprint, with a high amount of activity and a broad reach.”\nGoogle \n\nThe image above shows how Google is helping in handling fake news today. They have provided a tool called ‘Fact Check’. Here, Google will serve as a fact-checking website at the top of results. What will be showed is the person who made the verification claim, when they filed the claim, and the facts checked. These facts are presented by Google so as to help people have the right and informed judgments. This tool however does not provide all news stories of the review they need and is not yet available to all countries.\nUs \nWe ourselves can be a part of this battle against fake news. We do not need to be part of a tech giant or be a powerful or famous person to act. We can start by just even refraining to share these fake news we see, report it, and educate people who are gullible of being deceived by such.\nTechnology is power, and with great power comes great responsibility. \nReferences: http://fakenewswatch.com/ \nhttp://www.philstar.com/opinion/2017/03/06/1678369/not-alternative-facts-real-facts \nhttps://arstechnica.com/tech-policy/2017/04/facebook-highlights-its-fight-against-fake-news-in-print/ \nhttp://news.abs-cbn.com/business/09/13/16/facebook-twitter-join-network-to-tackle-fake-news \nhttp://money.cnn.com/2017/04/14/media/facebook-fake-news-france-election/ \nhttp://www.independent.co.uk/voices/facebook-fake-news-fact-check-google-ad-save-journalism-a7645706.html \nhttp://www.independent.co.uk/life-style/gadgets-and-tech/news/sir-tim-berners-lee-fake-news-crackdown-world-wide-web-a7625271.html ", "url": "http://omgili.com/ri/.wHSUbtEfZRWQr7xLF256__Cy2wpK_zIG7L4ZB_D7K95rUGc2HUiwXyiRaKNBFBXMHlfOgl6mIpxH_iDS3GVO9LgdCl6ZpaH8QqZrEUA4Q754b72dlF9Yg--", "highlightText": "", "highlightTitle": "", "published": "2017-04-14T18:04:00.000+03:00", "language": "english", "title": "The Battle Against Fake News", "thread": {"title_full": "The Battle Against Fake News", "site_full": "thetechdenphilippines.wordpress.com", "site": "wordpress.com", "site_section": "https://thetechdenphilippines.wordpress.com", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "The Battle Against Fake News – The Tech Den", "url": "http://omgili.com/ri/.wHSUbtEfZRWQr7xLF256__Cy2wpK_zIG7L4ZB_D7K95rUGc2HUiwXyiRaKNBFBXMHlfOgl6mIpxH_iDS3GVO9LgdCl6ZpaH8QqZrEUA4Q754b72dlF9Yg--", "published": "2017-04-14T18:04:00.000+03:00", "title": "The Battle Against Fake News", "uuid": "ea97d65cc876c0438fa6a0cc65b68a89686e40da", "main_image": null}, "uuid": "ea97d65cc876c0438fa6a0cc65b68a89686e40da", "ord_in_thread": 0}]