[{"rating": null, "external_links": [], "crawled": "2017-04-16T08:34:26.000+03:00", "author": "", "entities": {"persons": [{"name": "androidpay", "sentiment": "none"}, {"name": "narayen", "sentiment": "none"}, {"name": "ready", "sentiment": "none"}, {"name": "metronorth", "sentiment": "none"}, {"name": "bert hochfeld", "sentiment": "none"}, {"name": "patrick collison", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}, {"name": "stripe", "sentiment": "none"}, {"name": "zelle", "sentiment": "none"}, {"name": "venmo", "sentiment": "none"}, {"name": "evan spiegel", "sentiment": "none"}, {"name": "dan shulman", "sentiment": "none"}], "locations": [{"name": "venmo", "sentiment": "none"}, {"name": "airbnb", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "braintree", "sentiment": "none"}], "organizations": [{"name": "paypal", "sentiment": "negative"}, {"name": "pypl", "sentiment": "none"}, {"name": "ag", "sentiment": "none"}, {"name": "fidelity national", "sentiment": "none"}, {"name": "intuit", "sentiment": "none"}, {"name": "mastercard", "sentiment": "none"}, {"name": "non-gaap", "sentiment": "none"}, {"name": "fis", "sentiment": "none"}, {"name": "stubhub", "sentiment": "none"}, {"name": "fx", "sentiment": "none"}, {"name": "coo bill ready", "sentiment": "none"}, {"name": "national bank", "sentiment": "none"}, {"name": "citi", "sentiment": "none"}, {"name": "ebay", "sentiment": "none"}, {"name": "fb", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "text": "Long/short equity, growth, event-driven, research analyst Summary \nPayPal shares continue to stagnate. \nPayPal's business continues to grow at close to 20% net of currency. \nThe company continues to dominate the mobile payment space which is growing at triple digit rates. \nThe feuds the company has had with credit card issuers have been more or less abated with no real damage done to this company's business model. \nThe company's Venmo service, still not producing revenues, continues to grow at triple digits and drive other PayPal engagement. PyPal - Some thoughts about disruption, monetization and competition PayPal (NASDAQ: PYPL ) has not been the greatest stock to have owned in the 18 months or so since it was spun out of eBay (NASDAQ: EBAY ) in the summer of 2015. The shares are up by a bit more than 10% over that span. Most other payment shares have done quite a bit better. The IGV tech/software index is up 25%. Some observers have predicted apocalyptic scenarios regarding the company's future. Other observers have simply thought it was too highly valued. The under-performance of the shares since the company became a public entity coupled with continued strong operating performance has had a significantly salutary impact on valuation. The apocalyptic scenarios-well just like those predicting the end of the world, they haven't played out yet. PayPal is a name in which investors have to look beyond the numbers in order to get comfort-or do they. It is cheaper than has been the case and it dominates one of the greater business opportunities in the tech world-that of mobile payments. Monetizing the mobile payments opportunity along- and it reputedly has a 41% share of the space-is likely worth more than the company's entire valuation. It is going to report its results in a couple of weeks-I expect the results to continue to show positive trends-but that has been true for the other quarters since this company has been independent. The consensus expectations, as portrayed by First Call, call for 16% top line growth and for EPS of $.41 for the quarter and $1.72 for the year. Why should the shares work this time around when they have done so little in terms of reacting to earnings releases over the recent past? What should the shares be worth? That there are many companies in the payment space is self-evident. I believe this company presents investors with the leading opportunity in e-payments and particularly mobile payments. And it is run by leaders who have a deep understanding of the space. Trying to quantify those contentions is an undertaking that is difficult if not impossible. And I say that as an analyst who likes numbers and prefers to quantify all that can be quantified. I might normally choose to put some kind of analysis of disruption, monetization and competition in PayPal's space further back in this article after discussing the company itself. Most readers know something about the company and many readers use some of its services. I use it myself and it has proven to be a useful tool for accepting payments. If you are under a certain age, PayPal, and its subsidiary Venmo , is how you send money and split the tab when you go out to eat-or drink. And it how you get money from your Aunts, Uncles and parents. But the share price performance of this company going forward is going to relate to how it solves the problems of being a disruptor or itself getting disrupted, how it monetizes some of its free services such as Venmo and how it competes both with existing competitors and new market entrants, particularly in the mobile payments space. So, I chose to start the article with comments that I most often put at the end. The company's financials are not that complicated. The company's prospects are considered by some to be more than a little murky. At the end of the day, for this company it is all about mobile payments. One can read the statistics about growth-or better y et, one can use mobile payments or use services such as Uber or Airbnb. Even to a very conservative writer as I am, it is apparent what is happening in the payments world. The company is one of the success stories of the Fin-Tech space and its peers are a host of other firms that both compete and partner with PayPal for processing payments. Last quarter, the company announced partnerships with both Citi (NYSE: C ) and Fidelity National (NYSE: FIS ). Investors have bought into the fin-tech story of recurring revenues and modest to moderate growth. They have been willing to value most fin-tech shares very highly because of growth stability and visibility. The PayPal story is a little different in that the growth is a bit beyond moderate. There is some concept amongst some investors that tech in general and fin-tech specifically is a zero-sum game. Competition is frenzied and competitors make wild, unsubstantiated claims as to how they are going to rule one little corner of the world. Mobile payments is really one of the more massive opportunities in the tech world these days. Today I have taken a train and paid for the ticket on a mobile app. I also used my phone to pay for coffee and pastry. The apps aren't quite seamless but they work - it is MetroNorth and nothing regarding the railroad is seamless. In time, most payments will be made on mobile devices even by technophobes. Much of the growth for payments space in the future is clearly going to be in its newer segments and most particularly in mobile. It is hard to dispute that PayPal has a leadership position in mobile payments these days. It is equally difficult to dispute that there are new entrants into the space with high levels of brand recognition Many commentators are concerned that ApplePay, AndroidPay and AmazonPay are going to damage the PayPal's growth prospects in mobile. As it happens, so far none of these entrants has been particularly successful with their technology. Mobile Payments itself is divided into many different nooks and crannies. One component of the space that is wildly popular amongst millennials is Venmo. Venmo is known as a service which lets parents send money to their kids in college. It is a service that can also be used to share a bar tab or a restaurant bill. But so far, Venmo hasn't generated any noticeable revenues. Obviously owning a site that is wildly attractive for payments within a certain demographic is a significant asset. There are opportunities to take Venmo into merchant transactions but that is nothing likely to move the meter in the short term. As can be seen in the attachment, Venmo and PayPal simply dominate the space and while the banks combined are pushing their alternative called clearXchange, now called Zelle, Venmo has a cult-like following amongst millennials. Does anyone really believe that the consortium of banks that owns Zelle is going to have a great deal of success in displacing Venmo. How might they do that? Given the lead Venmo has and its triple digit growth, how might that happen? Ask your own group of millennial contacts how they pay each other and why they like Venmo. It might surprise you. How do you quantify something that is offered for free? It is all about engagement. When you invest in tech growth stocks, you try to recognize that there are business opportunities that simply do not lend themselves to current quantification. When I look at either Amazon (NASDAQ: AMZN ) or Shopify (NYSE: SHOP ), I do so knowing that I simply can't use typical valuation parameters. Venmo is something like that in that it produces little revenue currently that is traceable to the service. Venmo and the core of PayPal's mobile payments technology were acquired by PayPal back in 2013. I commented about the transaction in a prior article. These days, that $800 million acquisition seems like one of the bargains of this decade. I seriously doubt that I would be writing this article had it not happened. It is the Braintree technology stack that has vaulted PYPL into its leadership position in mobile payments. One finds the Braintree technology as the payment engine in services such as Uber and Airbnb. Many start-up mobile apps will instinctively turn to the Braintree technology which itself has brand recognition as well as technology that makes it easy to use as part of an overall service. I have used Venmo and don't quite see its attraction as something unique or part of the college experience. But then I do not like sending money to kids because they need to go to a concert or have a big date. It is convenient that Venmo is linked to my PayPal account I suppose, but I never had that much trouble sending money with PayPal. But of course I never knew that money had to be in an account in 20 minutes, either. Kids! How should investors value Venmo. It is one of the less tangible assets that allows investors to develop a higher growth rate construct for the company than might otherwise be the case. It is an asset that clearly has been copied but continues to lead its field. And it is one of the reasons to invest in PayPal shares. The key reason for investors to consider PayPal is the runway in mobile payments-the part of the space where merchants pay someone to facilitate the use of mobile devices to pay for things. To a certain extent, some of the stratagems that have been developed by participants in the space have been blind alleys. The switch from card swipes to contactless cards and phone taps has seemed to be more of a solution that isn't solving a problem. Do you really care if you swipe a card or insert it into a slot? But the use of different kinds of E-Commerce experiences, and particularly mobile E-Commerce to supplant physical shopping is almost a given at this point and PayPal is a leader in facilitating that trend. The last time I wrote an article about PayPal, I mentioned that one the company's significant assets was its COO Bill Ready. When investors are buying into a concept, one of the things into which they are buying is leadership. Mr. Ready doesn't get the public attention of someone like Evan Spiegel of Snap (NYSE: SNAP ) or Mark Zuckerberg of Facebook (NASDAQ: FB ). But in evaluating the future of a company that is in the business of overturning decade old payment technology, the bona fides of its leadership are key. Mr. Ready is one of the thought leaders of the mobile payments revolution-indeed he had been the CEO of Braintree and his role at PayPal makes it far more likely to come up with the next big things in the space. Again, investors can't quantify service offerings that do not yet exist. But I think it is fair to say that successfully technology investment, besides looking at traditional valuation metrics, also involves looking at senior management and their ability to innovate and make appropriate choices. Just to pick an example that is currently in style. What would Adobe (NASDAQ: ADBE ) look like today but for the choices that were made by its current CEO in many areas over the years. The expectation is that Mr. Narayen will continue to make the right choices and it is my expectation that Mr. Ready and CEO Dan Shulman will continue to drive the right decisions at the right times for this company. My own thought is that if investors believe in the future of the mobile payments space, they are most likely to achieve that potential through investing in a company that is run by a team that includes one of the pioneers and thought leaders in the space. I don't think that most investors have the specific expertise to determine whether or not some specific feature or function that PYPL offers is unique or a competitive game changer. And I know I certainly lack that kind of ability. But it is reasonable to look at the record of PayPal's COO and believe that the company does have that kind of expertise which is likely to leave the company with a significant competitive moat. The issue of MasterCard and Visa I believe that one of the principle issues that investors have dealt with in making an investment decision regarding PayPal is their concern about current and potential competition between PYPL and what are perceived to be rivals such as Visa (NYSE: V ) and MasterCard (NYSE: MC ). Last summer, peace was declared and agreements were disclosed. The principle parts of the agreement included an agreement in which PayPal stops steering Visa cardholders from using their Visa cards for PayPal transactions. In exchange, Visa has opened up its tap and pay application to PayPal's mobile app. At the time the accord was signed, analysts were concerned that the economics of the deal would eat into PayPal's margins. PayPal's core business is to facilitate the payments users make for merchandise and services by accessing their bank balances and transferring payments to vendors. It makes far less money if the transfer comes through the Visa interconnection. PayPal and MasterCard have a similar arrangement and most of the other major card issuers have reached agreements on working with PayPal by this time. I am not going to try to evaluate the specifics of the transactions between the rivals. There are too many statistics necessary that are not in the public domain for anyone to develop a credible analysis of what happened and what might reasonably be expected. But the future for PayPal is not so much in dealing with credit card issuers as it is in dealing with the mobile payments world. The heart of PayPal's mobile payment offering is called OneTouch. More and more millennials are using One-Touch as their payment methodology of choice where it is offered. And OneTouch these days is very easy to use and allows customers to checkout without entering their user name and password. It is the technology that facilitates payments inside of apps such as Airbnb, StubHub, ParkWhiz. The real competition that PayPal will have going forward isn't Visa and MasterCard but Stripe , a start-up on-line payment company that offers many of the same set of features and functions offered by PayPal and did so in advance of the current OneTouch offering. Without discussing the differences and similarities in detail, the huge growth in digital and mobile payments ought to allow for at least two successful vendors in the space. Why does PayPal draw those awful negative reviews and what do its finances actually reveal PayPal shares may not have seemed to be controversial-and yet their performance seemingly belies the ratings of analysts who publish their recommendations on First Call. Perhaps it has been the company's rather unusual tenure as a subsidiary of an unrelated entity, eBay. At this point, eBay, while still a significant component of payment volume at 16% of the total has been dwarfed by other sources of transactions. Mobile is now 33% of total spend On PayPal. Perhaps it is the view that if PayPal is successful, it must mean that Visa and MasterCard will suffer. Perhaps it is the level of stock based compensation expense although at 4% of revenues and 24% of non-GAAP earnings, it is not at extraordinary levels even compared to peers in the payment space. One of the principle concerns expressed about the company since it has become public relates to its declining take-rate which so the theory holds, will hobble margins and ultimately growth as PayPal services become more commoditized. That theory seems less viable with passing quarters and indeed, the decline in the take rate was smallest in Q4 than in all of the quarters since PayPal became an independent public company. As discussed earlier, the company entered into agreements with both Visa and MasterCard that it has artfully described as consumer choice transactions. During the 4th quarter, the impact was well within prior expectations. Volume based expenses grew by 27%, but transaction margins remained healthy at about 58%. In all, transaction expenses were just shy of $1 billion in the quarter and were 32% of revenue for the quarter compared to 29% of revenue in Q4 of 2015. That difference would appear to be the impact of the company's agreements with major credit card issuers on margins. Overall, the company saw a 25% increase in payment volume and a 19% increase in net revenues. Over the course of last several quarters, some analysts have expressed concerns relating to the company's position in extending loans to some consumers of its service. Transaction and loan losses were 10% of revenues during the quarter compared to 9.6% of revenues the prior year and appeared to be consistent with prior expectations for that metric. The company has expressed its intention of moving much of its consumer lending business off-balance sheet and utilizing 3 rd party funding. Many observers will be happy to see a lower level of consumer receivables outstanding on the company's balance sheet. Given the interest rates the company charges and the demand for credit, the company is not expected to have much trouble in finding 3rd party funding sources to enable the company to minimize the capital it devotes to credit services. During the course of the conference call, the company discussed the growth in other operating expenses outside of credit losses. Overall, operating expense on a GAAP basis rose by 8.5% year over year and was 36% of revenues compared to 38% of revenues the prior year. Overall, GAAP operating income was 15% of revenues compared to 16% the prior year, while non-GAAP operating income margin rose, due both to higher stock based comp and depreciation expense. I think that in terms of margins going forward, there are probably as many secular tail winds as headwinds. It was, I thought, telling that the company was able to actually reduce sales and marketing expense in actual dollars year on year in Q4 and to limit the increase in research and development costs to just 3% year on year. I would expect that the costs for running the network and general and administrative expense will show more favorable trends in 2017 to allow the company to maintain margins even if it sustains lower margins on transactions. The company is forecasting flat to slightly up non-GAAP operating margins in the current year, even after some impact from the costs of its hedging program and FX headwinds in aggregate. The company to the surprise of some analysts increased its expectations for revenue growth this current year by a few hundred basis points compared to its prior estimates. The company has some discrete service offerings, and in particular One Touch, that are taking off at this point and the company apparently has been able to use the Venmo offering to accelerate the growth of revenues for services that bring revenue to PayPal. The company has developed lots of payment relationships with companies such as Intuit (NASDAQ: INTU ) and Facebook that tend to be unheralded but which, in aggregate are apparently starting to move the meter in terms of revenue growth. (FB has recently launched a group payment option within its Messenger that is similar to Venmo but it is not a serious rival to Venmo at this time.) The company is actually forecasting FX neutral revenue growth of 17%-19%, just slightly less than the 21% constant currency revenue growth achieved in 2016. Given that foreign revenue is just slightly less than half of the total, FX is a substantial and essentially unknowable factor in forecasting revenue growth over any significant time period. Given the many secular tailwinds the company has, and the rapid growth of its newer services and partnerships, I think the odds favor that the company is likely to over-attain revenue guidance this year as was the case last year. Overall, the shares have an average rating of buy from the 40+ analysts who report their recommendations to First Call but 13 of the analysts covering the name consider it a hold and earlier this week it was downgraded by a European brokerage, National Bank, AG. The downgrade, apparently, from buy to sell, was related to valuation but it is not all that easy to understand given PayPal's share price stagnation, both this quarter and going back over some period. Valuation Is valuation stretched? I don't think so because I think the company has made the right strategic moves and has built a commanding position in the mobile payments space that is undervalued. I think that the issues that animated concern last year in terms of the company's agreements with credit card issuers in retrospect seem significantly overblown. I think the company, over time, will better monetize the payments it facilitates through Venmo. And given the company's management, I expect that it will continue to innovate with new payment services that will be able to generate revenue that is not yet forecasted. The recent announcement of PayPal's purchase of TIO Networks, while obviously not of huge significance in terms of currently projected financials, is an example of payment niches, as yet under-exploited, that are likely to add to the company's growth rate over time. PayPal's shares closed Thursday at $42.55 . With 1.2 billion shares outstanding (essentially unchanged year over year), the company has a market capitalization of about $52 billion. The company has a total net cash balance of cash and equivalents, including long term investments of $6.5 billion which yields an enterprise value of $45.5 billion. At the current forecast revenue level of about $12.6 billion for the year, the EV/S is 3.6X. That is what happens when shares stagnate and revenues grow. At that valuation level, PayPal shares are valued at significantly below that of most other companies in the payment space and are arguably growing significantly faster. The company is forecasting non-GAAP EPS of $1.72 for the current year with its expectation of flat margins. That is a P/E of 24.7X. Again, on a reported earnings basis, PayPal is one of the less expensive of the larger payment vendors around. PayPal is forecasting free cash flow of greater than $2.7 billion for the year. including capex of about $600 million. Last year CFFO grew by 24% and free cash flow was $2.55 billion. I would be surprised if the company saw such a small increase in free cash flow this year based on its earnings forecast and the other trends in cash flow. But using the forecast provided by management the free cash flow yield of almost 6%, one of the highest free cash flow yields seen in the space and one of the higher free cash flow yields available in a company growing organically close to 20%. About 20% of the company's free cash flow is a product of stock based comp, again a relatively low metric for that calculation. At this point, PayPal does not pay a dividend but is buying back shares at a modest pace. Clearly, with free cash flow of $2.7 billion, in can achieve a more optimal capital allocation strategy for shareholders or execute a significant acquisition. 80% of the company's cash balance is off-shore and thus it has been reluctant to pay the taxes necessary to redeploy the capital in order to pay dividends. Should the tax laws change, management has foreshadowed that it will reconsider that strategy although the payment of a 1%-2% dividend is not necessarily a game-changer for many potential investors. It has not been uncommon amongst investors to use some form of sum of the parts to justify valuation. It is worth noting that the company most talked about in the payments space these days is Stripe which has a valuation of $9.2 billion . Strip has about 1/3 rd the market share of PayPal in mobile payments at the moment, as best as can be determined. Just how the volumes of services such as Uber and Airbnb figure into that calculation is not known by this writer. It is not easy to determine which service is growing faster in the mobile space. But if the math is worth doing, the mobile payments component of Paypal ought to be worth $27 billion and perhaps more. That would leave the rest of PayPal valued at less than $20 billion. How much my Venmo be worth? How much is the balance of PayPal's e-commerce revenues worth? Probably a considerable multiple of $20 billion. Stripe is a poster child as a e-payments unicorn but it doesn't have Venmo and it doesn't power payments for Airbnb or Uber or Lyft etc. One can't buy Stripe shares and the boyish looking founder, Patrick Collison says an IPO is not imminent . Almost certainly, if Stripe were to do an IPO it would almost certainly command a premium over its last valuation when it was funded toward the end of 2016. Attempting to invest in the mobile payments space, if it can reasonably done, is not a hard decision to make. I think buying PayPal shares at their current valuation is a more than reasonable strategy to accomplish that objective at a valuation that can be readily justified. Maybe not as exciting as an IPO in Strip might be, but a good investment that can produce positive alpha. It is worth looking at before earnings, I believe. Disclosure: I/we have no positions in any stocks mentioned, but may initiate a long position in PYPL over the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. About this article: Expand Author payment: $35 + $0.01/page view. Authors of PRO articles receive a minimum guaranteed payment of $150-500. Become a contributor » Problem with this article? Please tell us . Disagree with this article? Submit your own . Follow Bert Hochfeld and get email alerts ", "url": "http://omgili.com/ri/.wHSUbtEfZTcDXTc7RaCvr1qjbSuqV3P5tH57MFrk11VDoPkAxcj8j2S.YeQ2P9yzWFnd231VsvCtJ.Sf4n00ehzr2jXxV8fqVP52_AAl.R7vN9AcSuhi.AmSFkAltClCVphqZ9oF3c-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T08:34:26.000+03:00", "language": "english", "title": "PayPal - The 600 Pound Mobile Payment Gorilla For Sale As Though It Were A Chimpanzee", "thread": {"title_full": "PayPal - The 600 Pound Mobile Payment Gorilla For Sale As Though It Were A Chimpanzee", "site_full": "seekingalpha.com", "site": "seekingalpha.com", "site_section": "http://seekingalpha.com/feed.xml", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 2}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "news", "spam_score": 0.0, "domain_rank": 1432, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "All Articles on Seeking Alpha", "url": "http://omgili.com/ri/.wHSUbtEfZTcDXTc7RaCvr1qjbSuqV3P5tH57MFrk11VDoPkAxcj8j2S.YeQ2P9yzWFnd231VsvCtJ.Sf4n00ehzr2jXxV8fqVP52_AAl.R7vN9AcSuhi.AmSFkAltClCVphqZ9oF3c-", "published": "2017-04-16T08:34:26.000+03:00", "title": "PayPal - The 600 Pound Mobile Payment Gorilla For Sale As Though It Were A Chimpanzee", "uuid": "eab6d672d49545b2ecedd3f5a59ceee75104b700", "main_image": "https://staticseekingalpha2.a.ssl.fastly.net/images/marketing_images/real_estate_mortgage/rent_dollar_payments_house_door.jpeg"}, "uuid": "eab6d672d49545b2ecedd3f5a59ceee75104b700", "ord_in_thread": 0}]