[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:01:16.000+03:00", "author": "shahidul islam (noreply@blogger.com)", "entities": {"persons": [{"name": "seth kaplan", "sentiment": "none"}, {"name": "silvia bellezza", "sentiment": "none"}, {"name": "kaplan", "sentiment": "none"}, {"name": "bellezza", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "va", "sentiment": "none"}, {"name": "fairfax", "sentiment": "none"}], "organizations": [{"name": "healthday   workaholism", "sentiment": "none"}, {"name": "columbia university", "sentiment": "none"}, {"name": "journal of consumer research", "sentiment": "none"}, {"name": "george mason university", "sentiment": "none"}, {"name": "american psychological association", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "text": "Researchers say complaints and \"humble-brags\" about being too busy or overworked have replaced stories about vacations and skipping out of work for a round of golf or a ballgame as ways of signaling social status. Photo by KieferPix/Shutterstock Copyright © 2017 HealthDay \n\nWorkaholism, it seems, is the new black.\n\nPeople who complain endlessly about being overworked and overwhelmed may be sending others a less-than-subtle message: \"I'm more important than you.\"\n\nSo finds new research suggesting that some Americans are eschewing old tipoffs to status -- weekday rounds of golf and months-long vacations.\n\nInstead, higher status is now transmitted by at least claiming to be oh so busy.\n\n[post_ads]\"In the past, living a leisurely life and not working was the most powerful way to signal one's status,\" explained study lead author Silvia Bellezza.\n\n\"Fast-forward to America today, and complaining about being busy and working all the time -- rather than being on holiday -- has become increasingly common,\" said Bellezza. She's an assistant professor of marketing at Columbia University in New York City.\n\nBellezza's team conducted a series of experiments focused on what psychologists call \"status attribution\" -- characteristics that help establish an individual's position in society.\n\nThese status-markers can change with time. So to examine current \"status attributions,\" the researchers first reviewed 1,100 examples of online \"humble-bragging.\"\n\n\"Humble-brags\" are a form of showing off by feigning self-deprecation. For example, \"I'm just so swamped by all my charity work.\"\n\nMost of the social media humble-brags in the study were placed on Twitter by well-known celebrities, Bellezza's team said. The posts had one thing in common: a tendency to complain about 'having no life' or 'being in desperate need for a vacation.' \"\n\nAnother experiment asked participants to indicate whether they thought \"being busy\" meant spending a lot of time at work, spending a lot of time performing house-related chores, or spending a lot of time engaged with hobbies or leisure activities.\n\nA third study recruited about 300 men and women who were asked to guess the social status and wealth of a series of Facebook users who had posted updates on leisure activities or workplace busyness.\n\nThe take-home message from the experiments: Americans viewed relentless work in a more favorable light than they did leisure-seeking.\n\nBrand and product use tended to reinforce this view, with services such as dog-walkers or online grocery purchasing designed with the busy worker in mind. Use of these services connotes higher status, the researchers said, in the same way that owning an expensive watch or purse might have in the past.\n\nHowever, one other experiment suggested that America's glorification of the \"busy-bee\" lifestyle might not be shared by people in other countries.\n\nComparing people from the United States and Italy, Bellezza and her colleagues found that Italians still placed a higher value on a more leisurely life versus the career \"rat race.\"\n[post_ads_2]\nWhy would Americans be enamored of working too hard? It might be due to being \"heavily influenced by our own beliefs in social mobility,\" according to Bellezza.\n\n\"The more we believe that one has the opportunity for social affirmation based on hard work,\" she noted, \"the more we tend to think that people who skip leisure, and work all the time, are of higher standing.\"\n\nBellezza added that the move to a more service-oriented economy has also likely encouraged the shift. She theorized that people with busy jobs involving information processing may be perceived as more talented and skillful compared with, say, someone on a factory floor.\n\nThe study appeared in a recent issue of the Journal of Consumer Research.\n\nSeth Kaplan is an associate professor of industrial/organizational psychology at George Mason University in Fairfax, Va. Reviewing the new findings, he said they \"are consistent with other research indicating that reporting being busy and even 'stressed' is socially desirable.\"\n\n[post_ads]In fact, not projecting such stress could prove problematic, given the \"potential inference is that that person is lazy and/or incompetent,\" Kaplan said.\n\n\"[But] what is perhaps especially interesting about this effect,\" Kaplan added, \"is that the evidence does not conclusively show that leisure time is actually decreasing,\" he noted.\n\n\"Although there is some debate in this area, most time-use data suggest that American leisure time has not decreased -- at least not significantly so -- in recent years,\" Kaplan said. \"We tend to just perceive and/or report that it has.\"\nMore information\n\nIs too much work stressing you out? Find tips on coping at the American Psychological Association . ", "url": "http://omgili.com/ri/j.JM_ertN3LXce0Fr0iG7O.5tU8gVmQFiD_Mt184IUi8B7AAJxpmcYgglBZzC.s0xybMZnv1du1R2tPi0Ynu7RIZC3xsEE0UDkQq7omo44w-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:01:16.000+03:00", "language": "english", "title": "'Humble-brags' about being overworked are the new status symbol, study says", "thread": {"title_full": "'Humble-brags' about being overworked are the new status symbol, study says", "site_full": "exp.dearjulius.com", "site": "dearjulius.com", "site_section": "http://exp.dearjulius.com/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "dearJulius.com Experiment", "url": "http://omgili.com/ri/j.JM_ertN3LXce0Fr0iG7O.5tU8gVmQFiD_Mt184IUi8B7AAJxpmcYgglBZzC.s0xybMZnv1du1R2tPi0Ynu7RIZC3xsEE0UDkQq7omo44w-", "published": "2017-04-16T11:01:16.000+03:00", "title": "'Humble-brags' about being overworked are the new status symbol, study says", "uuid": "ebcdf8d7d3469a9a50cea8e5d40f799511949e60", "main_image": null}, "uuid": "ebcdf8d7d3469a9a50cea8e5d40f799511949e60", "ord_in_thread": 0}]