[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:46:01.000+03:00", "author": "Niz Media (noreply@blogger.com)", "entities": {"persons": [{"name": "buhari", "sentiment": "none"}, {"name": "magu", "sentiment": "none"}, {"name": "yemi osinbajo", "sentiment": "none"}, {"name": "oke", "sentiment": "none"}, {"name": "olaniyi oladeji", "sentiment": "none"}, {"name": "malami", "sentiment": "none"}, {"name": "femi adesina", "sentiment": "none"}, {"name": "babagana monguno", "sentiment": "none"}, {"name": "ayodele oke", "sentiment": "none"}, {"name": "jonathan", "sentiment": "none"}, {"name": "mr oke", "sentiment": "none"}, {"name": "abubakar malami", "sentiment": "none"}, {"name": "ibrahim magu", "sentiment": "none"}], "locations": [{"name": "ikoyi", "sentiment": "none"}, {"name": "abuja", "sentiment": "none"}, {"name": "lagos", "sentiment": "none"}], "organizations": [{"name": "efc", "sentiment": "none"}, {"name": "economic and financial crimes commission", "sentiment": "none"}, {"name": "efcc", "sentiment": "none"}, {"name": "nia dg", "sentiment": "none"}, {"name": "central bank of nigeria", "sentiment": "none"}, {"name": "nia", "sentiment": "none"}, {"name": "national intelligence agency", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "cbn", "sentiment": "none"}]}, "text": "Sponsored Links \n\nThe over N13billion recovered by the Economic and Financial Crimes Commission (EFCC) from an Ikoyi apartment in Lagos was a discreet allocation released to the National Intelligence Agency (NIA) for major but covert security projects. \nThe total value of the cash at Central Bank of Nigeria official exchange rate is over N13 billion. \nWhat are the secret details? Inside sources revealed that, \nformer President Goodluck Jonathan approved the funds for the 30-year old secret service agency after its immediate past Director General, Olaniyi Oladeji, alerted him to the need for some “crucial and covert security projects”. \n\nThe funds were later released in cash directly from the Central Bank of Nigeria as a way of making its spending completely secret. \n\n“The projects are scattered across the country, but there is a major one in Lagos being funded with the cash warehoused in the Ikoyi building,” one source told PT. “The spending on the projects cannot be subjected to the usual expenditure process, and that is why the funds are held in cash. If you like, you can call it illegal projects in the national interest.” \n\nOur sources said only relevant top government officials and of the NIA are aware of the projects. \nOne official said when the incumbent Director General of the NIA, Ayodele Oke, was alerted that EFCC operatives had swooped on the apartment, being discreetly guarded by covert operatives, he rushed to the anti-graft agency’s headquarters in Abuja to advise its chairman, Ibrahim Magu, to withdraw his men as the funds belonged to government. \n\n\nAt the time, about 13 police officers and some soldiers, accompanied by photographers and videographers, had broken into the apartment, and were already dismantling the safes in which the funds were concealed, our sources said. \n\nMr. Magu however declined Mr. Oke’s request and directed his men to proceed with the operation as he had no security information backing the claim. \nA frustrated Mr. Oke was said to have rushed to National Security Adviser, Babagana Monguno, and Vice President Yemi Osinbajo to complain, and the huge embarrassment he had caused his otherwise extremely quiet and secretive agency. \n\nPresidency sources said Mr Oke met President Buhari in company of Attorney General Abubakar Malami to table the same complaints. \n\nThose who saw the NIA DG before he was called in to see the president said he had two bulky envelopes believed to contain paper and audio-visual records of the security projects. \n\nOfficials said President Buhari has since directed Mr. Magu to forward to him detailed report on the operation. The EFCC boss was also directed to immediately deposit the funds with the CBN. \n\nOn his part, Mr. Oke was asked to document his complaints and then reapply for the seized funds. \n\nA top presidency source said the President might ask Attorney General Malami to review reports submitted by the two officials, and then forward appropriate recommendations. \n\nWhen contacted Friday, the Special Adviser to the President on Media and Publicity, Femi Adesina, said, “It’s a security issue, and not strictly a presidency issue.” \n\nHe directed further enquiries on the matter to the security agencies involved. \n\nMr Oke of NIA confirmed to PT that the cash belongs to his agency but declined further comments when asked what the funds were meant for. \n\n“You don’t expect me to tell you that,” he said. \nFollow Us on Twitter! \n\nLike Us on Facebook! \nDo You Need a Sugar Mummy, Sugar Daddy, Girlfriend, Boyfriend Wife or Husband? If Yes, Then Click Here For Details \n\n\n18+ Video: Convenant University Female Student Expelled after her Nu de Video le aked on Facebook \n18+ Video: Guy Uploads Private Video of Her Ex Girlfriend \nSee What These Two Actress were Caught Doing in Another Nollywood P0 rn Movie \nAnother Woman’s Vag!na is Infested with Maggots! (Very Graphic Video) \nOMG! See What Most Nigerian Men Do Overseas To Make Money! \nNigerian Man leaks Video of his Girlfriend dancing Na ked In His Bed Room ", "url": "http://omgili.com/ri/jHIAmI4hxg_Ik8s72MrWr4TJBmcp0JQQ8iBhKF4yRWwnd0IUMkpPW.O7qUDZGZ0_ayMEZ9BXnTlHt28A3WXeTP6FOFbiCmjrOeTfDVJYFZ3isdHNnhLyZQ--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T10:46:01.000+03:00", "language": "english", "title": "Secret Details Of The Billions Recovered In Ikoyi By EFCC", "thread": {"title_full": "Secret Details Of The Billions Recovered In Ikoyi By EFCC", "site_full": "www.weeklypostng.org", "site": "weeklypostng.org", "site_section": "http://www.weeklypostng.org/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "WeeklyPostNG", "url": "http://omgili.com/ri/jHIAmI4hxg_Ik8s72MrWr4TJBmcp0JQQ8iBhKF4yRWwnd0IUMkpPW.O7qUDZGZ0_ayMEZ9BXnTlHt28A3WXeTP6FOFbiCmjrOeTfDVJYFZ3isdHNnhLyZQ--", "published": "2017-04-16T10:46:01.000+03:00", "title": "Secret Details Of The Billions Recovered In Ikoyi By EFCC", "uuid": "ebe4c40b1b5ac712263a291ef94de7b09fa4840b", "main_image": null}, "uuid": "ebe4c40b1b5ac712263a291ef94de7b09fa4840b", "ord_in_thread": 0}]