[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:03:32.000+03:00", "author": "LeTaraWrites", "entities": {"persons": [{"name": "williams", "sentiment": "none"}, {"name": "keith kareem williams", "sentiment": "none"}, {"name": "matthew", "sentiment": "none"}, {"name": "crowe", "sentiment": "none"}], "locations": [], "organizations": [{"name": "amazon , barnes & noble", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "text": "What can I say about Death in the City other than Whew! This book played with my emotions and took me to places that I typically read about and pray that I never experience in real life. Death in the City most certainly lives up to its title and cover. This is the third book I’ve read by Keith Kareem Williams and he has earned both my respect and my readership, making his way up my list of favorite authors.\nThe synopsis reads: A mother loses her son and completely loses her faith in the God she had served faithfully for her entire life. Trapped lovers try desperately to escape a lifestyle that, for a time, had comforted and kept them alive in a city that has always been trying to devour them. A reluctant assassin crosses paths with a woman who is determined to collect a pound of flesh from those in her debt for what they had cruelly taken from her. A frustrated husband and hard worker seeks escape from the life he has come to hate. A young girl can’t free herself from the grinning predator who has ruined her childhood because almost no one can recognize her silent cries for help. A young detective risks his life to prove that all policemen aren’t evil and that some who wore the badge were still true to their sworn oath to protect and serve, despite all of the wickedness they found themselves drowning in. All of these stories cross, intersect, twist and intertwine to create a graphic, beautifully ugly, savage depiction of what life-and-death looks like in the city. \nWhere do I begin? Usually, I can jump right into my thoughts about books I read, but this one…I finished this book about a week before I started the review because I had to digest it all. If you’ve read my review of Williams’ book Glass Goddesses, Concrete Walls , then you know how I feel about his style. His favorite word is savage and in staying true to himself and his style, that is how I would describe much of the content of Death in the City. Why? Well, since I’m trying to figure out where to begin, I’ll start at the beginning.\nTwo lovers are desperate to leave the life of illegal activity to walk the straight and narrow, but what happens when you live by the sword? According to the Greek tragedy Agamemnon , the Book of Matthew and other parallel proverbs, you die by it. Within the first few chapters there is love, regret, spiritual and existential conflict, graphic sex and even more graphic violence. You know, all of the good stuff. Based on that, the reader already knows that the couple who opens the story will not be the couple who finishes it. From there, we are introduced to characters who are seemingly unrelated, yet a very important prop is carried from one sub-plot to the next connecting everyone despite the majority of the characters never meeting each other. Something along the lines of Six Degrees of Separation. Among all of the sub-plots are a mother who is still grieving over the loss of her son at the hands of police, a husband and wife with a dull marriage that ends in a crime of passion, and a teenage girl who isn’t being heard.\nBased on little tidbits that the author has shared, this novel was intended to be a screenplay, yet for whatever reason he decided to share the story in book form. There were certain aspects, particularly a specific storyline that made me feel like I was watching instead of reading. The assassin and the vengeful woman, at times, made me feel like I was watching an Al Pacino flick, which was greatly appreciated by myself because it wasn’t as real to me as every other storyline.\nWilliams dealt with some extremely real subjects. Too real. Crime of passion: I don’t know about anyone else, but I’ve read my fair share of headlines, especially in recent weeks, involving jilted, crazed lovers/husbands/wives who’ve hurt or murdered their so-called loved ones and sometimes themselves. Despite the heinous nature of acts such as murder, I don’t think the feeling of rage and heartbreak is that foreign to most people. Even though we condemn the people who commit these types of crimes, how many stories have we heard of people who managed to stop themselves before they reached the point of murder, stopping at slashing tires, destroying belongings, etc.\nDrug dealers and thieves, not everyone knows one personally, but for those of us who do, we hate to see news reports or hearing through the grapevine that so-and-so was killed and nobody knows what (or nobody will tell what they know) happened. Protesters marching, hashtags and videos going viral of police violence and both sides being tried and judged in the court of public opinion long before they reach a court of law— if they ever reach that point. Then there’s the good cop who just can’t seem to outshine or outdo the bad ones. Williams brought all of that from the headlines and put it right into the readers’ laps. Even with me living near one of the major cities that made the news in recent months due to a police shooting and the protests that followed, leaving me feeling nervous to leave home in the days that immediately followed that event, Death in the City made me feel like I was there witnessing the events unfold in person beyond three dimensional reality into something totally different. Remember how I said in my review of Glass Goddesses that I literally felt like I was a fly on the wall? Yeah, that applies to this novel, too.\nThere were a couple of characters I wondered about. What happened to them after their respective scenes? Their whereabouts weren’t critical to the story moving forward, so they served their purpose. I was just curious, especially about the grieving mother. What was her thought process after the events in the novel took place?\nWhat stuck out in my mind the most out of everything was the teenage girl and her boyfriend who just wanted to run away from all of their troubles— and trust that they had MAJOR troubles— because sometimes I want to run away, too, and my troubles are nothing like theirs. I couldn’t and didn’t want to imagine what they must have felt like and if I had been in their shoes, I would’ve wanted to do the same thing.\nOne little thing that I really liked was the name of the assassin, Crowe. If I had to guess, the author chose that name for a purpose, but it is possible I’m reading too much into it. Crows are black birds, though not necessarily blackbirds, and are often associated with bad omens, death and darkness. Crowe killed people for a living and owned a cemetery. To quote the thought of his female companion “…crows were the guardians of the dead souls that remained here stubbornly after they should’ve moved on to the other side.” p.209 \nCrowe’s profession, Death, is the one thing above all else that every living thing has in common, so for the author to make the connection between strangers even more seamless—I loved it. I can’t say that I enjoyed this novel because I don’t feel that enjoy is an appropriate word for a novel such as this, but I really appreciated the author’s ability to tell this story. I give it a 4.5/5 stars.\nDeath in the City is available for purchase on Amazon , Barnes & Noble and the author’s website . Keith Kareem Williams also sells his books and can be reached via his social media pages.\n\nFacebook – https://www.facebook.com/keithkareemwilliams/?fref=ts \nInstagram – https://www.instagram.com/reemafterdark/ \nTwitter – https://twitter.com/ReemAfterDark \nGoogle Plus – https://plus.google.com/107187147376162217446 \nHis blog – http://reemafterdark.blogspot.com/ ", "url": "http://omgili.com/ri/.wHSUbtEfZT09TsTHBLgUlHw0au9dPIrDfcT5YSWN.nXTG5UfPxKbJv.VG8x7Z0__qMEVQLDbXKX3oPZfLewAy2TViwgm9mdh0wZas1tCcd5o05owBm0eA--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:03:32.000+03:00", "language": "english", "title": "Book Review: Death in the City", "thread": {"title_full": "Book Review: Death in the City", "site_full": "letarawritesbookreviews.wordpress.com", "site": "wordpress.com", "site_section": "https://letarawritesbookreviews.wordpress.com", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "Book Review: Death in the City – LeTara Writes Book Reviews", "url": "http://omgili.com/ri/.wHSUbtEfZT09TsTHBLgUlHw0au9dPIrDfcT5YSWN.nXTG5UfPxKbJv.VG8x7Z0__qMEVQLDbXKX3oPZfLewAy2TViwgm9mdh0wZas1tCcd5o05owBm0eA--", "published": "2017-04-16T09:03:32.000+03:00", "title": "Book Review: Death in the City", "uuid": "eca03bd68e94f47d08011f25da5d5c54db958c1b", "main_image": null}, "uuid": "eca03bd68e94f47d08011f25da5d5c54db958c1b", "ord_in_thread": 0}]