[{"entities": {"locations": [{"name": "oregon", "sentiment": "none"}, {"name": "district of columbia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "dhs", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "george washington university", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "department of homeland security", "sentiment": "none"}, {"name": "quinnipiac university poll", "sentiment": "none"}, {"name": "national academies of sciences", "sentiment": "none"}, {"name": "united states congress", "sentiment": "none"}, {"name": "marine corps", "sentiment": "none"}, {"name": "transportation security administration", "sentiment": "none"}], "persons": [{"name": "john kelly", "sentiment": "negative"}, {"name": "kelly", "sentiment": "negative"}, {"name": "mcclatchy", "sentiment": "none"}, {"name": "jeff sessions", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "sean spicer", "sentiment": "none"}, {"name": "tvert", "sentiment": "none"}, {"name": "vera bergengruenmcclatchy washington bureau", "sentiment": "none"}, {"name": "spicer", "sentiment": "none"}, {"name": "reuters/aaron p. bernstein", "sentiment": "none"}, {"name": "mason tvert", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.unionleader.com", "site_section": "http://www.unionleader.com/section/?template=RSS?nocache=1?omniture=0", "domain_rank": 41865, "replies_count": 0, "country": "US", "section_title": "All Stories", "title": "DHS's Kelly takes hard line on pot in major speech, closing ranks with Sessions", "title_full": "DHS's Kelly takes hard line on pot in major speech, closing ranks with Sessions", "published": "2017-04-19T08:39:01.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_GbzPSD3e8vS.s8ZsXJjqE.9fV0gwUSy_O1LsjUyeuxhrTq5ZQMxrKEYax.hLOTg4IC3QQE04QfyCIMN1uOA02AGYqgbibs03WkO7KVTw48Y2fSJ61RIOD", "site": "unionleader.com", "main_image": "/storyimage/UL/20170419/NEWS20/170419258/AR/0/AR-170419258.jpg?q=70?ExactW=600&ExactH=314&imageversion=MainHighlight&q=70", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 0, "performance_score": 0, "spam_score": 0.0, "uuid": "ee434e5b1cfb61f6a5de41a78b95272a05fef83d", "site_type": "news"}, "title": "DHS's Kelly takes hard line on pot in major speech, closing ranks with Sessions", "published": "2017-04-19T08:39:01.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_GbzPSD3e8vS.s8ZsXJjqE.9fV0gwUSy_O1LsjUyeuxhrTq5ZQMxrKEYax.hLOTg4IC3QQE04QfyCIMN1uOA02AGYqgbibs03WkO7KVTw48Y2fSJ61RIOD", "author": "", "crawled": "2017-04-19T08:39:01.000+03:00", "language": "english", "text": "Secretary of Homeland Security John Kelly speaks at an event entitled “Home and Away: Threats to America and the DHS Response” at George Washington University in Washington, on Tuesday. (REUTERS/Aaron P. Bernstein) DHS's Kelly takes hard line on pot in major speech, closing ranks with Sessions By Vera BergengruenMcClatchy Washington Bureau WASHINGTON — Two days after downplaying the role of marijuana in the nation’s drug war, Department of Homeland Security Secretary John Kelly changed course Tuesday, calling it a “potentially dangerous gateway drug” and saying his agency would continue to arrest and investigate those who traded in it in violation of federal law.“Let me be clear about marijuana: It is a potentially dangerous gateway drug that frequently leads to the use of harder drugs,” he said in his first major speech since being sworn in. “Its use and possession is against federal law and until that law is changed by the United States Congress, we at DHS, along with the rest of the federal government, are sworn to uphold all the laws that are on the books.”Marijuana advocates, who are watching closely to determine whether the Trump administration will deal a blow to state-level legalization efforts, decried the comments, saying Kelly was defying science in taking a hard line on pot. Eight states — Alaska, California, Colorado, Maine, Massachusetts, Nevada, Oregon and Washington — and the District of Columbia have legalized recreational marijuana in some form and another 20 permit the sale of pot for medical purposes.“DHS should stick to security and leave the science to the scientists,” Mason Tvert, spokesman for the Denver-based Marijuana Policy Project, told McClatchy. “This is a knee-jerk reaction among a certain generation of people that still think of marijuana as this vile, horrific substance and have yet to accept the fact that it is actually less harmful than alcohol.”Legalization advocates say Kelly’s claim that marijuana is a “gateway drug” has been thoroughly debunked by scientific studies. In one review of more than 10,000 scientific abstracts in January, the congressionally chartered National Academies of Sciences, Engineering and Medicine found no substantial link between marijuana use and other illegal drugs.Seventy-one percent of voters say the government should not enforce federal marijuana laws in states that have legalized medical or recreational marijuana use, according to a recent Quinnipiac University Poll. Fifty-nine percent support legalizing recreational marijuana, while 93 percent of Americans support the use of marijuana for medical purposes.The Trump administration has yet to clarify how it intends to deal with the disparity between the burgeoning legalization of marijuana in one form or another and federal law, which classifies the drug as highly addictive with no medical value, and any pronouncement from a Cabinet-level official sets off speculation of what it means for policy.Under former President Barack Obama, the government followed a hands-off policy toward enforcing federal marijuana laws in states where pot was legal.How long that policy will govern the Trump administration is uncertain. White House press secretary Sean Spicer caused a stir in February when he implied that the Justice Department might begin to crack down on recreational marijuana use in states that have already legalized it, and seeming to connect it to the opioid crisis.Attorney General Jeff Sessions has decried pot use and has advocated a crackdown. In a speech last month, Sessions said marijuana was only “slightly less awful” than heroin, and he declared at a Senate hearing last year that “good people don’t smoke marijuana.”Kelly’s remarks Tuesday seemed to be an effort to bring his position on marijuana more in keeping with Sessions’, two days after he took a decidedly softer line. On Sunday, Kelly had said marijuana was “not a factor” in the war on drugs, and that the search for solutions to the drug problem in the U.S. should focus on addictive drugs and not “arresting a lot of users.”“Yeah, marijuana is not a factor in the drug war,” Kelly said on NBC. “It’s three things. Methamphetamine. Almost all produced in Mexico. Heroin. Virtually all produced in Mexico. And cocaine that comes up from further south.”On Tuesday, though, Kelly, a retired Marine Corps general, asserted that scientific studies showed that pot “is not only psychologically addictive, but can have profound negative impacts on the still-developing minds of teens and people up into their mid-20s.”He promised that the Transportation Security Administration would take “appropriate action” when marijuana is found at baggage screenings, and that its possession and distribution would be “essential elements” in building cases to deport people who were in the country illegally.Ultimately, Tvert and many legalization advocates say remarks by Trump officials so far are a lot of talk and no cause for alarm.When it comes to the administration’s plans for marijuana, there have “seemingly been a lot of ups and downs that have been unsettling to some and mundane to others,” Tvert said.“In the end we haven’t moved anywhere and we’re in the same place where we started,” he said.But it remains unclear whether the Trump administration will adhere to Obama’s hands-off approach.“When you see something like the opioid addiction crisis blossoming in so many states around this country, the last thing we should be doing is encouraging people,” Spicer told reporters Feb. 23. “There’s a federal law that we need to abide by when it comes to recreational marijuana and other drugs of that nature.”Spicer clarified that the president sees a “big difference” in using pot for medical and recreational purposes.“The president understands ... the comfort that some of these drugs, including medical marijuana, can bring” to patients, he said.The administration’s lack of a defined line on legal marijuana worries officials in states that have set up elaborate regulatory schemes to control the substance and are taking in millions of dollars in taxes from legal sales.A cannabis caucus formed in Congress in February and vowed to fight President Donald Trump, if necessary, to protect legalization.", "external_links": [], "highlightTitle": "", "uuid": "ee434e5b1cfb61f6a5de41a78b95272a05fef83d", "highlightText": "", "rating": null}]