[{"entities": {"locations": [], "organizations": [], "persons": []}, "ord_in_thread": 0, "thread": {"site_full": "www.amazon.com", "site_section": "https://www.amazon.com/dp/B01ACEKAJY", "domain_rank": null, "replies_count": 0, "country": "US", "section_title": "Robot Check", "title": "16 Black - with Special Offers", "title_full": "Fire HD 8 Tablet with Alexa, 8\" HD Display, 16 GB, Black - with Special Offers (Electronics)", "published": "2017-04-19T05:30:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZSknjLeMG94os1vxGTFxqismA8xcbo_38TDuoUs2UnrPnLuBa9AKHpYhNZSzwTtZFUCjFWReSdIZo0CpigAHK5o8ZgfbT0DDtc-", "site": "amazon.com", "main_image": "", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "f36551647ea90c5b1986a4bded6643d9c55f6a10", "site_type": "discussions"}, "title": "Must have for Kindle and Amazon Prime users", "published": "2017-04-19T05:30:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZSknjLeMG94os1vxGTFxqismA8xcbo_38TDuoUs2UnrPnLuBa9AKHpYhNZSzwTtZFUCjFWReSdIZo0CpigAHK5o8ZgfbT0DDtc-", "author": "John aka GadgetMang", "crawled": "2017-04-19T08:40:29.000+03:00", "language": "english", "text": "I previously owned a Fire 7, Galaxy 8 Tab A, and Ipad Air 2 (not going to compare the Ipad for obvious reasons) and this a great upgrade from the Fire 7 and even (believe it or not!) in some ways the Galaxy Tab, mainly do to it's lower resolution screen, slower performance and price. I know many will argue my statement towards the Galaxy, but in my opinion their entry level device only has Android (Google Play Store) going for it when compared to this one.\nNow if your looking for decent budget tablet with great battery life than this one should be consider this one, with that said, based on some reviews I read on here many first time Amazon tablet buyers don't know that they do not use Google Play Store but a their modified versus for Android, which might mean they don't have access to their favorite apps (although Amazon has many of the popular apps available). I knew this going in with Fire 7 so was not an issue for me. Every thing works well on this device, even games like Real Racing 3 and Asphalt 8 runs perfectly and if your not expecting the latest snapdragon cpu performance, then this tablet performance will be fast enough for you.\nNow my major grip is that Amazon does not allow additional web browsers like Chrome to be installed, mainly because all of my bookmarks and other settings are shared on all my devices except this one :(\nThis would have been a 5 star review if Amazon gives in and give customers one of the most requested items for these tablets.\nSidenote: The MoKo Case for Amazon Fire HD 8 is very good option for a cheap case.", "external_links": [], "highlightTitle": "", "uuid": "f36551647ea90c5b1986a4bded6643d9c55f6a10", "highlightText": "", "rating": 4.0}]