[{"entities": {"organizations": [{"name": "starz", "sentiment": "none"}, {"name": "enemy review starz", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "bosworth", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}], "locations": [{"name": "york", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "persons": [{"name": "elizabeth", "sentiment": "none"}, {"name": "essie davis", "sentiment": "none"}, {"name": "elizabeth of york", "sentiment": "none"}, {"name": "michelle fairley", "sentiment": "none"}, {"name": "jodie comer", "sentiment": "none"}, {"name": "richard iii", "sentiment": "none"}, {"name": "rollo tomasi", "sentiment": "none"}, {"name": "henry vii", "sentiment": "none"}, {"name": "jacob collins-levy", "sentiment": "none"}, {"name": "henry", "sentiment": "none"}, {"name": "mother margaret beaufort", "sentiment": "none"}]}, "uuid": "f384315f5ec7500062fe5ebfc6fed62b16b485a5", "highlightText": "", "title": "TV Review: THE WHITE PRINCESS: Season 1, Episode 1: In Bed with the Enemy [Starz]", "thread": {"site": "film-book.com", "country": "US", "participants_count": 1, "site_full": "film-book.com", "section_title": "FilmBook", "uuid": "f384315f5ec7500062fe5ebfc6fed62b16b485a5", "site_section": "http://feeds.feedburner.com/film-book/dAVg", "domain_rank": null, "main_image": "http://cdn.film-book.com/wp-content/uploads/2017/04/suki-waterhouse-jodie-comer-essie-davis-rebecca-benson-the-white-princess-in-bed-with-the-enemy-01-600x350.jpeg", "performance_score": 0, "published": "2017-04-16T22:58:24.000+03:00", "url": "http://omgili.com/ri/.0rSU5LtMgzhqaKLFSMw6FvPA2Fk6XcH.IkYTQ2F.2jv0wxnZ.yq8NBEfAfuC_ey2bAjoo.2j84r.VmaPlNht4z3APIi1SHfrzl5U.TSZvBz0vCzbOX5eA--", "title_full": "TV Review: THE WHITE PRINCESS: Season 1, Episode 1: In Bed with the Enemy [Starz]", "title": "TV Review: THE WHITE PRINCESS: Season 1, Episode 1: In Bed with the Enemy [Starz]", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T22:58:24.000+03:00", "url": "http://omgili.com/ri/.0rSU5LtMgzhqaKLFSMw6FvPA2Fk6XcH.IkYTQ2F.2jv0wxnZ.yq8NBEfAfuC_ey2bAjoo.2j84r.VmaPlNht4z3APIi1SHfrzl5U.TSZvBz0vCzbOX5eA--", "ord_in_thread": 0, "crawled": "2017-04-16T22:58:24.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Rollo Tomasi", "text": "TV Review: THE WHITE PRINCESS: Season 1, Episode 1: In Bed with the Enemy [Starz] April 16, 2017 by Rollo Tomasi The White Princess In Bed with the Enemy Review Starz ‘s The White Princess : Season 1, Episode 1: In Bed with the Enemy was filled with many characters that the viewer will come to know, root for, some they will hate, and others that they will be ambivalent towards because of their motivations, intrinsic problems, and inherited conflicts. Elizabeth of York ( Jodie Comer ) was automatically the character that the viewer rooted for during In Bed with the Enemy . She was the underdog in the episode, the claimed spoil of war who was being forced into marrying not only a stranger but one of the people responsible for her true love (King Richard III)’s death. Elizabeth had to reign in: anger, the thirst for revenge, profound sadness, and anxiety over her fate and that of her immediate family so that she could make critical decisions that would open doors or seal her fate. Throughout In Bed with the Enemy , Elizabeth proved herself to be no wallflower, no passenger in a ship without a helmsman. Elizabeth stood up for herself from the beginning, wearing her position like a suit of armor, her words and her actions her shield and sword. The highlight of this was the tit-for-tat that King of England Henry VII ( Jacob Collins-Levy ) had with Elizabeth of York during an impromptu dinner and coital session. Their mutual disdain was the real meal that they feasted upon. Their dessert was the pressures of their positions. When it came to the king, the pressure to marry someone fertile that could produce a royal heir. Those societal pressures forced one into the other during a sexual encounter that could adequately be described as two people dispassionately clocked in at work. Henry VII’s passion and decision-making ability were on full display as he held his first royal audience during In Bed with the Enemy . King Henry truly wanted to kill the last York heir during In Bed with the Enemy but he also wanted to be even-handed and fair. Henry VII wanted to spare the youth’s life. That moment lay on a knife’s edge. The audience in attendance knew it. The York youth was one more outburst away from being behead or at least thrown into the Tower of London. The power, brains, and ambition behind-the-throne in In Bed with the Enemy were Dowager Queen Elizabeth ( Essie Davis ) and Queen Mother Margaret Beaufort ( Michelle Fairley ). During the episode, both women schemed but it was Dowager Queen Elizabeth whose machinations created the drama throughout the episode. Because of her former position, Dowager Queen Elizabeth knew what was going to happen before it happened. She not only knew the play book, she’d owned her own copy when in power and would have used similar tactics had power and position suddenly been thrust into her hands. That foreknowledge allowed her to stay one step ahead of her enemies throughout the episode. Elizabeth of York’s strength came from her mother’s example. Elizabeth of York’s secret motto (“Hidden and Patient”) and resolve (e.g. squeezing blood out of her foot to preserve her reputation) were born out of it. As Elizabeth of York’s eyes filled with tears during the closing moments of In Bed with the Enemy , the viewer saw that secret motto burning in her eyes. Like all palace intrigue TV series, The White Princess filled its premiere episode with competing interests, the high thrown low, the low raised high, rewards, punishments, renewed alliances, and subjugation. By all indications, no narrative stone (with regard to the time period, society, and setting – England, August 1485, after the Battle of Bosworth) will be left un-turned by The White Princess . Leave your thoughts on this The White Princess : Season 1, Episode 1: In Bed with the Enemy review and this episode of The White Princess below in the comments section. Readers seeking more TV show reviews can visit our TV Show Review Page , our TV Show Review Twitter Page , our TV Show Review Facebook Page , and our TV Show Review Google+ Page . Want up-to-the-minute notification? FilmBook staff members publish articles by Email , Twitter , Tumblr , Google+ , and Facebook ."}]