[{"entities": {"locations": [{"name": "nigeria", "sentiment": "none"}, {"name": "lagos-ibadan", "sentiment": "none"}], "organizations": [{"name": "frsc", "sentiment": "none"}, {"name": "kaduna state", "sentiment": "none"}, {"name": "federal road safety corps", "sentiment": "none"}, {"name": "fct", "sentiment": "none"}], "persons": []}, "ord_in_thread": 0, "thread": {"site_full": "mentertainmentnews.blogspot.com", "site_section": "http://mentertainmentnews.blogspot.com/", "domain_rank": null, "replies_count": 0, "country": "US", "section_title": "tezzyblog", "title": "ROAD ACCIDENT IN NIGERIA", "title_full": "ROAD ACCIDENT IN NIGERIA", "published": "2017-04-19T08:39:24.000+03:00", "url": "http://omgili.com/ri/2wGaacqxApvyfSp7j8HEldXh7mPS1yd913.L4r5kqIflh1QjKWyEd2Mu7JZkEzdDewEoYdrCVaR1PxgeTcT_s7hc8U2BeLWMsCAEVBhozVU-", "site": "blogspot.com", "main_image": null, "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "f41a02c330a77aca7c769cb544cb3a45251ef0d3", "site_type": "blogs"}, "title": "ROAD ACCIDENT IN NIGERIA", "published": "2017-04-19T08:39:24.000+03:00", "url": "http://omgili.com/ri/2wGaacqxApvyfSp7j8HEldXh7mPS1yd913.L4r5kqIflh1QjKWyEd2Mu7JZkEzdDewEoYdrCVaR1PxgeTcT_s7hc8U2BeLWMsCAEVBhozVU-", "author": "Adeyefa Tope (noreply@blogger.com)", "crawled": "2017-04-19T08:39:24.000+03:00", "language": "english", "text": "9,694 road accidents involving 15,682 cars were recorded in 2016 - FRSC According to the 2016 Annual Road Traffic Crash Report released by the Federal Road Safety Corps (FRSC),  9,694 road traffic accidents involving 15, 682 vehicles were recorded in 2016, resulting in the death of 5,053 persons, while 30,105 others sustained various degrees of injuries in the period under review.\n\nThis represents a decrease in number of crashes by 0.4 per cent and fatalities by 7 per cent compared to the 9,734 crashes and 5,440 deaths recorded in 2015. Analysis of the 2016 casualty figures on gender basis showed that 79 per cent or 3,970 of the dead were men, while 1,083 representing 21 per cent were women. Furthermore, 22,705 males constituting 75 per cent were injured, while 7,400 persons sustained varying degrees of injuries in the female category, which accounted for 25 per cent.   According to the report, 357 children representing 7 per cent were killed in the various road traffic accidents recorded in the year under review.  It said 56.6 per cent of all the vehicles involved in road crashes within the period were commercial, 41.6 per cent private and 1.7 per cent government vehicles.  Diplomatic vehicles accounted for 0.1 per cent, cars 34 per cent and motorcycles 20 per cent, the report said.   The report said most of the accidents occurred as a result of speed limit violation. On state-by-state basis, the FCT recorded the highest accidents with 1,373 cases involving 6,965 persons resulting in 253 deaths and injuries to 2,700 persons.   Kaduna State was next with 715 reported cases involving 5,392 persons out of which 505 died and 2,849 others sustained varying degrees of injury.   Analysis on the basis of route identified the 175 km-long Abuja-Lokoja road as the most crash-prone with a total of 531 crashes, leading to the deaths of 273 persons and injuries to 1,758 others.  Lagos-Ibadan road ranked second with 366 cases which claimed 229 lives, leaving 1,396 others injure ", "external_links": [], "highlightTitle": "", "uuid": "f41a02c330a77aca7c769cb544cb3a45251ef0d3", "highlightText": "", "rating": null}]