[{"entities": {"persons": [{"sentiment": "none", "name": "shawn"}, {"sentiment": "none", "name": "obama"}, {"sentiment": "none", "name": "jackie juntti"}, {"sentiment": "none", "name": "lois lerner"}, {"sentiment": "none", "name": "lerner"}, {"sentiment": "none", "name": "paz"}, {"sentiment": "none", "name": "lois"}, {"sentiment": "none", "name": "al sharpton"}, {"sentiment": "none", "name": "holly paz"}, {"sentiment": "none", "name": "trump"}], "organizations": [{"sentiment": "none", "name": "tea party"}, {"sentiment": "none", "name": "blm"}, {"sentiment": "none", "name": "justice department"}, {"sentiment": "none", "name": "irs"}, {"sentiment": "none", "name": "former internal revenue service"}, {"sentiment": "none", "name": "western free press"}], "locations": [{"sentiment": "none", "name": "us"}]}, "text": "4 Replies This weekend we were subjected to the too lazy to work crowds who prefer to march in protests about things they have no clue about beyond their rehearsed chanting. I am talking about the BLM’s and the SHOW US YOUR TAX RETURN loud mouths. I find it so telling of their hypocrisy – How they are demanding Pres. Trump release his tax returns but are totally SILENT about the SEALED RECORDS of Obama. Now we have Lois Lerner who KNOWS her testimony will expose the corruption in the IRS – especially during the Obama reign. Why is it the LEFT can hide and SEAL their corruption and deception but they demand that the Conservative side release everything including their used toilet paper… I also find it comical that they are demanding Pres. Trump release his tax returns and Lois Lerner is requesting her IRS time testimony be SEALED. What better example of the hypocrisy can there be???? Oh, and let’s not forget the millions that Al Sharpton owes the IRS and he still walks about a free man… ~ Jackie Juntti (Granny) Lois Lerner: “Public Can Never Know What I Did” Former Internal Revenue Service official Lois Lerner Embattled ex-IRS executive Lois Lerner was in federal court last week, asking a judge to seal her forthcoming deposition due to the inflammatory nature of her testimony. Lerner told the judge that if her actions at the IRS were to become public knowledge, she could face death threats from angry Americans – particularly those on the conservative side of the spectrum. Lerner is well-known for her role in the IRS’s partisan targeting of Tea Party groups; under the Obama administration, the IRS singled out nonprofit groups with conservative, Tea Party-ish style names for extra scrutiny. Many of their cases lingered in limbo for years while the IRS pretended to review their applications. Ultimately, there came to be no denying that there was a systematic, political effort inside the IRS to make life as difficult as possible for groups seen as threats to Obama’s agenda. Lerner and Holly Paz are scheduled to testify in a class action lawsuit against the IRS, which is being brought by 428 groups who were affected by the targeting scandal. But before the pair commit their testimony to record, they want assurances that what they say will never be read by the public. “Ms. Lerner and Paz have demonstrated that the public dissemination of their deposition testimony would expose them and their families to harassment and a credible risk of violence and physical harm,” their lawyer said in documents to the court. Reportedly, the women have submitted evidence to the judge that shows they’ve already received threats couched in “graphic, profane, and disturbing language.” No matter what the judge decides, the request itself has put the IRS scandal back in the headlines, and it comes at a time when Republicans want the Justice Department to re-open the case against Lerner. They say she deliberately obstructed the congressional investigation into the targeting and may have even contributed to it with her snide emails about Republicans. Lois in Chains??? If Lerner is so terrified about her actions coming to public light, that says it all. If she could reduce her perceived role in all this, she would shout her testimony from the highest mountain. Instead, she has wrapped herself in every layer of secrecy she can find. Either she’s protecting a certain someone higher on the food chain or she’s covering her own behind. Knowing the Obama administration, we’re guessing it’s a little of both. Written by Shawn and published by Western Free Press ~ April 14, 2017. FAIR USE NOTICE: This site contains copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available in our efforts to advance understanding of environmental, political, human rights, economic, democracy, scientific, and social justice issues, etc. We believe this constitutes a ‘fair use’ of any such copyrighted material as provided for in section 107 of the US Copyright Law. In accordance with Title 17 U. S. C. Section 107, the material on this site is distributed without profit to those who have expressed a prior interest in receiving the included information for research and educational purposes. For more information go to: http://www.law.cornell.edu/uscode/17/107.shtml Share this:", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "f7dfbb2d72e7bac082c4e4e9e4b22b3272c1d858", "rating": null, "highlightTitle": "", "title": "Liberalism is a mental disorder", "thread": {"country": "US", "site": "federalobserver.com", "replies_count": 0, "title_full": "Liberalism is a mental disorder", "site_categories": [], "performance_score": 0, "section_title": "The Federal Observer", "domain_rank": null, "uuid": "f7dfbb2d72e7bac082c4e4e9e4b22b3272c1d858", "main_image": "http://www.federalobserver.com/wp-content/uploads/2017/04/Lois-in-Chains-600x530.jpg", "site_type": "news", "title": "Liberalism is a mental disorder", "spam_score": 0.0, "site_section": "http://www.federalobserver.com/feed/", "url": "http://omgili.com/ri/jHIAmI4hxg.GrRsBYRruDBDxP1ntv6aVeWVMeNBlDKLWuMjbV0baDfHlDWFLIV0W2JVq_lSCjsfcBG95HitXd6CU8w9o3.STmvOSV9_p1mE-", "participants_count": 1, "site_full": "www.federalobserver.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T07:45:00.000+03:00"}, "crawled": "2017-04-18T11:24:43.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg.GrRsBYRruDBDxP1ntv6aVeWVMeNBlDKLWuMjbV0baDfHlDWFLIV0W2JVq_lSCjsfcBG95HitXd6CU8w9o3.STmvOSV9_p1mE-", "highlightText": "", "published": "2017-04-18T07:45:00.000+03:00", "author": "The Publisher"}]