[{"entities": {"persons": [{"sentiment": "negative", "name": "haslam"}, {"sentiment": "none", "name": "ruth topley"}], "organizations": [{"sentiment": "none", "name": "haslam college of business"}, {"sentiment": "none", "name": "ut knoxville"}], "locations": [{"sentiment": "none", "name": "ut knoxville"}]}, "text": "Call for Nominations: 2018 Professional MBA Program Scholarship April 17, 2017 2 SHARES \nThe Haslam College of Business will be sponsoring a scholarship for the 2018 Professional MBA program. Nominations are currently being accepted for the program which begins in August 2017. In order to be eligible for the scholarship, the following criteria must be met: Potential applicants must be nominated by his/her dean or appropriate administrator and complete an application for the ProMBA program. Nominees must be UT Knoxville full-time employees with at least three full years of employment at UT Knoxville. The selection review committee will be comprised of the vice chancellor of business and finance, the assistant vice chancellor of human resources, the Haslam College of Business executive director of talent management, diversity and community relations, the executive director of executive MBA programs, and the directors of the EMBA and professional MBA programs. The committee will select one applicant for the program who must then meet all application requirements for the program. Scholarship recipients will only be admitted when there is program capacity unused by external customers paying full rates. The availability of UT slots will be determined thirty days after the priority deadline. Scholarship recipients must remain as a full-time employee at UT Knoxville for two years following graduation or will be responsible for repaying the scholarship portion and, if appropriate, any departmental funding. In addition to the normal waiver of tuition, the scholarship will cover the program fee except for 50 percent of the variable cost which can be funded by the individual or the appropriate department. Currently the amount not covered by the scholarship will be $11,000 for the 2018 ProMBA program. Scholarship recipients will also be responsible for any miscellaneous costs which are not covered in the program fee and are required by all students. Individual leave must be taken for the time required in the program and coordinated with the recipient’s supervisor. \nIf you have an individual you wish to nominate, please submit the person’s name, job responsibilities, and the reason why you feel this person would be a good candidate. Nominations should be submitted to Ruth Topley ( ) no later than May 15. If you have questions, please call 974-1660. Post navigation", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "f7f12ab9da654c641204c0df1bbd66e82847992d", "rating": null, "highlightTitle": "", "title": "Call for Nominations: 2018 Professional MBA Program Scholarship", "thread": {"country": "US", "site": "utk.edu", "replies_count": 0, "title_full": "Call for Nominations: 2018 Professional MBA Program Scholarship", "site_categories": [], "performance_score": 0, "section_title": "Staff Stuff – Tennessee Today", "domain_rank": 9715, "uuid": "f7f12ab9da654c641204c0df1bbd66e82847992d", "main_image": "", "site_type": "blogs", "title": "Call for Nominations: 2018 Professional MBA Program Scholarship", "spam_score": 0.0, "site_section": "http://www.utk.edu/tntoday/category/staff/feed/", "url": "http://omgili.com/ri/DyQaNGXlfMrSNt3fgpdRIHD_YVfFW4tXtHR6hpHR0Tp5Yuh2UfSFuS20yMcus_zmP3Q6wO76rb7O4zOTJXiNGcXNe4iTbH2DA0Xz.xcQOVfryFibdB1Y30D5xQNvyfvr", "participants_count": 1, "site_full": "tntoday.utk.edu", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T03:19:00.000+03:00"}, "crawled": "2017-04-18T11:24:42.000+03:00", "url": "http://omgili.com/ri/DyQaNGXlfMrSNt3fgpdRIHD_YVfFW4tXtHR6hpHR0Tp5Yuh2UfSFuS20yMcus_zmP3Q6wO76rb7O4zOTJXiNGcXNe4iTbH2DA0Xz.xcQOVfryFibdB1Y30D5xQNvyfvr", "highlightText": "", "published": "2017-04-18T03:19:00.000+03:00", "author": "Karen Dunlap"}]