[{"entities": {"locations": [{"name": "broadway", "sentiment": "none"}, {"name": "north santa rosa", "sentiment": "none"}, {"name": "san antonio", "sentiment": "none"}, {"name": "city hall", "sentiment": "none"}, {"name": "san pedro creek", "sentiment": "none"}, {"name": "san fernando cathedral", "sentiment": "none"}], "organizations": [{"name": "express-news", "sentiment": "none"}, {"name": "san antonio express-news", "sentiment": "none"}, {"name": "san francesco di paola church", "sentiment": "none"}, {"name": "fratello", "sentiment": "none"}, {"name": "san antonio express-news", "sentiment": "none"}], "persons": [{"name": "john davenport", "sentiment": "negative"}, {"name": "fratello", "sentiment": "negative"}, {"name": "forno", "sentiment": "none"}, {"name": "emily spicer", "sentiment": "none"}, {"name": "caesar", "sentiment": "none"}, {"name": "magaro", "sentiment": "none"}, {"name": "magarao", "sentiment": "none"}, {"name": "salame", "sentiment": "none"}, {"name": "chuck hernandez", "sentiment": "none"}, {"name": "marilyn magaro", "sentiment": "none"}, {"name": "— emily spicer", "sentiment": "none"}, {"name": "bob owen", "sentiment": "none"}, {"name": "west martin", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.mysanantonio.com", "site_section": "http://www.mysanantonio.com/rss/feed/mySA-Food-922.php", "domain_rank": 12041, "replies_count": 0, "country": "US", "section_title": "mySA Food", "title": "Fratello's opening downtown location in ex-home of O'liva", "title_full": "Fratello's opening downtown location in ex-home of O'liva - San Antonio Express-News", "published": "2017-04-18T23:47:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_JJFqWRaLmlqWSoMNpCF0D6P.fMdToWOO89B1vRPLNIBir87.nN01ycXLs.1e7RcHA7A.QEYbAt0LEJGAVd756b2GCphGZTf.v1NeyByPmN29lavM.0cRzkf8C3r6MuiUrWp8LEjYsdw--", "site": "mysanantonio.com", "main_image": "http://ww4.hdnux.com/photos/57/62/74/12529423/5/rawImage.jpg", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.735, "uuid": "f8b3cf86621a9d01e4b037d797c9153b54e7bb00", "site_type": "news"}, "title": "Fratello's opening downtown location in ex-home of O'liva", "published": "2017-04-18T23:47:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_JJFqWRaLmlqWSoMNpCF0D6P.fMdToWOO89B1vRPLNIBir87.nN01ycXLs.1e7RcHA7A.QEYbAt0LEJGAVd756b2GCphGZTf.v1NeyByPmN29lavM.0cRzkf8C3r6MuiUrWp8LEjYsdw--", "author": "", "crawled": "2017-04-19T08:38:21.000+03:00", "language": "english", "text": "Photo: John Davenport /San Antonio Express-News Image 1 of / 17 Caption\nClose\nImage 1 of 17 Fratello's Italian Market & Deli Address: 2503 Broadway, 210-444-0277, fratellosdeli.com Brunch Hours: 11 a.m.-3 p.m. Sunday Brunch specials and regular menu price range: $4.29-$14.69 It is opening a second location at 115 Plaza de Armas, Suite 107, next to the Spanish Governor's Palace and behind City Hall. less Fratello's Italian Market & Deli Address: 2503 Broadway, 210-444-0277, fratellosdeli.com Brunch Hours: 11 a.m.-3 p.m. Sunday Brunch specials and regular menu price range: $4.29-$14.69 It is opening a ... more Photo: John Davenport /San Antonio Express-News Image 2 of 17 Fratello's will open a second location soon at the former home of O'liva, which closed in October. The location is downtown at 115 Plaza de Armas, Suite 107, behind City Hall. Fratello's will open a second location soon at the former home of O'liva, which closed in October. The location is downtown at 115 Plaza de Armas, Suite 107, behind City Hall. Photo: Emily Spicer / San Antonio Express-News, San Antonio Express-News Image 3 of 17 Fratello's will open a second location soon at the former home of O'liva, which closed in October. The location is downtown at 115 Plaza de Armas, Suite 107, behind City Hall. Fratello's will open a second location soon at the former home of O'liva, which closed in October. The location is downtown at 115 Plaza de Armas, Suite 107, behind City Hall. Photo: Emily Spicer / San Antonio Express-News, San Antonio Express-News Image 4 of 17 Fratello's will open a second location soon at the former home of O'liva, which closed in October. Tables and glassware seem set up and ready to go. The location is downtown at 115 Plaza de Armas, Suite 107, behind City Hall. less Fratello's will open a second location soon at the former home of O'liva, which closed in October. Tables and glassware seem set up and ready to go. The location is downtown at 115 Plaza de Armas, Suite 107, ... more Photo: Emily Spicer / San Antonio Express-News, San Antonio Express-News Image 5 of 17 Fratello's Italian Market & Deli is opening a second location at 115 Plaza de Armas, Suite 107, next to the Spanish Governor's Palace and behind City Hall. Pictured: Salame picante pizza at Fratello's Italian Market & Deli at 2503 Broadway. less Fratello's Italian Market & Deli is opening a second location at 115 Plaza de Armas, Suite 107, next to the Spanish Governor's Palace and behind City Hall. Pictured: Salame picante pizza at Fratello's ... more Photo: John Davenport /San Antonio Express-News Image 6 of 17 Fratello's is opening a second location at 115 Plaza de Armas, Suite 107, next to the Spanish Governor's Palace and behind City Hall. Pictured: Fratello's Italian Market & Deli market. Fratello's is opening a second location at 115 Plaza de Armas, Suite 107, next to the Spanish Governor's Palace and behind City Hall. Pictured: Fratello's Italian Market & Deli market. Image 7 of 17 This is the interior of Fratello's Italian Market & Deli Broadway location.\nThis is the interior of Fratello's Italian Market & Deli Broadway location. Photo: SAN ANTONIO EXPRESS-NEWS Image 8 of 17 Fratello's is opening a second location at 115 Plaza de Armas, Suite 107, next to the Spanish Governor's Palace and behind City Hall. Pictured: Caesar salad from the Broadway location.\nFratello's is opening a second location at 115 Plaza de Armas, Suite 107, next to the Spanish Governor's Palace and behind City Hall. Pictured: Caesar salad from the Broadway location. Photo: SAN ANTONIO EXPRESS-NEWS Image 9 of 17 This is the kitchen at Fratello's Italian Market & Deli. This is the kitchen at Fratello's Italian Market & Deli. Photo: SAN ANTONIO EXPRESS-NEWS Image 10 of 17 The exterior of O'liva, when it was open.\nThe exterior of O'liva, when it was open. Photo: BOB OWEN /San Antonio Express-News Image 11 of 17 O'liva's hummus, olive tapenade and muhammara, served with seasoned lavosh, a type of flatbread. O'liva's hummus, olive tapenade and muhammara, served with seasoned lavosh, a type of flatbread. Photo: BOB OWEN /San Antonio Express-News Image 12 of 17 O'liva's barbacoa benedict with a grilled tomato slice and beef barbacoa atop part of an English muffin, a poached egg and green chile hollandaise sauce. O'liva's barbacoa benedict with a grilled tomato slice and beef barbacoa atop part of an English muffin, a poached egg and green chile hollandaise sauce. Photo: BOB OWEN /San Antonio Express-News Image 13 of 17 O'liva's TBLT, with bacon aioli, lettuce and tomato jam. O'liva's TBLT, with bacon aioli, lettuce and tomato jam. Photo: BOB OWEN /San Antonio Express-News Image 14 of 17 The interior of O'liva The interior of O'liva Photo: BOB OWEN /San Antonio Express-News Image 15 of 17 Olive Oil at O'liva.\nOlive Oil at O'liva. Photo: BOB OWEN /San Antonio Express-News Image 16 of 17 A dinner at O'liva.\nA dinner at O'liva. Photo: Courtesy Photo Image 17 of 17 Fratello's opening downtown location in ex-home of O'liva 1 / 17 Back to Gallery Fratello's is adding a new location, downtown in the former home of O'liva, which closed in October. The location is at 115 Plaza de Armas, Suite 107, next to the Spanish Governor's Palace and behind City Hall.\nThe opening is tentatively set for May 1.\nPlans call for the restaurant to be open from 7 a.m. to 3 p.m. Monday through Friday and 11 a.m. to 3 p.m. Saturday, serving breakfast and lunch. There will be a coffee bar and a grab-and-go counter in addition to table seating for dining in.\nBreakfast will offer an assortment of pastries, breakfast panini and breakfast pizzas, plus yogurt cups and seasonal fruit. Everything will be made in-house except the yogurt, said manager Marilyn Magaro. Lunch will offer a slightly smaller version of the menu of Fratello's Broadway location , with salads, soups, antipasti and plenty of pasta.\nO'liva opened just over two years ago with a menu of healthy dishes. A 2015 Express-News review said, \"Chef-owner Chuck Hernandez hits a sweet spot. He aimed to create a restaurant that offers healthful, tasty, internationally inspired and reasonably priced dishes from local ingredients.\n\"For the most part, he and his team hit their mark and sometimes overshoot it. His nicely balanced dishes feel comfortable and accessible, whether they're served for breakfast, lunch or dinner.\" It was awarded 1 1/2 stars, between good and very good.\nIn October, this was posted on the O'liva Facebook page: \"We are sorry to announce that O'liva has officially closed its doors. Thanks to all who have been with us on this fantastic journey!\"\nFratello's at 2503 Broadway has been a local favorite for years. A 2013 Express-News review said, \"Creamy, herbaceous with just a touch of sweetness — the ricotta filling in the Lasagne Napoletana al' Forno at Fratello's has the power to evoke rhapsodies of joy.\"\nIts food scored three stars under a previous star system, ranking it very good.\nThe new location, with shiny wood floors, and with tables and glassware seemingly ready to go, is part of the renovated Plaza de Armas building, situated between City Hall and San Pedro Creek.\nMagaro explained that before San Francesco Di Paola Church was built in 1927 on the northern stretch of downtown by West Martin and North Santa Rosa streets, most Italian immigrants attended San Fernando Cathedral in Main Plaza, near the new Fratello's location.\n\"So it feels like a homecoming,\" Magarao said. \"It's all home cooking and (the owners') family recipes.\"\nThe new space is about the same size as the Broadway location, but the earlier hours means it will be available for special evening events -- something that's not an option on Broadway.\nA new quick breakfast/lunch option downtown will be its own special event when it opens.\n— Emily Spicer\nespicer@express-news.net\nTwitter: @Spiced1\nInstagram: @spiceoflife_en", "external_links": ["http://ww4.hdnux.com/photos/24/45/42/5396623/3/920x920.jpg", "http://ww3.hdnux.com/photos/42/10/27/8947178/13/920x920.jpg", "https://twitter.com/spiced1", "http://ww4.hdnux.com/photos/60/46/46/12741047/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/42/10/27/8947180/13/920x920.jpg", "http://ww4.hdnux.com/photos/42/10/27/8947183/13/920x920.jpg", "http://ww1.hdnux.com/photos/24/45/42/5396624/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/60/46/46/12741038/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/24/45/42/5396619/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/24/45/42/5396623/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/25/13/40/5552161/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/42/10/27/8947178/13/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/57/62/74/12529423/5/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/42/10/27/8947179/13/920x920.jpg", "http://ww1.hdnux.com/photos/60/46/46/12741040/3/920x920.jpg", "http://ww4.hdnux.com/photos/24/45/42/5396619/3/920x920.jpg", "http://ww1.hdnux.com/photos/24/45/42/5396624/3/920x920.jpg", "http://ww2.hdnux.com/photos/25/13/40/5552161/3/920x920.jpg", "https://www.instagram.com/spiceoflife_en/", "http://ww4.hdnux.com/photos/42/10/27/8947183/13/square_gallery_thumb.jpg", "http://www.fratellosdeli.com/", "http://www.expressnews.com/food/restaurants/article/Restaurant-review-O-liva-6627776.php?t=b66cf0325825164178&cmpid=twitter-premium", "http://ww2.hdnux.com/photos/51/43/03/10891517/16/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/60/46/46/12741047/3/920x920.jpg", "http://ww2.hdnux.com/photos/51/43/03/10891517/16/920x920.jpg", "http://www.expressnews.com/food/restaurants/article/Review-Fratello-s-Italian-Market-Deli-4944170.php?t=fa9ee3ced525164178&cmpid=twitter-premium", "http://ww1.hdnux.com/photos/42/10/27/8947184/13/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/43/42/34/9316101/9/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/42/10/27/8947182/13/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/57/62/74/12529423/5/920x920.jpg", "http://ww2.hdnux.com/photos/43/42/34/9316101/9/920x920.jpg", "http://ww1.hdnux.com/photos/42/10/27/8947180/13/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/60/46/46/12741038/3/920x920.jpg", "http://ww1.hdnux.com/photos/42/10/27/8947184/13/920x920.jpg", "http://ww1.hdnux.com/photos/60/46/46/12741040/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/42/10/27/8947182/13/920x920.jpg", "http://ww4.hdnux.com/photos/42/10/27/8947179/13/square_gallery_thumb.jpg", "http://www.fratellosdeli.com/Pages/Menu.aspx?DeptID=0"], "highlightTitle": "", "uuid": "f8b3cf86621a9d01e4b037d797c9153b54e7bb00", "highlightText": "", "rating": null}]