[{"entities": {"organizations": [], "locations": [], "persons": []}, "uuid": "f9cedaa1fe038a7f5ea9c996af281451ef8e1db3", "highlightText": "", "title": "Hypocritical Leftists Cause Sacramento Brewer to Shut Down", "thread": {"site": "corvetteforum.com", "country": "US", "participants_count": 4, "site_full": "www.corvetteforum.com", "section_title": "Politics, Religion &amp; Controversy - CorvetteForum - Chevrolet Corvette Forum Discussion", "uuid": "f9cedaa1fe038a7f5ea9c996af281451ef8e1db3", "site_section": "https://www.corvetteforum.com/forums/politics-religion-and-controversy-88/", "domain_rank": 24374, "main_image": "", "performance_score": 0, "published": "2017-04-16T15:52:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZS8i1SiyS5eu6ptADoBkOrUZ2RX0vKqewS_RIWLCEHqJ8fSEFPsk.PDNJdRYCUtbBiGt.IjSbFVmgogrYiXpEHJqYKeBEEbO0G23MmVl69KA7uus6EC6.P3Z9.m9IP77SRqCHT5eEr4vwTV2yXv2C9whlXIEv5KFK0XZ094AZ4nx.ENdwB9jnbL", "title_full": "Hypocritical Leftists Cause Sacramento Brewer to Shut Down - CorvetteForum - Chevrolet Corvette Forum Discussion", "title": "Hypocritical Leftists Cause Sacramento Brewer to Shut Down", "site_type": "discussions", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 4}, "language": "english", "published": "2017-04-16T15:52:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZS8i1SiyS5eu6ptADoBkOrUZ2RX0vKqewS_RIWLCEHqJ8fSEFPsk.PDNJdRYCUtbBiGt.IjSbFVmgogrYiXpEHJqYKeBEEbO0G23MmVl69KA7uus6EC6.P3Z9.m9IP77SRqCHT5eEr4vwTV2yXv2C9whlXIEv5KFK0XZ094AZ4nx.ENdwB9jnbL", "ord_in_thread": 0, "crawled": "2017-04-16T22:55:54.000+03:00", "rating": null, "external_links": ["https://cimg3.ibsrv.net/gimg/www.corvetteforum.com-vbulletin/330x254/80-grimes041317_7e85e23be41857af210d8767cb001265ba758524.jpg", "http://canadafreepress.com/article/hypocritical-leftists-cause-sacramento-brewer-to-shut-down"], "highlightTitle": "", "author": "Trainman-2", "text": "By Katy Grimes\nApril 15, 2017\nFreedom of information, speech and the press is firmly rooted in western democratic thought, and protected by the U.S. Constitution. But in California, apparently that western democratic thought isn\u0092t so free anymore.\nAn East Sacramento brewery owner who faced a very public protest of his restaurant after he posted a critique of the women\u0092s march on Facebook, has been forced to close his business.\n\u0093I am disgusted at all of the people and politicians that supported this anti-Trump event,\u0094 Murphy posted on his personal Facebook page in January\u0097not on the Facebook page for Twelve Rounds Brewing Company.\n\u0093But Murphy\u0092s post about the march was not his only political message,\u0094 the Sacramento Bee deviously reported. \u0093He has made comments suggesting Barack Obama is a traitor and a Muslim; he referred to abortion as murder; and he made clear his disdain for Hillary Clinton throughout the recent presidential campaign.\u0094\nApparently in leftist Sacramento, it is only okay to \u0093Celebrate diversity\u0094 as long as it solely coincides with the beliefs of the left. Diversity of thought, even offensive thought, is not allowed.\n\u0093Daniel Murphy should lose business for his narrowminded [sic] ignorance,\u0094 someone responded on Twitter to the Tweet posted by Nick Miller of the Sacramento News and Review (image), which said, \u0093Hey ladies, the owner of 12 Rounds brewery in Sacramento has some special feedback on the Women\u0092s March ...\u0094\nSuch interesting hypocrisy here. Randall Selland, the proprietor of Sacramento restaurants Ella, The Kitchen and Sellands, has long been known to share offensive leftist political musings to his patrons. But this Brewer dared to post critique of the ridiculous, highly publicized women\u0092s march on Facebook, and leftists shouted him down. And now they\u0092ve closed him down.\nI wonder how Nick Miller would feel about this\nI\u0092ve been on the receiving end of Randall Selland\u0092s rants, as have several of my friends. On one occasion, my husband and I were entertaining business clients for dinner at The Kitchen restaurant, which at the time had a 4-month wait for reservations. Selland came by our table and assuming everyone was liberal, as liberals do, started sharing rather distasteful, offensive thoughts about then-President Bush. It was not only tasteless for him to introduce himself with political comments with strangers and paying patrons, his comments were vile, and things I wouldn\u0092t even scream at the radio in the privacy of my own car.\nHowever, after my husband told Selland to bugger off, we vowed to never grace the doorsteps of his restaurants again. That\u0092s it. We didn\u0092t march on his restaurant. We didn\u0092t protest or smash windows. We didn\u0092t even leave a nasty Yelp review. We just decided that his style wasn\u0092t for us.\nFlash forward to Daniel Murphy. \u0093It is with a heavy heart that I am announcing that I am leaving Twelve Rounds Brewing Co,\u0094 Murphy posted on the Twelve Rounds Facebook page this week. \u0093This was my dream and my life. I put all of my heart, soul and money into it. I truly love what I do. It took 3 long years to get open due to delays in construction. We endured it and even paid for an empty building. But, there was a lot of backlash from my political views that have greatly affected Twelve Rounds. Even though they were on my personal Facebook page, It has affected Twelve Rounds too much.\u0094\n\u0093Later, after many objected to his views in their own posts, Murphy and his wife hastily posted again, asking for forgiveness from beer drinkers. But the damage was evidently done, and, on Tuesday, Murphy said the backlash had greatly affected the bottom line for Twelve Rounds,\u0094 the Bee reported.\nOne commenter on the Sac Bee article said this: \u0093If you read the article, he made offensive comments (offensive to most people) on a helluva lot more than just the women\u0092s march. People have free speech, as he did, but one has to expect consequences to it, especially if one has a job or a business.\u0094\nYes, speech has consequences. You cannot yell \u0093fire\u0094 in a crowded theater, or mention \u0093bomb\u0094 on an airplane without suffering consequences. But why does anyone care what his political views are? Does he make great brew? Why protest his business? Just don\u0092t patronize it if you don\u0092t like the guy or his politics.\nWhy are leftists compelled to shut down everything that makes them uncomfortable, or they disagree with?\nMany in America feel similarly to Murphy on a host of the issues he mentioned. But apparently in Sacramento, CA this is not allowed if you own and operate a business.\n\u0093But his post, along with several other incendiary political posts, have inspired many to call for a boycott,\u0094 the Bee reported, appearing to help gin up the protestors.\nThe Bee even reported that Twelve Rounds had grow quickly in popularity, won awards for its beers, and recently invested in an expensive bottling line to expand their sales reach at the retail level. \u0093This sudden uproar has them worried\u0097and based on comments on Twitter and Facebook, they\u0092re losing customers by the minute.\u0094\nThe Bee went on and on: \u0093In one post from August, Murphy used a derogatory term for someone from Pakistan, saying the person had\u0092just called on my cell phone and tried to tell me he was from Dell and needed my credit card number to fix malware on my PC. What a moron.\u0092\u0094 In one post, he displayed a statement calling the Islamic faith\u0092barbaric.\u0092\u0094\nGasp. I also think the Islamic faith is barbaric, given the beheadings, murders of homosexuals, female genital mutilation, wife beatings, child brides, predatory male sexuality with little boys\u0097all behaviors that are illegal in America. In Islam, rape victims are punished, women are worth half of a Muslim man, and infidels are worth nothing. Why don\u0092t Sacramento\u0092s leftists protest this?\nInstead, a guy who followed a dream to open a brewery shared his views of the world on his Facebook page with \u0093friends,\u0094 and ends up being forced out of business.\nThis is communism my friends. Freedom of information, speech and the press is firmly rooted in western democratic thought, as I stated in the first paragraph of this column. In a communist society, an individual\u0092s interests are indistinguishable from society\u0092s. Individual freedom is incompatible with communism. Hysterical mob censorship, which is what this is, and what we are seeing on college campuses, is dangerous, and must be fought by every liberty-loving American.\nRight now, there are four states proposing legislation to ensure free speech on college campuses, and to prohibit universities from banning speakers and shielding people from offensive and controversial ideas. (hint: California is not one of the states)\nIt\u0092s come to this in the United States, that we need to pass laws to protect Constitutional rights we already have. The left, terrified of free speech, shuts it down everywhere it can\u0097even if it means putting a man out of business. The left is dangerously poised on the precipice of delving into communism.\nKaty Grimes is an investigative journalist, Senior Correspondent with the Flash Report, ReaganBaby, and Senior Media Fellow with Energy and Environmental Institute. A longtime political analyst, she has written for The Sacramento Union, The Washington Examiner, Watchdog.org, The Pacific Research Institute\u0092s CalWatchdog, The San Francisco Examiner, The Business Journal, E&E Legal, The Sacramento Bee, Legal Insurrection, Canada Free Press, and Laura Ingraham\u0092s LifeZette, and can be heard regularly on many talk radio shows each week.\nhttp://canadafreepress.com/article/h...r-to-shut-down"}]