[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:47:11.000+03:00", "author": "Glenn,  kenixfan (noreply@blogger.com)", "entities": {"persons": [{"name": "gray", "sentiment": "none"}, {"name": "watkins", "sentiment": "none"}, {"name": "lewis-jarvis", "sentiment": "none"}, {"name": "erik stams", "sentiment": "none"}, {"name": "chris mcdonagh", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "chaz", "sentiment": "none"}, {"name": "matt gray", "sentiment": "none"}, {"name": "andrea lewis-jarvis", "sentiment": "none"}, {"name": "andrea", "sentiment": "none"}], "locations": [{"name": "d.c.", "sentiment": "none"}, {"name": "evergreen", "sentiment": "none"}], "organizations": [{"name": "evergreen", "sentiment": "none"}, {"name": "darling buds", "sentiment": "none"}, {"name": "odd box records", "sentiment": "none"}]}, "text": "\nI am thrilled to report that not only are The Darling Buds back but they are back in support of a thoroughly excellent release. The new EP, Evergreen , out on Friday via Odd Box Records , is so good, so effortlessly tuneful that a listener wants to immediately go and fall in love with this group's back-catalog all over again. \nThe group this time out -- original singer Andrea Lewis-Jarvis, bassist Chris McDonagh, guitarists Paul 'Chaz' Watkins and Matt Gray, and drummer Erik Stams -- gel remarkably well, so well, in fact, that one might forget that the 2 guitarists are from different eras of the band's past (Watkins from the Crawdaddy line-up and Gray from the Erotica one). Opener \"Evergreen\" positively soars, Andrea's vocals sounding more or less as they have for 30 years now, the anchor in the group's rockier take on the sort of Sixties styles that inspired so many in the C86-C87 generations. \"Guess The Good Parts\" roars past on the back of a killer hook and an assured performance from Lewis-Jarvis, with the results being the sort of tune that begs to be cranked up as one cruises the highway in a car with the windows down. \"Complicated\" achieves the same kind of thing, the overall effect here being a good deal similar to those magnificent early Catatonia singles, that Welsh band surely owing a huge debt to this Welsh band. Evergreen ends with the more down-tempo \"Twenty-One Aches\" , a number that wouldn't have sounded out-of-place on Erotica , though the mood here is one achieved with more guitars than keyboards this time around. \nIt seems hard to believe that this is the first new Darling Buds music to be released in 25 years. It really doesn't seem that long ago that I was putting \"Sure Thing\" on mix-tapes in my final year of college. And it doesn't seem like 26 years ago that I saw the band do a wonderful cover of \"Temptation\" by New Order when they played D.C. on the Crawdaddy tour, nor does it seem like it's been 28 years since I worked in a college record store and played \"Let's Go Round There\" off Pop Said... at a dangerously loud volume in the shop. So, believe this fan when I say that Evergreen is not only a set of 4 great Darling Buds songs, it's one of the very rare cases where a comeback release deserves to sit right next to a group's earlier records. There's nothing here in the grooves of Evergreen to suggest that the band have been away or anything like that. The Darling Buds sound, if possible, even a bit more invigorated here than they did on some of their major label albums. And for that reason, I can only hope that Evergreen is just the first in a string of new Darling Buds releases as, surely, a full-length record is the next logical step for these genuine Welsh legends. \nEvergreen by The Darling Buds is out on Friday via Odd Box Records . Follow The Darling Buds via their official Facebook page . \n[Photo: Uncredited promotional image] \nEvergreen EP by The Darling Buds ", "url": "http://omgili.com/ri/jHIAmI4hxg_yombN9U.f853Du_WigIrB4Nn7tuAciJmaQcVL9hvdyf7iV828_KaMv2JRJ0KzeTPRHq_0a.lU42w1wKybY81t.2G8lpIF_vNr9VUNi_EXVwWeLzIlqj9O94wHEGPSIYs-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T10:47:11.000+03:00", "language": "english", "title": "Guess The Good Parts: A Review Of The Fine New EP From The Darling Buds", "thread": {"title_full": "Guess The Good Parts: A Review Of The Fine New EP From The Darling Buds", "site_full": "www.apessimistisneverdisappointed.com", "site": "apessimistisneverdisappointed.com", "site_section": "http://www.apessimistisneverdisappointed.com/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "US", "section_title": "A Pessimist Is Never Disappointed", "url": "http://omgili.com/ri/jHIAmI4hxg_yombN9U.f853Du_WigIrB4Nn7tuAciJmaQcVL9hvdyf7iV828_KaMv2JRJ0KzeTPRHq_0a.lU42w1wKybY81t.2G8lpIF_vNr9VUNi_EXVwWeLzIlqj9O94wHEGPSIYs-", "published": "2017-04-16T10:47:11.000+03:00", "title": "Guess The Good Parts: A Review Of The Fine New EP From The Darling Buds", "uuid": "fa9c7a8f584aabe7246908f6e6bbe3225c5686ff", "main_image": null}, "uuid": "fa9c7a8f584aabe7246908f6e6bbe3225c5686ff", "ord_in_thread": 0}]