[{"entities": {"persons": [{"sentiment": "none", "name": "hugo castro"}, {"sentiment": "none", "name": "gaba cortes"}, {"sentiment": "none", "name": "angie velazquez"}, {"sentiment": "none", "name": "morones"}, {"sentiment": "none", "name": "castro"}], "organizations": [{"sentiment": "none", "name": "kpbs"}, {"sentiment": "none", "name": "kpbs radio"}, {"sentiment": "none", "name": "border angels"}, {"sentiment": "none", "name": "facebook"}], "locations": [{"sentiment": "none", "name": "mexico"}, {"sentiment": "none", "name": "tijuana"}, {"sentiment": "none", "name": "san diego"}, {"sentiment": "none", "name": "u.s."}, {"sentiment": "none", "name": "puebla"}, {"sentiment": "none", "name": "querétaro"}, {"sentiment": "none", "name": "caribbean"}, {"sentiment": "none", "name": "mexico city"}, {"sentiment": "none", "name": "mexicali"}]}, "text": "American Who Aids Immigrants Reported Missing in Mexico 0 Comments for this article Submitted: 04/17/2017 - 10:43pm \nHugo Castro’s missing poster reads, “Wanted. Seen for the last time on a live steam April 13 at 4:28 pm.” Border Angels \nHis partner told \nKPBS radio in San Diego she is scheduled to meet Tuesday morning in Mexico City with federal prosecutors to review security camera video that they hope will give clues as to his whereabouts. \nIn his own 20-minute video, posted on Facebook Thursday afternoon, Castro says in Spanish, “I was threatened. They want to kill me,” adding a short time later: “I need help. I need help.” \nCastro’s partner, Gaba Cortes, told KPBS that she missed a phone call Friday afternoon but called the number back and reached a taxi driver, who told her that he had driven Castro to Mexico City. The American reportedly said he still planned to head to the rendezvous point for the immigrant caravan, in the town of Querétaro, which is about 130 miles northwest of the capital. \nIn the Facebook video, Castro appears alongside a freeway and says he is the road that connects Mexico City with the city of Puebla, to the southeast. The American reports that his cell phone battery is running low and that he does not have a lot of money. \nHe mentions others who have disappeared in Mexico and says, “Please, someone come. . . . I don’t know what else to say.” \nCastro has been working odd jobs to pay the bills but devoting most of his time over the past decade to aid immigrants in Mexico, according to Morones. Both men work for Border Angels which, according to its website, is an “all-volunteer, non-profit organization that advocates for human rights, humane immigration reform, and social justice.” \nCastro had been \nfeatured a week ago by KPBS for his work aiding Haitians stranded in Tijuana and Mexicali after the U.S. toughened entry rules on the Caribbean refugees. The story depicted Castro bringing food to shelters and confronting an aid worker who appeared to no longer be welcoming the foreigners. \nCastro said that he did not believe in the leaders of Mexico or the U.S., adding: “But I do believe in the people. So we, the people, el pueblo , are the ones who are bringing the change.” \nMorones said it was not uncommon for volunteers working along the border to be threatened by smugglers and others who making money by preying on migrants. “About three weeks ago, Hugo was threatened,” Morones said. “He was trying to help these Haitians and people who were trying to take advantage of them said ‘It’s none of your business. Stay out of it.’” Morones said he told the volunteer to file a police report about the intimidation. \nIn joining the caravan escorting Central Americans from Querétaro, Castro intended to raise awareness about the plight of the migrants, many of whom cannot get asylum in the U.S. Smugglers and others have robbed, raped and beaten the immigrants. \nCastro’s sister, Angie Velazquez, said via email that her brother had helped hundreds of people, but he declined to “brag about it” or seek attention. \n“He has the kindest heart,” she said. “He helps, whether he knows you or not; he helps with no strings attached.” Share: ", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "fdcb74d9930fb29fd8e580672e45d8606445c36b", "rating": null, "highlightTitle": "", "title": "American Who Aids Immigrants Reported Missing in Mexico", "thread": {"country": "US", "site": "41nbc.com", "replies_count": 0, "title_full": "American Who Aids Immigrants Reported Missing in Mexico", "site_categories": [], "performance_score": 0, "section_title": "", "domain_rank": null, "uuid": "fdcb74d9930fb29fd8e580672e45d8606445c36b", "main_image": "http://www.41nbc.com/wp-content/uploads/2016/01/National.jpg", "site_type": "news", "title": "American Who Aids Immigrants Reported Missing in Mexico", "spam_score": 0.274, "site_section": "", "url": "http://omgili.com/ri/jHIAmI4hxg8kzgy91Dka_uv96W5OP56zahM0yLiret_ZVQd66.p0Hinxr46skf6jqPpyXrBsOXegQnRbtylDgq12uOWfKoQG96OrR2qJr07AwQYwcJGgIBTnceUV5Aqa", "participants_count": 0, "site_full": "www.41nbc.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T06:43:00.000+03:00"}, "crawled": "2017-04-18T11:24:27.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8kzgy91Dka_uv96W5OP56zahM0yLiret_ZVQd66.p0Hinxr46skf6jqPpyXrBsOXegQnRbtylDgq12uOWfKoQG96OrR2qJr07AwQYwcJGgIBTnceUV5Aqa", "highlightText": "", "published": "2017-04-18T06:43:00.000+03:00", "author": ""}]