[{"rating": null, 
"external_links": [], 
"crawled": "2017-04-16T09:14:02.000+03:00", 
"author": "Chad Murray", 
"entities": {"persons": [], "locations": [], "organizations": []}, 
"text": "(((O))) Interview: Talking Yerkish: Chad Murray Gets Primatial With Part Chimp Interview: Part Chimp Website | Facebook | \nWe'll let a lot of stuff slide to get the same feel, bum notes, bits that are just plain wrong, new bits or new songs with minimal takes to get a feel of almost falling apart. Because that's what it's like for us playing live. Just on the edge of falling apart. We try and get tight, but it's just not in us as a band. by Chad Murray | April 15, 2017 | Interviews \nAhead of the release of their stupendous new album IV ( reviewed here ) and their performance at Wrong Festival in Liverpool on the 22nd April, Chad Murray asked Part Chimp the big questions such as first and foremost, “cheese toastie or bean breville?” \nPC: Cheese and beans for ultimate scald factor. \n(((o))): The first thing I’d like to ask about the new is whether the album is intended to be referred to as four or “I.V” or even in vitro or something like chicken wings? \nPC: Iv, rhymes with div \n(((o))): Ok, so, I get you might not be able to explicitly answer this but exactly what part of you is chimp exactly? \nPC: You are right, I am not able to answer that question. \n(((o))): *Jake Murray also asks* “Part Chimp… Part Biscuit?” \nPC: No. \n(((o))): All the easy stuff aside, what exactly is it that you, as a band, feel helps to elevate your live sound from the studio? Especially, as you are frequently championed by people who’s opinion I trust as a fucking incredible band to behold in person. \nPC: A natural looseness that comes with the characters in the band. We try to get that factor onto the records but it’s sometimes difficult in the studio. We’ll let a lot of stuff slide to get the same feel, bum notes, bits that are just plain wrong, new bits or new songs with minimal takes to get a feel of almost falling apart. Because that’s what it’s like for us playing live. Just on the edge of falling apart. We try and get tight, but it’s just not in us as a band. \n(((o))): The big question on a lot of people’s minds seems to be what the fuck is gonna happen when Part Chimp storm Merseyside and swarm the stage for Wrong Festival, the first half of the true Merseyside derby? \nPC: I’m not sure that’s really the big question on a lot of people’s minds, unless you know something we don’t. Is it a trap? Have you rigged up some kind of Carrie-esque blood bath over the stage or something? What the fuck IS going to happen??! We just don’t know. \n(((o))): I won’t say too much but, bring wellies and a hook-hand. \n(((o))): I believe the next time I’ll be seeing you after that will be at the 100 Club with Baba Yaga, can you tell us about your history with Baba Yaga and your overall experience with the promotion? Personally, I feel like Baba Yaga is where live music is at as far as London is concerned, though, I obviously love Goodsoul Promotions and Chaos Theory as well but, I guess there’s some bias there. \nPC: I think it started at The Corsica Studios, which is a really great venue in South London. Adrian has been putting on great shows there for ever. And then one day it was Anthony booking us to play there and there was Baba Yaga’s Hut putting on lots of good shows. Which was cool. I’m not really clued in to the scene but it seems pretty good. Usually, if there’s an interesting show going on, it turns out it’s one of theirs. \n(((o))): I feel the same, recently moving to London it seems that there’s just a constant torrent of great gigs being put on by them. I also see that you’ve released a beautiful new t-shirt, what other merch might one be able to purchase whilst you’re on tour? \nPC: Yes. Along with the classic Beardface shirt, now in a beautiful 3 colour print! there is a hand screen printed design from a bloke called Lada in Hungary who has done some great shirts for a few bands in the past so I thought it was about time he did one for us. It’s got a slug on it and the Eye-sparagus from the cover of the record. It’s lovely. You will also be able to get the new album on white vinyl and anything else we can dig up. We also have copies of the 7″ split with Grey Hairs we did for God Unknown. \n(((o))): …And coming round somewhat palindromically or in some sort of paraprosdokian, how did you get that drum sound on your album? It’s fucking colossal. To be honest, at Echoes and Dust HQ, that was fuck loads of people asking how you got various sounds on your album; so, I guess if you guys could tell us about the recording process and what weird and wonderful shit went into that, I think that’d appeal to all of those curiosities? \nPC: We recorded in a barn in the middle of nowhere in Norfolk in February. It was really cold. Apparently it’s the cold that helps the sound waves travel through the air in a truer waveform and also microphone membranes perform better in low temperatures. This was all engineered by our engineer, Hieronymus, a dutchman born in the same town as Hieronymus Bosch, so what you are also hearing is traces of the mindset of the painter of the Garden Of Earthly Delights etc. \n(((o))): Well, I believe it was The Dude who said: “that’s fucking interesting man, that’s fucking interesting”. Kind of reminds me of something from Sylvia Massy’s Recording Unhinged. I dunno, the science of it myself but I imagine beers staying cold for longer also helped you guys to create the resulting Facemelter that we are all know and love here at Echoes and Dust. \nLast but not least, who would win in a collision one trillion lions or The Sun? (*the source of life; not the source of bogus “news”) \nPC: The person who managed to get one trillion lions into space. \n— \nThanks to Part Chimp for taking part in this interview, they will be playing Wrong Festival and the 100 Club on the aforementioned dates and IV was released last Friday 14th April ; get it down your fucking gullet. It’s magnificent.  ", 
"url": "http://omgili.com/ri/j.JM_ertN3KoiQFW5n0zTWMWASyt54Hw6cFWe6tnOvcF5M81J4Su8EGiK3Amj0PmmAl6PvCBRpZDKCS99RRisSoFa6fCV5fDzqp3EizfCm3_Y4pTiDCKj4wHwIZe5q1.", 
"highlightText": "", 
"highlightTitle": "", 
"published": "2017-04-15T21:50:00.000+03:00", 
"language": "english", 
"title": "Talking Yerkish: Chad Murray Gets Primatial With Part Chimp", 
"thread": {"title_full": "Talking Yerkish: Chad Murray Gets Primatial With Part Chimp", 
			"site_full": "echoesanddust.com", 
			"site": "echoesanddust.com", 
			"site_section": "http://echoesanddust.com/feed/", 
			"performance_score": 0, 
			"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, 
			"participants_count": 1, 
			"site_type": "blogs", 
			"spam_score": 0.0, 
			"domain_rank": null, 
			"replies_count": 0, 
			"site_categories": [], 
			"country": "NL", 
			"section_title": "Echoes And Dust", 
			"url": "http://omgili.com/ri/j.JM_ertN3KoiQFW5n0zTWMWASyt54Hw6cFWe6tnOvcF5M81J4Su8EGiK3Amj0PmmAl6PvCBRpZDKCS99RRisSoFa6fCV5fDzqp3EizfCm3_Y4pTiDCKj4wHwIZe5q1.", 
			"published": "2017-04-15T21:50:00.000+03:00", 
			"title": "Talking Yerkish: Chad Murray Gets Primatial With Part Chimp", 
			"uuid": "e12f4a207fd334a1c4975f14f421daa51cf5871f", 
			"main_image": "http://echoesanddust.com/wp-content/uploads/2017/04/Part_Chimp_iv.jpg"}, 
"uuid": "e12f4a207fd334a1c4975f14f421daa51cf5871f", 
"ord_in_thread": 0}]