[{"entities": {"organizations": [{"name": "united", "sentiment": "negative"}, {"name": "khou", "sentiment": "none"}, {"name": "united airlines", "sentiment": "none"}, {"name": "us marshall", "sentiment": "none"}, {"name": "cbs", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}], "locations": [{"name": "united ai", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "costa rica", "sentiment": "none"}], "persons": [{"name": "michael hohl", "sentiment": "negative"}, {"name": "amber maxwell", "sentiment": "none"}, {"name": "dao", "sentiment": "none"}, {"name": "maggie schmerin", "sentiment": "none"}, {"name": "hohl", "sentiment": "none"}, {"name": "maxwell", "sentiment": "none"}, {"name": "david dao", "sentiment": "none"}]}, "uuid": "d1bbf9184c2a3d4f2a5258b313c1c11bfb10028e", "highlightText": "", "title": "A couple says they were kicked off a United flight on the way to their wedding", "thread": {"site": "businessinsider.co.id", "country": "ID", "participants_count": 1, "site_full": "www.businessinsider.co.id", "section_title": "Business Insider", "uuid": "d1bbf9184c2a3d4f2a5258b313c1c11bfb10028e", "site_section": "http://www.businessinsider.co.id/feed/", "domain_rank": 44972, "main_image": "https://static-ssl.businessinsider.com/image/58f3b885c75d4a1a008b48c3-456/screen%20shot%202017-04-16%20at%2023051%20pm.png", "performance_score": 0, "published": "2017-04-16T22:48:27.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meuL1ei1Bo_4WUQZn62NzqF4SZAhTUqxYMWLds2poPBPdCvcGDYvBAo0cIcmHSr83Rwroe8uKvGXXD8_3Y2V9v4XT5_6Si6ioug--", "title_full": "A couple says they were kicked off a United flight on the way to their wedding", "title": "A couple says they were kicked off a United flight on the way to their wedding", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T22:48:27.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24meuL1ei1Bo_4WUQZn62NzqF4SZAhTUqxYMWLds2poPBPdCvcGDYvBAo0cIcmHSr83Rwroe8uKvGXXD8_3Y2V9v4XT5_6Si6ioug--", "ord_in_thread": 0, "crawled": "2017-04-16T22:48:27.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Sonam Sheth", "text": "Apr. 17, 2017, 2:57 AM Facebook Michael Hohl and Amber Maxwell \nIt’s been a rough week for United Airlines. \nThat deluge didn’t let up on Sunday, when KHOU reported that a couple had been kicked off their United flight as they were headed from Houston to Costa Rica for their wedding. \nMichael Hohl and Amber Maxwell had allegedly boarded their flight on Saturday and were about to take their seats when they said they saw a passenger napping across the row they were assigned to. \nHohl said that instead of waking up the man who was sleeping, he and his fiancée decided to sit a few rows in front of their assigned seats. \n“We thought not a big deal, it’s not like we are trying to jump up into a first-class seat,” Hohl told KHOU, the CBS affiliate in Houston. “We were simply in an economy row a few rows above our economy seat.” \nHohl said that after he and Maxwell sat down, a flight attendant asked if they were in their assigned seats. When the couple said no and explained why they had moved, Hohl said the attendant declined their request for an upgrade and asked them to return to their original seats. \nHohl said that although he and Maxwell did as they were told, a US Marshall later boarded the flight and asked them to get off the plane. The couple said they complied with that demand as well, but found the overall experience “strange.” \n“They said that we were being disorderly and a hazard to the rest of the flight, to the safety of the other customers,” Hohl said. “I think customer service and the airlines has gone real downhill. The way United Airlines handled this was really absurd.” \nUnited has disputed Hohl’s version of events, saying the couple had repeatedly tried to sit in upgraded seats and refused to comply with requests to move back to their assigned seats. \n“We’re disappointed anytime a customer has an experience that doesn’t measure up to their expectations,” United said in a statement to KHOU . “These passengers repeatedly attempted to sit in upgraded seating which they did not purchase and they would not follow crew instructions to return to their assigned seats. We’ve been in touch with them and have rebooked them on flights tomorrow.” \nUnited has been engulfed by controversy since a viral video emerged depicting 69-year-old David Dao being violently dragged off a United Airlines flight after refusing to give up his seat to make room for crew members. Dao sustained injuries and plans to file a lawsuit against the airline. \nAfter the incident involving Dao, United enacted a new rule stipulating that crew members will no longer be allowed to displace passengers already on board the plane, the Associated Press reported. \nUnited spokeswoman Maggie Schmerin said in an email to the AP on Sunday that the change is an initial step in a review of policies and it’s meant to ensure that situations like Dao’s never happen again. Please enable Javascript to watch this video Share"}]