[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/2wGaacqxApteHvNif0bnvf1GkJnNI9b6ZK7F8sO2jaVgVueyo5enDu7bGSCIxhdWQZ0egc2gdDilYX65FsCQUQsp5bN3LkzCVXdq77bY8nxWz7xo4POTcA--", "title": "Movie Review: Same Same but Different (2009)", "site_type": "blogs", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://magical-koinouta.blogspot.com/", "spam_score": 0.0, "section_title": "Tiya-Chan", "site": "blogspot.com", "site_full": "magical-koinouta.blogspot.com", "performance_score": 0, "uuid": "e40dcbad08d656ef1544b30882041d1aa666b915", "published": "2017-04-17T11:27:07.000+03:00", "site_categories": [], "country": "BN", "title_full": "Movie Review: Same Same but Different (2009)", "participants_count": 1, "main_image": null}, "url": "http://omgili.com/ri/2wGaacqxApteHvNif0bnvf1GkJnNI9b6ZK7F8sO2jaVgVueyo5enDu7bGSCIxhdWQZ0egc2gdDilYX65FsCQUQsp5bN3LkzCVXdq77bY8nxWz7xo4POTcA--", "title": "Movie Review: Same Same but Different (2009)", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:27:07.000+03:00", "language": "english", "entities": {"locations": [{"name": "cambodia", "sentiment": "none"}, {"name": "phnom penh", "sentiment": "none"}, {"name": "south-east asia", "sentiment": "none"}, {"name": "royal palace", "sentiment": "none"}, {"name": "hamburg", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "deutsch", "sentiment": "none"}, {"name": "western union", "sentiment": "none"}, {"name": "sreykeo", "sentiment": "none"}, {"name": "phnom pehn", "sentiment": "none"}, {"name": "east", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "persons": [{"name": "claus boje", "sentiment": "none"}, {"name": "deutsch", "sentiment": "none"}, {"name": "henry        after", "sentiment": "none"}, {"name": "lilli  jens harzer", "sentiment": "none"}, {"name": "david kross", "sentiment": "none"}, {"name": "sreykeo", "sentiment": "none"}, {"name": "ben  apinya sakuljaroensuk", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "benjamin prüfer", "sentiment": "none"}, {"name": "benjamin", "sentiment": "none"}, {"name": "sreykeo wanda badwal", "sentiment": "none"}], "organizations": [{"name": "german financial times", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "e40dcbad08d656ef1544b30882041d1aa666b915", "published": "2017-04-17T11:27:07.000+03:00", "author": "isnani tiya Nuswantari (noreply@blogger.com)", "text": "   Hi Chaners,    Today I wanna write about movie (again!), I feel that I really like to watch movie most of time, haha. Now, the movie that I want to talk (well, technically to write about) is called \"Same Same but Different\". \n   Have you known that Same Same but Different is a phrase? Well, it is. What does it mean? I don't know it’s significance or if it was a connotation of some sort for something deeper. To me it was the equivalent to saying “Same thing” only slightly cooler. But let's see what google say: \n1. Normally it means something is functionally or substantially the same as something else, but differs in method of implementation, or in minor details. 2.  It is when something is almost the same, but it isn't quite. Or, it can be used sarcastically to compare two things that are radically different. 3. It's used a lot in Thailand, especially in an attempts to sell something but can mean just about anything depending on what the user is trying to achieve.  \n    Ya, I've known that phrase long time ago. When I randomly went to instagram, I found that there's a movie using that phrase for its tittle. I was interested by the movie cover. There were an Asian lady with a white guy, and with a tagline written there: A Cambodian ba r girl and A German student, are you ready for the love of your life?       Same Same but Different, is a German film based on the incredible true story of Benjamin Prüfer, a German student who travel led in Cambodia and quickly f ell in love with a young Ca mbodian prostitute, Sreykeo.  \n     Oops, does it happen in real life? A love story between a good student with a prostitute girl? Well, the answer is YES. This movie is based on a true story from an article titled “Until death takes her away from me”, that published by German magazine called “Neon”. It turned into a second article, a book \"Perfect Paperback\" or \" Wohin du auch gehst\" in Deutsch.  \n    “Tourist from a western, industrialized country falls in love with an Asian prostitute”. A common occurence which happens a thousand times every day, again and again. So what makes Sreykeo, Benjamin and their story so different? \n     But first, let me introduce the casts to you guys: \nDirected by:  Detlev Buck  Produced by: Claus Boje Distributed by: Delphi Filmverleih Release date: 13 August 2009 Running time: 106 minutes Languages: Deutsch, Tinglish (Thai + American English) \nWat ch On line/Download:  lk21/SameSameButDifferent \nCast: \nDavid Kross as Ben jamin Prüfer \nApinya Sakuljaroensuk as Sreykeo Jens Harzer as Henry Stefan Konarske as Ed  Anne Müller as Claudia  Wanda Badwal as Lilli \n\n      After his graduation, Benjamin decided to go backpacking through South-East Asia, in his own words “to make my life and myself a bit more interesting”. He ended up in Phnom Penh, the capital city of Cambodia and meets Sreykeo at a 'Heart of Darkness' nightclub. Sreykeo means \"girl made of glass\" and the name suits her, because she really does seem fragile.      When the first time Sreykeo introduced herself to Benjamin as “Rose”, he asked her for her real name. “Sreykeo”. The “Heart of Darkness” was full of bar girls but Benjamin didn’t think about that. He simply thought that she was so different to the girls he’d met up until then. It wasn’t until he woke up next to her in the morning that he realized that she's too, was a prostitute when she told him that she was thinking about whether she should charge him or not. \n\n     Benjamin didn’t think that this fateful night in the middle of South-East Asia would lead to anything until Sreykeo showed up again at his lodge the next day. After all, this clash of cultures shouldn’t allow a happy ending and like Benjamin’s brother would later put it “She can’t afford love”.  \n\n\n      Phnom Penh isn’t the Paris of the East, there’s nothing romantic about it. The German boy and the Cambodian prostitute jumped onto the back of a Tuk-tuk and went to meet Sreykeo’s family. Sreykeo’s family lives in an area of the city so weathered and impoverished that the Khmer simply call it “La Building”. Benjamin ended up living at “La Building” for a month, sleeping in the one room with the whole of Sreykeo’s family and also sharing a single toothbrush with the whole family. \n     When Ben was back to German, he still got in touch with Sreykeo trough email, text, and skype. Then, Sreykeo is diagnosed with HIV, and the focus of the film becomes Benjamins struggle and desire to support her and her family, and to get her proper medicine.   \n     At the time, Benjamin was working as an intern and part-time editor at the German Financial Times, sending several hundred dollars to Sreykeo through Western Union every month because she still had to support her whole family (including her brother about to become a Buddhist monk and her gambling addicted mother) and he didn’t want her to work as a bar girl anymore (Ben is so sweet, but uh... it's lil bit annoying of Sreykeo. She always asked money and money to Ben. Why didn't she just work by her self? Why didn't she look for a better job? So that, Ben didn't have to bear all cost!) . \n    Benjamin once asked Sreykeo, “Why did you talk to me at The Heart of Darkness?”, “Because you just drink water when I see you. You did not dance with the bargirls. I don’t like men who go to the bargirls,” that was Sreykeo's answer. But that wasn’t the whole truth. She never told him but she told his brother when he came to Cambodia. The day before Benjamin and Sreykeo met, she went to a pond at the Royal Palace in Phnom Penh and released two turtles. A Buddhist ritual. A male turtle and a female turtle. On their shell she had written a prayer in Khmer, asking for a man who would always love her and care for her. She then colored her bleached hair back to black, got her nails done and went into the “Heart of Darkness”. \n    \"Same Same but Different\" is a film about love, the subject of a thousand films, but it is different, haha. The filmmakers let us see a bit of what everyday life in Cambodia is like. Overcrowded, poor, dirty, but somehow still charming and full of soul. It provides a social commentary on the way Westerners exploit the locals in third world countries. This is in contrast to the scenes in Hamburg, where life seems very cold, serious, and loveless. \n     It was just refreshing how this movie was different from all the rest. It wasn’t a usual romance movie. For one, it was set in Phnom Pehn and Germany which very accurately showed the contrast of the third-world and first-world countries. Second, it showed the reality of foreigners finding relations with locals, specifically prostitutes.  \n    Here in Indonesia, I (sometimes) see these prostitutes hanging around foreigners. I’m even pretty sure that a lot of the foreigner-local relationships in the country started out the same way Ben and Sreykeo’s relationship had. Third, it depicts the existence of true unconditional love. Ben gave  everything to Sreykeo. And this is a true story!! Which means that there really are people who love like this. It gives everyone hope.   \n     I guess, Ben is lovely man. He really takes care of Sreykeo. What captured my attention the most was the first time they met. Sreykeo asked Ben how many candles he would bring with him into a dark cave. He replied that he would bring along ‘two candles’. Sreykeo interpreted for him that he had loved two girls in his entire life. At the end of the movie, Sreykeo asked him again, and he said “one candle”. “What if the candle were blown off?” Srey Keo asked. “Then, I’d carry you forever,” he said. Oh my God, this is too sweet,Ben, haha. \n\n    Oh I almost forget, despite all the difficulties, today Benjamin and Sreykeo are married and live in Phnom Penh with their two children. Benjamin also went to the pond at the Royal Palace. The turtles are still in there.  The real Sreykeo & Ben with their kids. \n    Anyway, it was a great movie! I suggest people watch it. Not so many people get to appreciate movies like these, being bombarded by American films. You won’t regret the 100 minutes of your life watching this film. "}]