[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/j.JM_ertN3Lr0eY5j81x9eDb6LD6iKMFVNr7BPFE7loPlmCXk4GD.nYMl631wKZYbThSjvFIDnJMengH.E7bAoxBpv7fCaCvUZGP0hxmHWA-", "title": "Trump faces showdown with G7 over climate stance", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://econews.com.au/category/news-to-sustain-our-world/feed", "spam_score": 0.0, "section_title": "News – Eco News", "site": "econews.com.au", "site_full": "econews.com.au", "performance_score": 0, "uuid": "22db4147cba8b5d303ca2725f8e7975d497293a5", "published": "2017-04-14T07:06:00.000+03:00", "site_categories": [], "country": "AU", "title_full": "Trump faces showdown with G7 over climate stance", "participants_count": 1, "main_image": "http://econews.com.au/wp-content/uploads/2016/11/Green-Eiffel-Tower-France-Paris-Agreement.jpg"}, "url": "http://omgili.com/ri/j.JM_ertN3Lr0eY5j81x9eDb6LD6iKMFVNr7BPFE7loPlmCXk4GD.nYMl631wKZYbThSjvFIDnJMengH.E7bAoxBpv7fCaCvUZGP0hxmHWA-", "title": "Trump faces showdown with G7 over climate stance", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:23:54.000+03:00", "language": "english", "entities": {"locations": [{"name": "united states", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "sicily", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "taormina", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "perry", "sentiment": "none"}, {"name": "meyer", "sentiment": "none"}, {"name": "alden meyer", "sentiment": "none"}, {"name": "john kirton", "sentiment": "none"}, {"name": "todd stern", "sentiment": "none"}, {"name": "rick perry", "sentiment": "none"}, {"name": "tiziana d’angelo", "sentiment": "none"}], "organizations": [{"name": "group of seven", "sentiment": "none"}, {"name": "g8 research group", "sentiment": "none"}, {"name": "paris agreement", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "us energy", "sentiment": "none"}, {"name": "university of toronto", "sentiment": "none"}, {"name": "the trump", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "22db4147cba8b5d303ca2725f8e7975d497293a5", "published": "2017-04-14T07:06:00.000+03:00", "author": "David Twomey", "text": "0 SHARE \nA rift between United States President Donald Trump and the rest of the Group of Seven (G7) leading economies over his hard-line position on climate change looks set to widen next month when leaders meet in Italy. \nEnergy ministers from Canada, France, Germany and others members of the G7 took the unusual step of declining to issue a joint statement after a meeting in Rome this week, saying the US was not ready to endorse language upholding the United Nations sponsored Paris Agreement. \nBloomberg newsagency reports the move gives President Trump’s administration time to determine whether to follow through on a campaign pledge to abandon the landmark climate agreement, brokered in 2015 by more than 190 nations. \nIt also indicates that other nations are unwilling to drop climate change from the G7 agenda, setting up a potential showdown when President Trump attends his first summit with other world leaders in Taormina, Sicily, on May 26-27. \n“The leaders’ summit is the deadline,” said Dr Alden Meyer, who has followed international climate talks for two decades as director of policy at the Union of Concerned Scientists. \n“If President Trump walks into that meeting saying he still doesn’t have a position, I think that would be the end of the line for the other countries.” \nThe potential confrontation comes as world leaders have been largely silent, as President Trump, who has called global warming a hoax, has issued sweeping orders to gut environmental regulations. \nThe president plans to determine next month whether to pull the US out of the Paris Agreement. \nBloomberg reports instead of publicly confronting President Trump, Germany and others have tried to use international pressure at G7 and G20 meetings to convince his cabinet members to work with the rest of the world to fight climate change. \nG7 nations hold significant leverage as Canada, France, Germany, Italy, Japan and the United Kingdom are among America’s most important economic and military allies. \n“They are not going to let this be brushed under the rug,” Todd Stern, who helped shape the Paris accord as US special envoy for climate change under President Barack Obama, said in an interview. \n“Climate change is a consequential issue, and Paris is the international expression of it. They are not going to paper that over.” \nAs host of this year’s G7 meetings, Italy pushed to include language supporting the Paris accord in a joint statement drafted for this week’s meeting of energy ministers. \nPast communiques have included similar language, but US Energy Secretary Rick Perry objected, saying President Trump had not made up his mind, according to a G7 negotiator. \nRather than rewriting the statement to appease the US, the other nations scrapped it altogether. \nIn its place, Italy issued a statement of its own. \nIt singled out the US, saying America was ”reviewing many of its policies and reserves its position on this issue.” \nAll other G7 members remain committed to the Paris accord, according to the statement. \n“On Paris, it was impossible to sign a joint declaration because United States were not ready to take a clear position,” said Tiziana D’Angelo, a spokeswoman for Italy’s minister of economic development. \nIn a statement issued after the meeting, Mr Perry said it was important for nations to continue developing fossil fuel generation, including coal, as well as clean energy. \nHe made no direct mention of the Paris Agreement. \nWalking away from the Paris Agreement could isolate the US on multiple fronts, John Kirton, director of the University of Toronto’s G8 Research Group, said in an interview. \nAdding and removing passages from communiques are part and parcel of international diplomacy. \nBloomberg reports it would be unprecedented, however, if the US ultimately refuses to sign onto a joint statement backed by all other members. \n“That would be a pretty striking development,” Dr Meyer said. \n“The Trump administration is aware that it would put them under a pretty intense spotlight, isolated from the rest of the G7.” TAGS"}]