[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/.wHSUbtEfZRp_CnWDzTUD7SLFpQcPqV86rO40rReZpv8lz.29fW.44D7T4Y4DP8XJXCvjls3NBcwZc.fqI2XQREkO6gAsa2pLu7qYmMLEtYcqgVZ8bPIng6i8IjwFbHE", "title": "Bengal Tiger at the Baghdad Zoo theatre review (Old Fitz, Sydney)", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://dailyreview.crikey.com.au/feed", "spam_score": 0.0, "section_title": "Daily Review: Film, stage and music reviews, interviews and more.", "site": "dailyreview.com.au", "site_full": "dailyreview.com.au", "performance_score": 0, "uuid": "d1e6d492022b8f9553788f767dffe4ebe0020794", "published": "2017-04-17T10:49:00.000+03:00", "site_categories": [], "country": "AU", "title_full": "Bengal Tiger at the Baghdad Zoo theatre review (Old Fitz, Sydney)", "participants_count": 1, "main_image": ""}, "url": "http://omgili.com/ri/.wHSUbtEfZRp_CnWDzTUD7SLFpQcPqV86rO40rReZpv8lz.29fW.44D7T4Y4DP8XJXCvjls3NBcwZc.fqI2XQREkO6gAsa2pLu7qYmMLEtYcqgVZ8bPIng6i8IjwFbHE", "title": "Bengal Tiger at the Baghdad Zoo theatre review (Old Fitz, Sydney)", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:24:19.000+03:00", "language": "english", "entities": {"locations": [{"name": "old fitz", "sentiment": "none"}, {"name": "baghdad", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "broadway", "sentiment": "none"}, {"name": "old fitz theatre", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "persons": [{"name": "saddam hussein", "sentiment": "none"}, {"name": "stephen multari", "sentiment": "none"}, {"name": "benjamin brockman", "sentiment": "none"}, {"name": "nate edmondson", "sentiment": "none"}, {"name": "tyler de nawi", "sentiment": "none"}, {"name": "robin williams", "sentiment": "none"}, {"name": "megan smart", "sentiment": "none"}, {"name": "uday", "sentiment": "none"}, {"name": "andrew lindqvist", "sentiment": "none"}, {"name": "musa", "sentiment": "none"}, {"name": "claudia barrie", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "rajiv joseph", "sentiment": "none"}, {"name": "joseph", "sentiment": "none"}, {"name": "aanisa vylet", "sentiment": "none"}, {"name": "barrie", "sentiment": "none"}, {"name": "kate williams", "sentiment": "none"}, {"name": "maggie dence", "sentiment": "none"}, {"name": "bengal tiger", "sentiment": "none"}, {"name": "isabel hudson", "sentiment": "none"}, {"name": "kev", "sentiment": "none"}, {"name": "josh anderson", "sentiment": "none"}], "organizations": [{"name": "bengal tiger", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "d1e6d492022b8f9553788f767dffe4ebe0020794", "published": "2017-04-17T10:49:00.000+03:00", "author": "Ben Neutze", "text": "Home » Reviews » Bengal Tiger at the Baghdad Zoo theatre review (Old Fitz, Sydney) Bengal Tiger at the Baghdad Zoo theatre review (Old Fitz, Sydney) Share on Facebook \nRajiv Joseph’s 2009 play, Bengal Tiger at the Baghdad Zoo is a brilliantly executed exploration of cruelty, violence and redemption, set in Baghdad in the months after the 2003 US invasion. The play mixes moments of tough, brutal realism with surreal passages to stunning effect, and was a finalist for the Pulitzer Prize for Drama. \nIt’s not the most commercial of fare and, as engrossing and darkly funny as it is, it’s hardly the cheeriest of subjects. So it’s difficult to imagine it would’ve received the attention it’s had if its 2011 Broadway production didn’t star comedy legend Robin Williams in the title role: the tiger. \nDirector Claudia Barrie’s production at the Old Fitz Theatre stars stage veteran Maggie Dence in the role, an inquisitive, gruff, and endlessly hungry creature wandering the streets of Baghdad, bearing witness to the ongoing destruction and carnage, and searching for some kind of meaning in it all. \nJoseph focuses in on the conflicts between two soldiers — Tom (Stephen Multari) and Kev (Josh Anderson) — and their Iraqi translator Musa (Andrew Lindqvist). \nMusa worked for several years as a gardener for Saddam Hussein’s violent and tyrannical eldest son Uday (Tyler De Nawi). But Musa’s allegiances shifted after Uday was killed in a raid by US forces. Tom was involved in that raid, and stole a solid gold gun and toilet seat as his trophy. \n“Most of the action ends up taking place somewhere between heaven and earth — a place where there’s time and room to breathe and reflect on what’s meant by the violence unleashed upon this world.” \nThe action of the play starts not long after that raid. Tom and Kev have been charged with guarding Baghdad Zoo and the few remaining animals still contained within. It’s a rather low profile job, but proves to be more dangerous than either expected. \nIn the opening scene, Dence’s Tiger doesn’t seem entirely at ease behind bars, but her performance galvanises and takes hold with great impact once she’s liberated. And while she’s costumed in simple, tattered civilian human clothes, she does add the occasional feline mannerism into the mix. It’s a prodigious vocal performance and the monologue which opens the second act is deeply moving. \nThe acting is excellent across the board, with Stephen Multari and Josh Anderson as very believable US soldiers, trying to hold their lives and psyches together in a world which they can’t possibly understand. Andrew Lindqvist’s Musa is a victim of the violence unleashed by the US soldiers, but reveals a greater strength than might be expected. \nTyler De Nawi is appropriately terrifying as Uday, while Megan Smart is outstanding as Musa’s sister, and Aanisa Vylet impresses in dual roles. \nBarrie’s production is finely emotionally wrought, and she makes plenty of confident and bold directorial choices — from the very welcome casting of a woman in the role of the tiger (the play could otherwise turn out a bit relentlessly blokey), to the use of the ensemble, echoing and reflecting back the movements and emotional turns of the characters downstage. Some of those choices feel a little overworked: having actors play the magnificent topiary animals crafted by Musa is a strong visual statement, but they’re a little overused. \nBut that never takes you out of the world of the play, which is conjured up in magical ways by Isabel Hudson’s simple cyclone wire set, Benjamin Brockman’s colourful, otherworldly lighting and Nate Edmondson’s atmospheric and surprisingly understated sound design. \nMost of the action ends up taking place somewhere between heaven and earth — a place where there’s time and room to breathe and reflect on what’s meant by the violence unleashed upon this world. The questions Joseph is able to ask in that place remain entirely relevant as the US looks to again flex its military muscles. Unfortunately it doesn’t seem like many lessons have been learnt. Bengal Tiger at the Baghdad Zoo is at the Old Fitz Theatre, Sydney until May 6. Featured image by Kate Williams"}]