[{"uuid": "ae0ab490d874eee6ab2028924b6785dd2a026efe", "url": "http://omgili.com/ri/jHIAmI4hxg_yPv3acaEv0Ll2BKv4Kfo98Z4wHIP5HzTIa592nj2WMasU5i9gD38RGDZn4i3O3g_4SFF2QIS2p3tEQL_Zfs9ZholShPWlxIf9YI9KkhGctXTaFBq9gX4r5LWOnoSAvy4-", "title": "Wo steckt der Flugzeugträger «Carl Vinson»?", "author": "", "rating": null, "published": "2017-04-18T23:24:31.000+03:00", "highlightText": "", "entities": {"organizations": [], "locations": [], "persons": []}, "highlightTitle": "", "thread": {"uuid": "ae0ab490d874eee6ab2028924b6785dd2a026efe", "url": "http://omgili.com/ri/jHIAmI4hxg_yPv3acaEv0Ll2BKv4Kfo98Z4wHIP5HzTIa592nj2WMasU5i9gD38RGDZn4i3O3g_4SFF2QIS2p3tEQL_Zfs9ZholShPWlxIf9YI9KkhGctXTaFBq9gX4r5LWOnoSAvy4-", "site_full": "www.bernerzeitung.ch", "title": "Wo steckt der Flugzeugträger «Carl Vinson»?", "site_section": "http://www.bernerzeitung.ch/rss.html", "domain_rank": 69528, "published": "2017-04-18T23:24:31.000+03:00", "title_full": "Wo steckt der Flugzeugträger «Carl Vinson»?", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "Berner Zeitung Front", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "CH", "performance_score": 0, "main_image": "http://files.newsnetz.ch/story/2/6/1/26152096/teaserbreitgross.jpg", "site": "bernerzeitung.ch"}, "external_links": [], "language": "german", "text": "«Ich hoffe, Kim Jong-un will auch Frieden» US-Präsident Donald Trump hat eine Lösung im Konflikt mit Nordkorea auch am Willen der nordkoreanischen Führung festgemacht. 04:14 \nDieser Artikel wird automatisch aktualisiert. Restriktionen bei Arbeitsvisa \nUS-Präsident Donald Trump hat ein Dekret unterzeichnet, das die Ausstellung von Arbeitsvisa für hoch qualifizierte Ausländer erschweren soll. Trump unterzeichnete die Anordnung am Dienstag.Arbeitsplätze müssten «zuerst amerikanischen Arbeitern» angeboten werden , sagte Trump bei einem Besuch in Kenosha im Bundesstaat Wisconsin. «Zusammen werden wir alles in unserer Macht Stehende tun, um sicherzustellen, dass mehr Produkte mit diesen wunderbaren Worten versehen werden: Made in the USA.»Allerdings handelt es sich bei seinem Dekret eher um einen Handlungsaufruf an mehrere Ministerien, darunter das Arbeits- und das Justizministerium, als um konkrete Änderungen. Trump stellt damit die Vergabepraxis für die stark nachgefragten Einreisevisa der Klasse H-1B auf den Prüfstand. Aus seiner Sicht gab es dabei in der Vergangenheit «Betrug und Missbrauch». Die Vergabekriterien sollen nun strenger eingehalten werden. Frieden hängt auch von Kim ab \nUS-Präsident Donald Trump hat eine Lösung im Konflikt mit Nordkorea auch am Willen der nordkoreanischen Führung nach Frieden festgemacht. Er hoffe, dass der Machthaber Nordkoreas, Kim Jong-un, Frieden wolle, sagte Trump in einem Interview mit dem US-Sender TMJ4-TV. Das sei die «Endbestimmung». Trump äusserte zudem Kritik an der Vorgängerregierung, die nichts gegen die Beschaffung von Nuklearwaffen vonseiten Nordkoreas unternommen habe. Nun sei er aber in der Position, in der er etwas dagegen tun müsse. (Video: Youtube/Today's TMJ4) Ivankas Business \nAllein in diesem Monat sicherte sich Ivanka Trumps Konzern vorläufig drei potenziell wertvolle Markenrechte für China, wie die Nachrichtenagentur AP heute erfuhr. Mit diesen bekäme Trump Monopolrechte für den Verkauf von Schmuck, Taschen und Wellness-Dienstleistungen in der weltweit zweitgrössten Volkswirtschaft.Nach Recherchen der AP bekam die Firma an dem Tag den Zuschlag, als Ivanka Trump am 6. April abends mit dem chinesischen Präsidenten Xi Jinping auf Donald Trumps Anwesen Mar-a-Lago in Florida zusammensass. Das Unternehmen Ivanka Trump Marks LLC erklärte, die Verkäufe seien derzeit auf Rekordlevel, Importe und Vertrieb stünden ebenfalls hoch und seien auf Wachstumskurs. Seit der US-Präsidentschaftswahl hat die Firma weltweit zusätzlich mindestens neun Anträge für neue Handelsmarken gestellt, und zwar auf den Philippinen, in Puerto Rico und Kanada. Donald Trump auf Tour \nLaut einer Analyse der « Washington Post » hat Donald Trump bisher jede fünfte Minute oder rund zwanzig Prozent seiner Präsidentschaft auf seiner privaten Residenz in Palm Beach verbracht – Hin- und Rückreise nicht mit eingerechnet. Darunter Trips, die Donald Trump klar in seiner Rolle als Amtsträger absolvierte, etwa der Empfang des japanischen Premiers Shinzo Abe. Teils war er wiederum als Privatmann unterwegs, etwa auf einem seiner Golfplätze in der Region.Schwerer zu beantworten finden US-Medien allerdings die Frage, inwieweit Trumps geschäftliche und private Termine in Florida mitunter ineinander übergehen. Sieben von dreizehn Wochenenden hat er nach Berechnung der Journalisten der Hauptstadt Washington den Rücken gekehrt, und nicht immer gibt der offizielle Dienstkalender Auskunft über die Zeitgestaltung des US-Präsidenten. «Happy Easter!», wünscht Melania Trump vom Mar-a-Lago aus. (Bild: First Lady of the United States / Instagram) Einer von vielen und von der Öffentlichkeit weitgehend abgeschirmten Events im sonnenverwöhnten Florida: das traditionelle Ostereier-Rollen im Garten des Mar-a-Lago am vergangenen Sonntag. Gästeliste: unbekannt. Erwähnenswert findet ein draussen wartender Journalist der Zeitung die anlässlich des illustren Events vor dem Anwesen parkierten Luxuskarossen aller bekannten Nobelmarken. Später gewährt eine Mitarbeiterin der First Lady auf Twitter einen exklusiven Einblick, zu sehen sind allerdings nur die sorgfältig auf dem Edelrasen drapierten Ostereier: Happy #Easter to all of you!! ???? pic.twitter.com/VHS2kRFBDz — Stephanie (@OMGrisham) 16. April 2017 Am Sonntagnachmittag ging es dann für den nahezu vollzählig angereisten Trump-Clan zurück nach Washington. Viel unterwegs: Donald Trump und Ehefrau Melania nach der Landung auf der Joint Base Andrews nahe Washington D.C. (Bild: AP Photo/Alex Brandon) Spektakel an Ostern \nErstmals hat die Familie Trump das traditionelle Ostereier-Rollen im Garten des Weissen Hauses veranstaltet. US-Präsident Donald Trump empfing am Montag zusammen mit seiner Ehefrau Melania und dem elfjährigen Sohn Barron Tausende Kinder und deren Eltern zu dem seit Ende des 19. Jahrhundert veranstalteten Fest. «Das ist das 139. Ostereier-Rollen», rief Donald Trump vom Balkon des Weissen Hauses hinab. «Das 139.» Bevor er den Besuchern «Frohe Ostern» wünschte, beschwor Trump die Stärke der Nation: «Wir werden eine Nation sein, die stärker denn je ist, und wir sind auf dem guten Weg», sagte der US-Präsident an der Seite eines riesigen Plüsch-Osterhasen. Bei trübem Wetter mischte sich die Präsidentenfamilie kurz unter die Gäste auf dem Südrasen, um an verschiedenen Aktivitäten teilzunehmen. Unter anderem las Melania Trump ein Kinderbuch vor.Das Eier-Rollen im Garten des Weissen Hauses wurde 1878 vom damaligen US-Präsidenten Rutherford B. Hayes begonnen. Dabei liefern sich die Kinder ein Wettrennen, während sie mithilfe von Löffeln bunte Eier über den Rasen rollen. (afp) Trump wehrt sich \nNachdem Tausende Menschen am Osterwochenende in mehreren US-Städten gegen die Weigerung von Präsident Donald Trump protestiert hatten, seine Steuererklärungen zu veröffentlichen, reagierte nun der US-Präsident. Auf Twitter liess er wissen: «Jemand sollte untersuchen, wer für diese kleinen organisierten Kundgebungen gestern gezahlt hat». Der Wahlkampf sei längst vorbei, und er habe gewonnen. «Nun werden die Steuererklärungen wieder zum Thema gemacht?» Someone should look into who paid for the small organized rallies yesterday. The election is over! — Donald J. Trump (@realDonaldTrump) 16. April 2017 Entgegen der üblichen Praxis hatte Trump sich als Präsidentschaftskandidat geweigert, seine Steuererklärungen zu veröffentlichen. Er argumentierte, dass er sie wegen einer seit Jahren laufenden Steuerprüfung nicht veröffentlichen könne. Seine Kritiker werten dies als Ausrede und mutmassen, der Immobilienmilliardär habe etwas zu verheimlichen. (sda) Trumps Steuererklärung Der bekannte Rassist Nathan Damigo schlug eine Trump-Gegnerin nieder. Video: Tamedia/AFP/Storyful Tausende Amerikaner haben am Samstag in Protestmärschen den US-Präsidenten Donald Trump aufgefordert, endlich seine Steuerunterlagen zu veröffentlichen. Die Demonstrationen fanden in Dutzenden Städten statt – unter anderem im kalifornischen Berkeley. Rund 200 Protestierende hätten sich in einem Park versammelt, als mehrere Menschen in Kämpfen aneinandergeraten seien, teilte die Polizei mit. Veröffentlichte Fotos zeigten mindestens zwei Männer mit blutigen Gesichtern. Nach dem Aufeinandertreffen im Park blockierten Demonstranten laut Polizei mehrere Strassen im Stadtzentrum von Berkeley.Nach einem Bericht des «San Francisco Chronicle» beschimpften sich die Demonstranten. Einer soll beispielsweise an jene, die Trump nicht unterstützen, gerufen haben: «Geht zurück in die 1960er Jahre.» Als Antwort darauf soll ertönt sein, Trump-Anhänger sollten zurück ins 14. Jahrhundert gehen. Trump-Gegner verhaftet \nNach tagelanger Fahndung ist in den USA ein laut Polizei «hochgefährlicher» Gegner von Präsident Donald Trump gefasst worden. Wie die Polizei am Freitag mitteilte, spürten Beamte den 32-jährigen Joseph Jakubowski am Donnerstag auf einer Farm im Mittelweststaat Wisconsin auf, wo er wild zeltete. Er hatte den Angaben zufolge am Dienstag vergangener Woche einen Waffenhändler in Janesville überfallen und dabei 16 «Luxus-Feuerwaffen» erbeutet. Anschliessend habe er ein Auto in Brand gesetzt. Auch soll er ein Anti-Trump-Manifest ans Weisse Haus geschickt haben. Er liess sich nach Angaben der örtlichen Behörden widerstandslos festnehmen.Die Polizei in Wisconsin hatte mit einem Grossaufgebot von etwa 150 Beamten nach Jakubowski gesucht. Ein Arbeitskollege Jakubowskis sagte nach Angaben der Polizei aus, dass dieser angekündigt habe, Waffen stehlen zu wollen, um damit ein Attentat zu verüben. Zudem soll er sich eine schusssichere Weste und einen Helm gekauft haben.Der Verdächtige schickte nach den Polizei-Angaben ausserdem ein 161 Seiten langes Pamphlet per E-Mail an Trump, in dem er dessen Politik verurteilte und die soziale Ungerechtigkeit in den USA anprangerte. Es handele sich um «eine lange Liste von Ungerechtigkeiten, von denen er glaubt, dass die Regierung und Gesellschaft und die Oberschicht sie dem Rest der Bürger auferlegt haben», sagte der Sheriff des Verwaltungsbezirks Rock County, Robert Spoden. Weisses Haus \nUS-Präsident Donald Trump macht das Weisse Haus weniger transparent. Die unter Vorgänger Barack Obama begonnene Veröffentlichung des Besucherverkehrs im Weissen Haus wird nicht fortgeführt, wie US-Medien am Freitag berichteten. Zur Begründung führte die Regierung an, dass die bisherige regelmässige Publikation dieser Listen «schwere nationale Sicherheitsrisiken» mit sich bringe und gegen den Schutz der Privatsphäre verstosse.Während der Amtszeit Obamas liess sich mit Hilfe eines Suchformulars einsehen, welche Abgeordneten, Senatoren, Lobbyisten, Botschafter und sonstige Besucher des Präsidenten oder seiner Mitarbeiter im Weissen Haus ein und aus gingen. Nur in wenigen Ausnahmefällen – etwa bei rein privaten Besuchen bei der Präsidentenfamilie oder aus Gründen der nationalen Sicherheit – wurden die Namen nicht ins Netz gestellt. (afp) Texas bekommt Abschiebe-Lager \nDer US-Staat Texas soll eines der ersten neuen für Abschiebungen illegaler Einwanderer vorgesehene Lager bekommen. Ein privates Gefängnis-Unternehmen gab am Donnerstag den Abschluss eines Bauvertrags für das Lager mit etwa 1000 Betten bekannt. Die Eröffnung des Lagers nördlich von Houston, in Conroe, ist für Dezember 2018 vorgesehen. Der Bauauftrag sei rund 110 Millionen Dollar wert, wie das Unternehmen mitteilte.Der Bau des Lagers ist eine Massnahme der verschärften Politik des US-Präsidenten Donald Trump gegen illegale Einwanderung. In den USA sind mehr als 41'000 Einwanderer festgesetzt – damit hat das Land bereits eine rekordverdächtige Zahl an Haftplätzen. Nach Angaben der nun beauftragten Gefängnis-Baufirma vom Februar dieses Jahres stünden landesweit etwa 3000 Betten leer. Die Firma plant jedoch das neue Lager, anstatt die leerstehenden Betten zu füllen. Mängel in Trumps Privatclub \nGesundheitsgefährdende Meeresfrüchte, unzureichend gekühltes Fleisch, rostige Regale, Köche ohne Haarnetz: Diese und weitere Verstösse entdeckten Gesundheitsinspektoren in Florida Ende Januar bei einer Kontrolle von US-Präsident Donald Trumps Mar-a-Lago-Privatclub. Das Hauptrestaurant des Luxusresorts und ein Strandclub durften dennoch geöffnet bleiben. Das Personal bemühte sich, besonders gravierende Mängel umgehend zu beheben.Insgesamt wurden 15 Verstösse festgestellt. Unter den dringlichsten Problemen, die als «potenziell gefährlich» beschrieben wurden, waren schadhafte Kühlschränke, in denen Fleisch bei deutlich höheren Temperaturen als den geforderten fünf Grad Celsius gelagert wurde. Ausserdem wurde Räucherlachs aufgetischt, ohne dass er zuvor einer «geeigneten Parasitenzerstörung» unterzogen wurde.Der Kontrolle seien keine Kundenbeschwerden oder Erkrankungen vorausgegangen, und die Mängel seien umgehend behoben worden, sagte ein Sprecher der zuständigen Behörde. Die Inspektoren würden Mar-a-Lago bis Ende des Jahres einen weiteren unangekündigten Besuch abstatten, sagte Sprecher Stephen Lawson.Unterlagen zufolge wurden dort in den vergangenen drei Jahren insgesamt 78 Beanstandungen verzeichnet. So hantierten etwa Köche mit Nahrungsmitteln, ohne sich zuvor die Hände zu waschen. Ferner wurden schmutzige Schneidbretter und eine «schwarz/grüne schimmelartige Substanz» auf der Eismaschine moniert.Trump hält sich häufig in dem von der Trump Organization betriebenen Privatclub auf, den er als sein «Weisses Haus für den Winter» bezeichnet. Wenige Tage nach der Kontrolle empfing Trump in Mar-a-Lago den japanischen Ministerpräsidenten Shinzo Abe. Trump mag Yellen \nUS-Präsident Donald Trump hat in einer überraschenden Kehrtwende seine Wertschätzung für Notenbankchefin Janet Yellen bekundet. «Ich mag sie, ich respektiere sie», sagte er in einem Interview mit dem «Wall Street Journal».Trump hatte die Vorsitzende der Federal Reserve während des Wahlkampfes hart für ihre Zinspolitik kritisiert. Nun liess er sogar die Möglichkeit offen, dass er Yellen über ihre im Februar kommenden Jahres ablaufende Amtszeit hinaus auf ihrem Posten behalten könnte. Es sei noch «sehr früh», um sich mit dieser Frage zu befassen, sagte der US-Präsident auf eine entsprechende Frage.Während des Wahlkampfs hatte Trump die Fed-Chefin bezichtigt, die Zinsen künstlich niedrig zu halten, um die Wirtschaftsbilanz des damaligen Präsidenten Barack Obama aufzumöbeln. Er hielt ihr sogar vor, sie solle sich dafür «schämen». Jetzt sagte Trump in dem Interview, er möge «eine Politik der niedrigen Zinsen, das muss ich Ihnen ehrlich sagen». Treffen mit Stoltenberg \nUS-Präsident Donald Trump hat mit Blick auf die Nato eine Kehrtwende vollzogen. In einer Pressekonferenz mit Nato-Generalsekretär Jens Stoltenberg im Weissen Haus sagte Trump am Mittwoch, das Bündnis sei «nicht länger obsolet». Während seines Wahlkampfs hatte Trump erklärt, die Organisation mit 28 Mitgliedstaaten sei ineffektiv und überholt.Seit seinem Amtsantritt hat er zwar Unterstützung für die Nato geäussert, aber zugleich immer wieder betont, dass die europäischen Partner ihre Verteidigungsausgaben wie 2014 vereinbart auf zwei Prozent des Bruttoinlandsprodukts erhöhen müssten.Trump hat zudem Russland verdächtigt, von dem mutmasslichen Chemiewaffenangriff in Syrien vorab gewusst zu haben. «Ich wünschte, ich könnte sagen, dass sie es nicht wussten, aber sie konnten es sicher wissen», sagte Trump am Mittwoch nach einem Treffen mit Nato-Generalsekretär Jens Stoltenberg in Washington. «Sie waren da unten.» Interview mit WSJ \nUS-Präsident Donald Trump wirft China nicht mehr vor, seine Währung zu manipulieren. Die Chinesen seien «keine Währungsmanipulatoren», sagte Trump in einem Interview mit dem «Wall Street Journal». Während des Präsidentschaftswahlkampfs hatte der Immobilienmilliardär Peking fortwährend beschuldigt, seine Währung zu manipulieren, um seine Exporte billiger zu machen und der verarbeitenden Industrie in den USA zu schaden.Nun sagte Trump, dies habe Peking seit Monaten nicht mehr getan. Der US-Präsident hatte sich vor wenigen Tagen mit seinem chinesischen Amtskollegen Xi Jinping in Florida getroffen.Dabei hätten sie eine gute Beziehung aufgebaut, sagte Trump am Mittwoch nach einem Treffen mit NATO-Generalsekretär Jens Stoltenberg in Washington. «Ich denke, wir haben eine sehr gute Chemie», sagte der US-Präsident. Xi wolle den USA «mit Nordkorea helfen». Schmerzensgeld für Melania Trump \nWeil das britische Boulevardblatt «Daily Mail» Melania Trump als früheres Escort-Girl bezeichnet hat, zahlt es der First Lady der USA ein Schmerzensgeld in unbekannter Höhe. Die Anwältin der Zeitung, Catrin Evans, gab zudem am Mittwoch vor Gericht in London eine Entschuldigung ab. Die «Daily Mail» erkenne an, dass die im August während des US-Wahlkampfs geäusserten Behauptungen falsch seien und nehme diese zurück.Damit die beiden Klagen, die die Ehefrau des heutigen US-Präsidenten Donald Trump angestrengt hatte, eingestellt würden, habe die «Daily Mail» in die Zahlung von Schmerzensgeld eingewilligt, erklärte Evans weiter. Die Höhe der Zahlungen wurde nicht beziffert. Melania Trump hatte die Zeitung im Februar auf 150 Millionen Dollar verklagt.In einem Bericht der «Daily Mail» hatte es geheissen, das aus Slowenien stammende frühere Model habe in den 90er Jahren für einen Escort-Service gearbeitet. Dabei habe Melania «Dienstleistungen angeboten, die über das reine Modeln hinausgingen». Der Artikel wurde zehn Tage nach seiner Veröffentlichung zurückgezogen. Trump: Assad ist ein «Tier» \nUS-Präsident Donald Trump hat den syrischen Präsidenten Bashar al-Assad als «Tier» bezeichnet. Kurz vor dem Treffen seines Aussenministers Rex Tillerson mit dessen russischem Kollegen Sergej Lawrow sagte Trump dem Fernsehsender Fox Business, Russlands Präsident Wladimir Putin stütze eine «böse Person» in Syrien. Putins Unterstützung für Assad sei «sehr schlecht für Russland» und auch «sehr schlecht für die Menschheit», sagte Trump in dem Interview, das heute ausgestrahlt werden sollte. Ivanka Trump war «untröstlich» \nDie älteste Tochter von US-Präsident Donald Trump hat nach Angaben des Weissen Hauses die Reaktion ihres Vaters auf den mutmasslichen Chemiewaffenangriff in Syrien beeinflusst. Ivanka Trump und andere hätten sich zweifelsfrei bei der Entscheidung eingeschaltet, erklärte Sprecher Sean Spicer bei seinem täglichen Pressebriefing.Trumps Sohn Eric hatte der Zeitung «The Daily Telegraph» in einem Interview gesagt, dass sein Vater von der Reaktion seiner Schwester auf den mutmasslichen Giftgasangriff beeinflusst worden sei. Seine Schwester sei «untröstlich und empört» wegen der Attacke gewesen, sagte Eric Trump. Justizminister gegen illegale Einwanderer \nUS-Justizminister Jeff Sessions will härter gegen illegale Migranten vorgehen. Die illegale Einreise in die Vereinigten Staaten gelte künftig als Verbrechen, kündigte er am Dienstag bei einem Besuch in der Grenzstadt Nogales im Bundesstaat Arizona an.Er werde zudem Staatsanwälte im ganzen Land anweisen, Einwanderungsfälle zu ihrer Priorität zu machen und härtere Strafen zu verhängen. Ausserdem sollen mehr Richter eingestellt werden, um die zahlreichen Fälle zügig abzuarbeiten.«All jene, die illegal in dieses Land einreisen wollen, seien gewarnt: Das ist eine neue Ära. Das ist die Trump-Ära», sagte Sessions. China schickt Nordkoreas Kohle zurück \nNach den jüngsten Atomtests Nordkoreas schickt China zahlreiche Schiffe mit Kohlelieferungen aus dem Land zurück. Eine Flotte nordkoreanischer Schiffe kehrte von chinesischen Häfen zurück, wie satellitengestützte Reuters-Schifffahrtsdaten heute zeigten.Chinesischen Handelskreisen zufolge hat die Regierung Importeure angewiesen, Kohle aus Nordkorea nicht mehr anzunehmen. An diesem Tag hatte sich US-Präsident Donald Trump mit Chinas Staatschef Xi Jinping in Florida getroffen und auch über die Spannungen wegen des nordkoreanischen Raketen- und Atomwaffenprogramms gesprochen.Kohle ist eine wichtige Einnahmequelle für Nordkorea. Das abgeschottete Land steht an vierter Stelle der Lieferanten Chinas, vor allem mit Kokskohle für die Stahlerzeugung.Um seine Kohle-Versorgung zu sichern, greift China auf Importe aus den USA zurück. Trump telefoniert mit Merkel und May \nUS-Präsident Donald Trump hat in getrennten Telefonaten mit der deutschen Kanzlerin Angela Merkel und der britischen Premierministerin Theresa May über den US-Luftangriff in Syrien beraten.Dabei hätten sowohl Merkel als auch May ihre Unterstützung für das Vorgehen der USA ausgedrückt, teilte das US-Präsidialamt mit. Sie seien mit Trump über die Wichtigkeit einig, den syrischen Präsidenten Bashar al-Assad für einen mutmasslichen Giftgasangriff zur Verantwortung zu ziehen.Das Amt von May teilte mit, die Premierministerin sei sich bei dem Telefonat mit Trump einig gewesen, dass es jetzt eine Chance gebe, Russland von seiner Unterstützung für Assad abzubringen. Der Besuch von US-Aussenminister Rex Tillerson diese Woche in Moskau biete eine Gelegenheit, Fortschritte für eine nachhaltige politische Lösung des Konflikts zu erzielen. Bilanz der Zerstörung \nBei der Attacke auf eine syrische Militärbasis am vergangenen Donnerstag ist nach Angaben von US-Verteidigungsminister James Mattis ein erheblicher Teil der Luftwaffe von Machthaber Bashar al-Assad zerstört worden. «20 Prozent der operativen Flugzeuge» der syrischen Armee seien vernichtet worden, teilte Mattis am Montag in Washington mit.Die US-Streitkräfte hatten von Kriegsschiffen im östlichen Mittelmeer aus 59 Tomahawk-Präzisionsraketen auf die Basis Al-Schairat abgefeuert. US-Präsident Donald Trump begründete den Angriff mit dem mutmasslich von syrischen Regierungstruppen verübten Giftgasangriff am Dienstag vergangener Woche auf die von Rebellen kontrollierte Stadt Chan Scheichun.Dabei waren 87 Zivilisten getötet worden, darunter viele Kinder. Laut Trump sollen die Flugzeuge mit dem Nervengas von Al-Schairat gestartet sein. «Die syrische Regierung wäre schlecht beraten, nochmals chemische Waffen einzusetzen», warnte Mattis. (afp) US-Angriff auf Depot \nDie Tomahawk-Marschflugkörper seien bewusst nicht auf die Depots des syrischen Luftwaffenstützpunktes abgefeuert worden, in denen das Giftgas mutmasslich gelagert gewesen sei. Dies sagte Pentagon-Sprecher John Thomas am Montag in Washington. Es habe vermieden werden sollen, dass das Gas freigesetzt werde.US-Präsident Donald Trump hatte den Beschuss des Stützpunktes Al-Schairat mit dem mutmasslich von syrischen Regierungstruppen verübten Giftgasangriff in Chan Scheichun begründet. Laut Trump sollen die Flugzeuge mit dem Nervengas von Al-Schairat gestartet sein.Ziel des Angriffes sei es nicht gewesen, den Stützpunkt «langfristig funktionsunfähig zu machen», sagte Oberst Thomas dazu. Vielmehr sei es darum gegangen, die Basis derart zu beschädigen, dass die syrische Armee sie kurzfristig nicht mehr als Startpunkt für Chemiewaffen-Angriffe nutzen könne. (sda) Härtere Gangart \nDie USA wollen nach den Worten von Aussenminister Rex Tillerson weltweit Verbrechen gegen die Menschlichkeit ahnden. «Wir verschreiben uns wieder dem Ziel, jeden in der ganzen Welt zur Rechenschaft zu ziehen, der Verbrechen an Unschuldigen verübt», sagte Tillerson am Montag beim Besuch einer Gedenkstätte für Nazi-Verbrechen in Italien, drei Tage nach dem Luftangriff auf einen syrischen Stützpunkt als Reaktion auf einen Giftgasangriff in Rebellengebiete.Tillerson äusserte sich im Vorfeld des G7-Aussenminister-Treffens in Lucca in der Toskana, von dem sich europäische G7-Länder Aufschluss über die amerikanische Syrien-Strategie erhoffen. Die Bombardierung des Flughafens der syrischen Luftwaffe hatte Spekulationen ausgelöst, dass US-Präsident Donald Trump aussenpolitisch eine härtere Gangart einlegen könnte. Europäische Länder interpretierten Signale aus Washington als widersprüchlich: Tillerson selbst nannte noch am Wochenende den Kampf gegen die Terrormiliz Islamischer Staat (IS) als Priorität der Syrien-Politik. Dagegen erklärte die US-Botschafterin bei den Vereinten Nationen, Nikki Haley, den Sturz von Staatschef Baschar al-Assads zum obersten Ziel.Assads Soldaten kämpfen mit Unterstützung Russlands und des Irans gegen Rebellen, die in verschiedene, sich teils gegenseitig bekämpfende Gruppen aufgespalten sind. Die USA helfen vergleichsweise moderaten Rebellen im Kampf gegen die sunnitischen Fanatiker vom so genannten Islamischen Staat. Vergangenen Freitag hatten die USA die syrische Armee erstmals seit Ausbruch des Bürgerkrieges vor sechs Jahren gezielt angegriffen. Tausende demonstrieren \nTausende Demonstranten sind am Sonntagabend für die Rechte von Einwanderern in der US-Stadt Dallas auf die Strasse gegangen. Sie forderten, das Einwanderungssystem zu überarbeiten und das zu beenden, was die Organisatoren als eine «aggressive Abschiebungspolitik» kritisierten. Bei dem sogenannten Dallas Mega-Marsch wurde unter anderem auch das von US-Präsident Donald Trump veranlasste Einreiseverbot gegen Bürger aus sechs mehrheitlich muslimischen Ländern als diskriminierend verurteilt.Der Demonstrationszug endete nach rund 2,4 Kilometern vor der Stadthalle von Dallas, wo unter anderem der Menschenrechtler und Sohn von Martin Luther King, Martin Luther King III., als Redner auftrat. Eine kleine Zahl von Trump-Unterstützer hatte sich ebenfalls versammelt. Der Polizei zufolge kam es zu keinen Festnahmen. Personalwechsel im US-Sicherheitsrat \nIm Nationalen Sicherheitsrat der Vereinigten Staaten gibt es nach dem Abzug Stephen Bannons weitere Änderungen. Die unter dem früheren Sicherheitsberater Michael Flynn in das Gremium eingeführte Kathleen Troia McFarland (Bild) muss ihren Posten aufgeben, bestätigte ein US-Regierungsvertreter am Sonntag. Sie soll demnach US-Botschafterin in Singapur werden, was jedoch noch vom US-Senat bestätigt werden muss. Ausserdem stehe die Genehmigung aus Singapur noch aus.Der neue US-Sicherheitsberater, General Herbert Raymond McMaster, hat die Struktur des Sicherheitsrats grundlegend geändert. Als er die Funktion übernahm, kündigte er weniger hierarchische Strukturen als unter seinem Vorgänger Flynn an. Er holte eine Vertreterin aus dem Weissen Haus, Diana Powell, in das Gremium und machte sie zur stellvertretenden Sicherheitsberaterin im Bereich Strategie. Bannon, der Chefstratege von US-Präsident Donald Trump und frühere Chef der ultrarechten Internetplattform Breitbart, musste hingegen gehen.Die Änderungen kommen im Zuge von Vorwürfen gegen den Nationalen Sicherheitsrat (NSC), denen zufolge zwei NSC-Mitarbeiter einem republikanischen Abgeordneten Geheimdienstinformationen über eine mögliche russische Einflussnahme auf den US-Wahlkampf zugespielt haben sollen. Schwarzenegger für Kasich \nArnold Schwarzenegger möchte US-Präsident Donald Trump spätestens im Jahr 2020 nicht mehr im Amt sehen – deshalb empfiehlt der Schauspieler, dass der republikanische Gouverneur des US-Staats Ohio, John Kasich, sich für das Weisse Haus bewerben solle. Kasich sei ein «Mann von Substanz», sagte Schwarzenegger in einem Interview mit der Zeitung «Los Angeles Times». Kasich habe viel Politik-Erfahrung auf Staats- und Bundesebene. Er sei gemässigt und «habe eine Vision», so Schwarzenegger, der bereits Gouverneur von Kalifornien war. Kasich sagte dazu, er plane nicht, sich für irgendein Amt zu bewerben.Schwarzenegger unterstützte Kasich schon im Vorwahlkampf für das Präsidentenamt im vergangenen Jahr. Die beiden arbeiten jedes Jahr zusammen, wenn Schwarzeneggers Bodybuilding-Wettbewerb in Ohio stattfindet. Die Beziehung zwischen dem Schauspieler und Trump ist hingegen nicht die beste. Sie feinden sich regelmässig über Twitter an. Trump hatte Schwarzenegger für die fallenden Quoten der TV-Sendung «Celebrity Apprentice» verantwortlich gemacht, die er zuvor moderierte. Trump sieht Fortschritte in Beziehungen zu China \nUS-Präsident Donald Trump hat bei einem Treffen mit Chinas Staatschef Xi Jinping der Beziehung beider Länder einen «enormen Fortschritt» bescheinigt. Ein grosser Teil potenzieller Probleme würden verschwinden, sagte Trump nach dem ersten persönlichen Treffen der Staatschefs der beiden grössten Volkswirtschaften der Welt in Florida. Die Gespräche waren von dem US-Angriff auf einen syrische Luftwaffenstützpunkt in der Nacht zu Freitag in den Hintergrund gedrängt worden.Nach Angaben des US-Aussenministers verständigten sich die beiden Länder auf eine engere Zusammenarbeit, um Nordkorea zum Stopp seines Atomwaffenprogramms zu bewegen. Die Staatschefs hätten die Dringlichkeit der Bedrohung zur Kenntnis genommen, sagte Rex Tillerson nach dem Treffen.Trump forderte China zudem auf, für US-Arbeiter «das Spielfeld zu ebnen» und betonte die Wichtigkeit eines beidseitigen Zugangs zu den Märkten der Länder. Xi sagte, die Delegationen hätten über wichtige Themen gesprochen und eine gute Freundschaft und Zusammenarbeit aufgebaut. Es sei eine historische Verantwortung beider Länder, zusammenzuarbeiten, um Frieden und Stabilität zu garantieren, so Xi. Das Treffen dauerte zwei Tage. Streit um Nutzerdaten II \nDie US-Regierung hat den Versuch, einen Trump-Kritiker bei Twitter zu enttarnen, nach Gegenwehr des Kurznachrichtendienstes aufgegeben. Twitter teilte heute mit, das Ministerium für Innere Sicherheit habe den Antrag auf Herausgabe von Nutzerdaten zurückgezogen. Deshalb lasse auch der Kurznachrichtendienst seine Klage gegen die US-Regierung fallen.Der Streit entbrannte um den den Ende Januar eröffneten und anonym betriebenen Account @ALT_USCIS, der unter anderem zum Widerstand gegen die umstrittene Einwanderungspolitik von US-Präsident Donald Trump aufruft.Twitter wollte die Daten des oder der Nutzer nicht herausgeben und erklärte das Vorgehen der Regierung laut der am Donnerstag eingereichten Klageschrift zu einem widerrechtlichen Angriff auf die Meinungsfreiheit. Unzufriedene Mitarbeiter vermutet Beobachter gegen davon aus, dass das Twitterkonto eventuell von einem unzufriedenen Mitarbeiter der Behörde USCIS betrieben wird. Bei dem Account ist klar ausgezeichnet, dass er nicht die Meinung der US-Regierung vertritt. Streit um Nutzerdaten \nDer Kurzbotschaftendienst Twitter hat Klage gegen die US-Regierung eingereicht. Hintergrund ist laut Twitter ein Streit um die Herausgabe von Nutzerdaten von Regierungskritikern.In den am Donnerstag bei einem Bundesgericht in Kalifornien eingereichten Unterlagen heisst es, das US-Ministerium für Innere Sicherheit habe Twitter am 14. März aufgefordert, den oder die Betreiber eines Kontos offenzulegen, über das Kritik an der Politik von US-Präsident Donald Trump geübt wird.Twitter will die Daten nicht herausgeben, solange die Regierung keine Beweise für straf- oder zivilrechtliche Verstösse vorlegt. Das Unternehmen spricht von einem widerrechtlichen Angriff auf die Meinungsfreiheit.Das von der Regierung beanstandete Konto soll von Mitarbeitern einer dem Ministerium unterstellten Bundesbehörde betrieben werden, die mit der Politik der neuen Regierung nicht zufrieden sind. Trump hatte bereits mehrfach moniert, dass in Washington immer wieder Interna durchgestochen würden. Diese «Lecks» müssten geschlossen werden. Die Bürgerrechtsorganisation American Civil Liberties Union (ACLU) begrüsste das Verhalten von Twitter. Das US-Justizministerium wollte sich nicht zu dem Fall äussern. Dauerreden gegen Trumps Kandidaten \nIm US-Senat läuft ein dramatischer Showdown um die Bestätigung des von Präsident Donald Trump vorgeschlagenen Kandidaten für das Verfassungsgericht. Der republikanische Mehrheitsführer Mitch McConnell setzte am Donnerstag die sogenannte nukleare Option auf die Tagesordnung, um die finale Abstimmung über Richter Neil Gorsuch ohne die Verzögerung demokratischer Dauerreden herbeizuführen.Die Demokraten brachten zunächst genügend Stimmen – 45 – zusammen, um einen Filibuster einzuleiten. Um direkt zur endgültigen Abstimmung zu schreiten, hätten die Republikaner 60 der 100 Stimmen benötigt.Im zweiten Akt des Politdramas zog McConnell die sogenannte nukleare Option – nämlich die «Filibuster-Regel» für Verfassungsrichterbestätigungen abzuschaffen und Gorsuch mit einfacher Mehrheit zu bestätigen. Er berief sich dabei «auf den Präzedenzfall vom 21. November 2013», bei dem der damals mehrheitlich demokratisch besetzte Senat den Filibuster für Bestätigungen von Richter- und Verwaltungsposten unterer Ebenen abschafften. Nunes zieht sich von Ausschuss zurück \nDer massiv in die Kritik geratene Vorsitzende des Geheimdienstausschusses im US-Repräsentantenhaus, Devin Nunes, zieht sich vorläufig aus den Untersuchungen zu den mutmasslichen russischen Einmischungen in den US-Wahlkampf zurück. Das kündigte der republikanische Abgeordnete am Donnerstag in Washington an. Die Untersuchungen des Gremiums zu der Russland-Affäre sollten nun von seinem Parteikollegen Mike Conaway geleitet werden. Die oppositionellen Demokraten hatten Nunes mangelnde Überparteilichkeit vorgeworfen.Bei den Untersuchungen zu den Hackerangriffen auf die US-Demokraten im Wahlkampf geht es auch darum, ob es möglicherweise illegale Absprachen zwischen dem Team des heutigen Präsidenten Donald Trump und Russland gab. Nunes war in den vergangenen Wochen von den oppositionellen Demokraten für sein Vorgehen in der Untersuchung heftig kritisiert worden, weil er den Fokus zu verschieben versucht hatte. Ende März hatte Nunes mitgeteilt, Mitglieder des Trump-Teams seien «beiläufig» bei Abhöraktionen gegen ausländische Ziele belauscht worden. Er zeigte sich «beunruhigt» darüber, dass in den entsprechenden Geheimdienstberichten die Namen der Trump-Mitarbeiter nicht unkenntlich gemacht worden seien und äusserte den Verdacht, dass damit gegen Vorschriften verstossen worden sei. Ersatz von Obamacare stockt \nDie Republikaner von US-Präsident Donald Trump kommen bei ihrem neuen Anlauf zum Umbau der Gesundheitsreform Obamacare nicht so schnell voran wie erhofft. Ein Gesetzentwurf werde diese Woche doch nicht mehr zustande kommen, sagte der Abgeordnete Chris Collins.«Wir werden Morgen ohne einen Deal nach Hause fahren», sagte der Trump-Verbündete von der gemässigten sogenannten Tuesday Group im Repräsentantenhaus am Mittwoch. Der Kongress verabschiedet sich Ende der Woche in eine zweiwöchige Frühlingspause. Am Montag hatten die Republikaner einen neuen Versuch für eine Gesundheitsreform gestartet mit dem Ziel, noch möglichst diese Woche einen neuen Entwurf zur Abstimmung zu bringen.Die Verhandlungen seien letztlich an Forderungen der konservativen Seite gescheitert, sagte Collins. Das zeigt, dass die Kluft zwischen moderaten Republikanern wie der Tuesday Group und Konservativen wie dem «Freedom Caucus» offenbar noch gross ist.Wegen des Flügelstreits kam ein Plan des ranghöchsten Republikaners im Repräsentantenhaus, Paul Ryan, nicht einmal zur Abstimmung. Den Gemässigten gingen die geplanten Massnahmen zur Änderung von Obamacare zu weit, den Konservativen nicht weit genug. Millionen Amerikaner liefen aber Gefahr, ihre Krankenversicherung zu verlieren.Ryan sagte am Mittwoch, die Republikaner hätten sich keine Frist für einen neuen Versuch gesetzt. Die Gespräche seien bisher sehr produktiv verlaufen. «Wir können daran noch wochenlang arbeiten. Wir haben Zeit, um das zu lösen», betonte er.US-Präsident Trump hatte im Wahlkampf versprochen, Obamacare aufzuheben. Der Rückzug des Gesetzentwurfs Ende März war für ihn daher ein schwerer Rückschlag. Trump telefoniert mit Merkel \nUS-Präsident Donald Trump und die deutsche Kanzlerin Angela Merkel haben miteinander telefoniert. Die beiden Politiker hätten über mehrere Fragen von beiderseitigem Interesse gesprochen, teilte das Weisse Haus mit. Dabei sei es unter anderem um den Konflikt im Osten der Ukraine und die Lage in Afghanistan gegangen. Beide hätten vereinbart, sich in diesen und anderen Fragen abzustimmen und in engem Kontakt zu bleiben, hiess es in der knappen Erklärung aus Washington weiter.Ob Trump und Merkel auch über den mutmasslichen Giftgasangriff in Syrien sprachen, blieb offen. Die USA vermuten die Regierung in Damaskus hinter der Attacke auf die von Rebellen kontrollierte Kleinstadt Chan Scheichun, bei der am Dienstag nach Angaben von Aktivisten mindestens 86 Menschen starben. Trump beschuldigt Susan Rice \nIm Zuge der Abhörvorwürfe gegen Barack Obama hat US-Präsident Donald Trump nun auch dessen Nationale Sicherheitsberaterin Susan Rice beschuldigt. Er glaube, dass diese ein Verbrechen begangen habe, sagte Trump in einem Interview mit der «New York Times» am Mittwoch. Konkret geht es darum, dass sie die Namen von Trump-Verbündeten in Akten von Geheimdiensten entschwärzt hat, die mutmassliche Verbindungen nach Moskau beinhalten.Die Offenlegung von Namen in solchen Unterlagen ist erlaubt, wenn dies zum Verständnis der Informationen beiträgt. Trump-Unterstützer werfen Rice vor, dies aus politischen Gründen getan zu haben.Trump weigerte sich, weitere Details zu seinen Behauptungen zu nennen. Dies werde er «zur richtigen Zeit» tun. «Ich denke, es wird die grösste Geschichte sein», sagte er. «Es ist so eine wichtige Geschichte für unser Land und die Welt. Es ist eine der grossen Geschichten unserer Zeit.»Rice hatte die Vorwürfe bereits zuvor zurückgewiesen. Am Mittwoch sagte eine Sprecherin von Rice, Erin Pelton, sie werde den «lächerlichen Vorwurf» des Präsidenten nicht durch einen Kommentar «ehren».Unterdessen sagte ein Mitglied des Geheimdienstausschusses im US-Repräsentantenhaus dem Fernsehsender CNN, dass Rice auf der Zeugenliste für eine Befragung in dem Gremium stehe. Es untersucht Vorwürfe, nach denen Russland Einfluss auf den US-Wahlkampf genommen haben soll und das Trump-Team in Kontakt mit Moskau stand. Besonders steht der frühere Sicherheitsberater von Trump, Michael Flynn, in der Kritik. Er sprach noch vor Trumps Amtseinführung mit dem russischen Botschafter in den USA. Rice sagte, sie habe keine Details über Flynns Anruf durchsickern lassen. Vorschläge für Grenzmauer zu Mexiko \nFür die geplante Mauer an der Grenze zwischen Mexiko und den USA gibt es eine Reihe von Ideen, die das Bauwerk optisch attraktiver machen sollen. Der Bieterprozess um den Bau des Prestigeprojekts von US-Präsident Donald Trump ist gerade zu Ende gegangen. Eine Firma aus Las Vegas schlägt beispielsweise vor, die Mauer mit Solarzellen zu versehen. Diese könnten nach Angaben der Baufirma zwei Megawatt Strom pro Stunde gewinnen. Der Vorschlag ziele vor allem auf die jüngere Bevölkerung ab. «Sie sagen, wenn es eine Mauer gibt, dann soll sie grün sein», erklärt der Manager der Baufirma der Zeitung «The San Diego Union-Tribune».Ein anderer Baubieter schlug eine Mauer aus poliertem Beton vor, versehen mit Steinen und Gegenständen, die den Charakter der Region widerspiegeln, in der der Mauerabschnitt steht. «Die Idee ist, die Mauer zu einem Kunstwerk zu machen», sagt der Geschäftsführer der Firma aus San Diego. In einem weiteren Vorschlag ist die Rede von einer Aussichtsplattform, die Touristen einen Rundumblick in die Wüste ermöglichen könnte.Wie viele Angebote es gibt und wer genau die Bieter dafür sind, gab die Grenzschutzbehörde zunächst nicht öffentlich bekannt. Normalerweise ist das beim Bau von Regierungsprojekten Standard. Es wird erwartet, dass die Regierung Anfang Juni bekannt gibt, welche Firmen Prototypen ihrer Mauer-Ideen bauen sollen.Für das Bauwerk gab es einige generelle Anforderungen: So sollte die Struktur Pickeln und Vorschlaghämmern mindestens eine Stunde standhalten – zudem war ein ästhetisches Design für die Nordseite der Mauer gewünscht, also den Teil, der in den USA zu sehen ist.. Tillerson reist nach Moskau \nUS-Aussenminister Tillerson reist am 12. April zum ersten Mal in seiner neuen Funktion nach Moskau. Washington zufolge wird Tillerson seinen russischen Amtskollegen Lawrow treffen. Russische Diplomaten schlossen auch ein Treffen mit Präsident Putin nicht aus.Angaben aus Washington zufolge wird Rex Tillerson mit Sergej Lawrow und anderen russischen Vertretern das Thema Ukraine, die Terrorbekämpfung und die bilateralen Beziehungen zu besprechen. Laut Mitteilung in Moskau geht es daneben auch um die Terrormiliz Islamischer Staat (IS), das Thema Syrien sowie den Palästinenserkonflikt und den Konflikt mit Nordkorea.Russland bewerte die «erklärte Absicht» der neuen US-Regierung zur Verbesserung der Beziehungen positiv, hiess es in einer Erklärung des Aussenministeriums in Moskau. Einschränkend fügte es hinzu: «Wir sollten das aber an tatsächlichem Handeln messen.» Interview mit Ivanka \nIvanka Trump hat versichert, die politischen Entscheidungen ihres Vaters durchaus zu kritisieren. «Dort, wo ich meinem Vater widerspreche, weiss er es und ich sage es ihm mit totaler Aufrichtigkeit», sagte sie in einem Interview mit dem Fernsehsender CBS News, das am (heutigen) Mittwoch in voller Länge ausgestrahlt werden sollte. «Wo wir übereinstimmen, setze ich alles ein, unterstütze seine Agenda und hoffe, dass ich ein Gewinn für ihn sein kann.» Dass sie sich öffentlich zu manchen umstrittenen Themen nicht äussere, solle nicht mit Stillschweigen verwechselt werden, sagte sie.Anlass ist Kritik an ihrer Person, nach der die First Daughter es versäumt haben soll, die konservative Agenda ihres Vaters öffentlich anzuzweifeln – etwa, was das Einreiseverbot oder die geplante Mauer an der Grenze zu Mexiko angeht. Die 35-Jährige hat eine offizielle Rolle in der US-Regierung übernommen. Ohne Bezahlung kümmert sie sich um Themen wie Frauenförderung in der Wirtschaft und Berufsausbildungen. Schwiegersohn Kushner im Irak \nNach seinem Besuch in der Hauptstadt Bagdad hat der Schwiegersohn und Berater von US-Präsident Donald Trump, Jared Kushner, auch die autonome Kurdenregion im Irak besucht. Kushner führte gemeinsam mit US-Generalstabschef Joe Dunford sowie dem Sicherheitsberater im Weissen Haus, Tom Bossert, in Erbil Gespräche mit Behördenvertretern, darunter der Präsident der autonomen Kurdenregion, Massud Barsani, Regierungschef Neschirwan Barsani und der Vorsitzende des regionalen Sicherheitsrats, Masrur Barsani.Masrur Barsani bezeichnete die Gespräche im Kurzbotschaftendienst Twitter als «produktiv». Themen seien der Kampf gegen die Dschihadistenmiliz Islamischer Staat (IS) und «Pläne für die Zeit danach» gewesen. Masrur Barsani ist der Sohn von Kurdenführer Massud Barsani, der Regierungschef Neschirwan Barsani ist der Neffe des Präsidenten.Kushner hat wie sein Schwiegervater keine Regierungserfahrung, wurde mit dem Amtsantritt Trumps jedoch binnen kurzer Zeit zu einem der einflussreichsten Männer in Washington. Vom Präsidenten wegen seiner Diskretion und Loyalität geschätzt, hat der 36-jährige Ehemann von Ivanka Trump als Berater einen grossen Einfluss auf die Innen- und Aussenpolitik der USA. Alle Trump-Tweets werden archiviert \nDas US-Nationalarchiv und das Weisse Haus haben sich darauf geeinigt, dass alle Tweets von US-Präsident Donald Trump gesichert werden – auch diejenigen, die er gelöscht oder korrigiert hat. Das Weisse Haus habe versprochen, alle Einträge in dem sozialen Netzwerk aufzubewahren, teilte der Chef der National Archives and Records Administration (Nara), David Ferriero, zwei demokratischen Senatoren vergangene Woche in einem Brief mit.Darin wurde nicht erklärt, wie das Weisse Haus die Tweets speichere – die Obama-Regierung nutzte ein automatisiertes System, um Kopien von Tweets zu sichern. Die Nara hatte das Weisse Haus kontaktiert, um die Verwahrung der Tweets zu klären. Die Senatoren Claire McCaskill und Tom Carper hatten gegenüber der Einrichtung zuvor Bedenken geäussert, nachdem Trump Anfang März mehrere frühere Tweets gelöscht und geändert hatte.Die zwei Senatoren wollten zudem Informationen der Nara zu Berichten, nach denen manche Mitarbeiter des Weissen Hauses angeordnet worden sein sollen, E-Mails und Apps, die E-Mails speichern, zu vermeiden. Grund dafür soll Angst vor der Weitergabe von Regierungsinformationen an die Presse sein. Ferriero sagte, ihm sei nicht bewusst, dass Mitarbeiter angehalten worden seien, ihre E-Mail-Kommunikation zu beschränken.Einige Tweets, die in Vergangenheit für Aufsehen sorgten: ...vast sums of money to NATO & the United States must be paid more for the powerful, and very expensive, defense it provides to Germany! — Donald J. Trump (@realDonaldTrump) 18. März 2017 James Clapper and others stated that there is no evidence Potus colluded with Russia. This story is FAKE NEWS and everyone knows it! — Donald J. Trump (@realDonaldTrump) 20. März 2017 What about all of the contact with the Clinton campaign and the Russians? Also, is it true that the DNC would not let the FBI in to look? — Donald J. Trump (@realDonaldTrump) 20. März 2017 I don't know Putin, have no deals in Russia, and the haters are going crazy - yet Obama can make a deal with Iran, #1 in terror, no problem! — Donald J. Trump (@realDonaldTrump) 7. Februar 2017 Trump startet neuen Versuch gegen Obamacare \nUS-Präsident Donald Trump unternimmt einen neuen Versuch zur Aufhebung der Gesundheitsreform seines Vorgängers Barack Obama. Trump wolle möglichst noch Ende dieser Woche über einen neuen Gesetzentwurf zur Aufhebung von Obamacare im Kongress abstimmen lassen.«Der Präsident wäre sehr froh, wenn dies am Freitag verabschiedet werden würde.» Es könne ziemlich schnell gehen, sagte der Abgeordnete Chris Collins am Montag nach einem Treffen von Republikanern mit Mitgliedern der Regierung.Collins gehört der «Tuesday Group» von moderaten Republikanern an, die ins Weisse Haus eingeladen worden waren. Anschliessend traf sich Pence mit Vertretern des konservativen «Freedom Caucus», an dessen Widerstand der erste Gesetzentwurf der Trump-Regierung vor allem gescheitert war. «Wir hoffen, dass wir den Gesetzestext innerhalb der nächsten 24 Stunden bekommen werden», sagte Mark Meadows, der Vorsitzende des «Freedom Caucus» im Repräsentantenhaus. «Wir warten ab, was der Gesetzestext tatsächlich enthält, aber wir bleiben offen und gewillt, uns die Details anzuschauen.»Mit seinem ersten Gesetzentwurf für tiefe Einschnitte an Obamacare hatte Trump Ende März eine Niederlage erlitten. Die Republikaner zogen auf Bitten des Präsidenten den Entwurf zurück, weil sich abzeichnete, dass er im Repräsentantenhaus keine Mehrheit bekommen würde. Moderaten Republikanern waren die Vorschläge zu weit, konservativen Republikanern dagegen nicht weit genug gegangen. Offizielles Porträt der First Lady \nMelania Trump, die First Lady der USA, hat nun ein offizielles Porträtfoto. Das Bild, das die US-Regierung in Washington herausgab, zeigt die 46-Jährige in ihrem neuen Wohnsitz, dem Weissen Haus. Official Portrait of First Lady pic.twitter.com/K1DUVE5kSI — Melania Trump (@FLOTUS) 3. April 2017 Die First Lady hält sich allerdings die meiste Zeit gar nicht dort auf. Bisher wohnt sie weiterhin im Trump Tower in New York, wo sie und ihr zehnjähriger Sohn Barron neben dem Schutz des Secret Service auch jenen der Polizei und Feuerwehr geniessen. Die Sicherheit der beiden kostet die Stadt nach Angaben von Polizeichef James O'Neill täglich bis zu 146'000 Dollar. Kushner trifft Iraks Präsident \nDer Schwiegersohn und ranghohe Berater von US-Präsident Donald Trump, Jared Kushner, und US-Generalstabschef Joseph Dunford haben am Montag den irakische Ministerpräsidenten Haidar al-Abadi getroffen. Kushner und Dunford sollen sich zudem mit irakischen Regierungsvertretern und US-Truppen treffen und sich auch über den aktuellen Stand des Kampfes gegen die Terrormiliz Islamischer Staat informieren.Die Reisepläne Kushners waren bereits am Sonntag bekannt geworden, weil ein Mitarbeiter der Regierung darüber gesprochen hatte. Eigentlich unterliegen Besuche von ranghohen Regierungsvertretern in Kriegsgebieten der höchsten Geheimhaltung.Der Regierungsmitarbeiter hatte gesagt, Kushner wolle sich selbst ein Bild von der Situation im Irak machen. Die Information war nach Aussen gedrungen, als er schon auf dem Weg nach Bagdad gewesen sein soll. Derzeit laufen Untersuchungen zu einem Luftangriff der US-geführten Koalition bei Mossul im vergangenen Monat, bei dem mehrere Zivilisten getötet wurden.Kushner befasste sich in seiner Funktion unter anderem mit dem Beziehungen der USA zum Nahen Osten, Kanada und Mexiko. Obwohl er über keine vorherige diplomatische oder Regierungserfahrung verfügt, beauftragte ihn Trump auch damit, ein Friedensabkommen zwischen Israel und den Palästinensern zu vermitteln. Kushner ist mit Trumps ältester Tochter Ivanka verheiratet.Der irakische Ministerpräsident Haidar al-Abadi hatte vor zwei Wochen gesagt, ihm sei vom Präsidenten versichert worden, dass die USA ihre Unterstützung für den Kampf des Irak gegen die Terrormiliz Islamischer Staat verstärken würden. Spendabel \nGleich zu Amtsantritt hatte sich Donald Trump mit der für die US-Nationalparks zuständigen Verwaltungsbehörde angelegt – nun spendet er dem National Park Service (NPS) seine ersten Monatsgehälter. Der Sprecher des Weissen Hauses, Sean Spicer, übergab heute in Washington einen Scheck über 78'333,32 Dollar an Innenminister Ryan Zinke, dem der NPS untergeordnet ist.Trump hatte bereits während des Wahlkampfs angekündigt, auf sein Präsidentengehalt verzichten zu wollen. Allerdings hatte der Immobilienmogul damals in Aussicht gestellt, das Geld an eine karitative Einrichtung und nicht an eine Behörde zu spenden.Möglicherweise war seine Entscheidung für den NPS nun als Versöhnungsgeste gemeint. Unmittelbar nach seiner Amtseinführung am 20. Januar war Trump durch eine Twitter-Botschaft der Behörde in Rage versetzt worden, in der Luftaufnahmen von den Zuschauermengen während seiner Vereidigung sowie jener seines Vorgängers Barack Obama weiterverbreitet worden waren. Staatsbesuch \nUS-Präsident Donald Trump hat heute den ägyptischen Staatschef Abdel-Fattah al-Sisi im Weissen Haus empfangen. Die beiden wollten bei ihrem Treffen unter anderem über den gemeinsamen Kampf gegen den Terror und die Unterstützung des ägyptischen Militärs durch die USA sprechen.Das Treffen symbolisiert einen Neuanfang in den Beziehungen der beiden Staaten. Trumps Vorgänger Barack Obama hatte Al-Sisi nie nach Washington eingeladen und kurzzeitig auch die Militärhilfe für Ägypten ausgesetzt. Al-Sisis Regierung warf er wiederholt Menschenrechtsverletzungen vor.Trump hatte Al-Sisi bereits vor seinem Wahlsieg getroffen, im September im New Yorker Plaza Hotel. Damals hatte er den ägyptischen Präsidenten als «grossartigen Typen» bezeichnet und über die «gute Chemie» zwischen ihnen geschwärmt. Kushner besucht Irak \nJared Kushner, Schwiegersohn und enger Berater von US-Präsident Donald Trump, ist zu einem offiziellen Besuch im Irak eingetroffen. Ein Regierungsvertreter teilte am Sonntag in Washington mit, Kushner reise mit US-Generalstabschef Joe Dunford, der ihn eingeladen habe.Nähere Angaben zu dem Besuch wurden zunächst nicht gemacht, der Kampf gegen die Terrormiliz Islamischer Staat (IS) dürfte jedoch eines der zentralen Themen der Reise sein. Die USA führen eine internationale Anti-IS-Koalition an, die Luftangriffe zur Unterstützung der irakischen Truppen am Boden fliegt. Einflussreicher Schwiegersohn Mitte Februar starteten die Verbündeten eine Offensive, um die IS-Miliz vollständig aus Mossul zu vertreiben. Der IS hatte die zweitgrösste irakische Stadt im Sommer 2014 unter seine Kontrolle gebracht. Mossul ist die letzte Hochburg der Jihadisten im Irak.Kushner hatte, wie sein Schwiegervater, keine Regierungserfahrung, wurde mit dem Amtsantritt Trumps jedoch binnen kurzer Zeit zu einem der einflussreichsten Männer in Washington. Vom Präsidenten wegen seiner Diskretion und Loyalität geschätzt, hat der 36-Jährige als Berater einen grossen Einfluss auf die Innen- und Aussenpolitik der USA. Trump lobt EU \nUS-Präsident Donald Trump hat die Europäische Union für ihre Reaktion auf das Brexit-Votum gelobt. Die EU mache «sehr gute Arbeit», sagte Trump in einem am Sonntag veröffentlichten Interview mit der Zeitung «Financial Times».Er habe nach der Entscheidung der Briten für einen EU-Austritt zunächst gedacht, dass weitere Länder folgen würden, aber er glaube wirklich, dass es die Europäische Union schaffen werde.Seit dem überraschenden Votum der Briten habe die Europäische Union «sehr gute Arbeit» geleistet, die Mitgliedstaaten «wieder zusammenzuführen». In der EU herrsche nun «ein anderer Geist des Zusammenhalts». Er rechne damit, dass die Brexit-Verhandlungen für beide Seiten gut ausgehen würden, sagte Trump der «Financial Times».Die neuen Äusserungen des US-Präsidenten stehen im Widerspruch zu einem Interview, das er vor seiner Amtseinführung im Januar den Zeitungen «Bild» und «The Times» gegeben hatte. Darin hatte er den Brexit als «grossartige Sache» bezeichnet und erklärt, er rechne damit, dass weitere EU-Staaten dem Vorbild Grossbritanniens folgen würden.Neun Monate nach dem Brexit-Referendum hatte die britische Regierung am Mittwoch offiziell den Antrag auf Austritt aus der EU gestellt. Damit beginnt ein zweijähriger Verhandlungsprozess über die Entflechtung der Beziehungen zwischen London und der EU. Alleingang gegen Nordkorea \nDie USA sind laut US-Präsident Donald Trump im Zweifelsfall auf einen Alleingang gegen Nordkorea vorbereitet. Wenn China nicht in der Lage sei, das Problem zu lösen, dann würden die USA einschreiten, sagte Trump der «Financial Times». Vize-Sicherheitsberater K. T. McFarland sagte der Zeitung, es sei möglich, dass Nordkorea bis zum Ende der ersten Amtszeit Trumps über mit Atomwaffen bestückbare Raketen verfüge, welche die USA erreichen könnten.Einem US-Regierungsvertreter zufolge schlossen die Sicherheitsberater Trumps einen Bericht zu den Optionen der USA ab, um das Atomprogramm Nordkoreas einzudämmen. Darin seien eine Reihe von wirtschaftlichen und militärischen Massnahmen enthalten, sagte der Insider der Nachrichtenagentur Reuters. Der Schwerpunkt liege jedoch darauf, neue Sanktionen zu erlassen und verstärkten Druck auf China auszuüben.Die Volksrepublik ist einer der wenigen Verbündeten der Regierung in Pyongyang. Unklar sei, ob Trump der Bericht vorliege, hiess es weiter. Der US-Präsident trifft in dieser Woche seinen chinesischen Amtskollegen Xi Jinping. «Heil Präsident» \nUnbekannte haben am 1. April die Nachrichten-App der US-Zeitung «The New York Post» gehackt und darüber an Präsident Donald Trump gerichtete Eilmeldungen versendet. Die Zeitung entschuldigte sich für den Vorfall am Samstagabend. Die Funktion für Eilmeldungen der App sei vorgeführt worden. «Wir arbeiten daran, das Problem zu beheben.»Über die sogenannten Push-Nachrichten hatten die Hacker unter anderem den Satz «Heil Präsident Donald Trump» verschickt. Die anderen Nachrichten richteten sich direkt an Trump: «Öffne dein Herz für die, die du nicht verstehst und höre denen zu, vor welchen du Angst hast und auf die du herabsiehst.» Ausserdem zitierten die Hacker eine Liedzeile des Nirvana-Songs «Come As You Are». «The New York Post» gehört dem Trump eher positiv gesinnten Medienmogul Rupert Murdoch. — Jack Sterne (@JRSterne) 2. April 2017 Streit um «Trump-Uni» beigelegt \nDer Rechtsstreit um Betrugsvorwürfe gegen eine umstrittene «Universität» von US-Präsident Donald Trump ist beigelegt. Richter Gonzalo Curiel im Bundesstaat Kalifornien segnete am Freitag einen Vergleich zwischen dem Präsidenten und ehemaligen Studenten ab. Um einen Prozess zu verhindern, hatte Trump kurz nach seiner Wahl im November angeboten, 25 Millionen Dollar an Ex-Studenten zu zahlen, die ihm Betrug vorwarfen.Der Vergleich beendet drei Gerichtsverfahren rund um die Trump University und betrifft insgesamt rund 4000 Kläger, wie aus der am Freitag veröffentlichten Entscheidung hervorgeht. 21 Millionen Dollar gehen demnach an die klagenden Ex-Studenten, die zwei Sammelklagen eingereicht hatten. Vier Millionen Dollar fliessen in den Etat von New Yorks Generalstaatsanwalt Eric Schneiderman, der ebenfalls ein Verfahren angestrengt hatte. Mit dem Geld sollen die Kosten seiner Kläger erstattet werden. Sean Spicer's April Fools:-Trump University was a great school.-Liars' pants don't catch on fire. — Frederick Douglass (@HITEXECUTIVE) March 31, 2017 Trump hatte seine «Universität» im Jahr 2004 gegründet und hielt daran einen Anteil von 93 Prozent. Die Seminare kosteten bis zu 35.000 Dollar. Die kommerzielle Einrichtung, die nicht offiziell als Hochschule anerkannt war und ihren Kunden angeblich vermitteln sollte, wie sie im Immobiliengeschäft schnell zu Geld kommen, machte 2011 dicht. Ehemalige Studenten der Trump University hatten den Geschäftsmann verklagt, weil sie sich betrogen fühlten.Trotz dieser Faktenlage hatte Trump bis zu seiner Wahl eine gütliche Einigung stets ausgeschlossen. Nach seinem teuren Einlenken im November erklärte er im November im Onlinedienst Twitter, er habe den Streitfall für eine verhältnismässig kleine Summe beigelegt, «weil ich mich als Präsident auf unser Land konzentrieren muss». Trump wird «König der Narren» \nDonald Trump hat schon viele Titel von Freund und Feind erhalten – nun ist er zum «König der Verrückten» ernannt worden. Dutzende Teilnehmer einer New Yorker Parade zum 1. April trugen am Samstag Masken mit dem Konterfei des US-Präsidenten. Sie folgten einer lebensgrossen Trump-Puppe auf einem Umzugswagen, die auf einer Toilette thronte. Darüber prangte in goldenen Lettern der Name des Monarchen, «TRUMP». #aprilfoolsday #donaldtrump #Breakingnews Donald Trump is Crowned the King of Fools Today! pic.twitter.com/5euMR4xDXy — Alistair Reign (Ali) (@AlistairReign) April 1, 2017 Es war das 32. Mal, dass der Künstler Joey Skaggs die Aprilscherz-Parade organisierte – doch im Unterschied zu früher fand der Marsch erstmals tatsächlich statt. Und so liefen die Untertanen von König Trump mehrere hundert Meter die Fifth Avenue entlang bis zum berühmten Trump Tower, in dem First Lady Melania und ihr Sohn Barron nach wie vor leben. A few dozen people parade in front of Trump Tower in Manhattan for April Fools' Day. Trump chosen King of Fools this year they say #AFP pic.twitter.com/FcD0XGcNOW — Laura Bonilla (@LauraBonillaCal) April 1, 2017 Trump sei einstimmig zum «King of Fools» («König der Verrückten») gewählt worden, sagte Skaggs. Auf Englisch wird der 1. April «April Fool's Day» genannt, wie hierzulande gibt es die Tradition des Aprilscherzes. «Wir müssen jede Gelegenheit nutzen, unsere Gefühle zu zeigen, die wir für diesen Verrückten im Weissen Haus hegen», erklärte die hinter einer Trump-Maske versteckte Teilnehmerin Judy. Trumps Ferrari versteigert \nEin roter Ferrari, der einst US-Präsident Donald Trump gehörte, hat für 270'000 Dollar den Besitzer gewechselt. Der zehn Jahre alte Sportwagen wurde am Samstag nahe Miami im US-Bundesstaat Florida versteigert, wie das Auktionshaus Auctions America mitteilte.Der erfolgreiche Bieter blieb anonym. Normalerweise bringe ein vergleichbares Ferrari-Modell zwischen 125'000 und 175'000 Dollar, sagte Auktionshaus-Sprecherin Amy Christie. Aufgrund des prominenten Vorbesitzers waren die Erwartungen aber höher: Das Auktionshaus hatte mit einem Erlös von 250'000 bis 350'000 Dollar für das F430 Coupé gerechnet. «Es ist sehr wahrscheinlich, dass Donald Trump der einzige US-Präsident ist, der jemals einen Sportwagen besessen hat», hatte Auctions America vor der Versteigerung am Samstag erklärt. Die Tatsache, dass Trump einst Besitzer des Autos gewesen sei, lasse dem Wagen eine besondere Bedeutung zukommen.Der Immobilien-Milliardär Trump hatte den Ferrari als Neuwagen für seinen persönlichen Gebrauch gekauft und die Luxuskarosse etwas mehr als vier Jahre lang gefahren. Mit dem Sportwagen legte er knapp 3900 Kilometer zurück. Die beiden nachfolgenden Besitzer fuhren insgesamt gut 9600 Kilometer. Clinton kritisiert Trumps Einsparungen \nDie frühere US-Aussenministerin und unterlegene Präsidentschaftskandidatin Hillary Clinton hat Präsident Donald Trump wegen geplanter Einsparungen im Aussenministerium scharf kritisiert.Auch die angekündigten Einschnitte bei der Entwicklungshilfe seien ein «schwerer Fehler», sagte Clinton am Freitag vor hunderten Studenten in der Georgetown-Universität in Washington. Die von der Regierung angestrebten Streichungen bei «internationaler Gesundheit, Entwicklung und Diplomatie wären ein Schlag für Frauen und Kinder und ein schwerer Fehler für unser Land», sagte die Demokratin, die von 2009 bis 2013 an der Spitze des US-Aussenministeriums stand.Nach den Planungen Trumps soll das Budget des Aussenministeriums um 28 Prozent schrumpfen. Stattdessen will der Präsident die Ausgaben der USA ganz auf militärische und sicherheitspolitische Erfordernisse ausrichten. Der Verteidigungshaushalt soll auf einen Schlag um zehn Prozent auf fast 600 Milliarden Dollar anwachsen. Allerdings hat der Kongress das letzte Wort. Trump unterzeichnet Dekrekt zum Freihandel \nUS-Präsident Donald Trump will angesichts des hohen US-Handelsdefizits sämtliche Wirtschaftsbeziehungen zu anderen Ländern auf den Prüfstand stellen. Dazu unterzeichnete Trump am Freitag in Washington ein Dekret. Trump wirft Deutschland und anderen Ländern unfaire Handelspraktiken zu Lasten der USA vor. Untersucht werden sollen nun etwaige Verletzungen von Handelsverträgen. Handelsminister Wilbur Ross sprach von einem «neuen Kapitel» in den Handelsbeziehungen der USA.Die US-Regierung will ausserdem Dumping-Vorwürfe untersuchen lassen, etwa gegen mehrere ausländische Stahlproduzenten. Tausende Jobs in den USA seien deswegen verloren gegangen, sagte Trump. Diejenigen, die Regeln gebrochen hätten, würden die Konsequenzen tragen.Die Anforderung des Berichts kommt wenige Tage vor dem ersten Treffen Trumps mit seinem chinesischen Kollegen Xi Jinping in Florida. Dort wird das Thema Handel vermutlich eine herausragende Rolle spielen, denn China verzeichnet den bei weitem höchsten Überschuss im Warenaustausch mit den USA.Trump sind die hohen Defizite im Handel mit anderen Ländern wie China, Deutschland und Japan, seit langem ein Dorn im Auge. 2016 überstiegen die Importe von Gütern aus dem Ausland die Exporte um 734 Milliarden Dollar.Angesichts dessen erwägt Trump, die Einfuhren mit neuen Steuern oder Zöllen zu verteuern. Damit versucht er, die Firmen zu bewegen, mehr in den USA zu produzieren und damit dort mehr Arbeitsplätze zu schaffen. Trump erntet Shitstorm auf Twitter \n«Nur wenn wir das volle Potenzial der Frauen in unserer Gesellschaft ausschöpfen, wird es möglich sein, Amerika wieder gross zu machen» – twitterte Trump am heutigen Donnerstag. Seine früheren, eher weniger schmeichelhaften Äusserungen über das weibliche Geschlecht scheinen der Aussage jedoch seine Glaubwürdigkeit zu rauben. Jedenfalls sprechen die Twitter-Reaktionen für sich. @realDonaldTrump Don't you mean \"GRAB the full potential of women\"!?! pic.twitter.com/h9InQRxrvp — Kristina Wong ?? (@mskristinawong) 31. März 2017 Eine Twitterin hat etwa Trumps Aussagen, die auf einer Tonaufnahme festgehalten wurden, transkribriert. Dazu schreibt sie: «@realDonaldTrump: Meinen Sie nicht, das volle Potenzial der Frauen anzuPACKEN?»Ein weiterer User postet ein 10-minütiges Video, das alle Situationen zusammenfasst, in denen «Trump Frauen öffentlich beleidigt und erniedrigt hat.» @realDonaldTrump Here's a 10 minute video that aggregates all of the times you have publicly demeaned, objectified, & insulted women. https://t.co/dBpqTURoku — Casey Clemmons (@Casey_Clemmons) 31. März 2017 Auch die Aussagen Trumps über Top-Managerin Carly Fiona als Präsidenschaftskandidatin wurden von einer Twitterin wiedergegeben. So soll er gesagt haben: «Könnt Ihr euch dieses Gesicht, als das eurer Präsidentin vorstellen? Ich meine, sie ist eine Frau. Ich will nichts Schlechtes sagen aber Leute kommt schon, meint ihr das ernst?» @realDonaldTrump Not to sound like a broken record but... pic.twitter.com/kiFfkGeg09 — Allison Piwowarski (@allisonpiwo) 31. März 2017 Trumps IPhone \nDas neue iPhone von US-Präsident Donald Trump ist nach Einschätzung von Experten nicht vor Hacker-Angriffen geschützt. «Ich kann garantieren, dass die Russen und die Chinesen versuchen werden, eine Attacke zu starten», sagte John Dickson, ehemaliger Verantwortlicher für Cybersicherheit bei der US-Luftwaffe. Die Gefahr, dass ein Smartphone gehackt werde, hänge sehr von der Nutzung des Gerätes ab. Trump ist ein eifriger Nutzer des Kurzmitteilungsdienstes Twitter.Der Leiter der Social Media-Abteilung des Weissen Hauses, Dan Scavino, hatte diese Woche bestätigt, dass Trump «seit einigen Wochen sein neues iPhone zum twittern benutzt». Zuvor hatte der US-Präsident laut «New York Times» sein «altes, ungesichertes Android-Smartphone» benutzt.Dickson sagte, Geräte mit begrenzten Funktionen seien nicht anfällig für Hackerangriffe. «Aber sobald man anfängt, etwas anzuklicken, Apps hochzuladen, den Zugang zum Telefon zu erlauben, wird es ernst.» Hacker können sich aus der Ferne Zugriff zu Smartphones verschaffen. Sie können das Mikrofon zum Abhören benutzen, die Kamera verwenden, das Telefon orten und sogar sämtliche Funktionen des Gerätes unter ihre Kontrolle bringen.Trumps Vorgänger Barack Obama hatte zunächst ein BlackBerry und dann ein anders Smartphone, das aus Sicherheitsgründen eingeschränkte Funktionen hatte. Experten zufolge sind Apple-Geräte allgemein besser vor Hacker-Angriffen geschützt als Geräte anderer Hersteller, weil das Unternehmen sowohl die Hardware als auch die Software kontrolliert und seine Programme regelmässig aktualisiert.Allerdings sagte die Expertin für Cybersicherheit an der Universität von Kalifornien, Betsy Cooper, Untersuchungen hätten ergeben, dass der Ruf von Apple nicht mehr mit der Realität übereinstimme. Ein iPhone könne ebenso leicht gehackt werden wie ein Android-Smartphone. Unklar sei zudem, wie Trumps Auftritte in den sozialen Netzwerken gesteuert werden. Der US-Präsident hat zwei Twitter-Profile: das offizielle Profil des US-Präsidenten (@POTUS) und sein älteres Profil (@realDonaldTrump). US-Regierung geht in Berufung \nDie US-Regierung hat gegen die verlängerte Aussetzung des überarbeiteten Einreiseverbots Berufung eingelegt. Regierungsanwälte reichten entsprechende Dokumente am Donnerstag vor dem neunten Bundesberufungsgericht ein. Aus ihnen geht hervor, dass die Berufung sich nicht nur auf die Verlängerung, sondern auch auf die erste vorläufige Anordnung des Bundesrichters Derrick Watson bezieht. Dieser hatte am Vortag entschieden, dass das Verbot weiter ausser Kraft gesetzt bleibt.Er hatte argumentiert, das Dekret des US-Präsidenten solle so lange ausgesetzt bleiben, bis der gerichtliche Streit darüber gelöst sei. Er war es auch gewesen, der die überholte Version des Einreiseverbots kurz vor Inkrafttreten erstmals auf Eis gelegt hatte.In seiner Entscheidung vom Mittwoch hatte er bereits deutlich gemacht, bei seiner Haltung zu bleiben – selbst wenn die US-Regierung entscheide, in Berufung zu gehen. Konkret heisst das: Vorerst bleibt es bei der Aussetzung. BREAKING: President Donald Trump's administration appeals Hawaii federal judge's ruling blocking revised travel ban. — The Associated Press (@AP) 30. März 2017 Der Generalstaatsanwalt von Hawaii, Douglas Chin, hatte mit einer Berufung der US-Regierung gerechnet. Das US-Justizministerium hatte sich verärgert darüber gezeigt, dass in Honolulu eine erneute Entscheidung zulasten des Verbots gefallen war.In einer seiner ersten Amtshandlungen hatte Präsident Donald Trump versucht, Staatsbürgern aus sieben mehrheitlich muslimischen Ländern die Einreise in die USA zu verbieten. Dieses erste Dekret sollte ohne Vorlaufzeit umgesetzt werden und führte zu Chaos auf Flughäfen und zahlreichen Klagen. Die US-Regierung legte daraufhin eine überarbeitete Version vor, die nur noch sechs Staaten betraf, aber kurz vor Inkrafttreten durch Hawaii blockiert wurde. Treffen mit Xi Jinping wird «schwierig» \nUS-Präsident Donald Trump glaubt, dass sein anstehendes Treffen mit Chinas Staats- und Parteichef Xi Jinping sehr schwierig werden wird. Auf Twitter schrieb Trump am Donnerstagabend, man könne «nicht länger ein so massives Handelsdefizit haben». The meeting next week with China will be a very difficult one in that we can no longer have massive trade deficits... — Donald J. Trump (@realDonaldTrump) 30. März 2017 In einem zweiten Tweet wandte sich Trump gegen US-Jobverluste, die angeblich China zugute kämen. Amerikanische Unternehmen müssten darauf vorbereitet werden, sich nach Alternativen umzusehen, schrieb er eine Woche vor der ersten Begegnung der beiden Staatsmänner in Trumps Domizil in Mar-a-lago. ...and job losses. American companies must be prepared to look at other alternatives. — Donald J. Trump (@realDonaldTrump) 30. März 2017 Trump und Xi werden am 6. und 7. April in Florida zusammentreffen. Das Treffen der Präsidenten der beiden grössten Volkswirtschaften wird mit Spannung erwartet.Trump hatte besonders im Wahlkampf eine härtere Gangart gegenüber Peking signalisiert und angeblich grobe Verstösse gegen fairen Handel wiederholt thematisiert. Zuletzt hatte er sich versöhnlich gezeigt, aber die jüngsten Tweets geben möglicherweise einen anderen Ton vor.Noch beim China-Besuch von Aussenminister Rex Tillerson Mitte März hatte dieser gesagt, Trump freue sich darauf, den chinesischen Präsidenten persönlich kennenzulernen. New York kritisiert Steuerpläne \nDie Pläne von US-Präsident Donald Trump für eine Steuerreform stossen in seiner Heimatstadt New York auf Widerstand. Sollten sie umgesetzt werden, müssten fast alle Millionäre der Metropole deutlich weniger Steuern zahlen.Zugleich würde mehr als ein Drittel der Familien mit geringen oder mittleren Einkommen stärker belastet, kritisierte der Chef der städtischen Rechnungsprüfungsbehörde, Scott Stringer (im Bild). Es gebe bereits gewaltige Wohlstandsunterschiede in der Stadt und den gesamten USA, sagte der Demokrat. «Das Steuergesetz Trumps würde sie – im Falle einer Umsetzung – noch verschlimmern.»Stringers Behörde legte für die Berechnungen nach eigenen Angaben Trumps Vorschläge aus dem Wahlkampf zugrunde. Demnach gäbe es für New Yorker zwar Steuererleichterungen von insgesamt fünf Milliarden Dollar. Fast zwei Drittel davon entfielen allerdings auf Menschen mit einem Jahreseinkommen von mehr als 500'000 Dollar, obwohl sie nur gut die Hälfte des Steueraufkommens zahlten.Eine Steuerreform gehört zu den wichtigsten Wahlversprechen des Republikaners Trump. Sein Finanzminister Steven Mnuchin hatte in der vergangenen Woche gesagt, die neuen Regeln zielten auf die Mittelschicht und nicht auf die oberen ein Prozent. Unzufriedene US-Bürger \nZwei Monate nach dem Amtsantritt von Donald Trump ist die Mehrheit der US-Bürger laut einer Umfrage mit seiner Regierungsführung insgesamt unzufrieden. Besonders galt dies für seinen Umgang mit der Gesundheitsreform, die von mehr als 60 Prozent der Amerikaner abgelehnt wird. Auch seine Aussen-, Einwanderungs- und Steuerpolitik sowie der Umgang mit dem Haushaltsdefizit werden jeweils von einer Mehrheit abgelehnt. Besser schneidet demnach aber seine Wirtschaftspolitik ab.42 Prozent der US-Bürger finden Trumps Arbeit gut, 58 Prozent tun dies nicht, wie aus der von Associated Press und dem Norc Center for Public Affairs Research durchgeführten Umfrage hervorgeht. Zu diesem Zeitpunkt in seiner Präsidentschaft waren in einer Gallup-Umfrage mehr als 60 Prozent mit der Amtsführung von Barack Obama zu frieden, die Zustimmung zu George W. Bush betrug seinerzeit mehr als 50 Prozent. Aktuell gibt Gallup die Zufriedenheit mit Trump sogar mit unter 40 Prozent an.62 Prozent der Amerikaner fanden bei AP-Norc, das Land steuere in die falsche Richtung, nur 37 Prozent halten die Richtung für gut. Mit Blick auf die Wirtschaft schnitt Trump indes besser ab: 50 Prozent der Befragten fanden sein Vorgehen gut, 48 Prozent lehnten es ab. Die Umfrage unter 1110 Erwachsenen wurde vom 23. bis 27. März durchgeführt. Juncker warnt Trump \nEU-Kommissionspräsident Jean-Claude Juncker hat US-Präsident Donald Trump vor weiteren Freudenbekundungen über den Brexit gewarnt. Juncker drohte Trump an, es ihm andernfalls gleichzutun: Wenn der US-Präsident so weitermache, werde er, Juncker, öffentlich für die Unabhängigkeit des US-Staats Ohio oder von Austin, Texas eintreten, sagte er bei einem Treffen der Europäischen Volkspartei auf Malta.Juncker ist verstimmt darüber, dass Trump sich mit Genugtuung über den Brexit geäussert und andere Länder aufgefordert habe, dem britischen Beispiel zu folgen. Der EU-Kommissionspräsident riet, jeder Staats- und Regierungschef möge sich auf seinen eigenen Job konzentrieren. Enge Mitarbeiterin verlässt Trump \nUS-Präsident Donald Trump verliert eine enge Mitarbeiterin: Vizestabschefin Katie Walsh scheidet aus dem Amt, wie am Donnerstag aus Kreisen des Weissen Hauses verlautete. Walsh arbeitet seit Jahren als rechte Hand von Stabschef Reince Priebus, sowohl im Republikanischen Nationalkomitee als auch zuletzt im Weissen Haus.In der Öffentlichkeit agiert sie zurückhaltend, ist aber im inneren Führungskreis der Regierung zu einer Hauptakteurin geworden und steht dem Präsidenten nahe. Was ihr Abgang für Priebus bedeutet, war zunächst nicht bekannt. Ihn machen manche Beobachter für erste Misserfolge Trumps nach dessen Amtsantritt verantwortlich, darunter das Scheitern der republikanischen Reform des Gesundheitsgesetzes. Blockade des Einreiseverbots verlängert \nDas von US-Präsident Donald Trump verhängte Einreiseverbot bleibt ausser Kraft. Ein Bundesrichter in Hawaii hat die bislang vorläufige Verfügung gegen das Verbot am Mittwoch unbefristet verlängert.Der Bundesstaat Hawai hatte gegen Trumps Verbot geklagt, weil er die Anordnung als Diskriminierung von Muslimen und damit einen Verstoss gegen die Verfassung wertet.Das Verbot betrifft Reisende und Flüchtlinge aus sechs muslimisch geprägten Staaten. Es ist eine überarbeitete Version eines schärferen Verbots, dass ebenfalls juristisch ausgebremst worden war. Trump hält das Einreiseverbot für eine notwendige Massnahme zum Schutz der nationalen Sicherheit. Ivanka wird Mitarbeiterin im Weissen Haus \nDie Tochter von US-Präsident Donald Trump, Ivanka Trump, wird offizielle Mitarbeiterin im Weissen Haus. Sie werde allerdings kein Gehalt bekommen, kündigte die sogenannte First Daughter am Mittwoch an. Sie habe die Bedenken von anderen, dass sie den Präsidenten beraten werde, gehört. Zuvor hatte sie bekannt gegeben, ein Büro im Westflügel des Regierungssitzes zu beziehen und Sicherheitsüberprüfungen zu durchlaufen, ohne jedoch Teil der US-Regierung zu sein. Dies hatten Ethikexperten kritisiert.Trump ergänzte, dass sie in gutem Glauben mit Beratern des Weissen Hauses und ihrer eigenen Beraterin zusammengearbeitet habe, um einen Rahmen für diese noch nie da gewesene Natur ihrer Rolle zu finden. In einer Erklärung begrüsste das Weisse Haus Trumps Schritt und erklärte, die künftige Jobbezeichnung werde «Assistentin des Präsidenten» sein. Die «New York Times» hatte zuerst über die Personalie berichtet. Finanzen offenlegen In der vergangenen Woche hatten mehrere Anwälte und Regierungsbeobachter in einem Brief an den Berater des Weissen Hauses, Don McGahn, ihre Bedenken geäussert. Sie forderten ihn auf, Trumps Dienste für ihren Vater – ohne dass sie eine offizielle Regierungsmitarbeiterin war – zu überprüfen. Grund sind Vorschriften zu Transparenz und Ethik, ein US-Gesetz verbietet beispielsweise Interessenskonflikte.Ein Ethikberater von Ex-Präsident Barack Obama erklärte, es sei gut, dass sich das Weisse Haus nun besonnen hätte. «Lasst uns hoffen, dass es kein isolierter Moment der Vernunft war», sagte Norman Eisen. Er hatte den Brief an das Weisse Haus mit unterzeichnet.Trump wird nach Angaben ihrer Anwältin Jamie Gorelick ihre finanzielle Situation offenlegen, so wie es für Mitarbeiter des Bundes vorgesehen ist. Zudem wird sie nun ethischen Richtlinien unterliegen. Kein festes Gehalt Trumps Entscheidung zeige, dass sie sich der Einhaltung von Regeln verpflichtet fühle, sagte Gorelick. Sie sei zudem offen gegenüber den Ansichten von Kritikern.Trump hatte sich bereits um Distanz zu ihren Geschäftsinteressen bemüht. Sie ist zwar weiterhin Besitzerin ihres Markennamens. Das Alltagsgeschäft in ihrem Unternehmen hat sie jedoch bereits an den Vorsitzenden übergeben. Zudem hat sie veranlasst, dass der Konzern keine Verträge im Ausland abschliessen darf; bei neuen Vertragsabschlüssen hat sie ein Veto-Recht. Eine Führungsposition in der Trump Organization hat sie abgegeben; sie erhält dort künftig ein festes Gehalt und keine Gewinnanteile mehr. Chinesische Investition in Kushner-Besitz geplatzt \nEine mögliche Investition eines chinesischen Unternehmens in ein New Yorker Gebäude von Jared Kushner, dem Schwiegersohn des US-Präsidenten, ist geplatzt. Die Kushner Unternehmen bestätigten am Mittwoch, dass die Verhandlungen mit dem chinesischen Versicherer Anbang einvernehmlich beendet worden seien. Da Kushner auch ein Berater von Donald Trump ist, hatten Ethikexperten die potenzielle Anteilsübernahme kritisiert und als einen Versuch Chinas gewertet, in die Gunst des Weissen Hauses zu kommen.Ein Sprecher der Kushner Unternehmen sagte, es seien noch Verhandlungen mit weiteren möglichen Investoren offen. Das betroffene Gebäude auf der Fifth Avenue war im Jahr 2007 für 1,8 Milliarden Dollar erworben worden. Dies wurde als grosser Sprung für Kushner gewertet, dessen Immobiliengeschäft vorher vor allem für den Erwerb von Apartments in den New Yorker Vororten bekannt war. Senat überprüft Verhältnis zu Russland \nDer Geheimdienstausschuss des US-Senats hat eine gründliche Untersuchung des Verhältnisses von Präsident Donald Trump und Russland angekündigt. Im Fokus steht dabei der Präsidentschaftswahlkampf, wie der republikanische Ausschussvorsitzende Richard Burr am Mittwoch sagte.Der Ausschuss wolle der Frage nachgehen, ob es irgendwelche Hinweise für direkte Verbindungen gebe. Dazu sollen voraussichtlich ab nächster Woche zunächst bis zu 20 Personen angehört werden, darunter Trumps Schwiegersohn und Berater Jared Kushner.Burr sagte, der Ausschuss wolle auch auf Versuche Russlands aufmerksam machen, die bevorstehenden Wahlen in Frankreich und Deutschland zu beeinflussen.US-Geheimdienste werfen Russland vor, sich in den US-Präsidentschaftswahlkampf eingemischt zu haben, um Trumps Siegeschancen gegen seine Rivalin Hillary Clinton zu erhöhen. Auch Beziehungen zwischen Trump-Wahlkampfmitarbeitern und Russland werden geprüft. Trump hat die Vorwürfe für haltlos erklärt, Russland weist sie zurück.Der Republikaner Burr trat zusammen mit dem ranghöchsten Demokraten des Ausschusses, Mark Warner, vor die Presse. Beide beteuerten, eng zusammenzuarbeiten. Grabenkampf im Repräsentantenhaus Anders läuft es im Repräsentantenhaus, dessen Geheimdienstausschuss sich ebenfalls mit der Angelegenheit befasst. Der Vorsitzende Republikaner Devin Nunes ist massiv in die Kritik geraten. Ihm wird seine Nähe zu Trump vorgeworfen.Die Demokraten fordern, dass er sich aus der Untersuchung zurückziehen soll. Viele Kongresspolitiker beider Parteien stufen wegen des tobenden Grabenkampfes die Untersuchung des Senats als die wichtigere ein.Burr war während des Wahlkampfs ein Sicherheitsberater Trumps. Er betonte, er könne dennoch objektiv bleiben. Er habe sich mit Trump nicht über den Umfang der Untersuchung des Ausschusses abgesprochen. David Friedman vereidigt \nDer Anwalt David Friedman ist als neuer US-Botschafter für Israel vereidigt worden. Vizepräsident Mike Pence nahm ihm am Mittwoch in einer Zeremonie in Washington den Amtseid ab.Friedman war bisher Anwalt für Donald Trump in Immobilienfragen. Nach seiner Nominierung sagte er, er gehe davon aus, künftig in Jerusalem zu arbeiten. Die amerikanische Botschaft steht seit 68 Jahren in Tel Aviv.Friedman gilt als ausgesprochen siedlerfreundlich. Er hatte Jerusalem als ewige Hauptstadt Israels bezeichnet. Die Palästinenser wollen im arabischen Ostteil der Stadt, den Israel 1967 besetzt und später annektiert hatte, die Hauptstadt eines unabhängigen Staates ausrufen. Der endgültige politische Status von Jerusalem soll in Friedensverhandlungen zwischen Israel und den Palästinensern geklärt werden.In einem aufsehenerregenden Brief an den US-Senat hatten fünf ehemalige US-Botschafter Friedman vor wenigen Tagen als unqualifiziert für die Position beschrieben. Sie kritisierten nach Angaben israelischer Medien Friedmans «extreme, radikale Positionen». Umweltschützer klagen gegen Klimapläne \nEinen Tag nach US-Präsident Donald Trumps Unterzeichnung eines Dekrets zur Abkehr vom Klimaschutz ist gegen den Erlass eine Klage eingereicht worden. US-Umweltschutzgruppen und der indianische Ureinwohnerstamm der Northern Cheyenne klagen gemeinsam.Das Bündnis bezeichnete es am Mittwoch als «alarmierend und inakzeptabel», dass die Regierung ein Moratorium zur Kohleförderung aufgehoben habe. Trump’s war on climate policy is also a war on public health https://t.co/udspcbICBo pic.twitter.com/1g82ENluQb — Earthjustice (@Earthjustice) 29. März 2017 Es handle sich um einen Verstoss gegen das Nationale Umweltgesetz, weil vor grossen politischen Richtungswechseln zunächst eine umfassende Umweltverträglichkeitsprüfung vorgenommen werden müsse. Die Gruppe Earthjustice erklärte, das Ende des Moratoriums bedeute eine Gesundheitsgefährdung für die Öffentlichkeit.Trump hatte bei der Vorstellung des Dekrets am Dienstag gesagt, seine Regierung werde den «Krieg gegen die Kohle» beenden. Ein Bündnis von überwiegend demokratisch regierten Bundesstaaten kündigte an, ebenfalls gerichtlich gegen Trumps Pläne vorzugehen. Palm Beach, Florida \nIm US-Bundesstaat Florida formiert sich Widerstand gegen die häufigen Besuche von US-Präsident Donald Trump in seinem Luxus-Resort Mar-a-Lago. In einem Schreiben der drei demokratischen Abgeordneten Lois Frankel, Alcee Hastings und Ted Deutch, von dem die Nachrichtenagentur AFP am Dienstag eine Kopie erhielt, wird Trump aufgefordert, für eine Erstattung der Millionenkosten zu sorgen, die für die Absicherung des Präsidententrosses auflaufen.«Wir haben Verständnis dafür, dass der Präsident gerne hier sein möchte», sagte die Abgeordnete Frankel aus West Palm Beach. «Klar – das ist hier das Paradies.» Wenn allerdings der Präsident in sein Luxusdomizil komme, so müssten Polizei und Feuerwehr Überstunden leisten.Seit dem Amtsantritt im Januar habe Trump fünf Wochenenden in Mar-a-Lago verbracht. Für die kleinen Unternehmen im Umfeld des Trump-Domizils seien bereits Verluste von 720'000 Dollar entstanden, rechneten die drei Abgeordneten aus. Die Feuerwehr habe 1,7 Millionen Dollar ausgegeben. ExxonMobil will am Klimaschutzabkommen festhalten \nWiederbelebung der Kohleindustrie stossen auch bei Energieunternehmen auf Kritik: Der Mineralölkonzern ExxonMobil forderte die US-Regierung zum Festhalten am Klimaschutzabkommen von Paris auf. ExxonMobil erklärte in einem Brief an die US-Regierung, das Pariser Abkommen sei die erste internationale Vereinbarung zum Kampf gegen den Klimawandel, die neben Industrieländern auch Schwellenländer wie China und Indien zum Abbau von Kohlendioxidemissionen verpflichte. Es sei «umsichtig, dass die USA Teil des Pariser Abkommens bleiben». So könnten «gleiche Wettbewerbsvoraussetzungen» garantiert werden, «damit die weltweiten Energiemärkte so frei und konkurrenzfähig wie möglich bleiben».Die USA seien «in einer guten Position», um im Rahmen des Pariser Abkommens auf dem Energiemarkt bestehen zu können, erklärte der auf die Erschliessung und Förderung von Erdöl und Erdgas spezialisierte US-Konzern, dessen langjähriger Chef Rex Tillerson nun Trumps Aussenminister ist. Die Vereinigten Staaten verfügten über ergiebige Ressourcen an CO2-armen Energiequellen wie Gas sowie über innovative Energieunternehmen. Trump steht dem Pariser Klimaabkommen skeptisch gegenüber und hatte am Dienstag offiziell die Abkehr von der Klimaschutzpolitik seines Vorgängers Barack Obama eingeleitet. Obwohl im Niedergang begriffen, bleibt die Kohleindustrie ein wichtiger Bestandteil der Energieversorgung in den USA. Trump hat ein neues Handy \nBis vor kurzem hat der US-Präsident ein Galaxy S3 aus dem Jahr 2012 benutzt. Das betagte Android-Betriebssystem lud Hacker geradezu ein, das Handy des mächtigsten Mannes der Welt knacken, seinen Twitteraccount inklusive. Zuletzt hatten sich Kongressabgeordnete besorgt über das Galaxy S3 geäussert, weil es nicht einmal besonders gesichert war. . @POTUS @realDonaldTrump has been using his new iPhone????for the past couple of weeks here on Twitter. Yes, it is #POTUS45 reading & tweeting! — Dan Scavino Jr. (@DanScavino) March 29, 2017 Inzwischen hat Trump ein neues, sicheres Handy bekommen – ein iPhone. Er benutze es nun seit einigen Wochen, twitterte Trumps Social-Media-Berater Dan Scavino Jr.Auch Barack Obama hatte sich nach seiner Amtsübernahme nur schwer von seinem geliebten Blackberry getrennt. Das offizielle Amts-iPhone, das er stattdessen erhielt, war so stark abgesichert, dass er nicht einmal mehr SMS verschicken konnte. IATA kritisiert Trumps Laptopverbot \nDie Internationale Luftverkehrs-Vereinigung (IATA) hat das von den USA und Grossbritannien verhängte Verbot elektronischer Geräte wie Laptops im Handgepäck auf vielen Flügen scharf kritisiert. Die neuen Regeln seien unakzeptabel und könnten dem Vertrauen der Passagiere in den Luftverkehr schaden, teilte der Branchenverband am Dienstag mit.«Welcher Bedrohung auch immer» die Massnahmen entgegenzuwirken versuchen sollten – langfristig seien sie keine akzeptable Lösung, sagte IATA-Chef Alexandre de Juniac in Montreal. Auch auf kurze Sicht sei es «schwer, ihre Effektivität zu verstehen».Das Verbot grösserer elektronischer Geräte auf bestimmten Flügen aus einigen Ländern des Mittleren Ostens und Nordafrikas führe zu ernsthaften geschäftlichen Verwerfungen für die Fluggesellschaften, sagte de Juniac.Sein Verband rufe die Regierungen auf, «mit der Industrie zusammenzuarbeiten, um das Fliegen sicher zu machen, ohne die Passagiere von ihren persönlichen elektronischen Geräten zu trennen», sagte der IATA-Chef. Er beklagte, dass es vor dem Erlass der neuen Handgepäck-Regeln keine Beratungen mit der Luftfahrtindustrie gegeben habe.Zudem fragten nun Passagiere und Airlines, warum Laptops auf einigen Flügen sicher sein und auf anderen – vom selben Flughafen – nicht. Es müsse die Möglichkeit geben, elektronische Gegenstände an den Kontrollpunkten der Flughäfen «effektiv» zu untersuchen, sagte de Juniac. Gesundheit \nDer US-Präsident zeigt sich sicher, dass es bald eine Einigung zur Gesundheitsvorsorge in den USA geben wird. «Ich weiss, dass wir alle ein Abkommen bei der Gesundheitsvorsorge abschliessen werden. Und das wird einfach», sagte Donald Trump bei einem Empfang von republikanischen und demokratischen Senatoren im Weissen Haus am Dienstag.Dass Vertreter beider Parteien bei dem Empfang waren, wertete Trump als gutes Zeichen. Er sehe auch viel Potenzial bei der Zusammenarbeit der Republikaner und Demokraten bei anderen Themen.Der Entwurf der Republikaner, um das als Obamacare bekannte Gesundheitsgesetz zu ersetzen, war in der vergangenen Woche gescheitert. (sda) Immunität \nUS-Präsident Donald Trump hat sich angesichts einer Klage wegen sexueller Belästigung aus seiner Reality-TV-Zeit auf seine Immunität berufen. Seine Anwälte trugen am Dienstag in einer Eingabe beim Obersten Gericht New Yorks vor, sie würden formell die Abweisung der im Januar vorgebrachten Beschuldigungen von Summer Zervos beantragen. Trump sei von der US-Verfassung gegen solche Klagen geschützt, solange er Präsident sei.Zervos war 2006 Teilnehmerin in Trumps Fernsehshow «The Apprentice». Sie klagte, nachdem sie auf einer Pressekonferenz gesagt hatte, Trump habe sie 2007 in einem Hotel in Beverly Hills unerwünscht sexuell kontaktiert. Trumps Anwälte erklärten, der Präsident weise diese «unbegründeten Beschuldigungen» zurück, die ein offensichtlich politisch motivierter Angriff seien. Spicer spricht mit Essensresten im Mund \nKurz nach dem Mittagessen sollte man besser nicht vor die Öffentlichkeit treten: Was Trump-Sprecher Sean Spicer am Montag bei der Medienkonferenz zwischen den Zähnen hatte, beschäftigte in den sozialen Medien mehr als das, was er sagte. Sean Spicer’s teeth are a sanctuary city for spinach. #PressBriefing pic.twitter.com/JgPelp2Qxx — Jose Antonio Ojeda (@ojedasbodega) March 27, 2017 «Sean Spicers Zähne sind ein Aufnahmezentrum für Spinat», spottete ein Twitter-User. Auch kursiert eine Fotomontage, die Spicers Kopf auf dem Körper der Spinat liebenden Comicfigur Popeye zeigt. Spicey the Sailor Man: \"I lie to the finish, while I eats me spinach!\" #PressBriefing #SpicerTeeth pic.twitter.com/uX1lbfcIsj — T.R. Morley (@TheRealMorley) March 27, 2017 Ein anderer User twitterte «Die perfekte Ablenkung. Ich war nur auf den Spinat fokussiert. Gut gemacht, Sean Spinat Spicer, gut gemacht.» Dekret gegen Klimawandel-Kampf \nUS-Präsident Donald Trump wird am Dienstag eine Exekutivanordnung unterzeichnen, die ein halbes Dutzend Anordnungen seines Vorgängers Barack Obama gegen den Klimawandel aussetzt, widerruft oder zur Überprüfung stellt. Dies sagte ein Vertreter des Weissen Hauses einem Reporter vor Ort. Zur Überprüfung soll demnach unter anderem der sogenannte Clean Power Plan stehen, der Treibhausgasemissionen von Kohlekraftwerken beschränkt.Ausserdem wird mit der Anordnung ein 14 Monate altes Moratorium aufgehoben, durch das bundesstaatliches Land nicht mehr zur Ablagerung von Kohle verpachtet werden konnte. Trump, der den Klimawandel als einen Schwindel bezeichnet hatte, hat die Regelungen zu Kohlekraftwerken wiederholt kritisiert. Er sieht in den Einschränkungen einen Angriff auf die amerikanischen Arbeiter und die Kohleindustrie.Bereits am Montag hob der Präsident weitere Verordnungen auf, die sein Vorgänger Obama erlassen hatte. Dabei ging es unter anderem um Regeln zur Einordnung der Leistung von Schulen und der Lehrerausbildung. Trump sagte, Lehrer, Eltern und einzelnen US-Staaten wüssten selbst, was gut für ihre Schüler sei. Auch eine Regulierung zu Arbeitnehmerrechten hob Trump mit der Bemerkung auf, dies werde «eine Menge Jobs retten». Für Einreiseverbot \n13 US-Staaten haben vor einem Bundesberufungsgericht ihre Unterstützung für das überarbeitete Einreiseverbot von Präsident Donald Trump erklärt. Der Republikaner habe rechtmässig im Interesse der nationalen Sicherheit gehandelt, erklärten sie in einem Schreiben an das vierte Bundesberufungsgericht in Virginia am Montag (Ortszeit). Sie forderten es auf, die Aussetzung des Einreiseverbots aufzuheben.Die Staaten argumentierten, dass Trumps Exekutivanordnung weder eine Religion erwähne noch dass die Regelung davon abhängig sei, ob betroffene Muslime seien. Daher sei das von Trump veranlasste Dekret kein Verbot für Muslime, erklärten der Gouverneur von Mississippi und die zwölf Generalstaatsanwälte von Alabama, Arizona, Arkansas, Florida, Kansas, Louisiana, Montana, Oklahoma, South Carolina, South Dakota, Texas und West Virginia. Abhör-Infos aus Weissem Haus \nDie Informationen über eine angebliche Geheimdienstüberwachung des Teams von US-Präsident Donald Trump sind offenbar aus dem Weissen Haus gekommen. Das sagte David Nunes, Sprecher des Vorsitzenden des Geheimdienstausschusses im Repräsentantenhaus, am Montag. Der Republikaner selbst bestätigte, auf dem Gelände des Weissen Hauses gewesen zu sein, als er die Hinweise bekam. Die Erkenntnis von Montag sorgte für Empörung unter hochrangigen Demokraten. Sie forderten, Nunes müsse sich aus dem Ausschuss zur Überprüfung mutmasslicher russischer Einflussnahme auf den US-Wahlkampf zurückziehen. Er sei offensichtlich voreingenommen und könne die Untersuchung nicht mehr objektiv vornehmen, erklärte der ranghöchste Demokrat im Geheimdienstausschuss, Adam Schiff. Richtungs-wechsel? \nDonald Trump ist nach seiner Niederlage bei der Abschaffung von «Obamacare» zu einer Zusammenarbeit mit den Demokraten bereit. Das sagte sein Sprecher Sean Spicer am Montag. Es handle sich dabei bis zum einem gewissen Grad um einen Kurswechsel.«Wir müssen sehen, wie wir unsere Mehrheiten bekommen», sagte Spicer. Der Präsident meine das durchaus ernst. Trump steht mit seinen angekündigten Vorhaben wie einer grossen Steuerreform und Investitionen in die Infrastruktur vor der Schwierigkeit, angesichts der Zerrissenheit der Republikaner möglicherweise keine parlamentarischen Mehrheiten zu erhalten.Eigentlich kontrollieren die Republikaner beide Parlamentskammern im US-Kongress. Aber am Freitag war ein Gesetz, das die Gesundheitsversicherung «Obamacare» ersetzen sollte, im Repräsentantenhaus am Widerstand innerhalb der Republikanischen Partei gescheitert.Verantwortlich waren vor allem die gut 30 Mitglieder des «Freedom Caucus», einer Gruppe sehr konservativer Abgeordneter. Würde Trump sie künftig aus Gesetzesvorhaben herausrechnen wollen, müssten für eine Mehrheit 18 Demokraten mit den Republikanern stimmen.Nächster Prüfstein ist die Finanzierung der US-Regierung, um einen drohenden Stillstand zu verhindern, einen so genannten «Government Shutdwon» wie zuletzt 2013. Stichtag ist bereits der 29. April, gleichzeitig der 100. Tag der Amtszeit Präsident Trumps. Angesichts kontinuierlicher, wochenlanger Angriffe Trumps auf die Demokraten bleibt abzuwarten, wie sie auf das Angebot reagieren. (sda) Telefon aus den USA \nUS-Präsident Donald Trump hat der deutschen Kanzlerin Angela Merkel zum Erfolg ihrer Partei CDU bei den Landtagswahlen im Saarland gratuliert. Die Glückwünsche habe Trump der Kanzlerin in einem Telefongespräch ausgesprochen, teilte der Sprecher des Weissen Hauses, Sean Spicer, am Montag in Washington mit.Dass ein US-Präsident einem Bundeskanzler zu Ergebnissen von Landtagswahlen gratuliert, ist eine eher ungewöhnliche Geste. Merkels Besuch bei Trump im Weissen Haus vor anderthalb Wochen war in unterkühlter Atmosphäre verlaufen.Für Wirbel sorgte eine Szene im Oval Office, als der Präsident auf die Bitte von Fotografen wie auch der Kanzlerin selbst, sich für ein Bild die Hände zu geben, nicht reagierte. Spicer sagte damals dem «Spiegel», Trump habe wohl die Frage nicht gehört. (sda) Neuer Posten für den Schwiegersohn \nPräsident Donald Trump will seine Regierung effizienter machen. Dabei soll eine neue Behörde helfen, besetzt mit Fachleuten aus Wirtschaft und Politik. Der Chef: Schwiegersohn Jared Kushner.Für die direkt dem Präsidenten unterstellte Taskforce soll ein Büro im Weissen Haus eingerichtet werden. Wie aus ranghohen Regierungskreisen verlautete, will Trump das sogenannte Büro amerikanischer Innovation am Montag vorstellen. Über die Pläne berichtete zuerst die Zeitung « Washington Post ».Das Team solle führende Talente aus Wirtschaft und Regierung zusammenbringen, sagte Kushner in einem Interview am Sonntag. «Die Regierung sollte geführt werden wie eine grosse amerikanische Firma. Wir hoffen, dass wir für unsere Kunden – die Bürger – Erfolg und Effizienz erreichen können.» Obamacare \nUS-Demokraten sind nach Angaben eines Senatsmitglieds bereit, für eine Reform des auch als Obamacare bekannten Gesundheitsgesetzes mit Republikanern zusammenzuarbeiten. Diese müssten jedoch einwilligen, dass das Gesetz nicht abgeschafft werde, sagte der demokratische Minderheitsführer im Senat, Chuck Schumer, im Fernsehsender ABC am Sonntag.«Wir haben nie gesagt, dass es (das Gesetz) perfekt ist. Wir haben immer gesagt, wir würden zusammenarbeiten, um es zu verbessern», so Schumer. Am Freitag hatten die Republikaner ihren Entwurf eines Gesundheitsgesetzes vor einer Abstimmung im Repräsentantenhaus zurückgezogen, weil sich abzeichnete, dass sie nicht die nötige Mehrheit bekommen würden. Für US-Präsident Donald Trump, der im Wahlkampf stets angekündigt hatte, Obamacare teils abzuschaffen und teils zu reformieren, war das eine herbe Niederlage. Gouverneur gegen Mauer \nDer kalifornische Gouverneur Jerry Brown hat ein «sehr hartes», strategisches Vorgehen gegen die von US-Präsident Donald Trump geplante Mauer an der Grenze zu Mexiko angekündigt. «Wir werden das menschlich Richtige machen. (...) So behandelt man Menschen nicht», sagte er in einem Interview mit dem US-Fernsehsender NBC am Sonntag mit Blick auf illegale Einwanderer. Diese sollen durch das Bauprojekt gestoppt werden. «Ich denke wir Amerikaner sollten sehr vorsichtig sein, wenn wir radikale Veränderungen wie eine neun Meter hohe Mauer vornehmen, die manche drinnen und manche draussen lässt.» Die Pläne erinnerten ihn zu sehr an die Berliner Mauer, sagte Brown. Verrat ans Vaterland \nDas Erzbistum Mexiko hat inländische Firmen, die am Bau der geplanten US-Grenzmauer mitwirken wollen, als Vaterlandsverräter kritisiert. Jedes Unternehmen, das beabsichtige in die «fanatische Trump-Mauer» zu investieren, werde als unmoralisch gesehen, ging aus einer Erklärung der Diözese am Sonntag hervor. Firmeneigentümer und Anteilseigner seien Verräter ihrer Heimat.Nach Angaben des Erzbistums haben sich manche Firmen bereit erklärt, Material und Arbeitskraft zur Verfügung zu stellen. Darunter seien Lieferanten von Zement, Farbe sowie Lichtanlagen. Der katholische Verwaltungsbezirk sagte, besonders überraschend sei die Scheu der mexikanischen Wirtschaftsbehörden, nicht stärker gegen die entsprechenden Betriebe vorzugehen. Krawalle bei Trump-Protesten \nUnterstützer und Gegner von US-Präsident Donald Trump sind bei einer Demonstration an einem Strand im Süden Kaliforniens aneinandergeraten. Gewalt sei ausgebrochen, als manche Trump-Gegner mit Pfefferspray umhergesprüht hätten, teilten die Behörden mit. Insgesamt hätten 30 Kritiker des Präsidenten 2000 Befürwortern gegenübergestanden.Nach Polizeiangaben wurden drei Personen festgenommen, weil sie das Spray illegalerweise eingesetzt haben sollen. Eine vierte Person werde der Körperverletzung verdächtigt und sei ebenfalls in Gewahrsam genommen worden. Zwei Menschen wurden leicht verletzt, hiess es.Einem Bericht der «Los Angeles Times» zufolge wurde ein Trump-Kritiker, der Pfefferspray genutzt haben soll, von einer Gruppe von Trump-Unterstützern zu Fall gebracht und getreten. Die protestierenden Gegner hatten vor der Demonstration angekündigt, den Aufmarsch der Trump-Unterstützer mit einer «menschlichen Mauer» stoppen zu wollen.Vor drei Wochen hatte es in der Nähe der Universität Berkeley Ausschreitungen gegeben, auch hier kam es zu Festnahmen. Reaktionen \nMit hämischen Kommentaren hat die Hollywood-Riege auf die Niederlage von US-Präsident Donald Trump bei seiner geplanten Gesundheitsreform reagiert. «So viel zu 'The Art of the Deal'», schrieb der Dokumentarfilmer Michael Moore am Freitag im Internetdienst Twitter und versah seinen Eintrag mit dem Hashtag #loser (Verlierer). Moore nahm damit Bezug auf Trumps Bestseller, der sich mit Unternehmererfolg und erfolgreichen Geschäftsabkommen beschäftigt. Trump has blinked. So much for the Art of the Deal. #loser @realDonaldTrump — Michael Moore (@MMFlint) 24. März 2017 Der republikanische Vorsitzende des Repräsentantenhauses, Paul Ryan, entschuldige sich nun dafür, «es nicht geschafft zu haben», das Leben von Millionen Amerikanern zu zerstören, fuhr der schadenfreudige Moore fort. Der parteiunabhängige Rechnungshof des Kongresses hatte geschätzt, dass unter dem republikanischen Modell die Zahl der Bürger ohne Krankenversicherung bis zum Jahr 2026 um 24 Millionen steigen könnte. Found outside Trump Tower! pic.twitter.com/n8l4BWaPWs — Bette Midler (@BetteMidler) 24. März 2017 Die Sängerin und Schauspielerin Bette Midler veröffentlichte das Bild eines Einmalhandschuhs, der den Mittelfinger ausstreckt. «Gerade vor dem Trump Tower gefunden», schrieb sie dazu. Der Musiker und Schauspieler John Legend sprach von einem «wahren Sieg» und dankte allen, die sich gegen «Trumpcare» gestellt hätten. Bryan Cranston, bekannt aus der Serie «Breaking Bad», dankte wiederum Obama. Ohne ihn würden die Republikaner «gar nicht darüber nachdenken, überhaupt eine Gesundheitsversorgung anzubieten». Ivanka Trump \nDie Tochter von US-Präsident Donald Trump, Ivanka Trump, plant nach einem Bericht des Magazins « Spiegel » demnächst einen Besuch in Deutschland.Hintergrund ist demnach eine Einladung deutscher Wirtschaftsvertreter, die Kanzlerin Angela Merkel vor gut einer Woche bei ihrem Besuch in Washington begleitet hatten. Ivanka Trump wolle sich in Deutschland berufliche Ausbildungszentren ansehen, um sich über das System der dualen Berufsausbildung zu informieren.Von Merkel, die sich während ihrer Visite auch mit Ivanka Trump unterhalten hatte, wird die Einladung laut «Spiegel» ausdrücklich unterstützt. Die Präsidenten-Tochter ist im Regierungsteam ihres Vaters auch offiziell an den Vorbereitungen für den G20-Gipfel im Juli in Hamburg beteiligt. Auch hier sollen Bildungsfragen eines der Themen sein. Einwanderung \nDer US-Bundesstaat New York hat eine Initiative gestartet, mit der vor allem illegale Einwanderer Rechtsbeistand bekommen sollen. Ein Bündnis aus 182 Verbänden, Organisationen, Anwaltskanzleien und Jurastudenten werde solchen Einwanderern juristische Hilfe zukommen lassen, «die von den jüngsten Änderungen in der Einwanderungspolitik bedroht sind», hiess es am Freitag in einer Erklärung des Bündnisses.«New York ist ein Leuchtfeuer der Hoffnung und der Möglichkeiten für alle, und Einwanderer waren schon immer Teil des Gebildes dieses grossartigen Staates», erklärte Gouverneur Andrew Cuomo (Bild). «In diesen stürmischen Zeiten ist es wichtig, dass alle New Yorker Zugang zu all ihren Rechten unter dem Gesetz haben.»Das Projekt wird vom Staat New York koordiniert. Anwälte und Rechtsanwaltsgehilfen werden im Rahmen der Initiative ihre Freizeit für die Beratung der Einwanderer nutzen. Für das Projekt kamen eine Million Dollar aus öffentlichen und privaten Quellen zusammen. Shia LaBeoufs Installation wieder abgebrochen \nEine Anti-Trump-Kunstinstallation von Hollywood-Schauspieler Shia LaBeouf und zwei anderen Künstlern ist zum vierten Mal vorzeitig beendet worden. Nach nur einem Tag wurde das umstrittene Projekt «He Will Not Divide Us» (Er wird uns nicht spalten) auch im britischen Liverpool abgebrochen. Das Liverpooler Kunstzentrum FACT erklärte zu seiner Entscheidung, es habe auf den Rat der Polizei reagiert.Das Projekt begann zu Donald Trumps Amtsantritt als US-Präsident am 20. Januar vor dem New Yorker Museum of the Moving Image und sollte eigentlich während des gesamten vierjährigen Mandats laufen. In der Zeit sollten Besucher vor einer Webcam den Satz «He Will Not Divide Us» skandieren, die Aktion sollte live im Internet zu verfolgen sein.Doch nach einer Reihe von Auseinandersetzungen mit Trump-Anhängern beendete das Museum nach drei Wochen das Projekt wieder mit dem Argument, es habe zur Gewalt angestiftet und sei zweckentfremdet worden. Die Installation zog weiter vor ein Kino von Albuquerque (New Mexiko), wo sie nach knapp einem Monat nach Zwischenfällen erneut abgebrochen wurde. Daraufhin änderte die Künstler das Projekt: Nun wehte vor der Webcam eine Fahne mit demselben Spruch – an einem unbekannten Ort. Dennoch gelang es ultrarechten Aktivisten, sie zu stehlen. Nach Kritik des Künstlerkollektivs an der bedrohten Existenz derartiger Projekte in den USA erklärte sich schliesslich das Liverpooler FACTS-Zentrum am Mittwoch bereit, der Fahne Asyl zu gewähren. Doch schon am Freitag war damit wieder Schluss – offenbar, weil zwei Maskierte auf das Dach des Zentrums geklettert waren. Luxemburg warnt Washington \nDas Weisse Haus hat der Europäischen Union zum 60. Jubiläum der Römischen Verträge und der Gründung der Europäischen Wirtschaftsgemeinschaft gratuliert. «Unsere zwei Kontinente teilen gemeinsame Werte», hiess es in einer Mitteilung aus der Pressestelle des Weissen Hauses. Gemeinsam blicke man 60 weiteren Jahren gemeinsamer Sicherheit und gemeinsamen Wohlstandes entgegen. Der Jahrestag wird unter anderem am Samstag mit einem EU-Gipfel in Rom begangen.Luxemburgs Ministerpräsident Xavier Bettel hatte zuvor die Warnung in Richtung des US-Präsidenten Donald Trump geäussert, der EU nicht die kalte Schulter zu zeigen. «Herr Trump wird sehr schnell lernen, dass die EU nicht ein Haufen von 27 Supermärkten ist, an deren Türen man klopfen und Geschäfte machen kann», sagte Bettel in einem Interview mit der Nachrichtenagentur AP. Wenn Trump denke, er brauche Europa nicht, wäre das ein Verlust für beide Seiten.Trump hatte in den vergangenen Monaten einige EU-Regierungschefs unter anderem mit der öffentlichen Unterstützung für den Austritt Grossbritanniens aus der EU verärgert.Grossbritanniens Premierministerin Theresa May wird an dem EU-Gipfel in Rom nicht teilnehmen. Kalifornien zeigt Trump die Zähne \nIn den USA bahnt sich zwischen der Regierung in Washington und dem Bundesstaat Kalifornien ein handfester Konflikt über Abgasvorschriften an. Die kalifornische Umweltbehörde beschloss am Freitag ihre Emissionsvorgaben für die Jahre 2022 bis 2025.Ein Vertreter des US-Präsidialamts äusserte sich enttäuscht. Mit diesem Schritt habe Kalifornien ein Kooperationsangebot Washingtons ausgeschlagen. Der Regierung von Präsident Donald Trump gehe es darum, heimische Arbeitsplätze zu schützen und den Verbrauchern erschwingliche Autos zu ermöglichen.Vergangene Woche hatte die Bundesumweltbehörde EPA auf Drängen der Autoindustrie eine Prüfung der Emissionsziele für 2022 bis 2025 angekündigt. Rund ein Dutzend Bundesstaaten übernimmt üblicherweise die kalifornischen Umweltstandards für Autos zumindest in Teilen. Ein Streit zwischen den Behörden könnte für die Hersteller teuer werden und Auto-Käufern Kopfzerbrechen bereiten. Umstrittene Pipeline bewilligt \nDie US-Regierung unter Donald Trump bewilligt die umstrittenen Pipeline Keystone XL, die Öl von Kanada quer durch die USA bis nach Texas pumpen soll. In Abkehr einer Entscheidung des damaligen Präsidenten Barack Obama erklärte das Aussenministerium am Freitag, das Projekt liege im nationalen Interesse der USA. Präsident Trump unterzeichnete am Freitag die Bewilligung. If only there were other pipelines to compare the Keystone XL to. pic.twitter.com/YyJzVTp2dX — Kevin G. (@CacklingPoptart) March 24, 2017 «Das wird eine wunderbare Pipeline», sagte Trump. Der Öltransport über eine Pipeline sei viel sicherer als auf anderen Wegen. Der kanadische Premierminister Justin Trudeau begrüsste die Entscheidung. «Wir sind sehr erfreut über die Ankündigung der USA», sagte Trudeau zu Journalisten. «Wir wissen schon seit langem, dass es für Jobs und Wirtschaftswachstum in Kanada wichtig ist, dass wir unsere Ressourcen auf sichere und verantwortungsbewusste Art und Weise zum Markt bekommen.»Obama hatte das Projekt nach langem Streit gestoppt. Trump machte die Wiederaufnahme per Dekret möglich. Obamas Klimapolitik setzte auf erneuerbare Energien, Trump will fossile Energieträger fördern. Schwarze Liste \nChefstratege Steve Bannon rät Trump zu einer Schwarzen Liste. Auf dieser sollen die Namen jener Republikaner stehen, die für die Niederlage von Trumpcare gearbeitet haben. Das berichtet « TheDailyBeast ».Gemäss mehreren Funktionären der Trump-Administration sei der Präsident wütend darüber, das sein erster gesetzgebender Push vor seinen Augen zerbröckelt wird. «Er will jene loswerden, die sich gegen ihn stellen. Bin nicht sicher ob ich es eine Feindes-Liste nennen würde, aber ich bin sicher, dass ich nicht darauf stehen will», wird einer der Beamten zitiert. Von offizieller Seite soll es geheissen haben, dass Bannon und Trump eine eindeutige Haltung in diesem Prozess eingenommen haben: «Entweder seid ihr für oder gegen uns». Manafort tritt vor Kongressausschuss \nDer ehemalige Wahlkampfleiter von US-Präsident Donald Trump, Paul Manafort, ist im Rahmen einer Untersuchung zu angeblicher Einmischung Russlands in die Wahl 2016 zu einem Gespräch mit dem Geheimdienstausschuss des Repräsentantenhauses bereit. Das teilte der Vorsitzende des Ausschusses, der republikanische Abgeordnete Devin Nunes, am Freitag mit.Der Geheimdienstausschuss untersucht, ob es Verbindungen zwischen Trump-Mitarbeitern und Russland gibt. Nunes sagte zu Reportern, Manaforts Anwalt habe den Ausschuss am Donnerstag kontaktiert, um Abgeordneten die Möglichkeit zu bieten, ihn zu befragen. Ob die Befragung in einem öffentlichen Forum oder hinter verschlossenen Türen stattfinden werde, wisse er nicht.Die Nachrichtenagentur AP hatte in dieser Woche berichtet, dass Manafort vor seinem Beitritt zum Trump-Wahlkampfteam heimlich für einen russischen Milliardär gearbeitet hatte. Er machte auch einen Vorschlag, der darauf abzielte, der Regierung in Moskau von Nutzen zu sein. Trump droht Republikanern \nUS-Präsident Donald Trump hat im Ringen um die Pläne zur Beseitigung der Gesundheitsreform seines Vorgängers Barack Obama der eigenen Partei gedroht. Vor einer auf Freitag verschobenen Abstimmung über seine Gesetzesvorlage liess Trump die Rebellen in den eigenen Reihen wissen, dass es «bei Obamacare bleiben wird», wenn es im Repräsentantenhaus keine Zustimmung gebe, wie der republikanische Abgeordnete Chris Collins am Donnerstagabend im Kongress sagte.«Wenn das scheitert, werden wir zu anderen Dingen als der Gesundheit übergehen», fasste der republikanische Abgeordnete Chris Collins den in einer Dringlichkeitssitzung versammelten Parteifreunden Trumps ultimatumartige Botschaft zusammen.Zuvor war in letzter Minute in der Kongresskammer die Abstimmung über den von Trump unterstützten Plan zur Abschaffung des als «Obamacare» bezeichnete Systems vertagt worden. Die Fraktionsspitze von Trumps Republikanischer Partei entschloss sich zur Verschiebung der ursprünglich für Donnerstagabend angesetzten Abstimmung, da sich weiterhin eine grössere Zahl von republikanischen Abgeordneten der Gesetzesvorlage widersetzte. Damit fehlte die Mehrheit für den von der Fraktionsführung vorgelegten Plan. Er sieht vor, Obamacare durch ein stärker marktwirtschaftlich ausgerichtetes Modell zu ersetzen. — Donald J. Trump (@realDonaldTrump) 23. März 2017 Noch wenige Minuten vor Bekanntgabe der Verschiebung hatte Trump zuversichtlich erklärt, dass die Kongresskammer noch am Donnerstag das «Desaster namens Obamacare» abschaffen werde. Die Ablösung des Systems durch ein neues Modell mit deutlich weniger staatlichen Regulierungen ist eines von Trumps zentralen Wahlkampfversprechen.Obamacare war vor genau sieben Jahren in Kraft getreten. Das System wurde von den Republikanern von Anfang an vehement bekämpft. Über Obamacare sind inzwischen 20 Millionen US-Bürger krankenversichert, der Anteil der Bürger ohne Krankenversicherung sank von 16 Prozent auf neun Prozent. Das republikanische Ersatzmodell sieht nun vor, die allgemeine Versicherungspflicht wieder abzuschaffen und die staatlichen Zuschüsse und Programme zu kürzen. Disastrous #Obamacare has led to higher costs & fewer options. It will only continue to get worse! We must #RepealANDReplace . #PassTheBill — President Trump (@POTUS) 24. März 2017 Moderaten Republikanern geht der Plan jedoch zu weit. Laut einer Schätzung des parteiunabhängigen Rechnungshofs des Kongresses (CBO) würde dadurch die Zahl der Bürger ohne Krankenversicherung im kommenden Jahr wieder um 14 Millionen steigen, bis zum Jahr 2026 um 24 Millionen. Friedman wird Botschafter in Israel \nDer rechtsgerichtete Hardliner David Friedman wird US-Botschafter in Israel. Der Senat in Washington stimmte der Nominierung des jüdischen Rechtsanwalts zu. Für ihn stimmten 52 Senatoren, 46 votierten gegen ihn.Der von US-Präsident Donald Trump ernannte Friedman steht mit seinen Positionen zum Nahost-Konflikt der israelischen Rechten nahe. Er wird nicht nur von den oppositionellen US-Demokraten, sondern auch linksgerichteten jüdischen Gruppierungen in den Vereinigen Staaten heftig kritisiert.Der israelische Ministerpräsident Benjamin Netanyahu zeigte sich hingegen erfreut über die Bestätigung von Friedmans Nominierung. Dieser werde als «enger Freund Israels» herzlich empfangen werden, schrieb Netanyahu im Kurzbotschaftendienst Twitter. New US ambassador to Israel David Friedman will be warmly welcomed as President Trump's representative and as a close friend of Israel. — Benjamin Netanyahu (@netanyahu) 23. März 2017 Friedman befürwortet die Ausweitung der jüdischen Siedlungen in den besetzten Palästinensergebieten sowie die Verlegung der US-Botschaft von Tel Aviv nach Jerusalem. Die Siedlungsfrage sowie der Status von Jerusalem gehören zu den strittigsten Fragen des Nahost-Konflikts. Während Israel Jerusalem als seine unteilbare Hauptstadt betrachtet, wollen die Palästinenser Ost-Jerusalem zur Hauptstadt ihres künftigen Staates machen. Friedman hat jedoch auch das Ziel eines Palästinenserstaates in Frage gestellt. Er wirkte als Berater für Trumps Wahlkampagne und hat die Positionen des heutigen Präsidenten offenbar stark beeinflusst. So distanzierte Trump sich Mitte Februar bei einem Treffen mit Netanyahu von der Zwei-Staaten-Lösung als unentbehrlicher Grundlage des Friedensprozesses. Damit ist das Ziel der friedlichen Ko-Existenz des israelischen Staates mit einem künftigen Palästinenserstaat gemeint. Der US-Präsident sagte, diese Lösung sei nicht die einzige Möglichkeit für einen Friedensschluss. Während des Wahlkampfs hatte Trump auch für die Verlegung der Botschaft nach Jerusalem plädiert. Diese Position hat er seit Amtsantritt allerdings relativiert. Die Entscheidung über den Sitz der Botschaft sei «nicht leicht», sagte er während eines Netanyahu-Besuchs in Washington. Richter bedroht \nDer für die Aussetzung des umstrittenen US-Einreiseverbots verantwortliche Bundesrichter wird nach FBI-Angaben bedroht. Der Behörde seien Berichte bekannt, nach denen Richter Derrick Watson aus Hawaii Nachrichten mit Drohungen bekäme, sagte eine Sprecherin des FBI. Falls nötig, seien die Beamten auf einen Einsatz vorbereitet. Watson hatte die Anordnung von US-Präsident Donald Trump vorläufig ausgesetzt. Damit dürfen Staatsbürger aus sechs islamischen Ländern weiterhin in die USA einreisen, auch wenn das Dekret das Gegenteil vorsah. Trump wusste nichts von Manaforts Arbeit \nUS-Präsident Donald Trump hat nach Angaben des Weissen Hauses nicht gewusst, dass sein früherer Wahlkampfchef Paul Manafort für einen russischen Milliardär gearbeitet hat. Es gebe jedoch auch keine Hinweise, dass Manafort damit regelwidrig gehandelt habe, sagte Regierungssprecher Sean Spicer. Ausserdem sei die in einem Bericht der Nachrichtenagentur AP beschriebene geheime Arbeit im «vergangenen Jahrzehnt» geschehen.Manafort hat nach AP-Informationen vor zehn Jahren heimlich für den russischen Aluminiumindustriellen Oleg Deripaska gearbeitet und dabei auch die Regierung von Präsident Wladimir Putin unterstützt. Demnach schlug Manafort eine politische Strategie vor, um die antirussische Opposition in früheren Sowjetrepubliken zu untergraben. Seine Tätigkeit scheint Aussagen der Trump-Regierung und von Manafort selbst zu widersprechen, dass er niemals für russische Interessen gearbeitet habe.Manafort bestätigte unterdessen seine Arbeit für Deripaska. Es sei aber unfair, die Tätigkeit als nicht angemessen darzustellen. Er war Mitte August als Wahlkampfleiter des späteren Präsidenten Trump zurückgetreten, nachdem Kritik an seiner vorherigen Arbeit, unter anderem für prorussische Politiker in der Ukraine, laut geworden war. Richter-Kandidat beruhigt Demokraten \nDer Kandidat für das höchste Richteramt in den Vereinigten Staaten, Neil Gorsuch, hat Demokraten versichert, dass es kein Zurück in alte Zeiten geben werde. Von einer demokratischen Senatorin gefragt, ob er für die Einschränkung von Abtreibung stimmen würde, sagte er, niemand wolle das Land «zu den Tagen von Pferden und Kutschen» zurückbringen.Er wiederholte zudem seine Aussage, dass er «entmutigt» von den Angriffen des US-Präsidenten Donald Trump auf die Justiz gewesen sei, als dessen erstes Einreiseverbot vorläufig ausgesetzt wurde. Trump hatte den Richter, der seine Anordnung gestoppt hatte, als «sogenannten Richter» bezeichnet.Gorsuch ist für einen vakanten Richterposten am Supreme Court nominiert, eine Abstimmung darüber dürfte Anfang April im Senat erfolgen. Für Donnerstag sind andere Zeugen vorgesehen – für gewöhnlich sind das frühere Kollegen und Interessensvertretungen, die für oder gegen den Kandidaten aussagen. Nato-Termin für US-Aussenminister verschoben \nNato-Generalsekretär Jens Stoltenberg hat sich zuversichtlich gezeigt, dass ein Treffen der Nato-Aussenminister zugunsten einer Teilnahme des Chefs des US-State Departments, Rex Tillerson, verschoben werden kann. Beide hätten vereinbart, dass ihre Mitarbeiter einen neuen Termin abstimmen sollten, sagte Stoltenberg der Nachrichtenagentur AP am Rande eines Anti-Terror-Treffens in Washington. Aus Kreisen hatte es zuvor geheissen, bei den für April geplanten Gesprächen werde Tillerson sich vertreten lassen. Trump fordert schnelle Gerichtsentscheide \nIm Streit um das Einreiseverbot hat die Regierung von US-Präsident Donald Trump ein Bundesberufungsgericht zum schnellen Handeln aufgefordert. Es ginge um eine Frage von nationaler Wichtigkeit, Anhörungen sollten so schnell wie möglich stattfinden, hiess es in Dokumenten, die beim vierten Bundesberufungsgericht in Virginia eingereicht wurden.Gerichte in Maryland und Hawaii hatten das überarbeitete Einreiseverbot vor rund einer Woche ausgesetzt. Damit können Staatsbürger aus sechs überwiegend muslimisch geprägten Ländern weiter in die Vereinigten Staaten einreisen, auch wenn die Anordnung des US-Präsidenten eigentlich das Gegenteil vorsieht. Kritiker des Einreiseverbots argumentieren, dass es die Verfassung des Landes verletze. Geheimdienst-Visier \nIn der verschlungenen Affäre um angebliches Abhören von US-Präsident Donald Trump vor seiner Amtseinführung sind plötzlich neue Thesen aufgetaucht. Es sei möglich, dass Gespräche von Trump und seiner Mitarbeiter durch routinemässige Abhöraktionen mitgeschnitten worden seien, sagte der Vorsitzende des Geheimdienstausschusses im US-Repräsentantenhaus, Devin Nunes (Bild: Getty Images).Trump hatte seinem Amtsvorgänger Barack Obama vorgeworfen, dieser haben ihn in seinem Wahlkampf-Hauptquartier im Trump-Tower in New York abhören lassen. Die US-Geheimdienste verneinten dies. Die Bundespolizei FBI untersucht unterdessen weiter mögliche Verbindungen des Trump-Teams zur russischen Regierung.Präsident Trump, der über die neuen Erkenntnisse von Nunes im Weissen Haus informiert worden war, sagte, er empfinde «so etwas wie eine Rehabilitierung». Allerdings sagte Nunes auch, dass die Vorwürfe gegen Obama weiterhin haltlos seien. «Normales, zufälliges Sammeln» Nunes sagte nun, er selbst habe beim Sichten von ihm zugeleiteten Geheimdienstunterlagen bemerkt, dass es offenbar zufällig gesammelte Informationen gegeben habe. «Das ist normales, zufälliges Sammeln», sagte Nunes. Es scheine sich um legal erlangte Informationen zu handeln.Der US-Abhördienst NSA zeichnet routinemässig Gespräche auf, die führende US-Amerikaner mit ausländischen Repräsentanten führen. In den verschriftlichten Versionen werden die Namen jedoch nicht genannt. Es sei zu befürchten, dass in diesem Falle eine Demaskierung stattgefunden habe, sagte Nunes.Über die Affäre unerlaubter Kontakte zu ausländischen Regierungen war bereits Trumps früherer Sicherheitsberater Michael Flynn gestolpert. Er hatte nach wenigen Wochen im Amt zurücktreten müssen, weil er noch vor Amtsantritt mit dem russischen Botschafter Gespräche über Sanktionen geführt und dies verheimlicht hatte.Untersucht wird auch die Rolle von Trumps früherem Wahlkampfmanager Paul Manafort, dem Kontakte nach Russland und in die Ukraine nachgesagt werden. Rolle von Tillersons Frau \nAls Rex Tillerson, der damalige Chef des US-Erdölkonzerns ExxonMobil, in den Trump Tower nach New York beordert wurde, hatte er den angehenden Präsidenten laut seinen eigenen Angaben zuvor noch nie getroffen. Tillerson selber habe den Posten als Aussenminister auch nicht angestrebt. «Ich wollte den Job nicht, ich habe mich nicht darum bemüht», sagt er der « Independent Journal Review » (IJR). Weshalb er die Berufung trotzdem angenommen hat? «Meine Frau hat gesagt, ich müsse das machen», erklärt Tillerson. Er sei auch überrascht gewesen, als ihn Donald Trump nach einem Gespräch «über die Welt» fragte, ob er Aussenminister werden wolle. Nach einer mehr als 40-jährigen Karriere bei ExxonMobil wollte er mit 65 eigentlich in Pension gehen, sich auf seine Ranch zurückziehen und sich um seine Enkelkinder kümmern. Bild: Rex Tillerson (Mitte), seine Frau Renda (l.) und US-Präsident Donald Trump bei Tillersons Vereidigung als Aussenminister. (AP Photo/Carolyn Kaster, 1. Februar 2017) Trump und Ryan in Gesundheitsmission \nUS-Präsident Donald Trump und der republikanische Vorsitzenden des Repräsentantenhauses, Paul Ryan, haben die Abgeordneten ihrer Partei aufgerufen, für den Entwurf des Gesundheitsgesetzes zu stimmen. Das Votum am Donnerstag sei entscheidend, sagte Trump bei einem Fundraising-Abendessen der Republikaner der Kongresskammer am Dienstag in Washington. Die Lösungen der Konservativen aus dem Wahlkampf müssten nun auch umgesetzt werden, so Trump. «Es ist Zeit, an die Arbeit zu gehen und die Sache zu erledigen.»Auch Ryan versuchte, die Abgeordneten kurz vor der Abstimmung nochmals auf Kurs zu bringen. «Donnerstag ist der grosse Tag», sagte der republikanische Vorsitzenden des Repräsentantenhauses. Mit dem republikanischen Entwurf soll das Gesundheitsgesetz von Ex-Präsident Barack Obama, die sogenannte Obamacare, aufgehoben und ersetzt werden. Der Gesetzentwurf hat Kritik von sowohl Konservativen als auch Gemässigten innerhalb des von Republikanern geführten Repräsentantenhauses hervorgerufen.Republikaner hätten seit Jahren für diesen Moment gearbeitet, sagte Ryan. Seine Partei müsse nun abliefern, was sie zuvor versprochen habe, um «diesen Obamacare-Albtraum ein für alle Mal zu beenden.» Nato-Generalsekretär trifft Trump \nNato-Generalsekretär Jens Stoltenberg wird US-Präsident Donald Trump am 12. April in Washington treffen. Es handele sich um die erste persönliche Begegnung der beiden seit dem Amtsantritt des US-Präsidenten, teilte die Nato am Dienstagabend in Brüssel mit. «Sie werden darüber diskutieren, wie wichtig eine starke Nato für kollektive Verteidigung und für Stabilität über die Grenzen der Allianz hinaus ist», hiess es weiter. Die Nato legte zudem das Datum für ihren kommenden Gipfel auf den 25. Mai fest, wie eine Sprecherin mitteilte. Zuvor hatte US-Aussenminister Rex Tillerson mitteilen lassen, dass er nicht am nächsten Treffen mit seinen Nato-Kollegen Anfang April teilnehmen werde. Er werde bei dem Treffen durch Staatssekretär Tom Shannon vertreten, hiess es. Die Nato-Aussenminister halten am 5. und 6. April in Brüssel ihre halbjährliche Zusammenkunft ab. Trump hatte das Militärbündnis noch Mitte Januar als «obsolet» bezeichnet und zu geringe Verteidigungsausgaben der europäischen Verbündeten kritisiert. Ausserdem beklagte er ein zu geringes Engagement der Allianz im Anti-Terrorkampf. Gorsuch erneut vor Justizausschuss \nNeil Gorsuch, der Wunschkandidat von US-Präsident Donald Trump für den vakanten Posten am Obersten Gerichtshof, hat sich am Dienstag erneut den Fragen des Justizausschusses gestellt. Zu einer Positionierung zur Frage gedrängt, ob Trump Folter als Verhörmethode seines Landes wiedereinführen könnte, sagte er: «Niemand steht über dem Gesetz.»Gorsuch musste sich am zweiten Tag seiner Bestätigungsanhörung zu einer Reihe von Themen äussern. Die Demokraten versuchten, ihn zum Enthüllen seiner Standpunkte zur Abtreibung, Waffengesetzen und anderen Streitthemen zu bringen – meist vergeblich.Gorsuch bestand darauf, er bleibe während der Urteilsfindung stets unvoreingenommen. Während die Demokraten versuchten, ihn Trump nahezustellen, sprachen ihm die Republikaner um Senator Lindsey Graham Neutralität zu.Der Justizausschuss entscheidet bei Nominierungen für den Obersten Gerichtshof traditionell darüber, ob er den Kandidaten empfiehlt oder nicht. Die endgültige Entscheidung liegt dann beim kompletten Senat. Republikaner haben erklärt, dass sie Gorsuch gerne vor einer zweiwöchigen Pause des Kongresses am 7. April bestätigt sähen. Die Anhörung Gorsuchs ist auf vier Tage angesetzt. Grossbritannien folgt den USA \nFluggäste dürfen auf bestimmten Strecken nach Grossbritannien künftig keine Laptops oder andere grössere Elektronikgeräte mehr im Handgepäck mit sich führen. Das teilte die britische Regierung von Premierministerium Theresa May mit, nachdem zuvor die US-Regierung ein ähnliches Verbot verkündet hatte.Die britische Massnahme gilt für Direktflüge aus den sechs Ländern Türkei, Libanon, Jordanien, Ägypten, Tunesien und Saudi-Arabien. Nicht erlaubt seien «jegliche Telefone, Laptops oder Tablets, die grösser als ein normal grosses Mobiltelefon oder Smartphone sind», hiess es.Die US-Regierung hat Passagieren auf Flügen aus acht überwiegend islamischen Ländern verboten, Laptops und andere grössere Elektronikgeräte an Bord von Direktflügen in die USA zu bringen. Einige Fluggesellschaften im Nahen Osten begannen damit, ihre Fluggäste darüber in Kenntnis zu setzen. Das Weisse Haus hat die Massnahme mit der Gefahr möglicher Anschläge begründet. Ob es eine konkrete Terrordrohung gegen die USA oder Grossbritannien gibt, wurde nicht bekannt. Cameron witzelt über Abhörvorwürfe \nDer frühere britische Premierminister David Cameron hat gescherzt, dass er ausspionierte Konversationen von US-Präsident Donald Trump nicht mehr hören muss. «Nur um das klar zu machen, das ist ein Witz», sagte er laut der Zeitung «Providence Journal» bei einer Ansprache vor 2000 Menschen in der Brown University in Rhode Island am Montag. Die von Briten und Amerikanern geteilten Werte würden Nationalismus und Isolationismus überdauern, sagte er. Als Werte führte er Freiheit, Gleichberechtigung und Gerechtigkeit auf.Bei seinem spassigen Spruch bezog sich Cameron auf unbegründete Behauptungen des Weissen Hauses, der britische Geheimdienst GCHQ habe dem früheren US-Präsidenten Barack Obama geholfen, den Republikaner Trump im Wahlkampf auszuspionieren. FBI-Chef James Comey hat am Montag vor einem Ausschuss des Senats gesagt, er habe keine Informationen über eine entsprechende Abhörung.Cameron trat im vergangenen Jahr zurück, nachdem er die Briten nicht davon überzeugen konnte, bei einem Referendum im Juni mehrheitlich gegen den Austritt aus der Europäischen Union zu stimmen. Grossbritannien kündigte am Montag an, die Scheidungsverhandlungen am 29. März einzuleiten. Verbot von Elektrogeräten \nFlugreisende aus acht Ländern des Nahen Ostens und Nordafrikas dürfen bei Flügen in die USA künftig keine Laptops und anderen grossen elektronischen Geräte mehr ins Handgepäck nehmen. Die US-Behörden begründeten das Verbot heute mit dem Risiko von Anschlägen: Erkenntnisse der Geheimdienste deuteten darauf hin, dass Extremisten versuchen könnten, Sprengsätze in derartigen Geräten an Bord zu schmuggeln, sagte ein Regierungsvertreter in Washington.Das Verbot bezieht sich auf Geräte, die grösser sind als Handys - also etwa Laptops, Tablet-Computer, Spielekonsolen und Kameras. Diese müssen künftig beim Check-in mit dem Gepäck abgegeben werden. Mobiltelefone dürfen weiter mit an Bord genommen werden. 96 Stunden Zeit für Umsetzung Die Massnahme gilt für zehn Flughäfen - unter ihnen stark frequentierte Drehkreuze wie der Atatürk-Flughafen in Istanbul, die Flughäfen von Doha, Abu Dhabi und Dubai am Persischen Golf, der Mohammed-V-Flughafen in Casablanca und der Flughafen von Kairo. Den neun betroffenen Fluggesellschaften sei heute Morgen 96 Stunden Zeit gegeben worden, das Verbot umzusetzen, sagte der US-Regierungsvertreter.In der Nacht hatten bereits die Fluglinien Saudi Airlines und Royal Jordanian die neuen Bestimmungen über den Kurzbotschaftendienst Twitter bekannt gegeben. Die Mitteilungen wurden später gelöscht. Es gab Spekulationen, die Information sei zu früh öffentlich gemacht worden.Das US-Ministerium für Innere Sicherheit erklärte, «mögliche Sicherheitsvorkehrungen» nicht zu kommentieren. «Zu gegebener Zeit» werde es aber eine aktualisierte Information diesbezüglich geben.Der Sender CNN berichtete unter Berufung auf einen US-Beamten, das Verbot stehe möglicherweise in Zusammenhang mit einer Bedrohung durch das Terrornetzwerk Al-Kaida auf der Arabischen Halbinsel (AQAP).US-Präsident Donald Trump hatte zuletzt Einreiseverbote für Bürger aus mehrheitlich muslimischen Staaten verhängt, die jedoch zwei Mal von Gerichten ausgesetzt wurden. Tochter Ivanka zieht ins Weisse Haus \nIvanka Trump, Tochter des US-Präsidenten, soll einem Bericht des Magazins «Politico» zufolge eigene Büroräume im West-Flügel des Weissen Hauses bekommen. Noch diese Woche solle die 35-Jährige mit Kommunikationsmitteln der Regierung ausgerüstet werden.Eine offiziellen Posten habe sie jedoch nicht, berichtet das Magazin unter Berufung auf den Anwalt der Trump-Tochter, Jamie Gorelick. Ivanka Trumps Ehemann Jared Kushner arbeitet bereits als Trumps Berater im Weissen Haus.Dass Staats- oder Regierungschefs demokratisch nicht legitimierte Familienmitglieder ohne offizielle Rolle in die Regierungsgeschäfte einbeziehen, ist in westlichen Demokratien nicht üblich. Ivanka Trump werde keine Bezahlung erhalten und sich an alle Ethik-Regeln halten, die auch für offizielle Regierungsbedienstete gälten, sagte ihr Anwalt.Sie soll nicht vereidigt werden. «Ein erwachsenes Kind des Präsidenten zu haben, das aktiv in die Regierung eingebunden ist, ist Neuland», räumte er ein. Neues Gesundheitsgesetz \nUS-Präsident Donald Trump hat bei einer Kundgebung im US-Staat Kentucky für Unterstützung des republikanischen Entwurfs eines Gesundheitsgesetzes geworben. «Das ist unsere langersehnte Chance, endlich Obamacare loszuwerden», sagte Trump vor Tausenden Menschen in Louisville. Bevor grosse Steuersenkungen vorgenommen werden könnten, müsste das «Disaster», das Gesundheitsgesetz seines Vorgängers Barack Obama, ersetzt werden.Trump trat gemeinsam mit dem republikanischen Mehrheitsführer und Abgeordneten für den Staat, Mitch McConnell, auf. Trump soll am Dienstag persönlich bei republikanischen Abgeordneten im Repräsentantenhaus für den Entwurf werben, der für viel Diskussion innerhalb der Partei geführt hat. Erneut Trump-Nachwuchs \nUS-Präsident Donald Trump wird zum neunten Mal Grossvater: Sein Sohn Eric und dessen Ehefrau Lara verbreiteten die frohe Botschaft am Montag auf dem Kurzbotschaftendienst Twitter. «Wir werden im September einen Jungen zum Trump-Team beisteuern», teilte das Paar mit, das sein erstes Kind erwartet. «Es war ein unglaubliches Jahr. Wir sind gesegnet», erklärte es «aufgeregt». Congratulations Eric & Lara. Very proud and happy for the two of you! https://t.co/s0T3cTQc40 — Donald J. Trump (@realDonaldTrump) 20. März 2017 Der US-Präsident twitterte zurück: «Sehr stolz und glücklich für Euch beide.» Der 70-Jährige hat fünf Kinder aus drei Ehen. Seine ältesten beiden Kinder aus erster Ehe, Donald Jr. und Ivanka, haben bereits fünf beziehungsweise drei Kinder.Seit Trumps Amtsantritt leitet Eric Trump zusammen mit seinem älteren Bruder Donald Jr. das weitverzweigte Firmenimperium. Dazu gehören Geschäfte im In- und Ausland, Immobilien und Hotels sowie Golfclubs. Die 34-jährige Lara Trump ist eine ehemalige Journalistin, die sich für den Tierschutz engagiert und mit ihrem Mann die Eric Trump Stiftung leitet, die vor allem Kinderkrankenhäuser finanziert. Irak \nDonald Trump hat seine Kritik am amerikanischen Truppenrückzug aus dem Irak bekräftigt. «Wir hätten (den Irak) sicherlich nie verlassen sollen, niemals», sagte Trump bei einem Treffen mit dem irakischen Regierungschef Haider al-Abadi im Weissen Haus. In der Vergangenheit hatte Trump selbst einen schnellen Abzug der Truppen gefordert.Beide stimmten darin überein, dass der Kampf gegen die Terrormiliz Islamischer Staat (IS) ein zentrales Ziel sein müsse. Derzeit sind noch knapp 4600 US-Soldaten im Irak. Nach einer Schätzung der «Washington Post» sind es einschliesslich Militärberatern etwa 6000 Personen. Verfrühter Abzug? 2003 hatten die USA ohne UNO-Mandat einen umstrittenen Krieg gegen den Irak begonnen, der 2004 endete. Im Januar 2007 gab US-Präsident George W. Bush zu, die Sicherheitslage im Land falsch eingeschätzt zu haben. Er kündigte eine Aufstockung der US-Truppen an.2008, als noch 146'000 US-Soldaten im Irak waren, einigten sich beide Länder auf einen Abzug der US-Truppen bis Ende 2011. Im Oktober 2011 erklärte US-Präsident Barack Obama den Irak-Krieg offiziell für beendet. Die letzten US-Kampftruppen gingen im Dezember.Das entstandene Machtvakuum im Irak wird als einer der wesentlichen Gründe für das Erstarken der Terrormiliz IS genannt. FBI \nDie US-Bundespolizei FBI verfügt über keinerlei Belege für einen vermeintlichen Lauschangriff auf den heutigen Präsidenten Donald Trump durch seinen Vorgänger Barack Obama. Das hat FBI-Direktor James Comey bei einer Befragung im Repräsentantenhaus in Washington gesgt. Comey hat zudem erstmals öffentlich bestätigt, dass seine Behörde wegen Russlands Bemühen um eine Beeinflussung der US-Präsidentschaftswahl ermittelt. Bei den Untersuchungen gehe es auch um jegliche mögliche Verbindungen zwischen Mitarbeitern des Wahlkampfteams von US-Präsident Donald Trump und der russischen Regierung, sagte Comey. Die Ermittlungen gingen auch der Frage nach, ob Straftaten begangen worden seien. Details lieferte er nicht. Abhörvorwurf \nDer republikanische Vorsitzende des Geheimdienstausschusses des US-Repräsentantenhauses, Devin Nunes, hat die Vorwürfe von Präsident Donald Trump zu einem von Vorgänger Barack Obama autorisierten Abhören seines New Yorker Anwesens entkräftet. Eine Abhöraktion im Trump Tower habe es nicht gegeben, sagte Nunes am Montag. Andere Überwachungsmassnahmen gegen Trump und seine Vertrauten könnten jedoch nicht ausgeschlossen werden, fügte der Republikaner zu Beginn einer Anhörung hinzu.Trump hatte zuletzt mehrmals behauptet, Obama habe ihn im Trump Tower abhören lassen. Belege für diese Vorwürfe hat er nicht geliefert. Umfragetief \nMit seiner Politik stösst US-Präsident Donald Trump bei einer wachsenden Mehrheit seiner Landsleute auf Ablehnung. In einer aktuellen Umfrage des Gallup-Instituts bewerteten nur noch 37 Prozent der Befragten Trumps Amtsführung als positiv. Guter Job, schlechter Job: Die Unzufriedenheit der US-Bürger über Trumps Regierungsarbeit wächst (Screenshot: Gallup Analytics) Dagegen missbilligten 58 Prozent seine politische Arbeit. Zu Beginn seiner Amtszeit Ende Januar hatten noch 45 Prozent ihre Zustimmung zu Trumps Präsidentschaft bekundet und ein ebenso grosser Anteil seine Ablehnung. Gallup ermittelt Trumps Zustimmungswerte mit täglichen Telefonbefragungen von 1500 Erwachsenen, wie das Institut auf seiner Webseite erläutert. Das Umfrageergebnis habe einen statistischen Unsicherheitsbereich von plus/minus drei Prozentpunkten. \n(NXP)", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:31.000+03:00"}]