[{"entities": {"locations": [], "organizations": [], "persons": []}, "ord_in_thread": 0, "thread": {"site_full": "www.hwupgrade.it", "site_section": "http://www.hwupgrade.it/forum/forumdisplay.php?f=40", "domain_rank": 7226, "replies_count": 0, "country": "IT", "section_title": "Cellulari e smartphone - Hardware Upgrade Forum", "title": "Umidigi Z Pro [RECENSIONE]", "title_full": "Umidigi Z Pro [RECENSIONE] - Hardware Upgrade Forum", "published": "2017-04-18T03:00:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_0.3Z3tFvkYr1f64L4uXEIxbfXgY3d5vjAWDv0QxtR9fpKOvhWyqFrCBWExqp_AEI-", "site": "hwupgrade.it", "main_image": "", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "0392f3a6b377b8f03c783087c888e6d68a0bf1b1", "site_type": "discussions"}, "title": "Umidigi Z Pro [RECENSIONE]", "published": "2017-04-18T03:00:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_0.3Z3tFvkYr1f64L4uXEIxbfXgY3d5vjAWDv0QxtR9fpKOvhWyqFrCBWExqp_AEI-", "author": "Fabi_92", "crawled": "2017-04-19T08:40:46.000+03:00", "language": "italian", "text": "Umidigi Z Pro [RECENSIONE]\n Video recensione https://www.youtube.com/watch?v=RHi-P8s5mpk&t=4s\nSul tasto home vi è integrato un sensore di impronte , mentre per quanto riguarda la barra di navigazione in sè, potrete utilizzare anche i tasti a schermo via software.\nNon può mancare ovviamente un display da 5.5 pollici IPS SHARP IGZO e una risoluzione FullHD 1080x1920 pixel con una densità schermo pari a 401 ppi .\nA livello di impronte siamo a buon punto finalmente.\nBuon lavoro per quanto riguarda la resa cromatica e nessun punto debole evidenziato.\nDiscreta luminosità e luce adattiva un po' lenta ma ben funzionante.\nLo schermo è assolutamente adatto alla categoria in cui questo Z PRO, si pone.\nIl lato destro è caratterizzato dal tasto power e dal bilanciere del volume\nSul lato sinistro troviamo un tasto il carrellino estraibile che metterà a disposizione un DUAL SIM Nano con l'estensione di sostituire alla seconda SIM, una micro SD.\nhttp://i.imgur.com/2xfcH2Mt.jpg http://i.imgur.com/FGzZcACt.jpg\nSul lato inferiore abbiamo soltanto lo speaker , microfono e vano usb di tipo C .\nsu quello superiore troviamo il jack da 3,5 mm per le cuffie.\nhttp://i.imgur.com/af3g2mKt.jpg http://i.imgur.com/a8DBdfot.jpg\nNella parte posteriore due fotocamere da 13 Mega Pixel con Flash Quad-LED e secondo microfono posto a destra di questi ultime.\nhttp://i.imgur.com/46UPPyGt.jpg\nBack-cover e non rimovibile e batteria non estraibile; Li-Po da 3780 mAh\nPer quanto riguarda l'unboxing , abbiamo una \"cassettina\" in plastica.\nContiene oltre al dispositivo:\n- Caricabatteria pump express plus + cavo usb type C\n- Manuale\n- Spilletta per il carrellino\nCARATTERISTICHE SPECIFICHE\nhttp://i.imgur.com/kVmYxD5.png\nSOFTWARE\nUmidigi Z Pro attualmente è provvisto di Android Marshmallow 6.0 con patch di sicurezza datate 5 febbraio 2017.\nNessuna applicazione spazzatura e basata sulla stock.\nPer quanto riguarda le principali features:\n- Turbo Download: :\nPermette di scaricare i vostri file in maniera più rapida utilizzando contemporaneamente WiFi e connessione mobile 4G/3G,\nPersonalmente non so che farmene ma potrebbe tornare utile a qualcuno di voi.\nOra perdonate la mia ignoranza ma cosa vorrebbe dire \"Arrêt\"? tranquilli, per logica sono sicuro voglia dire \"Disattivo\" ma volevo farvi notare questi problemini della famosa \"rom di Mediatek\".\nhttp://i.imgur.com/0FE0HPV.png\n- S View Settings: :\nFunzioni in allegato alle classiche cover a libro che permettono la visualizzazione del display.\nConsentirà di spegnere la visualizzazione dell'orologio in base al display o a 3 e 5 secondi; si potrà inolte scegliere se avere un orologio analogico o digitale!\nhttp://i.imgur.com/UB0zY2Y.png\n- Nuovi tiles nelle impostazioni rapide :\nAlcuni tasti rapidi per scegliere se passare ai tasti statici/schermo o la modalità risparmio energetico, li troverete nella tendina delle impostazioni rapide.\nhttp://i.imgur.com/2yhTuFR.png\n- Bottoni :\nTralasciandone la traduzione, in questa sottosezione possiamo invertire l'ordine dei tasti, nascondere la navbar con una gesture o switchare dai tasti a schermo a quelli fisici (o viceversa)\n- Ottimizzazione Suono :\nClassica \"\"ottimizzazione/potenziamento\"\" del suono di Mediatek e l'aggiunta di Call mode Switch che permette di passare alla modalità auricolare quando si è in vivavoce e si avvicina l'orecchio alla capsula.\n- Fingerprint :\nSensore di impronte posto frontalmente... come piace a me.\nSarà possibile configurare più dita.\n- Notifica LED Harlequin :\nIn questa sezione potremo decidere quando innescare il LED di notifica (in carica, se scarico)\nPotremo inoltre modificare i colori delle chiamate, dei messaggi, delle chiamate in arrivo e di altre notifiche in generale.\nI colori disponibili: rosso, blu e verde!\nhttp://i.imgur.com/uOoRQOx.png\n- Risparmio energetico :\nA mio parere un buon gestore a risparmio energetico dove potremo gestire davvero molte cose!\nSi può scegliere una modalità semplice, usare solo una tonalità grigia, disattivare wifi, programmazioni varie ... insomma dei veri e propri profili da adattare alla vostra tipo di giornata; non sottovalutateli, vi potrebbero servire.\nhttp://i.imgur.com/vHgnUGX.png\n- Background task clear\nLe app seleazionate nella lista bianca non verranno chiuse quando premerete il tasto kill in app recenti.\nhttp://i.imgur.com/c9wQ41w.png\n- Programma di accensione/spegnimento\n- Autostart Management / App permissions / Data protection / Mobile antitheft\n- G-sensor e Proximity sensor calibration\n- Miravision, Color Temperature e ClearMotion\nSolito tool per personalizzare e calibrare i colori come preferiamo.\nQuesta volta abbiamo anche un contorno: la personalizzazione della temperatura del colore e l'ottimizzazione dell'uniformità dei video.\nhttp://i.imgur.com/smYWGk0.png\nSensoristica?\nAccelerometro, prossimità, luminosità, campo magnetico, giroscopio, bussola..\nSituazione più che accettabile, anche se il sensore di prossimità durante le chiamate combina qualche pasticcio non spegnendo sempre il display; vi potrebbe capitare di schiacciare qualche bottone in chiamata. non il massimo.\nIl LED di notifica è ben visibile e funzionale.\nIl Fingerprint frontale è qualcosa di riuscito. non sblocca in modo rapidissimo ma ha un'ottima percentuale di successo! promosso..\nE gli aggiornamenti?\nUna cosa è certa: Umidigi ha promesso Nougat in futuro.\nCalcolando che sul Super e altri dispositivi dell'azienda, sia già presente... dubito non arriverà.\nPerformance e sensazioni\nDeca-core spezzettato in 2 clock frequenze da 2.6, 4 da 2.0 e le restanti 4 da 1.6 Ghz.\nIn aggiunta 4gb di RAM ed una GPU Mali-T880 MP4.\nLe prestazioni sono più che buone con un'ottima resa anche sui giochi più pesanti.\nE buona esperienza anche con la tastiera; i tocchi simultanei sono 5 ma la risposta al touch è buona.\nL'unico problema?\nDopo aver controllato a fondo cpu, load average e quanto altro ... posso dire che scalda e non poco!\nScalda anche durante la carica (non in uso) o se utilizzato un po' di più del normale; speriamo si possa fare qualcosa nei prossimi aggiornamenti.\nFortunatamente non sembra incidere sulle prestazioni, non si ha throttling. Sembra quindi consentire queste temperature ma è comunque fastidioso.\n[REVIEW PARTE 2]\nBATTERIA\n3780 mAh che garantiscono le 4 ore, 5 di schermo con uso intenso...\nPotrete pure farci anche una giornata e fine.\nMi aspettavo qualcosina di più, ma può starci (sappiamo che anche i più blasonati hanno problemi di questo genere)\nIl pump expess plus all'interno della confezione riesce a caricare completamente in 2 ore, 2 ore e mezza circa.\nTest uso personale:\nhttp://i.imgur.com/dOCW3Wc.png http://i.imgur.com/07krAma.png http://i.imgur.com/Va79zZ6.png\nTest PcMark:\nPer chi non lo sapesse, questo è un test che mette sotto sforzo il dispositivo.\nNon verranno contati i minuti di schermo attivo ma la media rispetto ad altri dispositivi.\nhttp://i.imgur.com/wiDAdpv.png\nFOTOCAMERA, AUDIO, MULTIMEDIA & GAMES\nFotocamera:\nPromossa la Fotocamera anteriore Samsung s5k3l8s da 13 Megapixel che immortala autoscatti decenti; riesce anche a catturare più luce di quanto pensassi in condizioni scarse!\nSe poi ci aggiungiamo anche la presenza di un flash anteriore... beh promossa!\nSul mio sample alcuni selfie però restituiscono uno strano colorito marrone che sembra un misto tra brufoli e make up.\nNo, non ho attivato la modalità facebeauty.. tanto meno mi sono truccato :D\nLe due Fotocamere posteriori sony IMX258 da 13 Mega Pixel (monocromatica una di esse) regalano buoni risultati.\nAnche qui, si riesce a catturare buona luce in condizioni scarse con situazioni molto più decenti rispetto a vari dispositivi del passato.\nNon vi dico che è la perfezione ma tutto sommato sul rapporto qualità/prezzo, si è svolto un lavoro accettabile.\nL'app camera fortunatamente è stata rivista da Umidigi.\nQuesta volta non elencherò alcune solite funzioni classiche (rilevazione volto etc.) ma tutto \"il nuovo\" e tutto ciò che ci permetterà di capire come funzionano queste 2 fotocamere:\n- Photo: modalità normale\n- Panorama\n- Facebeauty: make-up prima di scattare\n- Pro photo: modalità manuale con possibilità di personalizzare iso, saturazione etc.\n- Bokeh:\n* ci permetterà di isolare un oggetto sfocando il resto e giocando con la profondità di campo; purtroppo non sempre riesce a saperare bene ma con un po' di pazienza i risultati potranno essere interessanti!\n* refocus post foto a mio parere molto utile\n* background e fancy color potranno creare dei veri e propri fotomontaggi isolando l'oggetto e aggiungendolo ad una nostro foto (background) o a delle maschere predefinite (fancy color). Anche qui, gli effetti sono molto carini ... senza contare che riuscirete a capire se siete riusciti a mettere a fuoco perfettamente il dettaglio da voi scelto in precedenza.\n* vista 3D darà qualche effetto tridimensionale alla foto\n- Mono: sfrutterà solamente la fotocamera in bianco e nero\nScelta di zoom digitale 3x, HDR, modalità super night (per l'aiuto in notturna) e live photo per immortalare una foto dinamica che mostra anche i passi prima dello scatto.\nVi lascio tutte le prove in galleria.\nATTENZIONE: alcune di esse sono prove generali di fuoco... non spaventatevi :P\nGalleria Foto: http://imgur.com/a/5pVWv\nLe riproduzioni video hanno la possibilità di essere codificate anche in mp4 raggiungendo i 4k (1080p per la frontale)\nVengono abbastanza bene con un buon comportamento del focus a patto però che facciate qualche tap nelle macro.\nAudio:\nComparto audio sufficiente in tutti i suoi componenti.\nIl volume speaker è alto ma non distorce più di tanto...\nInsomma, di medio livello.\nMultimedia:\nDopo un test video, eccovi una lista dei formati non supportati in modo adeguato:\nhttp://imgur.com/a/2MOmt\nRICEZIONE\nLTE Cat 6 per il WiFi a/b/g/n/ac. bande/frequenze a piena compatibilità con i nostri operatori italiani.\nBluetooth di tecnologia 4.1 (presente tecnologie A2D) che ha superato tutti i test di accoppiamento e tethering effettuati.\nNavigazione GPS/A-GPS/GLONASS che si è comportata bene con google maps, gps test e altre applicazioni che sfruttano la geolocalizzazione.\nBENCHMARK VARI\nAntutu Benchmark:\nhttp://i.imgur.com/NLzEoch.png\nPC Mark:\nhttp://i.imgur.com/I5QlFhx.png http://i.imgur.com/2mwjqsg.png\nGeekbench:\nhttp://browser.primatelabs.com/v4/cpu/2489100\nhttp://browser.primatelabs.com/v4/compute/639988\nAndrobench:\nhttp://i.imgur.com/ynXJxgZ.png\nCONCLUSIONE\nSe qualcuno ha già seguito qualche mia recensione, sa di certo che con Umi non mi sono risparmiato più volte.\nquesto non vuole dire mettere una croce sull'azienda e infatti sono qui oggi per dirvi che Umidigi migliora piano piano.\nZ Pro, seppur solo una rivisitazione di Umi Z ha una sua identità.\nQualche scopiazzamento qui e lì e qualcosa da assestare ma già dal manuale in italiano, si capisce che ha la voglia di affermarsi sul mercato.\nLa scelta della doppia fotocamera, la sua app camera, il fatto che sia stata la prima ad integrare questo Helio x27 vogliono dire qualcosa.\nQuesto è un dispositivo su cui attendiamo nougat ma per il momento non si può rivelare una delusione ma un buon prodotto.\nCosa mi è piaciuto particolarmente\nBuona iniziativa di umidigi: la doppia fotocamera, risparmio energetico, app camera rivista, formati mp4, 4k ... tutte cose che fanno sperare per il futuro.\nBuoni materiali\nFingerprint \"home\" e ottima precisione (anche se un po' lento)\nComparto audio abbastanza buono (di solito è uno degli anelli deboli in questi dispositivi)\nFlash fotocamera anteriore\nPrezzo sempre più interessante\nCosa non mi è piaciuto particolarmente\nScalda parecchio\nBokeh non sempre preciso (sopratutto agendo sull'anteriore)\nNougat assente. (ma promesso!)\nSpero voi possiate apprezzare e vi ricordo che questo è soltanto il mio punto di vista :)", "external_links": ["http://i.imgur.com/46UPPyGt.jpg", "http://browser.primatelabs.com/v4/compute/639988", "http://browser.primatelabs.com/v4/cpu/2489100", "http://i.imgur.com/NLzEoch.png", "http://imgur.com/a/5pVWv", "http://i.imgur.com/I5QlFhx.png", "http://i.imgur.com/a8DBdfot.jpg", "http://i.imgur.com/kVmYxD5.png", "http://i.imgur.com/af3g2mKt.jpg", "http://www.youtube.com/watch?v=RHi-P8s5mpk", "http://i.imgur.com/0FE0HPV.png", "http://i.imgur.com/2yhTuFR.png", "http://i.imgur.com/Va79zZ6.png", "http://i.imgur.com/dOCW3Wc.png", "http://i.imgur.com/ynXJxgZ.png", "http://i.imgur.com/07krAma.png", "http://imgur.com/a/2MOmt", "http://i.imgur.com/c9wQ41w.png", "http://i.imgur.com/vHgnUGX.png", "http://i.imgur.com/FGzZcACt.jpg", "http://i.imgur.com/uOoRQOx.png", "http://i.imgur.com/1CQ5QcOt.jpg", "http://i.imgur.com/2xfcH2Mt.jpg", "http://i.imgur.com/UB0zY2Y.png", "http://i.imgur.com/smYWGk0.png", "http://i.imgur.com/2mwjqsg.png", "http://i.imgur.com/wiDAdpv.png"], "highlightTitle": "", "uuid": "0392f3a6b377b8f03c783087c888e6d68a0bf1b1", "highlightText": "", "rating": null}]