[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:28:06.000+03:00", "author": "cleopatralovesbooks", "entities": {"persons": [{"name": "sarah r shaber", "sentiment": "none"}, {"name": "fiona harper", "sentiment": "none"}, {"name": "simon beckett", "sentiment": "none"}, {"name": "thorne moore", "sentiment": "none"}, {"name": "amira", "sentiment": "none"}, {"name": "jude", "sentiment": "none"}, {"name": "sarah", "sentiment": "none"}, {"name": "booker talk", "sentiment": "none"}, {"name": "susan", "sentiment": "none"}, {"name": "charlie", "sentiment": "none"}, {"name": "lisa jewell", "sentiment": "none"}, {"name": "ricky langley", "sentiment": "none"}, {"name": "floyd", "sentiment": "none"}, {"name": "tanner", "sentiment": "none"}, {"name": "maggie", "sentiment": "none"}, {"name": "jude hanson", "sentiment": "none"}, {"name": "ewan", "sentiment": "none"}, {"name": "ellie", "sentiment": "none"}, {"name": "tammy cohen", "sentiment": "none"}, {"name": "alexandria marzano-lesnevich", "sentiment": "none"}, {"name": "laurel", "sentiment": "none"}, {"name": "emma kavanagh", "sentiment": "none"}, {"name": "thorne", "sentiment": "none"}, {"name": "paula", "sentiment": "none"}, {"name": "tom thorne", "sentiment": "none"}, {"name": "jeffrey h konis", "sentiment": "none"}, {"name": "ricky", "sentiment": "none"}, {"name": "mark billingham", "sentiment": "none"}, {"name": "dan", "sentiment": "none"}, {"name": "nicola tanner", "sentiment": "none"}, {"name": "emma flint", "sentiment": "none"}], "locations": [{"name": "wales", "sentiment": "none"}, {"name": "louisiana", "sentiment": "none"}, {"name": "essex", "sentiment": "none"}, {"name": "alexandria", "sentiment": "none"}], "organizations": [{"name": "time for silence", "sentiment": "none"}, {"name": "laurel", "sentiment": "none"}, {"name": "pan macmillan", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "text": "By Cleopatralovesbooks @cleo_bannister \nFirst up I want to wish you all a very Happy Easter full of eggs, and books of course! \nWe’ve just said goodbye to a family with a delightful couple of young boys who have kindly left me their shell collection in the bathroom after we spent a wonderful few hours on the beach – there really is nothing quite like seeing our island through a child’s eyes! This Week on the Blog \nMy week started with my review for The Restless Dead by Simon Beckett , a very well told crime thriller set on the marshes in Essex. \nOn Tuesday I hosted a post by Simon Beckett as part of The Restless Dead Blog Tour where he describes how he developed book one, The Chemistry of Death into a series. \nMy This Week in Books featured books by Sarah R Shaber , Emma Kavanagh and Emma Flint – you’ll have to wait to hear what I made of this selection! \nOn Thursday I posted my review of A Time For Silence by Thorne Moore which I actually read a while ago and it is definitely one of those books that linger in your mind. \nNext up was my review of The Conversations We Never Had by Jeffrey H Konis which he was kind enough to leave a comment on explaining why the imagined conversations were conducted in the formal manner presented. \nYesterday was another post on the Put A Book On The Map feature, this time superbly executed by Booker Talk and Thorne Moore as they put A Time For Silence firmly on the map for Wales. This Time Last Year… \nI was reading Tammy Cohen’s When She Was Bad a brilliant psychological thriller set in an office which was scarily accurate. Even more scary was the Team Building exercise that the staff were forced to take part in – the very words send shudders down my spine!! \nYou can read my full review here or click on the cover \nBlurb \nYOU SEE THE PEOPLE YOU WORK WITH EVERY DAY. \nBUT WHAT CAN’T YOU SEE? \nAmira, Sarah, Paula, Ewan and Charlie have worked together for years – they know how each one likes their coffee, whose love life is a mess, whose children keep them up at night. But their comfortable routine life is suddenly shattered when an aggressive new boss walks in …. \nNow, there’s something chilling in the air. \nWho secretly hates everyone? \nWho is tortured by their past? \nWho is capable of murder? Amazon Stacking The Shelves \nI have had some great luck in securing new books over the last couple of weeks so here’s a selection of my favourites \nFirstly from NetGalley I have a copy of The Fact of a Body by Alexandria Marzano-Lesnevich a non-fiction true crime read with a difference, which will be published on 18 May 2017 by Pan Macmillan. \nBlurb \nBefore Alexandria Marzano-Lesnevich begins a summer job at a law firm in Louisiana, working on the retrial defence of death-row convicted murderer and child molester, Ricky Langley, she thinks her position is clear. The child of two lawyers, she is staunchly anti death penalty. But the moment Ricky’s face flashes on the screen as she reviews old tapes, the moment she hears him speak of his crimes, she is overcome with the feeling of wanting him to die. \nShocked by her reaction, she digs deeper and deeper into the case, realizing that despite their vastly different circumstances, something in his story is unsettlingly, uncannily familiar. Crime, even the darkest and most unspeakable acts, can happen to any one of us, and as Alexandria pores over the facts of the murder, she finds herself thrust into the complicated narrative of Ricky’s childhood. And by examining minute details of Ricky’s case, she is forced to face her own story, to unearth long-buried family secrets, to reckon with how her own past colours her view of his crime. \nAs enthralling as true-crime classics such as In Cold Blood and Midnight in the Garden of Good and Evil and broadcast phenomena such as Making a Murderer and Serial, The Fact of a Body is a groundbreaking, heart-stopping investigation into how the law is personal, composed of individual stories and proof that arriving at the truth is more complicated, and powerful, than we could ever imagine. NetGalley \nI was lucky enough to be approved for a copy of Lisa Jewell’s Then She Was Gone , I’m a huge fan of this author and this, her latest book, will be published on 27 July 2017 \nBlurb \nA BURIED SECRET \nTHEN She was fifteen, her mother’s golden girl. She had her whole life ahead of her. And then, in the blink of an eye, Ellie was gone. NOW It’s been ten years since Ellie disappeared, but Laurel has never given up hope of finding her daughter. And then one day a charming and charismatic stranger called Floyd walks into a café and sweeps Laurel off her feet. Before too long she’s staying the night at this house and being introduced to his nine year old daughter. Poppy is precocious and pretty – and meeting her completely takes Laurel’s breath away. Because Poppy is the spitting image of Ellie when she was that age. And now all those unanswered questions that have haunted Laurel come flooding back. What happened to Ellie? Where did she go? Who still has secrets to hide? NetGalley \nAdded to which another favorite author, Mark Billingham , is waiting publication of Love Like Blood in June 2017. \nBlurb \nDI Nicola Tanner needs Tom Thorne’s help. Her partner, Susan, has been brutally murdered and Tanner is convinced that it was a case of mistaken identity—that she was the real target. The murderer’s motive might have something to do with Tanner’s recent work on a string of cold-case honor killings she believes to be related. Tanner is now on compassionate leave but insists on pursuing the case off the books and knows Thorne is just the man to jump into the fire with her. He agrees but quickly finds that working in such controversial territory is dangerous in more ways than one. And when a young couple goes missing, they have a chance to investigate a case that is anything but cold. NetGalley \nI also have a copy of The Other Us by Fiona Harper which will be published on 4 May 2017 which is billed as one for those who loved The Versions of Us , which I did! \nBlurb \nIf you could turn back time, would you choose a different life? Forty-something Maggie is facing some hard truths. Her only child has flown the nest for university and, without her daughter in the house, she’s realising her life, and her marriage to Dan, is more than a little stale. When she spots an announcement on Facebook about a uni reunion, she can’t help wondering what happened to Jude Hanson. The same night Dan proposed, Jude asked Maggie to run away with him, and she starts to wonder how different her life might have been if she’d broken Dan’s heart and taken Jude up on his offer. Wondering turns into fantasising, and then one morning fantasising turns into reality. Maggie wakes up and discovers she’s back in 1992 and twenty-one again. Is she brave enough to choose the future she really wants, and if she is, will the grass be any greener on the other side of the fence? Two men. Two very different possible futures. But is there only once chance at happiness? Amazon \nWhat have you found to read this week? Do share, as you can see I’m always on the lookout for a good book! \nSince my last post I’ve read 5 books and gained 4 so the grand total is hurtling downwards to 190 Physical Books – 113", "url": "http://omgili.com/ri/j.JM_ertN3KhAdid5Cvugx2NdhywbmWYWJIwdnPglCYiPmUfGKwKotfqPGYNI8WjbrD8ZUMrskcoGLRMXmtwdQ--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:28:06.000+03:00", "language": "english", "title": "Weekly Wrap Up (April 16)", "thread": {"title_full": "Weekly Wrap Up (April 16)", "site_full": "en.paperblog.com", "site": "paperblog.com", "site_section": "http://en.paperblog.com/rss/recents", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": 23391, "replies_count": 0, "site_categories": [], "country": "FR", "section_title": "Paperblog : Latest articles", "url": "http://omgili.com/ri/j.JM_ertN3KhAdid5Cvugx2NdhywbmWYWJIwdnPglCYiPmUfGKwKotfqPGYNI8WjbrD8ZUMrskcoGLRMXmtwdQ--", "published": "2017-04-16T11:28:06.000+03:00", "title": "Weekly Wrap Up (April 16)", "uuid": "1794a0550d591616d9d738c635a914968d1c427e", "main_image": "http://m5.paperblog.com/i/166/1660093/weekly-wrap-up-april-16-T-SRvk7z.jpeg"}, "uuid": "1794a0550d591616d9d738c635a914968d1c427e", "ord_in_thread": 0}]