[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:23:33.000+03:00", "author": "", "entities": {"persons": [{"name": "kevin benedict", "sentiment": "none"}, {"name": "billy dean", "sentiment": "none"}, {"name": "alexa", "sentiment": "none"}, {"name": "jim kaskade", "sentiment": "none"}, {"name": "william schmarzo", "sentiment": "none"}, {"name": "jason trovela", "sentiment": "none"}, {"name": "shelly palmer", "sentiment": "none"}, {"name": "antonella corno", "sentiment": "none"}, {"name": "william schmarzo well", "sentiment": "none"}, {"name": "alexa lie", "sentiment": "none"}, {"name": "larry alton big data", "sentiment": "none"}, {"name": "harry trott cloud", "sentiment": "none"}, {"name": "kevin benedict digital", "sentiment": "none"}, {"name": "william morrish", "sentiment": "none"}, {"name": "dana gardner", "sentiment": "none"}, {"name": "yeshim deniz", "sentiment": "none"}, {"name": "neil thurston", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "u.s.s.r.", "sentiment": "none"}, {"name": "ny", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "javits center", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "none"}, {"name": "federal communications commission", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "alexa voice service", "sentiment": "none"}, {"name": "nasa", "sentiment": "none"}, {"name": "fcc", "sentiment": "none"}, {"name": "interarbor solutions", "sentiment": "none"}, {"name": "idc", "sentiment": "none"}, {"name": "university of san francisco", "sentiment": "none"}, {"name": "jyoti bansal digital", "sentiment": "none"}, {"name": "organization’s data and analytics research paper", "sentiment": "none"}, {"name": "mit sloan management review", "sentiment": "none"}, {"name": "dell emc", "sentiment": "none"}, {"name": "daily mail", "sentiment": "none"}, {"name": "ftc", "sentiment": "none"}, {"name": "logicalis group", "sentiment": "none"}, {"name": "dynatrace blog digital", "sentiment": "none"}, {"name": "interoute", "sentiment": "none"}, {"name": "cia", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "federal trade commission", "sentiment": "none"}]}, "text": "The Chatbots Are Taking Over! By PagerDuty Blog Wouldn’t it be great if there were tiny robots that kept track of what you were thinking, then helped you implement your plans automatically? Well, if you’re an admin responsible for monitoring infrastructure, they exist. They’re called chatbots, and they are the key to leveraging ChatOps in order to optimize your monitoring and incident management workflow. This post explains what chatbots and ChatOps do and why they're so valuable for organizations that are adopting DevOps practices. Apr. 15, 2017 07:15 PM EDT Reads: 1,104 Big Data: Driving Factor in Consumers’ Lives By Larry Alton Big Data is literally everywhere, and consumers interact with it daily. However, it’s the marketers that recognize the value of such data and use it to perfect the customer experience. Consumers, on the other hand, are often oblivious to their contribution to the mass data that marketers and businesses use to design their products and services. They don’t realize that their phones actually ping location-based data to nearby retailers. Browsing history, social media shares, online transactions, subscriptions, and other online interactions also provide information that marketers use to know more... Apr. 15, 2017 06:15 PM EDT Reads: 1,948 Demystifying Data Science By William Schmarzo [Opening Scene]: Billy Dean is pacing the office. He’s struggling to keep his delivery trucks at full capacity and on the road. Random breakdowns, unexpected employee absences, and unscheduled truck maintenance are impacting bookings, revenues and ultimately customer satisfaction. He keeps hearing from his business customers how they are leveraging data science to improve their business operations. Billy Dean starts to wonder if data science can help him. As he contemplates what data science can do for him, he slowly drifts off to sleep, and visions of Data Science starts dancing in his head…... Apr. 15, 2017 03:15 PM EDT Reads: 1,652 How Cloud Enables Digital Transformation By Janakiram MSV Whether you are an owner of a thriving small business or a decision maker at an established enterprise, you cannot ignore digital technology. Businesses worldwide are going digital to deliver compelling experiences to customers, which is becoming a key differentiating factor. The rise of social and mobile have increased the discoverability of businesses. Consumers are Apr. 15, 2017 03:00 PM EDT Reads: 1,812 Natural Language Processing By William Schmarzo “Apophenia is the propensity to see patterns in random data.” We encounter it all the time in the real world. Examples include gamblers who see patterns in how the cards are being dealt or investors who imagine patterns in the movement of certain stocks, or basketball fans who believe that their favorite player has the “hot hand.” But apophenia has no place in the world of data science, especially when data science is trying to help us make better decisions about critical things such as the quality of healthcare, where to allocate police resources, ensuring that our airplanes operate effectiv... Apr. 15, 2017 12:00 PM EDT Reads: 1,772 Has IoT Transformed Business? By Jason Trovela Common items are becoming “smarter.” IoT is making an impact on businesses across the board, including commercial buildings, manufacturing, retail and events. You‘ve probably heard of the Internet of Things by now, and if you haven't, you might be surprised to discover it's likely already made an impact on your life. The Internet of Things, or IoT for short, refers to connecting everyday objects to the internet and allowing them to exchange data on their performance and the environment. By gaining the ability to communicate, common items you interact with every day are becoming \"smarter.\" IoT ... Apr. 15, 2017 12:00 PM EDT Reads: 1,668 Cloud Tech in Home Security By Harry Trott Cloud is a lot more pervasive than one may have imagined and in this article, we will focus on the various ways in which cloud technology is making home security systems robust and impenetrable. The term ‘Internet of Things’ gets thrown around quite a lot when we talk about cloud technology in domains outside of computer systems. But cloud technology in areas like home security is not merely about IoT. Cloud is a lot more pervasive than one may have imagined and in this article, we will focus on the various ways in which cloud technology is making home security systems robust and impenetrable.... Apr. 15, 2017 09:15 AM EDT Reads: 1,701 Economic Value of Data (EvD) Challenges By William Schmarzo Well, my recent University of San Francisco research paper “Applying Economic Concepts To Big Data To Determine The Financial Value Of The Organization’s Data And Analytics Research Paper” has fueled some very interesting conversations. Most excellent! That was one of its goals. It is important for organizations to invest the time and effort to understand the economic value of their data because data has a direct impact on an organization’s financial investments and monetization capabilities. Apr. 15, 2017 08:15 AM EDT Reads: 1,538 Internet Privacy: What You Need to Know By Shelly Palmer There has never been a reasonable expectation of online privacy, and there never will be. Regardless of what you may have recently heard about joint resolutions or nullifications, nothing has changed. Internet Service Providers (ISPs) have always had the right to use your data as they see fit, within a few Federal Trade Commission (FTC) and Federal Communications Commission (FCC) parameters. This has not changed. And you have given FANG (Facebook, Amazon, Netflix, and Google) the right to use your data as they see fit (with a few privacy policy exceptions and within the few aforementioned FTC ... Apr. 14, 2017 12:00 PM EDT Reads: 2,443 Analyzing Retail Through Digital Lenses By Kevin Benedict In 2016, total worldwide retail sales reached $22 trillion, of which digital commerce makes up $1.9 trillion, or 8.7% of the total. While the majority of retail sales still occur in brick-and-mortar stores, overall growth is predominantly driven by digital commerce, which was expected to expand rapidly worldwide at a 23.7% growth rate in 2016, and by 2020 to represent 14.6% of total retail spending of $27 trillion. Of course, digital commerce numbers vary depending on the product category. Online sales penetration for many product types - electronics, apparel, furniture, home improvement, etc... Apr. 13, 2017 04:00 PM EDT Reads: 2,236 The Convergence of Identities and the IoT By Jim Kaskade Anyone who knows me, knows that I’m extremely passionate about opportunities involving Internet of Things (IoT) – or should I call it Identity of Things – and what it will bring to end-consumers and businesses alike! The industry of connected devices is growing at a breakneck speed and consumers are getting more and more excited as they learn about the ever-expanding possibilities. But are brands preparing themselves properly for IoT? Do they know the complexities involved? Apr. 13, 2017 02:00 PM EDT Reads: 2,557 FutureScape: Worldwide Cloud in 2017 and 2018 By Antonella Corno Cloud usage continues to gain momentum across all industries. In a recent FutureScape: Worldwide Cloud 2017 Predictions report, IDC predicted that between 60 percent and 70 percent of all software, services and technology spending will be on the cloud by 2020. With this increase in cloud usage comes a corresponding need for employees with cloud skills. Supply has not kept pace with demand, however. The State of Cloud Readiness Study 2016 found that 53 percent of IT leaders are struggling to acquire the necessary skills to support cloud initiatives within their organizations, while almost hal... Apr. 12, 2017 09:15 PM EDT Reads: 7,339 The Role of Digital Thinking By Kevin Benedict Digital leaders think differently about the role and value of digital technologies, including the ability of these tools to enable competitive advantage in the form of revenue growth, and positively impact work and jobs. As a result, leaders are developing more aggressive technology plans and strategies than digital laggards. Apr. 9, 2017 10:45 AM EDT Reads: 2,515 Is Blockchain an Enabler of Data Monetization? By William Schmarzo Special thanks for the help on this blog to the coolest, most hip group of industry experts that I have ever met: the Pathfinders. The Pathfinders is an elite forces group of master system engineers inside of Dell EMC who tackle our customers’ most difficult and inspiring challenges. I am honored to be part of that club! Suppose an autonomous vehicle learns of a more efficient route and wants sell this knowledge to other autonomous cars for a fee (using blockchain to handle machine to machine transaction). Suppose the autonomous vehicle could start to monetize itself; to self-fund its own op... Apr. 8, 2017 08:00 PM EDT Reads: 5,146 Can Alexa Lie? By Shelly Palmer There was a recent tabloid piece featuring a video of a woman asking Alexa if it was connected to the CIA. At the time, the Echo Dot she was speaking to did not respond to the question. She asked a few times, and each time the Echo was silent. Conspiracy theorists weighed in. It was an amusing video, but the Daily Mail’s clickbait headline raises a legitimate question: Can Alexa lie? According to Amazon, you can “use the Alexa Voice Service (AVS) to add intelligent voice control to any connected product that has a microphone and speaker.” Alexa uses machine learning to help it recognize what ... Apr. 8, 2017 10:00 AM EDT Reads: 2,433 Great Expectations: Digital Transformation By Dynatrace Blog Digital transformation is happening everywhere. It starts with an expectation that whatever an organization does in the real world is supported by—and expands through—its digital presence. As the process continues, digital transformation should drive innovative ways to engage customers, get the most from resources and differentiate its way into completely new markets. All these great expectations come from both within and outside an organization, and can add up to a big challenge for any team. According to MIT Sloan Management Review, “Preparing for a digital future is no easy task. It means ... Apr. 7, 2017 04:15 PM EDT Reads: 3,100 Digital Transformation: Two Words Don’t Fit All By Jyoti Bansal Digital transformation. It’s only two simple words, but in the increasingly complex, customer-centric enterprise IT landscape, it’s a phrase that carries multiple meanings — to the point where some would probably observe, tongue-in-cheek, that it doesn’t mean anything anymore. It’d be hard to argue that “digital transformation” hasn’t been pushed into buzzword territory by those of us who write about business IT, but I feel like that speaks more of the concept’s genuine relevance and importance to the success of today’s digital first enterprises than just simple hype. The sports media talks ... Apr. 7, 2017 10:00 AM EDT Reads: 3,164 [video] Interoute's Digital Transformation By Yeshim Deniz \"My role is working with customers, helping them go through this digital transformation. I spend a lot of time talking to banks, big industries, manufacturers working through how they are integrating and transforming their IT platforms and moving them forward,\" explained William Morrish, General Manager Product Sales at Interoute, in this SYS-CON.tv interview at 18th Cloud Expo, held June 7-9, 2016, at the Javits Center in New York City, NY. Apr. 6, 2017 08:45 PM EDT Reads: 5,986 IT in the Age of Digital Transformation By Dynatrace Blog Next month will mark the 47th anniversary of Apollo 13. The film that recounts the story is a favorite of mine, probably because it so masterfully captures the incredible suspense, fear, and hope felt by people everywhere, that I personally recall very well. I also know how an organization’s digital transformation can generate similar reactions! Apollo 13 was likely a casualty of the space program’s incredibly aggressive schedule. NASA, with U.S. political and military leaders, was motivated by competition from the U.S.S.R. and fear of the potential consequences of not being first. Urgency oft... Apr. 3, 2017 08:45 PM EDT Reads: 4,048 How Digital Disruption Demands Hybrid IT By Dana Gardner Trends as Internet of things (IoT), distributed IT, data sovereignty requirements, and pervasive security concerns are combining to challenge how IT operates. Thanks to adoption of hybrid IT, tech organizations are shifting to become strategists and internal service providers. To help us define a new ideology for hybrid IT, we're joined by Neil Thurston, Chief Technologist for the Hybrid IT Practice at Logicalis Group in the UK. The discussion is moderated by Dana Gardner, Principal Analyst at Interarbor Solutions. Apr. 2, 2017 03:00 PM EDT Reads: 3,773", "url": "http://omgili.com/ri/GiCaV2xJNYs8HMed9TfiXT.n.FMYhXajeTLs2XYUmRnHClIpUYnXNg--", "highlightText": "", "highlightTitle": "", "published": "2017-04-15T23:30:00.000+03:00", "language": "english", "title": "TAP Accelerates #ArtificialIntelligence | @CloudExpo #AI #BigData #Hadoop", "thread": {"title_full": "TAP Accelerates #ArtificialIntelligence | @CloudExpo #AI #BigData #Hadoop", "site_full": "java.sys-con.com", "site": "sys-con.com", "site_section": "http://singularity-news.com/~api/papers/b199be28-4c75-42ea-8103-54ed8c946af2/rss", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "news", "spam_score": 0.0, "domain_rank": 59936, "replies_count": 0, "site_categories": [], "country": "FR", "section_title": "Artificial intelligence, transhumanism, nanotechnology & more", "url": "http://omgili.com/ri/GiCaV2xJNYs8HMed9TfiXT.n.FMYhXajeTLs2XYUmRnHClIpUYnXNg--", "published": "2017-04-15T23:30:00.000+03:00", "title": "TAP Accelerates #ArtificialIntelligence | @CloudExpo #AI #BigData #Hadoop", "uuid": "a2cf3660e86a3601839cd11dd8b0e0ff0399b9f3", "main_image": ""}, "uuid": "a2cf3660e86a3601839cd11dd8b0e0ff0399b9f3", "ord_in_thread": 0}]