[{"uuid": "510c1ec7c4e9c52b41ffd99feba77c328d959681", "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24mekvtvxo53wVW3GZPs4pXp1NGzclrIXkR42mXkZBkNPVMjGd5BaAA9B_2HxGYfxq.fn5Ez5BYAL_2QGPl7Mj_U7W9jvOrnRi_KN_abp0YQAks7JyAmwKXoyo-", "title": "THE TROUBLE WITH TSHETLHA: The Genesis of a Savior Complex (part 2)", "author": "TSHIRELETSO MOTLOGELWA", "rating": null, "published": "2017-04-18T18:31:00.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "sandhurst military school", "sentiment": "none"}, {"name": "bdf", "sentiment": "none"}, {"name": "waaf", "sentiment": "none"}, {"name": "office of the president", "sentiment": "none"}, {"name": "royal military college", "sentiment": "none"}, {"name": "bdp", "sentiment": "none"}, {"name": "british commission", "sentiment": "none"}, {"name": "british army", "sentiment": "none"}, {"name": "botswana police service", "sentiment": "none"}, {"name": "tuli block", "sentiment": "none"}, {"name": "sandhurst military academy", "sentiment": "none"}, {"name": "royal military academy", "sentiment": "none"}, {"name": "rma sandhurst", "sentiment": "none"}, {"name": "australian defence force academy", "sentiment": "none"}, {"name": "khama magic", "sentiment": "none"}, {"name": "women’s auxiliary air force", "sentiment": "none"}, {"name": "defence force", "sentiment": "none"}, {"name": "royal airforce", "sentiment": "none"}, {"name": "business weekly & review", "sentiment": "none"}, {"name": "finance and development planning ministry", "sentiment": "none"}, {"name": "anc", "sentiment": "none"}, {"name": "sadf", "sentiment": "none"}, {"name": "itb", "sentiment": "none"}, {"name": "seretse khama", "sentiment": "none"}, {"name": "national defence academy", "sentiment": "none"}, {"name": "botswana defence force", "sentiment": "none"}, {"name": "ministry of finance and development planning", "sentiment": "none"}], "locations": [{"name": "batswana", "sentiment": "none"}, {"name": "waterford", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "sandhurst", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "khama", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}, {"name": "ponatshego kedikilwe", "sentiment": "none"}, {"name": "serowe", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "waterford kamhlaba", "sentiment": "none"}, {"name": "galebotswe", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "republic of botswana", "sentiment": "none"}, {"name": "botswana", "sentiment": "none"}, {"name": "swaziland", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "tuli", "sentiment": "none"}, {"name": "west point", "sentiment": "none"}, {"name": "lesoma", "sentiment": "none"}, {"name": "mbabane", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "bangwato", "sentiment": "none"}], "persons": [{"name": "ian khama", "sentiment": "none"}, {"name": "ruth khama", "sentiment": "none"}, {"name": "george williams", "sentiment": "none"}, {"name": "baledzi gaolathe", "sentiment": "none"}, {"name": "khama", "sentiment": "none"}, {"name": "ruth williams", "sentiment": "none"}, {"name": "michael dutfield", "sentiment": "none"}, {"name": "masire", "sentiment": "none"}, {"name": "constand viljoen", "sentiment": "none"}, {"name": "merafhe", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "batswana", "sentiment": "none"}, {"name": "george", "sentiment": "none"}, {"name": "fisher", "sentiment": "none"}, {"name": "brigitte zypries", "sentiment": "none"}, {"name": "parsons", "sentiment": "none"}, {"name": "nicholas love", "sentiment": "none"}, {"name": "tlou", "sentiment": "none"}, {"name": "patrick schlemmer", "sentiment": "none"}, {"name": "philip steenkamp", "sentiment": "none"}, {"name": "quett masire", "sentiment": "none"}, {"name": "schlemmer", "sentiment": "none"}, {"name": "w. turner", "sentiment": "none"}, {"name": "ruth", "sentiment": "none"}, {"name": "seretse", "sentiment": "none"}, {"name": "seretse khama", "sentiment": "none"}, {"name": "ian", "sentiment": "none"}, {"name": "turner", "sentiment": "none"}, {"name": "festus mogae", "sentiment": "none"}, {"name": "mogae", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "g. pitso", "sentiment": "none"}, {"name": "seretse khama ian khama", "sentiment": "none"}, {"name": "lady ruth", "sentiment": "none"}, {"name": "lesoma", "sentiment": "none"}, {"name": "dutfield", "sentiment": "none"}, {"name": "henderson", "sentiment": "none"}, {"name": "david magang", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "510c1ec7c4e9c52b41ffd99feba77c328d959681", "url": "http://omgili.com/ri/jHIAmI4hxg8v3BmVd24mekvtvxo53wVW3GZPs4pXp1NGzclrIXkR42mXkZBkNPVMjGd5BaAA9B_2HxGYfxq.fn5Ez5BYAL_2QGPl7Mj_U7W9jvOrnRi_KN_abp0YQAks7JyAmwKXoyo-", "site_full": "www.businessweekly.co.bw", "title": "THE TROUBLE WITH TSHETLHA: The Genesis of a Savior Complex (part 2)", "site_section": "http://www.businessweekly.co.bw/feed", "domain_rank": null, "published": "2017-04-18T18:31:00.000+03:00", "title_full": "THE TROUBLE WITH TSHETLHA: The Genesis of a Savior Complex (part 2)", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "Business Weekly & Review", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "BW", "performance_score": 0, "main_image": "", "site": "businessweekly.co.bw"}, "external_links": [], "language": "english", "text": "SHARE \n\nPresident Ian Khama likes to hang around Batswana he calls the less fortunate – the rural poor and urban township dwellers. He enjoys it when he happens upon an unsuspecting street hawker and she rises to her feet eyes alight and mouth agape in disbelief. Something messianic in the way they hold his hand and then walk away in amazement, as if a new perfect dream has gate-crashed through their bland reality. \n\nKhama also relishes giving them goods; groceries of phaleche there, a bag of rice there, pasteurised milk, cans of fish, and for the even luckier ones, a roof over their head. But if there is something that provides the man from Serowe with ultimate satisfaction it is being seen to be giving, that is, when those donations are given in his name – His Excellency Doctor Lieutenant General Seretse Khama Ian Khama, the President of the Republic of Botswana. \n\nThere is a picture of Khama donating to an old San man, groceries before them, boxes of pasturised milk, phaleche and a newly painted wall behind them. The San man has the look of a hare stuck before the headlights, almost wide-eyed stunned. Khama has that characteristic smile. He has never looked happier. \n\nKhama’s keen interest in saving people whether as a soldier or as a philanthropist has had serious implications for his presidency at a policy level, with everything from his extreme interest in military procurement to his transfer of the entire government media department to Office of the President, all borne of that complex. When one studies Khama’s upbringing from formative stages past his Commandership of the Botswana Defence Force two aspects of Khama’s thinking stand prominent – the unsatisfied need to be a recognized mind in military terms, like his maternal grandfather, and to save people and animals in dire situations, like his highly influential mother lady Ruth Khama. \n\n\nKhama’s keen interest in saving people whether as a soldier or as a philanthropist has had serious implications for his presidency at a policy level \n\n\nHowever Khama possesses a Hero Complex of a unique nature and being known for such characteristics. But underpinning that is Khama’s keen interest in proving his worth to people of European origin, an inferiority complex before them that often presents itself in the guise of a superiority complex over Black people, the latter of which has foundations in both his racist past social existence as well his royal childhood. It is when his, and indeed his brothers’, actions as leaders are seen through this prism that a clearer picture emerges. \n\nKhama’s journey of heroism can be located within his dedication to the military while his philanthropy is traceable to his mother Ruth which itself is from her own dad and former soldier George Williams. \n\nIn the book, A Marriage of Inconvenience by Michael Dutfield, the role of the old man in his eldest daughter is explained in detail. When she, in the mid1940s, seeks to introduce Seretse Khama who she is dating to her father, she worries about how it would hurt him. Copious amount of writing exists on the influence fathers have on their daughters, and according to Dutfield, Williams was no less significant in the Ruth’s life. \n\nHe would have been a hero to his daughter, a man who took part in the First World War. While Ruth, at least according to various literary accounts, was determined to date a black man despite the extreme views of her father against cross-racial relationships, she worried about his reaction. \n\n“Her father, George, to whom she had always been very close, would, she knew, have been angry and hurt. He had spent six years in the British Army in India and had been invalided out at the end of the First World War. During that period, he had acquired very fixed opinions about the roles of black and white in the world. Born into an age when Britain ruled huge parts of the globe, George Williams regarded the differences between the races as fundamental and obvious. Any relationship other than that of ruler to ruled seemed to him absurd,” states Dutfield. \n\nThey may have differed over her dating decisions but the influence of the elder Williams could not be discounted, especially given that when a teenager she had quit school to join the Women’s Auxiliary Air Force, the WAAF. As World War II raged, Ruth encountered men who represented her father, at their most, helpless as survivors of plane crashes. “At 17, she had left school to join the Women’s Auxiliary Air Force, the WAAF. Her job had been to drive crash ambulances at airfields in the south of England, racing across the grass as crippled aircraft, often with their crews badly wounded, staggered home,” Dutfield explains. In a way, Ruth seeks to save men like her own father and in short admired military men like her father. \n\nFather and beloved daughter would reconcile years later but old Williams’ influence would resonate beyond the daughter’s WAAF role as shown by her later role in moving her eldest son into military service and sending him to Sandhurst Military School in Britain. Khama would later in his life be fast-tracked through the Police Mobile Unit to head of the Botswana Defence Force eventually. \n\nThe WAAF, where Ruth served, itself stands in the history of Britain as one of the most heroic organizations. It is not insignificant that Khama later became a pilot too because the WAAF was the women’s counterpart to the Royal Airforce during the World War II. It was formed in 1939 at the beginning of the World War II and at the height of its powers, it exceeded 180 000. WAAF members did not serve as aircrew, women were not allowed but did something second best to that, providing the framework upon which the British air force would function, serving in parachute packing, meteorology, radar, aircraft maintenance and ambulance services where Ruth served. Black and White pictures of women of the WAAF, with that hero-angle are still available to use in modern Britain. \n\nAs much as Ruth would have seen her father, a military man, as a hero, the young Ian would have been told of his maternal grandfather’s heroics as a British soldier in India. At the same time, it is possible that British airmen being attended to on emergency services by Ruth would have struck a chord, not just soldiers but specifically, pilots. It was her job to take care of these crash-landed pilots and combining her admiration of her dad as a soldier and these young pilots flying to dangerous enemy territory and coming back injured and needing help. So, father would have been hero to daughter. But daughter turned mother would also become hero to son, feeding the boy’s drive to emulate them. \n\nIf Ian Khama led a closeted life after he arrived in Serowe in 1953, as Seretse Khama biographers put it, then the boy made up for it with a closeness to his to his mother. They say he was a doting mother who wanted to keep her children near her, insulated from the surrounding rural environment. The closeness of Ian Khama to his mother is also natural, as many books have been written about the influence of mothers on their sons, especially their first-born sons. The British lady would work in formulating from her son, especially Ian, a model Brit, perhaps a version of her own father. In a way, the boy was destined to be a soldier. Later in life Ian Khama, now a Vice President, became protective of not just his elderly mother but her legacy. \n\nBack in the 60s as Seretse Khama got further into the tribal politics and later the mainstream pre-independence politics of Botswana, Ian Khama became more and more of a public figure although his was a routine between attending boarding schools, returning home and going back again. \n\nAfter stints in a Rhodesian school Ian Khama joined boarding school at Waterford Kamhlaba in Mbabane, Swaziland. Waterford is a member of a group of schools with campuses across the world. \n\nIt remains a mystery whether he completed his high school qualifications or not but in 1970 a 17-year-old Ian Khama left Waterford. He spent time after high school in a sort of academic island. Reports say he went to Geneva the following year to learn French, moving to London the following year. \n\nIn 1972, he joined the military college of Sandhurst. The school, established in 1947, gives preliminary training to military officers. RMA Sandhurst was a product of the merger of the Royal Military Academy which prepared Artillery and Engineering officers and the Royal Military College. At some point, it was the major training institution for entrance level military officers for the British army. Although not at the University level unlike schools such as West Point (US), National Defence Academy (India) and Australian Defence Force Academy, Sandhurst is one of the most recognizable names in military training. Ian Khama returned to Botswana in 1973 and joined the Police Mobile Unit, the precursor to the Botswana Police Service. The meteoric rise of Khama as a soldier and the impact of his military background on his government style are much obvious. \n\nThe Business Weekly & Review in an earlier story quoted declassified British documents indicating that the BDF was founded with pressure from Ruth Khama and the young Khama, against the wishes of senior civil servants at the time. According to archival records, the late Seretse Khama’s decision to form the Botswana Defence Force (BDF), taken in 1976 and implemented a year later, was a result of pressure from his family, particularly his wife, Ruth. It is said the First Lady wanted her husband to start the BDF to give then recent Sandhurst Military Academy graduate, Ian Khama something worthwhile to do. A brief from British Commission to the British Government, written by a certain W. Turner dated 16th January 1981 and bearing the official stamps and letterhead of the British Government, reveals that the BDF was formed under such questionable circumstances. \n\nHowever, Turner, quoting his encounters with Mogae and other civil servants, says that the late president was under tremendous pressure from his wife to give his first-born son who had recently completed military training at the British military college, something to do with his acquired knowledge. This version has been corroborated by a number of former senior cabinet ministers. \n\nThe BDF Bill was put to parliament and passed in 1977. Civil servants worried that the formation of BDF would attract of regional racist regimes who would want to test the BDF, preferring that the new government focus its efforts on diplomatic avenues. \n\nThe BDF would later cause a lot of concern when it dominated government spending during and after Seretse Khama’s presidency. Turner reveals that both then Vice President, Quett Masire and other senior government officials, among them Festus Mogae who was Permanent Secretary (PS) in the Finance and Development Planning Ministry and Philip Steenkamp, PS in the Office of the President were opposed to the project. \n\n“Mogae commented that the BDF is now a monster, absorbing more of the national wealth than could be afforded and diverting funds from worthwhile projects” states Turner’s brief. However, after the passing away of Seretse, the pressure to spend on the BDF, where Merafhe was commander and Ian Khama deputy, carried over to the Masire government, much to the consternation of civil servants at the Ministry of Finance and Development Planning (MFDP). “In the final years before President Khama’s death, Ian had been able to get anything he wanted from his father, who was then ailing and although Masire had always opposed the heavy expenditure he had been overruled by the president, who had imposed his will on the cabinet. The situation now was that Ian Khama and Merafhe had become extremely arrogant with ministers and officials,” states the letter. \n\nIan Khama must have been hurt by Mogae’s anti-defence spending position to the point that when Mogae returned from the United States (US) in 1981, he, Khama, is said to have noted that he was pleased by the latter’s departure in 1976, adding that the pro-BDF lobby had won a victory in his absence. However, Khama, through his office, rejected the account. “No, the president does not recall interacting with this individual. The president does not have a recollection of such a discussion with former President Mogae,” replied G. Pitso, Senior Private Secretary to the president. \n\nAt the time when the BDF was under Khama, it was the biggest employer in the country. In recent times Khama has insisted on heavy spending in the BDF. In the years between 1989 and 1998 when Khama was Commander, he averaged 4% of GDP in defence spending, one of the highest levels in the world, at the time. On average Khama outspent every BDF commander from Fisher to Galebotswe. It is not clear what prompted subsequent presidents to continue spending so heavily on the army, especially during Khama’s commandership. In a way, the formation and sustenance of the BDF indicates that Lady Ruth was prepared to move actively to make sure her son properly emulates her dad. What is true is also that she was still alive during these years, exerting influence over her son rapidly rising through the ladder of power. \n\nThe formation of the BDF is the first chapter where Khama views himself as a hero; and as much as Ruth would have been given all equipment she needed to save the bleeding soldiers as a WAAF, Khama would have seen the creation of the BDF and his inexorable match to its Commandership and his endless procurement of military equipment, merely as part of instruments a hero needs if he is to save the day. It’s the first-time state apparatus moved to feed this savior complex, but it would not be the last. \n\nVICTIMS CREATING THE HERO There is no point in creating a hero if there’s no one to be saved. Botswana’s society provided a solid platform in the creation and indeed sustenance of the hero syndrome in Khama, not just through the rushed formation of BDF against expert advice, but later in the overblown profile he gathers against his limited curriculum vitae. One major episode in the history of the BDF which would be later vaunted by Khama disciples was the shooting of three white men who had crossed into Tuli Block suspected to be undercover Rhodesian special forces, in March 1978. \n\n\n\nThe year started tragically and for Ian Khama, a potential challenge to his sense of heroism. In February 1978, less than a year after its founding, responding to reports of a Rhodesian military incursion along Botswana’s north-eastern border near the village of Lesoma, a BDF-mounted patrol drove directly into a Rhodesian ambush, sustaining 15 deaths. The Lesoma incident remains, so far, the biggest loss of life within the BDF and left a scar in the conscience. Of special relevance to Khama was that the men were under his him, given that he responsible of the northern part of the country. The death of the soldiers would have been seen as a serious threat to Khama’s sense of self and it would have affected his hero image for the story to be told and retold among the populace whose salvation was his destiny. \n\nTherefore, that March, just a few weeks after the Lesoma tragedy, when three white men suspected of being Rhodesian Special Forces trainees are caught in Tuli, Khama is quick to act. The men are arrested and then shot under Khama’s instructions. Reports indicate the men were attempting to escape. \n\nAmong the three was a 19-year-old Briton, Nicholas Love. In the months that followed Khama received pressure from all angles to tender an apology for the death of the teenager. “The unspoken point of issue was implicit criticism of Seretse’s eldest son Ian, who as deputy commander of the BDF had actually been in charge of the north-eastern frontier forces” say Parsons, Tlou and Henderson. Seretse refused to publicly relent on his defence of the BDF putting its actions within the context of the precarious situation in Botswana. \n\nBut this episode built on the Khama phenomenon. The shooting of a white man in the minds of black Batswana at the time, who had by now lived through a century of white colonial oppression served to elevate this belief that Khama was something special. His mixed-heritage, for a people who had lived through white supremacy and royal background, would have added to that mix that created Khama as the savior of Batswana. In a way, the formation of BDF against expert advice, the summary shooting of white soldiers by Khama, fitted the narrative that perhaps only Seretse’s son, himself half white, could save the country from destruction by evil whites of the southern African region. \n\nIn Khama’s mind his role as the savior of his people, and his people as helpless victims of their own inherent inability was developed. From then on Khama became a hero in folktales that were told to the young and his character was given superhuman powers including changing form to save each and every situation. Of course, incursions into Botswana increased following that Tuli Block episode, confirming the original thesis by some within government and BDF the latter would attract attacks to Botswana rather than stop them. If the BDF was formed to prevent such attacks, then it did not, because it was ill-prepared to confront the military strength of regional racist regimes, confirming the position held by Masire and Mogae at the time that diplomacy provided the best option for Botswana at the time. \n\nOn 14th June 1985, South African Defence Force under General Constand Viljoen crossed into Botswana reportedly in search of Umkhonto we Sizwe operatives. They killed 12 people including women and children and it was later reported that only 5 of the victims were members of the ANC. It is said in the aftermath Merafhe and Masire had to constantly remind the gun-happy Khama that BDF could not go to war with the SADF, a position Ian Khama saw as cowardice. Soldiers who have worked with Khama said he was adamant that they retaliate but strategists viewed this position as almost suicidal. The South African attacks must have hurt Khama, but he had foil, he could not be blamed for not responding. The South Africans only changed their intransigence once the British and American governments threatened to pull out of diplomatic relations. Ordinary Batswana would not be privy to such details, to them Khama had saved the day, rather than make the situation worse. \n\nThis story, to ordinary Batswana, fitted the profile of their savior Khama as a man who would move mountains to protect them against white abuse and despise the cowardice of their fellow black people such as Masire. \n\nIn a way Khama’s need for heroism is matched by Batswana’s projection such a quality on him. They in turn confirm the racist narrative in which whiteness equals ability, and in a way, projecting this expectation on him, it feeds his desire to be accepted as a man of European abilities. Every time he went to parliament to seek further funding, critical questions were never asked, firstly because he was very popular and secondly because he was the son of the beloved first president; But he was also King of Bangwato, a majority of policy makers were still his tribal subjects. At the same time, he could confirm with his admittedly aging mother, that indeed he was a capable heir to the Williams military heritage. Two things happened, both Batswana and Khama created a victim and hero out of each other. \n\n\nKhama, through his continuous rejection of black expert advice, came to know that it was not only it necessary to do so in some cases but useful to do so. He may have known throughout his childhood that he was above black Africans racially, it was also prudent for him to reject black expertise as more often, as Seretse Khama himself shown, and later Ian proved, you could make progress despite such advice. Also in Khama’s logic, because he is saving situations, he needs not necessarily entertain debates and exchanges of views before he can proceed with saving those who need to be saved. The savior often takes an authoritarian position forced by the power dynamics between hero and the helpless. Firstly, a savior does not have time for debates with those seeking her saving, if the ambulance is here Ruth Williams the driver needs the patient in it so she can drive away and save this life, not to hear the nurse debating with the injured pilot on how to place him on the stretcher. \n\nWhen the BDP was in a seeming crisis, a man of European heritage, Professor Patrick Schlemmer was hired to advice on the way forward. At that time, the party was at its wits’ end, party elders like Masire and his generation had run out ideas, they turned to this man to proffer his ideas out of the morass. Schlemmer released a report that would fit right into Khama’s sense of identity – he concluded that only Khama could save the situation. It is once again a moment when a type of man Khama inherently respects, expresses recognition for his abilities, especially to save a situation. \n\n\n\nThe Schlemmer conclusions would have resonated with Khama’s deep sense of self. It also confirms that indeed Khama is special, that being him, rules of interrogating capability and skill do not apply. By 1994, Khama had known nothing but the barracks but he was deemed more than capable of replacing such political experience, and intellectual depth as Ponatshego Kedikilwe or David Magang. Neither did he possess a professional profile relevant to political office of the kind Mogae or Baledzi Gaolathe possessed. However, President Mogae was prepared to dissolve parliament to force its hand if it rejected Khama as his Vice President, and the next president automatically. And when he was appointed president, he was received with ululations across the political divide. The media coined a phrase, The Khama Magic, a deep recognition that the man from Serowe possessed special powers beyond the normal, as far as this society is concerned. \n\n\nNow, from the top office, the man who had been a subject of folk tales could finally put into practice his destiny. However, Batswana nearly 10 years as President, Khama has been rejected by the intelligentsia and middle class, a matter he often says he finds incredulous. Whether this concerns him deeply or not is not clear as he comes to the end of his term. \n\nHowever recently, the Khama siblings landed in one of Europe’s most prestigious cities Berlin, Germany- for the ITB Berlin 2017 tourism expo. The city could not be any more European; it is the capital of the biggest economy in the European continent and one of the most iconic of cities in the world. It would have been a prestigious event for the Khama brothers and their contingent. So, when he arrives in that city he finds the streets paved with images of Botswana, the smiling faces of its happy natives and the scenery of flora and fauna, lions snarling, antelopes galloping. Then the real action begins, he does the official opening alongside none other than the German Federal Minister Brigitte Zypries. \n\nHe gets the opportunity to address and indeed be feted by the type of people he respects and in turn whose respect he craves. Spotlight on him and all eyes glazed at the podium, Khama gets the moment to shine where it matters the most to him – before an attentive group of European men and women. ITB Berlin is no small platform. \n\nIan Khama, the boy once rejected on account of being of mixed-race by a Rhodesian settler dentist; a boy whose mother, Ruth, was ostracized by some colonial Serowe British settlers for daring to be herself – was back as a hero in the very heart of Europe, before a people who, in the 50s, would have laughed him away. Now he was an equal among them, a better equal even. Next week – Seretse the absent father SHARE", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:55.000+03:00"}]