[{"entities": {"persons": [], "organizations": [], "locations": []}, "text": "Flames lament ‘what if’ Game 3 that slipped through their fingers Also Read \nCALGARY – It was a laugher that turned into a crier. Now, the Calgary Flames are one defeat from being swept out of the playoffs. \nCorey Perry capped a crazy Anaheim Ducks comeback 1:30 into overtime at the Scotiabank Saddledome on Monday night when his centering attempt banked off a couple Flames and wound up in the net for a 5-4 Ducks triumph. It was a stunning final blow in a game that saw Anaheim crawl out of a 4-1 deficit to snatch victory. \nNow, thanks in large part to two goals from defenceman Shea Theodore and a three-point night by grinder Nate Thompson, the Pacific Division champs are one win from advancing thanks to a 3-0 series lead. \n“A 4-1 game, you gotta close that out,” said Flames captain Mark Giordano . “There’s no excuses.” \nThere are, of course, reasons when something like this happens and there’s no hiding from the reality that goalie Brian Elliott had a large hand in Calgary’s undoing. \nThe Flames appeared to be cruising near the end of the second period, riding power-play goals from Sean Monahan , Kris Versteeg and Sam Bennett , as well as an even-strength marker by Michael Stone to a three-goal cushion that prompted Anaheim coach Randy Carlyle to yank John Gibson in favour of Jonathan Bernier . The shots after 40 minutes were 24-14 in favour of the Flames, but one of the Ducks’ last attempts – a sharp-angle floater from Theodore – eluded the glove of Elliott. \nIn a sombre Flames room, the goalie shouldered much of the blame. \n“That’s not an easy one, especially personally,” he said. “I didn’t feel I played very well and I let the team down a little bit. \n“I have to own that. It’s not an easy thing to do. The guys spotted four goals, we should win a game like that.” \nWhile Calgary was still in prime position to do so after 40, there’s no doubt Anaheim sprung to life after the goal. In fact, the Ducks nearly made it 4-3 in the dying seconds of the middle frame when Jakob Silfverberg rang one off the post. \n“We couldn’t seem to make two passes together for the better part the first two periods,” said Carlyle. “We got a goal that gave us some life and made us believe that we have a chance.” \nBased on past precedent, that should not have been the case. Calgary was lights out when it came to closing games in the regular season, posting a league best .971 points percentage in contests it led after two periods. \nAnd for 10 minutes of the third, there was no further indication of an Anaheim threat until Thompson – who was bumped up from the fourth line to the third during the game – tipped home a point shot with a stick video review confirmed was under the league’s legal height limit. \nThen, with fewer than five minutes remaining, a point shot from Theodore nicked off Bennett and found the net for the equalizer. By that point, the ‘C of Red’ was full of white knuckles as the home team crumpled. \n“We didn’t have enough push or drive,” said Giordano. “We allowed them to come and a few shots from the point went in. We sort of shelled up a little bit.” \nThe “what if” game will surely be played well into the night in Calgary. Both Monahan and Troy Brouwer had tap-in misses in the second period that inspired face palms and there’s no denying Anaheim continues to be on the right end of some fortuitous breaks. \nGame 2 was decided on a puck that caromed off Lance Bouma ’s skate in the high slot and somehow found the net; for most of the time it took to review Thompson’s deflection, Twitter was rife with non-partisans saying the goal would come back; Perry’s overtime winner kicked off Elliott’s stick, plunked Stone in the back of the leg while he battled Thompson on the lip of the crease and went into the net. \nStanley Cup Playoffs on Sportsnet NOW \nReady for playoff hockey? Stream every single game of the 2017 Stanley Cup Playoffs with Sportsnet NOW. \nA pity party, however, is not something Stone wants any part of. \n“I think those bounces are caused by different things that happen before it gets to that point,” he said. \nEven after all that, redemption seemed at hand for a precious moment in overtime when Johhny Gaudreau slipped behind the Anaheim defence. \n“We had a chance there with Johnny,” said Calgary coach Glen Gulutzan. “We were a foot away from springing him on a break.” \nThe pass, though, went just past the outstretched stick of the Flames sniper and, only seconds later, the game was over. \nAnd if Calgary can’t solve its problems quick, the series soon will be, too. Source:- http://q.gs/DgGjk", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "6681a912f47a5a409b7a8ffd2d3ce8a56f8a0ff3", "rating": null, "highlightTitle": "", "title": "Flames lament ‘what if’ Game 3 that slipped through their fingers", "thread": {"country": "SE", "site": "moraltime.com.np", "replies_count": 0, "title_full": "Flames lament ‘what if’ Game 3 that slipped through their fingers", "site_categories": [], "performance_score": 0, "section_title": "Central Sport", "domain_rank": null, "uuid": "6681a912f47a5a409b7a8ffd2d3ce8a56f8a0ff3", "main_image": "https://lh5.googleusercontent.com/proxy/KqBt-SByeFk3NYOviGYw-yWiyMo5W4XC3h5rHbg_0pSIQd8GN8fV44gymArC037cORE3JU0MjvTun7A3ADPvrWeqPm2o8ZMN3rpNTiCio0PznDWqs2b2un0izfu8rJMLHMEfE26O6f7rtq3x5naMvhbCMIZpRxf-Yq3gjmQUXzwI=w1200-h630-p-k-no-nu", "site_type": "blogs", "title": "Flames lament ‘what if’ Game 3 that slipped through their fingers", "spam_score": 0.0, "site_section": "https://anuarpan.blogspot.se/feeds/posts/default", "url": "http://omgili.com/ri/7aBdisT0NOpqC.LaH0mrw58aXauT5k4pvewhvlGJC_A9s1g_1Y6M2Ccmog6kseFBmA6ZBTSfDqbbxZUPLbf2Cw--", "participants_count": 1, "site_full": "sport.moraltime.com.np", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:25:36.000+03:00"}, "crawled": "2017-04-18T11:25:36.000+03:00", "url": "http://omgili.com/ri/7aBdisT0NOpqC.LaH0mrw58aXauT5k4pvewhvlGJC_A9s1g_1Y6M2Ccmog6kseFBmA6ZBTSfDqbbxZUPLbf2Cw--", "highlightText": "", "published": "2017-04-18T11:25:36.000+03:00", "author": "noreply@blogger.com (Central Tech)"}]