[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:53:26.000+03:00", "author": "admin", "entities": {"persons": [{"name": "kulbhushan jadhav", "sentiment": "negative"}, {"name": "hamid nehal ansari", "sentiment": "none"}, {"name": "sunil", "sentiment": "none"}, {"name": "masood akhtar", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "sajeed muneer", "sentiment": "none"}, {"name": "daniel mashi", "sentiment": "none"}, {"name": "singh", "sentiment": "none"}, {"name": "jadhav", "sentiment": "none"}, {"name": "ansari", "sentiment": "none"}, {"name": "bhim singh", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "kohat", "sentiment": "none"}, {"name": "peshawar", "sentiment": "none"}, {"name": "ambala", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}, {"name": "islamabad", "sentiment": "none"}, {"name": "bhopal", "sentiment": "none"}], "organizations": [{"name": "pakistani supreme court", "sentiment": "none"}, {"name": "national panthers party", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "isi", "sentiment": "none"}]}, "text": "Kulbhushan Jadhav death sentence: India, Pakistan hold many ‘agents’ in each other’s custody   Hindustan Times From left) Sunil, David and Daniel Mashi — three men who were jailed in Pakistan for espionage. \nFormer naval officer Kulbhushan Jadhav is not the only Indian in Pakistan’s custody on charges of spying. There are 13 others lodged in Pakistan jails, facing similar charges.More than 30 Pakistanis too were found to be lodged in Indian prisons – either convicted on charges of spying or facing trial — as per a 2015 list. \nJadhav is also not the only Indian to whom Pakistan has denied consular access. \nThe neighbouring country earlier refused consular access to Hamid Nehal Ansari, a 27-year-old management teacher from Mumbai, who went to Pakistan in search of a woman he fell in love on Facebook. \nHe disappeared after reaching Kohat near Peshawar. Later, during a court hearing in Pakistan, it transpired Ansari is in the custody of Pakistani intelligence agencies. \nIn all there are 208 Indians in Pakistani jail. Among them 174 are fishermen. \n“Among the civilian prisoners, 13 are facing espionage charges,” said a government source. \nIndia and Pakistan started exchanging list of nationals of each country lodged in other country’s jails following an agreement on consular access signed in 2008. \nUnder the agreement, twice every year — on January 1 and July 1 — both the countries exchange the lists of prisoners (civil as well as fishermen) through diplomatic channels simultaneously at New Delhi and Islamabad. \nDespite a chill in relations between the two countries, the last exchange of lists took place on January 1 this year. \nAt the time of last such exchange, the ministry of external affairs had said India remained committed to addressing with Pakistan on priority the humanitarian matters, including those pertaining to prisoners and fishermen in each other’s country. \n“In this context, we await from Pakistan confirmation of nationality of those in India’s custody who are otherwise eligible for release and repatriation. We also await consular access to those Indian nationals in Pakistan’s custody for whom it has so far not been provided including Hamid Nehal Ansari and Kulbhushan Jadhav,” said an Indian external affairs ministry’s statement during the exchange of list. \nOf the Pakistani nationals facing trial or undergoing sentence on the charges of spying in India, many have served their sentence but can’t be deported as Pakistan refuses to accept them as its citizens. \nSajeed Muneer, for instance, spent about 12 years in Indian jail for espionage before being released on June 5 last year. Pakistan does not acknowledge him as its national and hasn’t responded to India’s request to take him back. For the past 10 months, Bhopal police are taking care of his daily needs at a safe location. \nMasood Akhtar, another Pakistani national accused of being an ISI agent, was sentenced to 14 years of rigorous imprisonment in 2003. He was due for release but is still lodged in Ambala central jail. Jail officials say till the time they don’t get communication for his deportation from the ministry of foreign affairs, he will not be released. \nThe district magistrate issues orders every month for the extension of his imprisonment. \nActivists of an Indo-Pak peace initiative,’ Aaghaz-e-Dosti’ had accessed both the lists that were exchanged on July 1, 2015 through Right to Information Act in India. \nThe list had names of 251 Pak prisoners lodged in Indian jails. HT reviewed the charges against them and found that 31 among them were lodged either on the charges of collecting secret information or violation of Official Secrets Act. \nProfessor Bhim Singh, a patron of the National Panthers Party, has been fighting for release of those Pakistani prisoners who have completed their sentence and eligible for release. \n“I filed a petition in the Supreme Court in 2005 and hearing is still on in the matter. Following the litigation, on the directions of the top court, more than 500 Pakistani prisoners have been released,” Singh told HT. \nSingh is approaching the Pakistani Supreme Court for providing legal aide to Jadhav. \nIndia was about to release around a dozen Pakistani prisoners but following the announcement of death sentence to Kulbhushan Jadhav by a Pakistani military court, it has decided to put on hold the release.", "url": "http://omgili.com/ri/m1nCBNv_pozhwm4mOXSgYL.MOKiMh.voySwxmXEHBkNCVrbwiKyHMkO0kecBlyXURD.3H0MstDW39y4KRWBqsLO92bZJ7.0t00KjVJV4pXO_nQrXq8S776IJX7a6wGU2683nQMJQoxrk6eyd6Hl.YQ--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:53:26.000+03:00", "language": "english", "title": "Kulbhushan Jadhav death sentence: India, Pakistan hold many ‘agents’ in each other’s custody", "thread": {"title_full": "Kulbhushan Jadhav death sentence: India, Pakistan hold many ‘agents’ in each other’s custody", "site_full": "idrw.org", "site": "idrw.org", "site_section": "http://idrw.org/feed/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "news", "spam_score": 0.0, "domain_rank": 32785, "replies_count": 0, "site_categories": [], "country": "IN", "section_title": "Indian Defence Research Wing", "url": "http://omgili.com/ri/m1nCBNv_pozhwm4mOXSgYL.MOKiMh.voySwxmXEHBkNCVrbwiKyHMkO0kecBlyXURD.3H0MstDW39y4KRWBqsLO92bZJ7.0t00KjVJV4pXO_nQrXq8S776IJX7a6wGU2683nQMJQoxrk6eyd6Hl.YQ--", "published": "2017-04-16T09:53:26.000+03:00", "title": "Kulbhushan Jadhav death sentence: India, Pakistan hold many ‘agents’ in each other’s custody", "uuid": "11a343b3c55f7db3aa0e48ef4412b3055bd69bdb", "main_image": "http://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2017/04/16/Pictures/_15142c7a-2243-11e7-a5a9-704c25d3160d.jpg"}, "uuid": "11a343b3c55f7db3aa0e48ef4412b3055bd69bdb", "ord_in_thread": 0}]