[{"entities": {"persons": [], "organizations": [{"sentiment": "negative", "name": "barclays"}, {"sentiment": "negative", "name": "maharashtra barclays"}, {"sentiment": "none", "name": "investment bank"}, {"sentiment": "none", "name": "barclays values"}, {"sentiment": "none", "name": "recs"}, {"sentiment": "none", "name": "ib"}, {"sentiment": "none", "name": "intellimatch"}, {"sentiment": "none", "name": "lines of business and operations"}, {"sentiment": "none", "name": "program and project"}], "locations": [{"sentiment": "none", "name": "pune"}, {"sentiment": "none", "name": "maharashtra"}, {"sentiment": "none", "name": "americas"}, {"sentiment": "none", "name": "new york"}, {"sentiment": "none", "name": "singapore"}, {"sentiment": "none", "name": "asia"}, {"sentiment": "none", "name": "europe"}, {"sentiment": "none", "name": "africa"}, {"sentiment": "none", "name": "barclays"}, {"sentiment": "none", "name": "london"}]}, "text": "job title, keywords or company city or state Barclays 2,912 reviews - Pune, Maharashtra Barclays is an international financial services provider engaged in personal banking, credit cards, corporate and investment banking and wealth management with an extensive presence in Europe, the Americas, Africa and Asia. Barclays’ purpose is to help people achieve their ambitions – in the right way. With over 300 years of history and expertise in banking, Barclays operates in over 50 countries and employs approximately 140,000 people. Barclays moves, lends, invests and protects money for customers and clients worldwide. At Barclays, we recruit based on merit and are committed to promoting diversity throughout our organisation. About [Investment Banking] The Investment Bank is a leading provider of advice, financing and risk management solutions to companies, governments and institutions worldwide. We enable the movement of capital between those who need it and those looking to generate a return on investment. In doing so we fund and facilitate global economic growth, helping millions of people to achieve their ambitions. Our business is split into three core areas: markets, banking and research. We provide Barclays with a diversity of income and risk, and deliver market execution services for customers and clients within other parts of the Group. About [Reconciliation] Reconciliation is one of the most important detective controls used to support the accuracy and completeness of data held within IB systems and the bank’s books and records. Reconciliation within the context of this standard is defined as any process used to validate the accuracy of data, transactional data or other events held within Barclays' systems (settlement systems and sub ledgers) against related external or internal sources through: IntelliMatch is a 3rd party Reconciliation Application, widely used within the Investment Banking industry to address a spectrum of reconciliation requirements. IntelliMatch is Barclays’ Strategic Reconciliation Tool. To ensure the objectives of the Reconciliation control standard are met efficiently and effectively for reconciliations which are built using this platform it is expected that best practice designs and standards will be applied unless specifically approved otherwise. Overall purpose of role As this is an ETL SME and senior developer role, interacting with business / client stakeholders and assessing requirements for the new reconciliation and responsible for developing ELT transformations and workflows, configuration and implementation will be key purpose of the role. Key Accountabilities · Design and implement new features based on business and technical requirements · Work closely with the globally distributed development teams for development and maintenance application. · Responsible for working with business users to gather, understand, collate and document business requirements. Communicate with business to understand the requirement. · Build and test the ETL workflows; follow the test run process to produce the RECS results and release cycles working with other members of Program and Release team. · Understand existing implementation and deliver the additional functionalities that the business request · Adhere to the processes laid down by the Program and Project team to produce high quality deliverables and work artifacts. Stakeholder Management and Leadership · Work closely with the globally distributed development teams for development and maintenance application. · Work with the run team and the development team to provide 3rd line application support. Ability to own and resolve the production issues. · Responsible for working with business users to gather, understand, collate and document business requirements. Communicate with business to understand the requirement. · Leverage the internal or external networks to bring the solutions to the table. · Communicate effectively with business analysts, project managers and testers, understanding detailed business requirements at all stages of the development lifecycle · Must be able to build strong relationships across geographies (Singapore, London, New York) and multiple functional areas e.g. Run The Bank, Lines of Business and Operations group. · Provide technical, functional and management oversight to local team Decision-making and Problem Solving · Support the technical evaluation, root cause & gap analysis, identify the common issue patterns to come up with long term solutions of issues. · Participate in the problem management lifecycle, tracking and driving issues through problem resolution to controlled change. Person Specification · Contribute to development best practice across the group. · Cross-pollinate the best practices to other team members or resources working within same functional or technical portfolio. · Support the technical evaluation, root cause & gap analysis, identify the common issue patterns to come up with long term solutions of issues. Barclays Values and Diversity Our common purpose is to help people achieve their ambitions – in the right way. We’ll measure and reward our people, not just on commercial results, but on how they live our Values of Respect , Integrity , Service , Excellence and Stewardship and bring them to life every day. To find out more about working at Barclays and the development opportunities we offer please visit our website www.barclays.com We are an equal opportunity employer and we are opposed to discrimination on any grounds. Risk and Control Objective Ensure that all activities and duties are carried out in full compliance with regulatory requirements, Enterprise Wide Risk Management Framework and internal Barclays Policies and Policy Standards", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "11a4cea9db304ee7fb70b17e4fb03818e6e547b7", "rating": null, "highlightTitle": "", "title": "ETL Developer - Barclays - Pune, Maharashtra", "thread": {"country": "IN", "site": "indeed.co.in", "replies_count": 0, "title_full": "ETL Developer - Barclays - Pune, Maharashtra", "site_categories": [], "performance_score": 0, "section_title": "network Jobs in Pune, Maharashtra | Indeed.co.in", "domain_rank": 1813, "uuid": "11a4cea9db304ee7fb70b17e4fb03818e6e547b7", "main_image": "", "site_type": "blogs", "title": "ETL Developer - Barclays - Pune, Maharashtra", "spam_score": 0.0, "site_section": "http://www.indeed.co.in/rss?q=network&l=pune", "url": "http://omgili.com/ri/jHIAmI4hxg_WOVzQkS29a9b.0jDEodS4YEyDV4q6nEzi.RTen8weRnax0NVNuin9LlShFZ9e9Z4_OceiiLhpOQa_ps9.pfSB7xFUnF4hjC8o.W91frI40YWVFEwwoh71", "participants_count": 0, "site_full": "www.indeed.co.in", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-17T14:27:00.000+03:00"}, "crawled": "2017-04-18T11:27:10.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_WOVzQkS29a9b.0jDEodS4YEyDV4q6nEzi.RTen8weRnax0NVNuin9LlShFZ9e9Z4_OceiiLhpOQa_ps9.pfSB7xFUnF4hjC8o.W91frI40YWVFEwwoh71", "highlightText": "", "published": "2017-04-17T14:27:00.000+03:00", "author": ""}]