[{"uuid": "8e6fa8c0b8bdf4eba46f6971ce65df36a75079cb", "url": "http://omgili.com/ri/jHIAmI4hxg9J7QMKtRP1.D18Phy.b9PFkOzUBPu06IrvlvKNXGkK9681Qwj6IrCmGZFOLfmGA7Pj48hUerZtU.GIuFynlF80_t6UG2gb6j_EbempPHL5yvf11roIge1FPNFbhybHebRstPjIvY6EhG3XIjkHaRwMcDslJp04QPTA24rTaL6lYA--", "title": "Movie Review: Chakravarthy", "author": "Shyam Prasad S", "rating": null, "published": "2017-04-14T20:46:00.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "ram gopal varma", "sentiment": "negative"}, {"name": "national anthem", "sentiment": "none"}], "locations": [{"name": "aditya", "sentiment": "none"}], "persons": [{"name": "chakravarthy", "sentiment": "negative"}, {"name": "chinthan", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "vande mataram", "sentiment": "none"}, {"name": "toogudeepa srinivas", "sentiment": "none"}, {"name": "srujan lokesh", "sentiment": "none"}, {"name": "muthappa rai", "sentiment": "none"}, {"name": "kumar bangarappa", "sentiment": "none"}, {"name": "varma", "sentiment": "none"}, {"name": "dinakar", "sentiment": "none"}, {"name": "rai", "sentiment": "none"}, {"name": "darshan", "sentiment": "none"}, {"name": "shankar", "sentiment": "none"}, {"name": "chandrashekar", "sentiment": "none"}, {"name": "arjun janya", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "8e6fa8c0b8bdf4eba46f6971ce65df36a75079cb", "url": "http://omgili.com/ri/jHIAmI4hxg9J7QMKtRP1.D18Phy.b9PFkOzUBPu06IrvlvKNXGkK9681Qwj6IrCmGZFOLfmGA7Pj48hUerZtU.GIuFynlF80_t6UG2gb6j_EbempPHL5yvf11roIge1FPNFbhybHebRstPjIvY6EhG3XIjkHaRwMcDslJp04QPTA24rTaL6lYA--", "site_full": "www.bangaloremirror.com", "title": "Movie Review: Chakravarthy", "site_section": "http://bangaloremirror.indiatimes.com/", "domain_rank": 24605, "published": "2017-04-14T20:46:00.000+03:00", "title_full": "Movie Review: Chakravarthy - Bangalore Mirror", "participants_count": 8, "replies_count": 7, "spam_score": 0.297, "section_title": "Bangalore News: Latest &amp; Breaking City News Headlines | Bangalore Mirror", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "IN", "performance_score": 0, "main_image": "http://bangaloremirror.indiatimes.com/photo/58185587.cms", "site": "bangaloremirror.com"}, "external_links": [], "language": "english", "text": "A pinch of suspense to grab the interest\nRam Gopal Varma may want to take a look at Chakravarthy. This film (or rather a substantial portion of it) is a thinly disguised (but dramatised and commercialised) story on Muthappa Rai. Varma had announced a film, Rai, last year.\nHowever, debutant director Chinthan ensures that there is no direct refer ence to any real-life person. For those not familiar with the stories of Bengaluru's dark underbelly, it would be quite a task to connect the dots. Creative licence also ensures that patriotism and superhuman elements are infused in to the story. While being quite realistic in the first half, the film's 'creative' ending is only a commercial exploitation of patriotism.The first half of the film recreates the 1980s and is a buildup to the murder of an underworld don named Maharaja. This was just a 10-minute episode in the film Om. But here, a new protagonist is introduced in the entire proceedings; Darshan as Shankar. The stories of Bengaluru's under belly is presented in a different light. After single-handedly cleaning up the city of its bad elements, Shankar has to leave the country. But what is a film without a little suspense? How can a film's hero be the bad guy even if he is an underworld don? Or is he really a don? That's the creative part that makes a film hero's character?Read Also This Friday's releases\nDespite being on familiar territory, the first half of the film manages to keep the audience engaged. However, the second half becomes a drag with the narrative moving forward only with the help of dialogues. Exotic locales and scenes on a cruise ship does not make up for the lack of a visual narrative.\nThe biggest relief is that Chakravarthy is not another star vehicle. The director seems to be aiming for a national award for the best entertainer by incorporating not only the National Anthem but also Vande Mataram in the film. Shankar's personal life could have been fleshed out better. An embroidered lotus on his favourite shirt is the closest we see of his personal life. The son's character disappears without a trace after a few scenes.\nDarshan's maturity shows in some scenes and he is as convincing a screen don anyone can be.\nDinakar reminds of his father Toogudeepa Srinivas. Chandrashekar's cinematography and Arjun Janya's music add value to the film and so does the presence of a top-star cast that includes Aditya, Kumar Bangarappa and Srujan Lokesh. Chintan makes a promising debut as a commercial movie director. Chakravarthy may not be the best, even in terms of a commercial potboiler, but it has enough ammunition to be a cracker for Darshan's fans. Did you hear me say fate of the furious?\nKannada film makers are increasingly forgetting that their primary audience are Kannadigas. While characters speaking different tongues may be necessary for the plot, common sense suggests that there be Kannada subtitles for them.\nA large dose of Hindi dialogues spoken by a couple of characters in Chakravarthy reinforces the need.", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:48.000+03:00"}]