[{"entities": {"organizations": [{"name": "brics", "sentiment": "none"}, {"name": "institute of chinese studies", "sentiment": "none"}, {"name": "china institutes for contemporary international relations", "sentiment": "none"}, {"name": "ministry of external affairs", "sentiment": "none"}, {"name": "institute of contemporary tibetan studies", "sentiment": "none"}, {"name": "rashtrapati bhavan", "sentiment": "none"}, {"name": "fudan university", "sentiment": "none"}, {"name": "government of india", "sentiment": "none"}, {"name": "foreign ministry", "sentiment": "none"}, {"name": "arunachal pradesh", "sentiment": "none"}, {"name": "11th panchen lama", "sentiment": "none"}, {"name": "china tibetology research centre", "sentiment": "none"}, {"name": "mos home", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}], "locations": [{"name": "tibet", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "delhi", "sentiment": "none"}, {"name": "one belt", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "urgeyling monastery", "sentiment": "none"}, {"name": "beijing vijay gokhale", "sentiment": "none"}, {"name": "tamil nadu", "sentiment": "none"}, {"name": "sikyong", "sentiment": "none"}, {"name": "lhasa", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "mongolia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hindsight", "sentiment": "none"}, {"name": "tawang", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "one road", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "arunachal", "sentiment": "none"}, {"name": "jokhang temple", "sentiment": "none"}, {"name": "india-versus-china", "sentiment": "none"}], "persons": [{"name": "rao", "sentiment": "none"}, {"name": "pema khandu", "sentiment": "none"}, {"name": "lin minwang", "sentiment": "none"}, {"name": "panchen lama", "sentiment": "none"}, {"name": "hu shisheng", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "nirupama rao", "sentiment": "none"}, {"name": "tenzin gyatso", "sentiment": "none"}, {"name": "bharat ratna", "sentiment": "none"}, {"name": "tsai ing-wen", "sentiment": "none"}, {"name": "ajit doval", "sentiment": "none"}, {"name": "masood azhar", "sentiment": "none"}, {"name": "xi jinping", "sentiment": "none"}, {"name": "jambey lobsang", "sentiment": "none"}, {"name": "modi", "sentiment": "none"}, {"name": "ashok kantha", "sentiment": "none"}, {"name": "dalai lama", "sentiment": "none"}, {"name": "hu", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "piyush goyal", "sentiment": "none"}, {"name": "kantha", "sentiment": "none"}, {"name": "himachal pradesh", "sentiment": "none"}, {"name": "lama lobsang", "sentiment": "none"}, {"name": "tawang", "sentiment": "none"}, {"name": "nirmala sitharaman", "sentiment": "none"}, {"name": "lobsang sangay", "sentiment": "none"}, {"name": "kiren rijiju", "sentiment": "none"}, {"name": "mcmahon line", "sentiment": "none"}, {"name": "lian xiangmin", "sentiment": "none"}]}, "uuid": "a9e240663572614efd89836e25741b995c4438c7", "highlightText": "", "title": "Tibet card : UPFRONT - India Today 24042017", "thread": {"site": "intoday.in", "country": "IN", "participants_count": 0, "site_full": "indiatoday.intoday.in", "section_title": "", "uuid": "a9e240663572614efd89836e25741b995c4438c7", "site_section": "", "domain_rank": 654, "main_image": "http://media2.intoday.in/indiatoday/images/stories/upfront-1-3-apr24-1_647_041317044902.jpg", "performance_score": 0, "published": "2017-04-14T00:49:00.000+03:00", "url": "http://omgili.com/ri/m1nCBNv_poxSMGMZ1VQHBYxz9LUzWKzkwGgmyHm_WkLPG5J5kkipW.X56WyPYRnWIfne9uCVVbpCNM.lsf74Qhas9ey2UJIpxa5k4UIPOQbxEzFsRH5oQV0qk7lVzGarQZDStlMhQkoL.8ogfkuVwQ--", "title_full": "Tibet card : UPFRONT - India Today 24042017", "title": "Tibet card : UPFRONT - India Today 24042017", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 14, "shares": 14, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.177, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-14T00:49:00.000+03:00", "url": "http://omgili.com/ri/m1nCBNv_poxSMGMZ1VQHBYxz9LUzWKzkwGgmyHm_WkLPG5J5kkipW.X56WyPYRnWIfne9uCVVbpCNM.lsf74Qhas9ey2UJIpxa5k4UIPOQbxEzFsRH5oQV0qk7lVzGarQZDStlMhQkoL.8ogfkuVwQ--", "ord_in_thread": 0, "crawled": "2017-04-16T22:28:03.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "", "text": "A + A - Photo: TENZIN CHOEJOR / AP \nThe symbolism of the Dalai Lama's week-long visit to Arunachal Pradesh, his seventh to the state including his arrival 58 years ago, wasn't lost on local residents. In the monastery town of Tawang, where the Tibetan spiritual leader first arrived in India in 1959, aged 23, after a perilous 15-day journey across the Tibetan plateau, thousands lined up on April 6 to receive him. \"This is a very special visit for us,\" said local businessman Jambey Lobsang, 28, \"because I don't think the Dalai Lama may come back given his age. He is energetic, but we mustn't forget he is 81.\" \nTawang is where the remarkable 58 year journey in exile began for Tenzin Gyatso, the 14th Dalai Lama. Tawang is also where the final chapter of his leadership of the Tibetan movement may begin. Although he is a very healthy 81 - and Tibetans understandably don't even want to contemplate life after the 14th Dalai Lama - the question of his succession looms ever larger. And Tawang, the birthplace of the 6th Dalai Lama, is for many the most likely location where a reincarnation could be chosen. \nThis significance wasn't lost on China, which responded more angrily than it had done during the Dalai Lama's previous visits to Arunachal. Besides his 1959 arrival, the Tibetan spiritual leader has visited in 1983, 1997, twice in 2003 and in 2009. On April 5, Beijing summoned the Indian Ambassador in Beijing Vijay Gokhale - as it had done in earlier visits, and most recently when Prime Minister Modi visited Arunachal last year. But the Foreign Ministry also warned it would take \"necessary measures\" to defend its sovereignty, and accused India of \"violating its solemn commitments on Tibet-related issues\". In the eyes of some Chinese officials, statements by Arunachal Pradesh Chief Minister Pema Khandu, who said the state bordered Tibet and not China, as well as remarks by the Dalai Lama criticising Chinese rule in Tibet, had \"violated\" India's commitments that Tibet is part of China and it wouldn't allow \"anti-China\" political activities. \n\"Definitely this time the stridency of their tone and the kind of language they have used and frequency of their comments is far more than we had seen earlier,\" said Ashok Kantha, India's envoy in Beijing until 2016 and director of the Institute of Chinese Studies, who was also handling relations with China at the Ministry of External Affairs in Delhi at the time of the earlier visits in 1997 and 2003. \nChina's response \nBoth in Delhi and in Beijing, the Tawang visit has been seen as a shift in India's diplomacy. Supporters of the Modi government say India is finally standing up to China - ironically, a view echoed in Beijing, where State newspapers said India was \"playing the Tibet card\". Hu Shisheng, a scholar at the China Institutes for Contemporary International Relations in Beijing, said the visit was \"part of a series policies the Indian government has been taking in playing the Tibet card,\" referring to the Dalai Lama being hosted in December for the first time at Rashtrapati Bhavan along with other Nobel laureates, and Minister of State for Home Affairs Kiren Rijiju accompanying him to Arunachal. \n\"It seems to me that this [the Modi] government's Tibet policy is Americanised,\" said Hu. \"When nearly all the other countries are respecting China's Tibet policy and hold themselves aloof from the Dalai Lama and his group, only the Americans and Indians are still loving to play this card to embarrass or even to disgust China. Modi's government from the very beginning has been stirring up this issue once and again, from inviting Lobsang Sangay [the Sikyong, or \"prime minister in exile\"] to attend the inauguration of Prime Minister Modi, to the meeting between the Indian President and Dalai Lama, from the parliament member talking about awarding the Bharat Ratna to the Dalai Lama, to being accompanied by the minister to the disputed area between India and China. What is much worse is the so-called chief minister even saying that his state does not share a boundary with China. This is really too much.\" \nHow is China likely to respond? Hu says \"China has various resources to deal with such deliberate anti-China policies, like suspending some interaction mechanisms.\" Lin Minwang, a strategic affairs expert in Fudan University in Shanghai, adds, \"China has many 'cards' which can be used to counter India, but it would be unwise to try to put economic costs to India or stop some exchanges. This is not the way China conducts its foreign policy.\" In the past, with respect to India, Beijing's strong statements didn't lead to specific actions, in contrast to steps China has taken with other countries that hosted the Dalai Lama, most recently Mongolia, which saw a brief suspension of diplomatic and trade ties. \nThe sense is Beijing has one eye on the BRICS Summit it is hosting in September, which China hopes will be a grand success, without disruptions, and will showcase Xi Jinping as a global leader. BRICS will take place barely a month before the key once-in-five-year 19th Party Congress, where Xi will hope to consolidate his authority and promote his acolytes. It also remains unlikely China will disrupt a busy calendar of exchanges between both countries in the lead up to BRICS, with three Indian ministers - Finance Minister Nirmala Sitharaman and Power Minister Piyush Goyal -expected in June and July, and National Security Adviser Ajit Doval also due for the BRICS NSAs meeting. And for now, China is preoccupied with its major One Belt, One Road forum that Xi Jinping will host in May, with 20 heads of state likely to attend. Somewhat fortunately, there are no major engagements with India until then, yet Beijing could still choose to flex its muscles. \nThe Tibet Card \nBeyond the optics, has there been a change in India's approach? \"If there is any change, it is actually on the Chinese side, not on the Indian side,\" said Kantha, the former envoy, suggesting India, in fact, had been very consistent in allowing the Dalai Lama to travel. Kantha makes a persuasive case to underline that the seventh visit, in many respects, reflected more continuity than change, and that perhaps the difference this time was more in Beijing's response. \"Gradually, they have become more strident in their tone,\" he says. \"All Indian leaders including the present Prime Minister have received the Dalai Lama. We didn't go out of the way to publicise these meetings. This is a perfectly routine practice we have pursued for 60 years. It is fairly routine for local chief ministers and dignitaries to receive him too.\" \nAs for China's argument that the presence of Minister of State for Home Affairs Kiren Rijiju in the first stop in Arunachal underlined that this visit was qualitatively different and \"official\", Kantha dismisses that notion, pointing out that \"the minister comes from Arunachal so accompanying him is not being done by the Government of India to make a point. If the MoS Home wasn't from the state, it's very unlikely a central government minister would have travelled all the way.\" The visit, Kantha adds, did not violate any of India's commitments on Tibet. India's position on Tibet being a part of China still stands. \"There is nothing we have done that runs counter to that and by no stretch of imagination can this visit be described as an anti-China activity,\" he adds. \"The Dalai Lama travels extensively as you are aware, both within and outside India. Can we really tell him he cannot go to Arunachal? The Chinese should sit back and think. The visit to Arunachal for us was on par with him visiting Himachal Pradesh, or Tamil Nadu for that matter.\" \nThe idea that India can use the Dalai Lama as \"a card\" has been suggested by both Indian strategic experts, who see it as easy leverage, and more recently by the Chinese media, that has alleged the recent visit was proof of India \"playing the Dalai Lama card\". Kantha, however, describes it as \"a figment of the imagination\". \"I don't see the Dalai Lama being used by the Government of India. The way the Government of India manages our relations, it's not in such a tactical way. What does the Government of India get out of it? Does it yield any tangible returns?\" Nirupama Rao, former foreign secretary and former envoy to China, says the Tibet card \"is a stereotyped cliche that if Tibet is not China's, it is ours to gain\". \"We have no ulterior motives in Tibet. Our brief is not Curzonian,\" says Rao. \"India has held the line on Tibet with biblical patience all these years.\" Rao says, adding that \"Beijing cannot claim even a modicum of moral ground on this issue\". \nChanging China \nThe challenge facing India is a greater Chinese assertiveness on its \"core\" interests, and Tibet and Taiwan are top of the list. When the new U.S. President Donald Trump threatened to review the 'One China policy' and had a telephone call with the Taiwan President Tsai Ing-wen, Beijing threatened to cut off all contact and did not arrange the first telephone call between Xi Jinping and Trump until the U.S. President agreed to publicly reaffirm the 'One China policy'. Xi called Trump only after he agreed to do an embarrassing u-turn on his campaign trail bluster. With Chinese sensitivities already unnerved by Trump, there is a sense that the Dalai Lama's visit, shortly after, perhaps triggered a greater than usual outburst. \nRao, the former foreign secretary, says India shouldn't cave in to Chinese assertiveness. \"China sees Tawang as 'disputed territory' and is deeply suspicious and insecure about the Dalai Lama's aura and the weight of his global persona. With this latest development it is as if two atoms have collided. The Chinese have shown little sensitivity to India's well-justified grievances on Masood Azhar or their activities in PoK. Rolling over and playing dead cannot be an option for a self-respecting large country like India,\" she says. \"The Chinese keep talking about the sentiments of the Chinese people and how their government cannot ignore them. The same thumb rule applies for the Indian people, too.\" \nSuccession Question \nAnother possible explanation for China's fiery response is its increasing anxiety on the succession question. If the 15th Dalai Lama were chosen from Tawang, Beijing is aware that she or he could emerge as a far more credible successor than the candidate that China will put forward. \"The Chinese are laying down markers in terms of controlling the process,\" says Kantha, \"and its likely to become a contentious issue.\" Hence, as the Dalai Lama visited Tawang, China's government, as well as its offiical Tibetologists, came out with strong statements reaffirming Beijing's stand on the succession question. \"The reincarnation of the Dalai Lama must be conducted according to religious rituals and historical conventions including drawing of lots from the Golden Urn in front of the Buddha statue at the Jokhang Temple in Lhasa, which embodies the Buddhist spirit, and not by what the 14th Dalai Lama has said,\" the Foreign Ministry said. \nLian Xiangmin, Director of Institute of Contemporary Tibetan Studies at the official China Tibetology Research Centre that advises the government on Tibet policy, said his hope was that \"the Dalai Lama's succession should be found in his homeland, that is China\". \"There are six million Tibetan people. Apart from religious followers who are Tibetan there are also people of other ethnic groups who follow Tibetan Buddhism. I believe they hope to see the 14th Dalai Lama produced in China. So far, there have been 14 Dalai Lamas produced in China.\" \nYet Beijing knows that if the Dalai Lama chooses a successor on his own terms, it will likely face a huge challenge in pushing the credibility of its candidate, as underlined by the difficulties China has faced in promoting its candidate for the 11th Panchen Lama, who hasn't been given a high public profile by Beijing. Nirupama Rao, the former foreign secretary, argues that this is an issue in which India has a stake. \"We are stakeholders because we cannot abandon the interests of the Tibetans who live in India. The window is open during the lifetime of His Holiness the Dalai Lama. Our position should be that the religious and cultural sanctity of the process of succession should be respected and upheld above all. We should be flag bearers on this aspect.\" \n\"The world, not just India, consciously abandoned Tibet to its fate in 1950,\" adds Rao. \"Only His Holiness the Dalai Lama retains his sanctity in this sorry narrative. While Tibet cannot be a geopolitical pawn on the India-versus-China chessboard, given the Chinese stand on the McMahon Line, our signing on the dotted line of confirmation of Tibet as a part of China put us in a twist, condemned to strategic purgatory, neither in heaven nor hell. Hindsight is a hurtful thing.\" \nUncertain Future \nWith an increasingly assertive China, coupled with the growing prominence of the succession issue, the Tibet question is emerging again as a prominent factor in India's relations. China's claims on Tawang have grown louder since they were first voiced in 1985, and despite a border agreement signed between both countries in 2005 that both sides would take into account the interests of settled populations when arriving at a mutually acceptable solution for the boundary dispute. \nIn Tawang, many fear this may be the Dalai Lama's last visit, even though the Arunachal Pradesh state government has invited him back to conduct a Kalachakra initiation, which would, in all certainty, trigger another diplomatic row with China. For Tawang's residents, however, China is far from their minds. A greater concern is poor roads and bad infrastructure. A 20 km drive into Tawang takes one hour. Few in Tawang are willing to speak about the succession question, which is a highly emotive topic. No one, understandably, wants to contemplate life after the 14th Dalai Lama. Among younger residents, some are aware China will have its say on the reincarnation, given the Panchen Lama controversy. \nFew in Tawang saw the Dalai Lama's visit as being any different from the his previous one in 2009. As then, the entire Tawang town was decked up in flowers, prayer flags, as well as Indian and Tibetan flags. Also as in 2009, there appeared to be some hesitation from the government, as the Tibetan flags vanished overnight in some places, although not at the famous Tawang monastery. Uncertainties notwithstanding, for Lama Lobsang, the caretaker of the Urgeyling Monastery in Tawang where the sixth Dalai Lama was born, the future couldn't be more clear. \"China,\" he says simply, \"should mind its own business.\" For more news from India Today, follow us on Twitter @indiatoday and on Facebook at facebook.com/IndiaToday For news and videos in Hindi, go to AajTak.in . ताज़ातरीन ख़बरों और वीडियो के लिए आजतक.इन पर आएं. "}]