[{"rating": null, "external_links": [], "crawled": "2017-04-16T08:22:10.000+03:00", "author": "Riddhi Doshi", "entities": {"persons": [{"name": "ellen barry", "sentiment": "negative"}, {"name": "geeta anand", "sentiment": "none"}, {"name": "ellen", "sentiment": "none"}, {"name": "geeta", "sentiment": "none"}, {"name": "barry", "sentiment": "none"}, {"name": "anand", "sentiment": "none"}, {"name": "avirook sen", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "south asia", "sentiment": "none"}, {"name": "kashmir", "sentiment": "none"}, {"name": "peepli khera", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "bolshoi ballet", "sentiment": "none"}, {"name": "noida", "sentiment": "none"}, {"name": "premwati", "sentiment": "none"}, {"name": "avirook sen", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "new york times", "sentiment": "negative"}, {"name": "south asia bureau", "sentiment": "none"}, {"name": "nyt", "sentiment": "none"}]}, "text": "#Avirook sen #Ellen barry #Ellen barry nyt #Fweekend #New york times #Nyt #Pulitzer #Reporting \nA compelling story in the New York Times titled ‘ In India, A Small Band of Women Risk It all For A Chance to Work ’ in January 2016, highlighted the struggle of Indian women to access the labour market, and work and earn a living with respect. The narrative wove in stories of two friends — Geeta and Premwati — of Peepli Khera village, even as it laid bare the disturbing gender inequality in India’s work force. \nThe author — Ellen Barry, NYT 's South Asia Bureau chief — says the story was among the most challenging ones she pursued during her four-year stint in India, which comes to an end this August. \n“This is a subject I care about passionately: If more Indian women are able to earn for their families, I think that will have an enormous impact on the treatment and education of girls, age at first marriage and first childbirth, and problems like dowry-related violence and female feticide,” said Barry via an e-mail. It is a problem that she believes has gotten far too little attention from the government and the research community. “It is a challenging subject because it is complex and not as shocking or attention-grabbing as problems like rape or honour killing. It was important to me to shift the focus.” Ellen Barry's report on Indian women's struggles to access the labour market, as seen on the New York Times website \nThis story is also an absolute favourite of Barry’s friend and colleague Geeta Anand, who also liked her second piece about young women (working) in manufacturing in Bengaluru, on the same subject. “She (Ellen) spent months with these women, finding those telltale anecdotes and descriptions that elevated the pieces into great literature. They are fresh stories and they are among the best narrative nonfiction I have ever read,” says Anand, via an e-mail. \nBarry’s quick turn-around time and great writing skills makes the mother of two daughters one of the most sought after journalists in the field. “I loved her story about the injuries to protestors’ eyes in Kashmir,” says Anand. “Read it. I was amazed that she could turn around a news feature in just two or three days and that it could be so compellingly written and deeply reported. She begins by describing the eye surgery to repair a damaged eye. Read it,” she repeats. \nBarry though is never satisfied with her work and is always striving to be better. “I think Ellen’s great strength, besides her great talent, is her self-criticism. It’s hard to give her a compliment, because she doesn’t quite believe it,” says Anand. “Every story of hers that you tell her was great, she’ll point out the things that weren’t quite up to her standard, where she should have done more. This tortures her. But it makes her a better and better journalist with every passing year.” \nIn 2011, while posted in Russia, Barry was part of a team which won the Pulitzer Prize for International Reporting for highlighting instances of impunity in the country’s justice system and also covered the resurgence of Russia’s Cossacks; a meteor that slammed into the atmosphere there and a scandal at the Bolshoi Ballet, which started with a dancer throwing acid into the face of creative director. Ellen Barry will leave India this August, when her four-year stint as South Asia bureau chief for the New York Times ends. Image courtesy Ellen Barry's Facebook page \nIn August 2013, after five years in the former Soviet space, Barry was exhilarated to be India, which she says is a wonderful place to report as people are not afraid to speak their mind in public, including to reporters. “It is a free society in that sense. More frustrating is that top officials rarely feel compelled to answer challenging questions about policy and performance, which makes it difficult for journalists to hold them accountable,” says Barry. “This country is full of excellent, courageous journalists. They need institutional support from outlets and their owners in order to hold leaders' feet to the fire.” \nAs a bureau chief who shapes coverage of South Asia, Barry’s extremely ambitious, stays well informed and is constantly looking for how to tell the most important stories of the region is the most compelling way, says Anand. \nOf Barry's understanding and coverage of India, Anand says Ellen is among a handful of westerners she has met who have amazed her with how rapidly they can understand a country, its history, its politics and its people. “And so she wrote knowledgeably and with subtlety and compassion and curiosity about India.” \nAnand also goes on to say that Barry’s are almost always the best stories on whatever topics she tackles. “Her strengths are her speed and her intelligence and her writing talent. She’s also extremely hard working. Many people who are as talented writers might try to cut corners on the reporting. But Ellen makes twice as many calls as most reporters I know, and then begins writing. That means her stories are not only accurate but incredibly in-depth.” \nNot everyone is as pleased with Barry's work. Avirook Sen, author of the book Aarushi , based on the double murder in Noida, picked on Barry at an event for her critical review of his book. “I wrote a critical review of Avirook Sen’s book on the murder investigation. He did not like my review,” puts Barry simply. \nCome August, at the end of the stipulated four-year posting in any country by NYT , she will head to London to take on new responsibilities as Chief International Correspondent and is free to write on any region where she finds compelling stories, including India. But she plans to focus on Europe. “I am interested in the rise of right-wing populism and nationalism in the west. This is a process I observed in Russia, where I was posted between 2008 and 2013. It also reflects political changes going on in the United States and the decline in the US's global influence,” says Barry. \nAnand thinks that Barry has elevated the standard of journalism in India. “When you read an Ellen Barry story, you knew it would be deeply reported and accurate and you knew it would be written more compellingly than anything else on the subject,\" says Anand. \"Her project on working women in India is the best feature writing I’ve read since I’ve been here.\" \nPublished Date: Apr 16, 2017 10:44 am | Updated Date: Apr 16, 2017 10:44 am Also See", "url": "http://omgili.com/ri/jHIAmI4hxg_iwz6VMN0gZxssDM7bUbWEJkx9ab7BGD.kN20f.SKuhIRaC7pvndxny8x_BumgPs09Oty_h5vYNPkBuda4F3nPhQw1UN_QtlmovjvNoQgSh_hO2MG6wOlpnMwKmph5tjt4RQRtVAWAyzYvJ6LJ3cMLYbKCq1kecTY4KqkRDbIOfw--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T08:22:10.000+03:00", "language": "english", "title": "New York Times’ Ellen Barry’s India stint is ending; her compelling journalism will stay on", "thread": {"title_full": "New York Times’ Ellen Barry’s India stint is ending; her compelling journalism will stay on", "site_full": "www.firstpost.com", "site": "firstpost.com", "site_section": "http://feeds.feedburner.com/firstpost/xfJh?utm_source=fp_footer", "performance_score": 1, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 157, "shares": 157, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "news", "spam_score": 0.0, "domain_rank": 1168, "replies_count": 0, "site_categories": [], "country": "IN", "section_title": "Firstpost", "url": "http://omgili.com/ri/jHIAmI4hxg_iwz6VMN0gZxssDM7bUbWEJkx9ab7BGD.kN20f.SKuhIRaC7pvndxny8x_BumgPs09Oty_h5vYNPkBuda4F3nPhQw1UN_QtlmovjvNoQgSh_hO2MG6wOlpnMwKmph5tjt4RQRtVAWAyzYvJ6LJ3cMLYbKCq1kecTY4KqkRDbIOfw--", "published": "2017-04-16T08:22:10.000+03:00", "title": "New York Times’ Ellen Barry’s India stint is ending; her compelling journalism will stay on", "uuid": "f33167212bbed872ee2f586e96341c90bca06ca4", "main_image": "http://s2.firstpost.in/wp-content/uploads/2017/04/Ellen-Barry-Facebook-380.jpg"}, "uuid": "f33167212bbed872ee2f586e96341c90bca06ca4", "ord_in_thread": 0}]