[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/jHIAmI4hxg_9FHjbDKzoktrZ1yqplNTWXVeYadwQuknoFfTySbhBj7rSKBVMYeyDFDzkhNr2DfBas_mKuZ5Rx5FdsIJqAeaMDZVl2j65HMrE964MRt.BShWfcKUX71TF9aff9z6hInlMzvJ7THuHHKSyFQMpxJw.", "title": "Japan To Re-Invigorate TPP, Looks To Get Trump Back On Board For Asia-Pacific Free Trade", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://www.asiabriefing.com/news/feed/", "spam_score": 0.0, "section_title": "Asia Business News", "site": "asiabriefing.com", "site_full": "www.asiabriefing.com", "performance_score": 0, "uuid": "ea53c437c3eb590e179d10f644318717fa33369d", "published": "2017-04-17T11:24:50.000+03:00", "site_categories": [], "country": "JP", "title_full": "Japan To Re-Invigorate TPP, Looks To Get Trump Back On Board For Asia-Pacific Free Trade", "participants_count": 1, "main_image": "http://www.china-briefing.com/news/wp-content/uploads/2014/10/CDE-Op-Ed-Commentary.jpg"}, "url": "http://omgili.com/ri/jHIAmI4hxg_9FHjbDKzoktrZ1yqplNTWXVeYadwQuknoFfTySbhBj7rSKBVMYeyDFDzkhNr2DfBas_mKuZ5Rx5FdsIJqAeaMDZVl2j65HMrE964MRt.BShWfcKUX71TF9aff9z6hInlMzvJ7THuHHKSyFQMpxJw.", "title": "Japan To Re-Invigorate TPP, Looks To Get Trump Back On Board For Asia-Pacific Free Trade", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:24:50.000+03:00", "language": "english", "entities": {"locations": [{"name": "japan", "sentiment": "none"}, {"name": "asia-pacific free trade japan", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "brunei", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "asia briefing  while north korea", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "persons": [{"name": "shinzo abe", "sentiment": "none"}, {"name": "taro aso", "sentiment": "none"}, {"name": "vice-president pence", "sentiment": "none"}, {"name": "dezan shira", "sentiment": "none"}, {"name": "aso", "sentiment": "none"}, {"name": "pence", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "organizations": [{"name": "trump back on board for asia-pacific free trade", "sentiment": "none"}, {"name": "tpp", "sentiment": "none"}, {"name": "dezan shira & associates", "sentiment": "none"}, {"name": "asean", "sentiment": "none"}, {"name": "trans-pacific partnership", "sentiment": "none"}, {"name": "asia briefing ltd.", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "ea53c437c3eb590e179d10f644318717fa33369d", "published": "2017-04-17T11:24:50.000+03:00", "author": "Asia Briefing", "text": "Japan To Re-Invigorate TPP, Looks To Get Trump Back On Board For Asia-Pacific Free Trade Posted on by Asia Briefing \nWhile North Korea has been taking up the headlines of US Vice-President Pence’s trip to South Korea and Japan, a little noticed meeting is taking place tomorrow in Tokyo that could spark the re-ignition of the Trans-Pacific Partnership agreement that new President Trump ditched almost immediately after coming into office. It is worth remembering that Japanese Prime Minister Shinzo Abe was among the first world leaders to meet with Trump in Miami, and now Vice-President Pence is scheduled to meet with Japanese Finance Minister Taro Aso on Tuesday. \nJapan is looking to get the United States back on track as regards the aborted TPP deal, and will be asking Washington to show some sort of commitment to Asia-Pac Free Trade. If necessary, Tokyo is prepared to go it without the United States. Mr Aso, who is also Deputy Prime Minister, said last week “I want Japan and US to take the lead in creating (trade) rules that other nations in the region can adopt.” \nRelated: China Lays Foundations for Eurasian Free Trade After TPP Failure \nTokyo sees the TPP, which would have covered 40% of all global trade, as a “gold standard” of trade deals, given its inclusion of provisions not usually found in most trade deals, such as labor standards and governance and transparency standards. Japan is now working to resurrect the pact with just 11 members, local media reported yesterday. The other signatories are Australia, Brunei, Canada, Chile, Malaysia, Mexico, New Zealand, Peru, Singapore and Vietnam. \nIt remains unclear whether a “TPP-lite” agreement without the United States would be of much use or interest to countries such as Malaysia and Vietnam. These two in particular would have benefited from the US market open to them for the sale of raw products, while American businesses in both food and textiles would have benefited by securing a non-Chinese source of raw materials and by adding value to create end consumer products – a point seemingly lost on the Trump administration. It also remains unclear whether Japan would countenance any Chinese involvement. The TPP itself may be a dead deal, but it is possible it could be re-invented under a “Trump TPP” that he can be seen to approve and that would still secure for American business interests, raw Asian materials at zero import tariffs for them to add value too, and spin it as a “job creating” exercise. With the Trump administration capable of U-turns and learning fast on the job, Vice-President Pence may yet come away from Tokyo with clearer thoughts about the United States trade involvement with Asia. \nAbout Us Asia Briefing Ltd. is a subsidiary of Dezan Shira & Associates . Dezan Shira is a specialist foreign direct investment practice, providing corporate establishment, business advisory, tax advisory and compliance, accounting, payroll, due diligence and financial review services to multinationals investing in China, Hong Kong, India, Vietnam, Singapore and the rest of ASEAN. For further information, please email or visit www.dezshira.com . Stay up to date with the latest business and investment trends in Asia by subscribing to our complimentary update service featuring news, commentary and regulatory insight. Share this:"}]