[{"uuid": "08f4aaf5faa3e56575f6349ef13c8c86de6508b7", "url": "http://omgili.com/ri/jHIAmI4hxg.YuZjPcTcrfI5VQz788xFZLx22j.aFMz9x1Z_guDUEimgKBBLhwkHFOYmxq_NnBunl4Ts7gebhlpR83rQYOQaG60goB5tf6FecGZKmc5B8d6agic3UQzy.Vq1uU0JPkwULE.pO3_kalHZ3F92coj0WOnV0W5D0iuUsR15Ntu6OqDK9B_UldYdW", "title": "Platinum Group Metals Announces US$20 Million Bought Deal Financing", "author": "", "rating": null, "published": "2017-04-18T23:24:21.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "platinum group metals announces", "sentiment": "negative"}, {"name": "columbia", "sentiment": "negative"}, {"name": "million bought deal financing platinum group metals announces", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "nyse mkt llc", "sentiment": "none"}, {"name": "equity syndicate department", "sentiment": "none"}, {"name": "jogmec", "sentiment": "none"}, {"name": "data group of companies", "sentiment": "none"}, {"name": "times square", "sentiment": "none"}, {"name": "bmo capital markets corp.", "sentiment": "none"}, {"name": "bmo capital markets", "sentiment": "none"}, {"name": "sprott resource lending partnership", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "toronto stock exchange", "sentiment": "none"}, {"name": "platinum group metals ltd.", "sentiment": "none"}, {"name": "about platinum group metals ltd", "sentiment": "none"}, {"name": "michael jonesplatinum group metals ltd.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}, {"name": "platinum group", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "brampton distribution centre", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}, {"name": "quebec", "sentiment": "none"}, {"name": "torbram road", "sentiment": "none"}, {"name": "ny", "sentiment": "none"}, {"name": "mnombo", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "brampton", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "waterberg", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}], "persons": [{"name": "vancouverkris begic", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "08f4aaf5faa3e56575f6349ef13c8c86de6508b7", "url": "http://omgili.com/ri/jHIAmI4hxg.YuZjPcTcrfI5VQz788xFZLx22j.aFMz9x1Z_guDUEimgKBBLhwkHFOYmxq_NnBunl4Ts7gebhlpR83rQYOQaG60goB5tf6FecGZKmc5B8d6agic3UQzy.Vq1uU0JPkwULE.pO3_kalHZ3F92coj0WOnV0W5D0iuUsR15Ntu6OqDK9B_UldYdW", "site_full": "www.finanznachrichten.de", "title": "Platinum Group Metals Announces US$20 Million Bought Deal Financing", "site_section": "http://www.finanznachrichten.de/rss-nachrichten-rohstoffe", "domain_rank": 20838, "published": "2017-04-18T23:24:21.000+03:00", "title_full": "Platinum Group Metals Announces US$20 Million Bought Deal Financing", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "FinanzNachrichten.de: Rohstoff Nachrichten", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "DE", "performance_score": 0, "main_image": "http://fns1.de/g/fb.png", "site": "finanznachrichten.de"}, "external_links": [], "language": "english", "text": "Platinum Group Metals Announces US$20 Million Bought Deal Financing \nVANCOUVER, BRITISH COLUMBIA -- (Marketwired) -- 04/18/17 -- Platinum Group Metals Ltd., (TSX: PTM)(NYSE MKT: PLG) (the \"Company\" or \"Platinum Group Metals\") has announced today that it has entered into an agreement with BMO Capital Markets (\"BMO\") under which BMO has agreed to buy on a bought deal basis 15,390,000 common shares of the Company (the \"Common Shares\"), at a price of US$1.30 per Common Share for gross proceeds of approximately US$20 million (the \"Offering\"). The Company has granted BMO an option, exercisable at the offering price for a period of 30 days following the closing of the Offering, to purchase up to an additional 15% of the Offering to cover over-allotments, if any, and for market stabilization purposes. The Offering is expected to close on or about April 26, 2017 and is subject to customary closing conditions including, but not limited to, Toronto Stock Exchange and NYSE MKT approvals. \nThe Company intends to use the net proceeds of the Offering (i) for underground development and production ramp-up of the Maseve Mine; (ii) for working capital during start-up; (iii) for repayment of the US$2.5 million outstanding amount of a prior advance under the Company's credit agreement with a syndicate of lenders led by Sprott Resource Lending Partnership; and (iv) for general corporate purposes. \nThe Offering is being made pursuant to an effective shelf registration statement previously filed with the U.S. Securities and Exchange Commission (the \"SEC\") and a corresponding Canadian base shelf prospectus filed with the securities regulatory authority in each of the provinces of Canada, except Quebec. A prospectus supplement relating to the Offering has been filed with the SEC and with the securities regulatory authority in each of the provinces of Canada, except Quebec. \nA copy of the prospectus supplement and base shelf prospectus relating to the Offering in Canada may be obtained by contacting BMO Capital Markets, Brampton Distribution Centre C/O The Data Group of Companies, 9195 Torbram Road, Brampton, Ontario, L6S 6H2 or by telephone at (905) 791-3151 Ext 4312 or by email at torbramwarehouse@datagroup.ca. A copy of the prospectus supplement and base shelf prospectus relating to the Offering in the United States may be obtained by contacting BMO Capital Markets Corp., Attn: Equity Syndicate Department, 3 Times Square, 25th Floor, New York, NY 10036 (Attn: Equity Syndicate), or by telephone at (800) 414-3627 or by email at bmoprospectus@bmo.com. \nThis news release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of the Common Shares in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of that jurisdiction. \nAbout Platinum Group Metals Ltd. \nPlatinum Group is based in Johannesburg, South Africa and Vancouver, Canada. The Company's business is currently focused on the operation of the Project 1 \"Maseve\" platinum mine and the exploration and feasibility engineering on the newly discovered Waterberg platinum and palladium deposit, where the Company is the operator of the Waterberg JV Project with JOGMEC and Mnombo. \nThe Toronto Stock Exchange and the NYSE MKT LLC have not reviewed and do not accept responsibility for the accuracy or adequacy of this news release, which has been prepared by management. \nThis press release contains forward-looking information within the meaning of Canadian securities laws and forward-looking statements within the meaning of U.S. securities laws (collectively \"forward-looking statements\"). Forward-looking statements are typically identified by words such as: believe, expect, anticipate, intend, estimate, plans, postulate and similar expressions, or are those, which, by their nature, refer to future events. All statements that are not statements of historical fact are forward-looking statements. Forward-looking statements in this press release include, without limitation, statements regarding the Offering, including the terms, potential completion and the use of proceeds of the Offering. Although the Company believes the forward-looking statements in this press release are reasonable, it can give no assurance that the expectations and assumptions in such statements will prove to be correct. The Company cautions investors that any forward-looking statements by the Company are not guarantees of future results or performance, and that actual results may differ materially from those in forward-looking statements as a result of various factors, including, but not limited to, that the Company may be unsuccessful in satisfying the conditions to closing of the Offering including, but not limited to, obtaining Toronto Stock Exchange and NYSE MKT approvals; that the Offering may not be completed on the terms and timeline indicated, or at all; that the Company's use of proceeds of the Offering may differ from those indicated; uncertainty of production, development plans and cost estimates for the Maseve Mine; additional financing requirements; the Company's ability to comply with the terms of its indebtedness; cash flow risks; risks of delays in the production ramp-up of Project 1; variations in market conditions; the nature, quality and quantity of any mineral deposits that may be located; metal prices; other prices and costs; currency exchange rates; the Company's ability to obtain any necessary permits, consents or authorizations required for its activities and to comply with applicable regulations; the Company's ability to produce minerals from its properties successfully or profitably, to continue its projected growth, or to be fully able to implement its business strategies; and other risk factors described in the Company's Form 40-F annual report, annual information form and other filings with the SEC and Canadian securities regulators, including the registration statement, base shelf prospectus and prospectus supplement relating to the Offering, which may be viewed at www.sec.gov and www.sedar.com, respectively. Any forward-looking statement speaks only as of the date on which it is made and, except as required by applicable securities laws, the Company disclaims any intent or obligation to update any forward-looking statements, whether as a result of new information, future events or results or otherwise. \nContacts:Platinum Group Metals Ltd., VancouverR. Michael JonesPlatinum Group Metals Ltd., VancouverKris Begic(604) 899-5450 / Toll Free: (866) 899-5450 © 2017 Marketwired", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:21.000+03:00"}]