[{"thread": {"domain_rank": 45757, "replies_count": 8, "url": "http://omgili.com/ri/jHIAmI4hxg94_2GKak84QkpDC4yla9UYpdkVq7o6.8MyAmiqCxQirpW02n5ZUm3vpOp_Ghh0Pe8-", "title": "BackPage Advertiser Reviews", "site_type": "discussions", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://www.USASexGuide.info/forum/", "spam_score": 0.0, "section_title": "USA Sex Guide ", "site": "usasexguide.info", "site_full": "www.usasexguide.info", "performance_score": 0, "uuid": "2db337d6713a3acc2b5663b07e74ffe8e0728e5e", "published": "2017-04-15T23:36:00.000+03:00", "site_categories": [], "country": "DE", "title_full": "BackPage Advertiser Reviews", "participants_count": 7, "main_image": ""}, "url": "http://omgili.com/ri/jHIAmI4hxg94_2GKak84QkpDC4yla9UYpdkVq7o6.8MyAmiqCxQirpW02n5ZUm3v7gwoMwnJ8K_uKGQOdF7NepY5RNPcQLyT", "title": "", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:25:20.000+03:00", "language": "english", "entities": {"locations": [], "persons": [], "organizations": []}, "rating": null, "highlightText": "", "ord_in_thread": 1, "uuid": "4d1c36426f5c6412f0bbda6b94db758dfea402b8", "published": "2017-04-15T23:36:00.000+03:00", "author": "JustTex", "text": "Recently, I was in the mood for something different. Something off the beaten path. I wanted a dream with Asian flair. Thai had caught my eye and I wanted to see what she was all about. Great reviews on the oThER site so I figured she must be worth a visit.\nOn a side note, I had already tried to set up an appointment with Thai on two previous occasions as she comes here often. On both of those other occasions we set up a meeting time and she totally blew me off. Both times she went radio silent after I drove 30 plus minutes to get near her location. Not cool! She has great reviews so what's the deal? I mean come on girl. 3 strikes and you're out!\nMan would I like to say it worked out on this third try but I whiffed (again). I normally won't stand for someone who is so rude they won't even text you back to let you know what's going on but the little head got the best of me. I'm done with her though! She sets a time tells you a near location then doesn't get back in a timely manner. She texted me over an hour after I left and said \"hey\". Then wouldn't respond when I asked what happened to our appointment? Beyond rude!\nSo after being stood up by Thai yet again, Kai, the Hawaiian was next on my list.\nA quick text and she was ready to meet. Very professional. Only wanted a pic of me before meeting. We then set a time and she gave me the location. I dreamed of this really hot Hawaiian / Asian mix who was sexy as hell. Got to a decent hotel in S-Ville. She left the door open and in I went. Was not disappointed in the looks dept. She has a great figure and big boobs which I love! After a quick getting to know one another we undressed and the fun began.\nEverything was covered but her oral skills are amazing. She almost got me off there but I held on for a good cowboy ride and mish. She was open to doggy and just about everything else I suggested. Totally into the session, nice moaning and pleasure for both of us. I definitely came hard. Well worth the price of admission and will repeat again before she leaves this week. I would rate the session an 8/10. Not sure if she does GFE and that would have increased the score but if you like hot women with some flavor she will satisfy the craving. I'm glad I went and will be back! Treat her well and you will be rewarded."}]