[{"uuid": "67c77d520c2b3af5507ec322213143b7dc52e06c", "url": "http://omgili.com/ri/.wHSUbtEfZRn7k70npWTPN_FLjmdGK4FaRb3tbDqWauH1qfgiDfBnI3lKho2hq21Tfx22H6ZZSESycTaAlD5dd0jlg2C9yCBU5wrrAKmVUqxc19.3u7E.7ELJ.0eQZg3Fc7K0Ys7fNi6OngDeYL69yqrXLigQ_qpI4f5RdWRpHktWKVQ_erEJw--", "title": "Walmart - Kingford Charcoal Apple Western Smoking Chips Rude Employees Review 1035519 Apr 17", "author": "", "rating": null, "published": "2017-04-17T20:21:00.000+03:00", "highlightText": "", "entities": {"organizations": [], "locations": [], "persons": []}, "highlightTitle": "", "thread": {"uuid": "67c77d520c2b3af5507ec322213143b7dc52e06c", "url": "http://omgili.com/ri/.wHSUbtEfZRn7k70npWTPN_FLjmdGK4FaRb3tbDqWauH1qfgiDfBnI3lKho2hq21Tfx22H6ZZSESycTaAlD5dd0jlg2C9yCBU5wrrAKmVUqxc19.3u7E.7ELJ.0eQZg3Fc7K0Ys7fNi6OngDeYL69yqrXLigQ_qpI4f5RdWRpHktWKVQ_erEJw--", "site_full": "walmart.pissedconsumer.com", "title": "Walmart - Kingford Charcoal Apple Western Smoking Chips Rude Employees Review 1035519 Apr 17", "site_section": "http://www.pissedconsumer.com/browse-reviews/91.html", "domain_rank": 11785, "published": "2017-04-17T20:21:00.000+03:00", "title_full": "Walmart - Kingford Charcoal Apple Western Smoking Chips Rude Employees Review Review 1035519 Apr 17 @ Pissed Consumer", "participants_count": 1, "replies_count": 0, "spam_score": 0.0, "section_title": "Read complaints and reviews Page 91 @ Pissed Consumer", "site_type": "discussions", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "DE", "performance_score": 0, "main_image": "https://www.pissedconsumer.com/themes/foundation/images/sharing-logo.png", "site": "pissedconsumer.com"}, "external_links": [], "language": "english", "text": "Brooklyn Center, MN.Very unprofessional.\nI went in to purchase Charcoal and any items that caught my eye. It took over 5 mins for us to choose charcoal because the prices weren't marked clearly or accurately. After getting to the register I informed they cashier in self checkout to remove an item. Item was removed but originally it was rung 2x so she only removed it once after I informed her that I didn't want the charcoal (cashier is the one who rang it up 2x and when I told her to remove it I also told her she rang it 2x- she said she didnt without checking for accuracy).\nI paid and realized the problem. Also two items that I purchased weren't shelved with correct prices either. After heading back to the charcoal lane I returned to the same lady. She called for a manager.\nI explained to the manager my 3 concerns. She informed me that I would have to get in line in customer service to get a refund. I asked about the 2 items I paid more for. She called for another Manager to whom which I also explained to her that I do not work for Walmart and should not have to look at prices and sku numbers to make sure the price is verified; or can she have her staff select the items that were the price I thought they were.\nShe pointed at another employee and said she can do it and without acknowledgement to me she walked off. Unprofessional. If your not happy about my comment well so be it. She can still smile and do her job, not roll her eyes and walk off.\nThe 2 employees (manager/supervisor) that I felt weren't helpful were: Candy and Sabrina. The staff Shaunda who was told to do it was quiet, professional and got the job done. Its sad every time I come here I am unaware of prices, lines are long, and staff are rude.\nJust please shut the store down.Brooklyn park is better and Maple Grove is amazing and other areas away from the inner city.\nReview about: Kingford Charcoal Apple Western Smoking Chips Rude Employees.\nI liked: There price.\nI didn't like: Customers service is lacking, Unprofessional employees.\nReview #1035519 ", "ord_in_thread": 0, "crawled": "2017-04-18T23:23:51.000+03:00"}]