[{"uuid": "6996361f3da94bc8616062ae7ad98b93ba2d680c", "url": "http://omgili.com/ri/.wHSUbtEfZRmGL95Zj8VpRJbnESyhAFkAqak8HNuO.3l6r4edwBIbc8ZVp.UKF0gQXKk.SgOV7cFmtW14t7Epa.PQZWV3plvpY5nN1ifYDZyvCdf_fZ7.Q--", "title": "Pulte Homes - NO Pulte 1026695 Mar 28, Pulte Builders Poor Construction", "author": "", "rating": null, "published": "2017-03-28T16:18:00.000+03:00", "highlightText": "", "entities": {"organizations": [], "locations": [], "persons": []}, "highlightTitle": "", "thread": {"uuid": "6996361f3da94bc8616062ae7ad98b93ba2d680c", "url": "http://omgili.com/ri/.wHSUbtEfZRmGL95Zj8VpRJbnESyhAFkAqak8HNuO.3l6r4edwBIbc8ZVp.UKF0gQXKk.SgOV7cFmtW14t7Epa.PQZWV3plvpY5nN1ifYDZyvCdf_fZ7.Q--", "site_full": "www.pissedconsumer.com", "title": "Pulte Homes - NO Pulte 1026695 Mar 28, Pulte Builders Poor Construction", "site_section": "http://www.pissedconsumer.com/browse-reviews/91.html", "domain_rank": 11785, "published": "2017-03-28T16:18:00.000+03:00", "title_full": "Pulte Homes - NO Pulte Review 1026695 Mar 28, Pulte Builders Poor Construction @ Pissed Consumer", "participants_count": 1, "replies_count": 0, "spam_score": 0.023, "section_title": "Read complaints and reviews Page 91 @ Pissed Consumer", "site_type": "discussions", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "DE", "performance_score": 0, "main_image": "https://www.pissedconsumer.com/themes/foundation/images/sharing-logo.png", "site": "pissedconsumer.com"}, "external_links": [], "language": "english", "text": "RUN AWAY !!!Pulte is horrible...\nPulte claims that “when we build your new home, we follow a process that meets high standards of quality and attention to detail. Our process is firmly rooted in quality control measures and consistently refined with feedback from customers like you”. In our experience, nothing could be further from the truth. Pulte encourages you to share the build experience and be involved.\nWe strongly urge anyone building with Pulte do so attentively because someone has to watch the “vendors” you sub out all the work to. It was clear to us the contractors were unmanaged, unskilled and quite frankly not at all caring about their quality or that they were building a customer’s home. We were renting a mile away so my wife was there looking in on things quite a bit. What we observed: debris strewn about the site, sloppy work, construction material and tools thrown all over, uncovered new hardwood floors that are no longer “new” as they are currently all scratched and gouged (still fighting this one), tools and construction material piled on new granite, a toilet on the counter, metal tools stored in and scratching our new stainless steel sink (which, we had to escalate to management to get replaced).\nThe finishing work on our Pulte home is horrendous. This is my third new construction home I have moved into and by far the worse finishing work I have ever seen. Molding not cut correctly, molding uneven and or not level, grout missing, no caulking, wallboard seams showing, fireplace stones with huge gaps and uneven, scratched floors, scratched sinks, varnish spills on the floor, doors dinged and dented. It appeared that no one at all cared or followed up on these labors (definitely not craftsmen).\nMaybe their work was reflective in the empty beer cans found inside a closet at the site during one of our unannounced visits.We have pictures of all of this by the way and would be happy to share.\nReview about: Pulte Builders Poor Construction.\nReview #1026695 ", "ord_in_thread": 0, "crawled": "2017-04-18T23:23:53.000+03:00"}]