[{"entities": {"locations": [{"name": "south korea", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "eiffel tower", "sentiment": "none"}, {"name": "snapchat", "sentiment": "none"}], "organizations": [{"name": "samsung", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "google pixel", "sentiment": "none"}, {"name": "infinity display", "sentiment": "none"}, {"name": "lg", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "gpu", "sentiment": "none"}, {"name": "bixby vision", "sentiment": "none"}], "persons": [{"name": "danny d.", "sentiment": "negative"}, {"name": "bixby", "sentiment": "none"}, {"name": "bixby  bixby", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.sammobile.com", "site_section": "http://www.sammobile.com/feed/", "domain_rank": 2971, "replies_count": 0, "country": "DE", "section_title": "SamMobile", "title": "Galaxy S8 and Galaxy S8+ review: Samsung brings us the future, but it’s not perfect yet", "title_full": "Galaxy S8 and Galaxy S8+ review: Samsung brings us the future, but it’s not perfect yet", "published": "2017-04-18T23:24:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZRheeYS1OHGD72iIntCOZOyxfH1MwtxgB0su1K1aL9mwQIJlE7_K5wnGhV_LTZQQ2AwEnG9_KMR3qaXQB_rQOfLxj4XnP2oAAOxxHu49fTYV_A1vJfJBk.e0_5t4XqYVjA-", "site": "sammobile.com", "main_image": "https://www.sammobile.com/wp-content/uploads/2017/04/galaxy-s8-s8-plus-review-85-720x480.jpg", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "a311fadbf03ea96d78b827fc5b344c44e5087d5a", "site_type": "blogs"}, "title": "Galaxy S8 and Galaxy S8+ review: Samsung brings us the future, but it’s not perfect yet", "published": "2017-04-18T23:24:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZRheeYS1OHGD72iIntCOZOyxfH1MwtxgB0su1K1aL9mwQIJlE7_K5wnGhV_LTZQQ2AwEnG9_KMR3qaXQB_rQOfLxj4XnP2oAAOxxHu49fTYV_A1vJfJBk.e0_5t4XqYVjA-", "author": "Danny D.", "crawled": "2017-04-19T08:39:54.000+03:00", "language": "english", "text": "Danny D. / 14 hours ago \nAnother year, another Galaxy S flagship. With leaks flowing in faster than water from a tap, a lot was known about the Galaxy S8 ahead of its unveiling. Big design changes have been made this year: The front of the Galaxy S8 and Galaxy S8+ is a giant screen with very little bezel, with Samsung managing to fit 5.8-inch and 6.2-inch displays in bodies similar in size to devices that would usually feature much smaller screens. \nSmaller batteries are also part of the equation once again, two years after the Galaxy S6 and Galaxy S6 edge, and the Galaxy Note 7 fiasco might be partly to blame. Samsung has to get back in the saddle this year after all the negative press for the Note 7, so a lot is riding on the Galaxy S8 and Galaxy S8+. \nHas Samsung managed to succeed in making the S8 and S8+ good enough to make everyone forget about its “explosive” last flagship? Let’s dive into the review to find out. Design \nThe Galaxy S8 and Galaxy S8+ are gorgeous phones. There are shortcomings, but let’s talk about the positives first. Samsung has dropped its traditional hard home button this year, allowing it to make room for those giant and beautiful displays. The S8 has a 5.8-inch display while the S8+ has a 6.2-inch display. The screen takes up almost the entire front side of the device, with just two small bezels at the top and bottom. This is still the same glass and metal IP68 certified design, but with Gorilla Glass 5 on the front and back. The sides are still curved (on both the front and back), although the curves are noticeably less pronounced than they were on the Galaxy S7 edge and flow more seamlessly into the metal sides. \nThe Galaxy S8 and Galaxy S8+ are gorgeous phones. \nFor the first time ( at least on a global scale ), the front of a Galaxy smartphone has no Samsung logo. Since every color variant of the Galaxy S8 is black at the front, it is, therefore, hard to see where the top and bottom bezels begin or end. It’s beautiful to look at, and the main reason why the Galaxy S8 and Galaxy S8+ look gorgeous from the front no matter what color variant you might purchase. The black top bezels also hide the array of sensors that are located there, including the earpiece and the new 8-megapixel front-facing camera. \nOn the right side of the device, there’s the power button as usual, but on the left side, the volume buttons are joined by a dedicated button for Bixby, Samsung’s new virtual assistant. The placement of the Bixby button isn’t great, as I unwillingly pressed the Bixby key instead of the volume keys. The Bixby button isn’t textured to make it stand out from the other buttons, so you can expect to be hitting it fairly often while trying to adjust the volume. \nBecause every color variant of the Galaxy S8 is black at the front, it is, therefore, hard to see where the top and bottom bezels begin or end. \nAt the bottom of the phone, the microUSB port has finally given way to a USB Type-C port on a Galaxy S device, accompanied by the loudspeaker and the 3.5 mm headphone jack. People with OCD or the need to see perfection in design will be put off by the Type-C port, as it’s not exactly placed right in the middle. At the top resides the SIM and microSD slot (256GB cards are supported). Our review unit was a single SIM version, but some markets will be getting a dual SIM variant that will either work as a dual SIM device or let you use a single SIM card and a microSD card. Thankfully, the 64GB of internal storage means this might not be an issue anymore, as those wanting to use two SIM cards won’t necessarily be left wanting for storage space. \nNow, let’s talk about the negatives. We all know where that fingerprint sensor, which used to reside on the home button, has been moved to. It’s been placed on the right side of the camera, where the heart rate sensor and LED flash used to be (these are now on the left). Since the phones have become a lot taller (a necessary move in order to make those giant screens more ergonomic), the fingerprint sensor is hard to reach, even with my gigantic hands. Reaching for the fingerprint sensor is certainly possible with a little adjustment of the phone in your hand, but that also results in smudges on the camera (unless you’re a left-handed user, in which case the fingerprint sensor becomes less of a problem). Samsung knows, and warns users to keep the camera lens clean. It’s clear this was a hurried design decision, and the one who made the decision should probably be kept away from design and usability-related tasks in the future. \nSince the phones have become a lot taller, the fingerprint sensor is hard to reach. \nThe overall design of the Galaxy S8 and S8+ is narrow and tall. If you ask me, the smaller version is a little too narrow, while the bigger version is virtually as wide as the Galaxy S7 edge, which hits the sweet spot. Of course, opinions will vary on this, and the size of your hands is what will ultimately decide what phone is right for you. A note about the weight of these handsets. The S8 is lighter than the S7 edge, which makes it easy to use with one hand. But the S8+ ire a real heavyweight at 172 grams, so it will require both hands for comfortable usage. Display \nSamsung’s phones have always had the best displays, and this year the displays are taking center stage. Both models feature curved displays this year, with the S8’s sized at 5.8-inch and the S8+’ at 6.2-inch. Both feature a resolution of 2960×1440 (QHD+), although by default the phones run on Full HD+ resolution. Infinity Display is what Samsung has dubbed these Super AMOLED displays, which fits as the front of the phones basically looks like it’s all screen. These tall displays also have an odd new aspect ratio of 18:5:9, which allow for an enhanced multimedia experience according to Samsung. \nBut the thing is, a lot of multimedia apps don’t support this aspect ratio, so you need to crop things out, which makes some things cut off. It defeats the purpose if you ask me. But the new aspect ratio does show its worth while browsing, as the extra content that can be seen on-screen can be very handy. Regular apps should also see better compatibility in the future, as Google is already telling developers how their apps should adjust to the new aspect ratio, which is also used by LG on the new LG G6. \nAs is usual with Samsung’s displays, the ones on the S8 and S8+ are stunning… \nAs is usual with Samsung’s displays, the ones on the S8 and S8+ are stunning, with great viewing angles and contrast ( experts gave the displays an A+ rating ). It’s on the cooler side with the default Adaptive mode, but Samsung continues to offer an option to change screen modes for those looking for something more natural. In bright sunlight, these displays can get insanely bright, which is also why they have official certification for HDR content. In the night, brightness can go really low to reduce strain, and the built-in blue light filter further ensures using your phone in bed won’t disrupt your sleep too much. \nAs you might have noticed in the pictures, Samsung’s tuning for the displays seems to be too red on one of our units. It’s apparently a production issue , and should you have this problem on your S8, you should call in for a replacement. Also, a little tip: Go into Settings » Display » Full Apps to enable the apps you want to run in fullscreen. Not all apps are set to run in fullscreen mode, so unless you turn it on, you will see black bars at the top and bottom on unsupported apps. Camera \nThe Galaxy S8 and S8+ have a 12-megapixel rear camera with F1.7 aperture and Dual Pixel autofocus system, like the Galaxy S7 and S7 edge. Samsung has used a new sensor, though, and the S8 and S8+ employ a multi-frame processor that takes data from multiple pictures (or frames) and uses that data in the final image for increased quality over last year’s flagships. The camera app is the same as the one found on Nougat on the S7 and other devices and is now launched with a double press of the power button. It works on gestures: swipe up or down to switch between rear and front camera, swipe right to change modes, and swipe left to access filters and effects. \nSpeaking of filters, there are new additions in the form of masks. Think of them as the dog faces and other filters from Snapchat, now built into the camera. They work great, and you can download additional ones; the camera app even keeps the last used mask on the viewfinder for quicker access. Pro mode makes a return, with features like shutter speed control and shooting in RAW present, and the new floating camera button is also on-board. The only drawback with the camera app, as with last year’s phones, is that it shoots at 4:3 aspect ratio at the full resolution. For 18:5:9 pictures (that is, to use the entire screen), you have to dial the resolution down to 7.9 megapixels. \nNow, about image quality. Whether because of that multi-frame processor or because of improved software processing (or both), the S8 and S8+ take pictures with more popping colors and better contrast than what the S7 and S7 edge managed. Photos taken in good lighting are sometimes too saturated and not close to the real thing, but the final images tend to be colorful and pleasant to look at. \nThe S8 and S8+ take pictures with more popping colors and better contrast than what the S7 and S7 edge managed. \nAt night, details in the blacks and dark areas can sometimes be lost, and colors are once again not very natural. But overall detail in low-light shots is amazing. Where the S7 and S7 edge would get a little blurry in low-light conditions, the S8 manages to capture a fair bit of detail with little to no noise. \nAs for the lack of a dual camera, I’m not sure it’s a big deal, if only because Samsung seems to have made improvements to macro photography. There’s increased depth of field (bokeh, if you will) in macro shots, and close-up shots simply look incredible. Quality has been enhanced in videos as well. Videos have higher contrast and vibrant colors, although the optical image stabilization doesn’t seem to work as well as before. It’s nothing to worry about, but there seems to be a higher level of shake. \nThere’s increased depth of field (bokeh, if you will) in macro shots, and close-up shots simply look incredible. \nCheck out these camera samples from the primary camera. We’ll be doing a proper comparison of the S8′s camera with the S7′s, but for now, you can take a look at an early comparison here . \n\nSelfie Camera \nWhile the rear camera has gotten noticeably better, the front camera will really blow your mind and is probably one of the biggest upgrades on these phones. The camera has gone from a 5-megapixel sensor to an 8-megapixel sensor (aperture stays at F1.7), and you now have software-based autofocus. You no longer need to search for the sweet spot before taking a selfie. Just point it at yourself and shoot. \nThe front camera will really blow your mind and is probably one of the biggest upgrades on these phones. \nAutofocus makes a world of difference, and I can’t wait to see it come to other Samsung devices. Colors in selfies come out quite accurate, with a great deal of detail. Autofocus makes for sharp pictures and noise almost never manages to creep in. Just check out the samples below to see what I mean. If you love taking selfies, you’ll love the Galaxy S8 and S8+. Performance \nThis year’s Galaxy S flagships are powered by the Exynos 8895 SoC built on the 10 nm process, with four cores clocked at 2.3 GHz and four cores clocked at 1.7 GHz and the Mali-G71 MP20 GPU. Some markets get the Snapdragon 835 (also built on Samsung’s 10 nm process and featuring eight cores), and at least South Korea will also see a variant with 6GB of RAM and 128GB of internal storage. For all other markets, there’s 4GB of RAM and 64GB of internal storage, along with a microSD card. \nPerformance, as expected, is great. Everything is fluid, apps open quickly, and I never encountered the so-called TouchWiz lag. Of course, how well performance will hold up over time remains to be seen, but out of the box, the S8 and S8+ run well. There were a few hiccups when I was installing apps; the keyboard would become janky at the time, and while this is common on smartphones, it’s high time installing or updating apps doesn’t reduce performance during basic usage. \nPerformance, as expected, is great. \nThe Galaxy S8 and S8+ are great for gaming; Asphalt 8 and Modern Combat 5 run buttery smooth, and I didn’t notice the phone heating up during extended gaming sessions (no doubt because the larger surface area on these phones makes for excellent heat dissipation, and because the new 10 nm processors are very power efficient). Multitasking wasn’t an issue, either. The S8 manages to hold a lot of apps in memory; Samsung has been rather heavy handed with app management in recent years, but it seems to have dialed it down a bit with the S8. Or we’ve all just gotten used to it. In either case, it longer seems to be a problem. \nIris, facial and fingerprint scanners \nThe Galaxy S8 and Galaxy S8+ are packed with security features, with no less than five different ways to lock and secure the device ( including hardware and software methods ). Iris is making a comeback after the Note 7, while facial recognition is making its debut on the S8 duo. I’ll get this straight out of the way: The iris scanner is amazingly accurate and very secure, and works great even at night. It even works with sunglasses, although it will depend on just how dark your sunglasses are. You still need to wake up the phone for the iris scanner to start working, but the new ability to hard press the always on home button to skip the lock screen makes the proceedings faster. \nThe iris scanner is amazingly accurate and very secure, and works great at night. It even works with sunglasses. \nFacial recognition works extremely well, too, and it’s awesome how fast it is. It’s not totally secure, as I could fool it with a photo of myself, and it’s not great in low-light conditions. But it’s fast, and for most scenarios, makes for a perfect way to quickly unlock your phone. As for the fingerprint sensor, it’s much more accurate than Samsung’s previous front-facing sensors, and it now works passively so you can just keep your finger on the sensor when the screen is off and the phone will unlock. We’ve seen this on other Samsung devices in the last year , and it’s finally present on the company’s flagship as well. \nAgain, the fingerprint sensor is hard to reach for right hand users who will end up touching the camera quite often, but anyone using an official case will find this to be less of a problem as there are separate cutouts for the fingerprint sensor and camera. The fingerprint sensor also supports gestures like on the Google Pixel, so you can swipe down on the sensor to access the notification shade. \nOne thing that I did not like is that Samsung doesn’t let the iris and facial recognition stay active together. So if you’re using facial recognition and trying to unlock the phone at night, it will not fall back to the iris scanner and you’ll have to use the fingerprint sensor instead. Maybe a software update will remedy this, but the enhanced battery strain from having both active might be the reason why Samsung isn’t willing to make iris and facial recognition work in tandem. \nSoftware \nThe user interface on the Galaxy S8 is a lot like the one from the cancelled Note 7 and what we see on Nougat on the Galaxy S7 and S7 edge (and other recent Samsung devices), but there are a few differences from the moment you start using the phone. First, accessing the app drawer is now done by swiping up on the home screen. There’s still an option to go back to the old method of using a dedicated button to open the app drawer, but it isn’t enabled from the start. Second, you now have the option to put all apps right on the homescreen, disabling the app drawer completely. It’s what Apple and Chinese manufacturers have always been doing; it was available as a test feature on the S7 and S7 edge earlier, but is now a regular setting. \nThe rest of the interface is pretty much similar to the one seen on Nougat. Features like blue light filter, secure mode, and performance and battery saving modes are all there. Samsung has added new Infinity wallpapers to go along with the new displays. Like on previous Galaxy phones, there is an option to make the wallpaper move as you move the phone, and it gives off a somewhat dreamy feel. Oddly enough, the Galaxy S8 was codenamed Dream during development, so I can see why. \nNow, let’s talk about what you probably are most anxious about: the software navigation buttons. To make the transition easier for existing users, Samsung has replaced the hard home button with a force touch-enabled software button, and you can change the pressure sensitivity of the button. Wondering what this does? Well, the answer is simple: It lets you unlock the device in pretty much the same way as you did before, as the home button can be set to be always visible (even when the screen is off). \nSamsung has replaced the hard home button with a force touch-enabled software button. \nSamsung also allows you to change the order of the back and multitasking keys , and change the color of the background behind the buttons. Sadly, there seems to be no option to change the look of the software buttons themselves, so it remains the same no matter what theme you use (hopefully theme makers will get the option to customize them in the future). Samsung has also changed the look of their built-in apps, and I’m not happy with the result. The company’s apps can’t match the Material look employed by third-party apps today. I don’t usually use themes, but this might just drive me to do so. \nOkay, so is there something else new and interesting in Samsung’s user interface? I guess the new Edge Lighting feature fits the bill. This is a take on the Edge lighting feature on previous Edge phones whereby an incoming call would cause the edge to light up. Now, the edge can light up when notifications come in, and the color of the notification changes according to your theme. You can set Edge Lighting to work when the screen is off, when the screen is on, or all the time. When the screen is on, the four corners of the display will light up, and a small bubble with details on the notification also pops up. It’s cool to look at, although too many notifications might lead you to turn the feature off. \nNow, the edge can light up when notifications come in, and the color of the notification changes according to your theme. \nA word about software updates. The Galaxy S8 (at least our review unit) no longer has a software update option in the settings. It’s still present and can be accessed by using the search function in the settings, but you won’t see it in the main settings menu as updates are now checked for automatically more often. Last but not the least, Samsung calls the S8 interface Samsung Experience 8.1, which is based on Android 7.0. Not 7.1, but Samsung should roll out an update in the near future . \nBixby \nBixby is one of the headline features of the Galaxy S8, so it’s disappointing to see most of its features are not available globally just yet. For us, only Bixby Vision was active. Pressing the Bixby button once takes you to the Bixby homescreen, where you get information presented in a card layout, similar to Google Now. Samsung says Bixby will learn your usage patterns and suggest information that’s relevant, like putting an Uber card on top for those who take an Uber frequently. We couldn’t test this out much during our review period, so we’ll have a separate article about how this aspect of Bixby works. \nBixby is one of the headline features of the Galaxy S8, so it’s disappointing to see most of its features are not available globally. \nAs for Bixby Vision, this feature exists in the camera app. Take a picture of something, and Bixby will automatically search for similar items on the internet. If it’s a product you can buy, you’ll see links to the product on Amazon and other retail sites. Took a picture of the Eiffel Tower? Bixby Vision will show you information about the landmark and places to eat nearby. \nBixby Vision can be useful, but it will come down to how often you need such functionality. I personally won’t be using Bixby too much. My opinion might change once more features go live here in the Netherlands, but at this point in time, Bixby is too limited for me to give a final verdict. As a big new feature, though, Bixby is a disappointment, and Samsung will hopefully get more things working as quickly as possible. Thankfully, you can put that dedicated button to use elsewhere by using this third-party app . Audio Quality \nSamsung has finally taken a step to target audiophiles. The Galaxy S8 and S8+ support 32-bit audio; in layman terms, this means better sounding music, and it’s noticeable. The volume on headphones is loud, the bass is punchy, and the highs (treble) are not so shrill. The sound through my SoundMagic E10′s was perfect. The bundled AKG earphones miss out slightly on bass but are otherwise well balanced. They are also very comfortable to wear and fit nicely. \nThe volume on headphones is loud, the bass is punchy, and the highs are not so shrill. \nThe Galaxy S8 and S8+, unfortunately, do not have stereo speakers, unlike what the rumors were suggesting. The single loudspeaker is still at the bottom next to the Type-C port, which means it continues to be easy to block with your hand when playing games or watching YouTube videos. However, Samsung has managed to make the speaker louder than before and the sound it produces is not as tinny. In fact, the sound from the speaker is rather rich and has a bit of bass to it as well. Those looking for stereo speakers won’t be totally satisfied, but overall sound quality through the loudspeaker is certainly better than it has ever been. \nThe sound from the loudspeaker is rather rich and has a bit of bass to it as well. \nLike any other recent Samsung phone, Samsung’s own music player has to be downloaded off the Play Store or Galaxy Apps store, and Google Play Music is the default music player. There’s no radio once again (not that we were expecting it to return on a Galaxy flagship). As for calls, the S8 and S8+ do well. Voices come out clear on both ends. Battery \nThe Galaxy S8+ has a 3,500 mAh battery, the same as the Note 7 and 100 mAh less than the S7 edge. But the S8+ has a display that’s half an inch larger than the S7 edge’s while the S8 with its 3,000 mAh battery has also grown nearly the same amount compared to the regular S7. So how does battery life fare? \nWell, on the first charge, I used phone like I normally would, meaning the phone is on Wi-Fi where possible and on cellular data at other times. This left me with 35 percent charge in the evening by the time I would usually need the charger for the Galaxy S7 edge. This is quite interesting given the much larger display. This was with the home button enabled on AOD (and time turned off), and it looks like the dedicated IC for AOD does help with reducing battery drain. \nOn the second charge, I downloaded two games on Wi-Fi and was on a cellular network for the rest of the day. It gave me around 3 hours of screen on time and the phone was left with around 7 percent of charge. This isn’t too good, and you’ll be needing to keep a battery pack with you when you’re away from home for extended periods, especially if you will be using the phone as a dual SIM device in your particular market . \nTo reach 4 hours of screen time on either model, you’ll need to switch off AOD, turn off the iris scanner and watch the screen’s brightness. \nThe smaller S8 doesn’t fare much better. I kept getting around 3.5 hours of screen time but not more, at least with AOD turned on. To reach 4 hours of screen time on either model, you’ll need to switch off AOD, turn off the iris scanner and watch the screen’s brightness. Maybe software updates will improve battery life, but I’m not very hopeful. \nWhat makes it worse is that all these battery stats are on Full HD+ resolution and not the highest resolution these phones can reach. People coming in from the Galaxy S7 edge will notice the shorter battery life. We think it’s unacceptable for devices that we pay so much money for, and heavy users will constantly find themselves reaching for the charger. Sure, fast and fast wireless charging can get you up and running in no time, but those should be add-on features, not something you need to make up for the not-so-great battery life. \nWhat makes it worse is that all these battery stats are on Full HD+ resolution and not the highest resolution these phones can reach. \nIf you look at the A series phones, they last all day long and then some, and that’s at a much more affordable price. Okay, so flagships do have additional hardware to power, but again, the price tags carried by the S8 and S8+ make the average battery life hard to overlook. Samsung claims the 10 nm processors and new displays are more power efficient. We have no idea where we’re supposed to notice this enhanced efficiency, except maybe the fact that we get these battery figures on devices with such giant displays. Wrap Up \nSamsung’s latest flagship is an excellent device, albeit with hardware issues we did not expect, especially after the Note 7 and S7 edge. The fingerprint sensor and the dedicated Bixby button are placed in weird positions, and Bixby is even useless for many at this point because it supports so few languages. \nThere’s a lot going for these phones, though. They have a gorgeous design, brilliant displays, and top notch cameras (the front-facing camera is especially awesome). The software is packed with features and the on-screen navigation buttons work great with lots of customization to get them set up the way you want. You can even turn these phones into desktop computers using Samsung’s DeX station (a separate review for DeX is coming soon). \nOverall, the Galaxy S8 and Galaxy S8+ are great phones, but they are also the first Samsung flagships that have given us mixed feelings. Battery life, especially, stops them from reaching their true potential, and so does Bixby’s limited nature. How can a device that costs over Euro 800 not offer screen time of at least four hours, and the confidence that you can get away with ? \nIf you have a device like the Galaxy S6 or S6 edge, go ahead and upgrade to the Galaxy S8 or S8+ without a second thought. But anything like the Note 5, S6 edge+ or the S7 and S7 edge can still hold its own today, and owners of these devices would do well to try the S8 and S8+ out in stores before putting down their hard earned money. Pros Gorgeous design with minimal bezel Average battery life", "external_links": [], "highlightTitle": "", "uuid": "a311fadbf03ea96d78b827fc5b344c44e5087d5a", "highlightText": "", "rating": null}]