[{"thread": {"domain_rank": 45757, "replies_count": 8, "url": "http://omgili.com/ri/jHIAmI4hxg94_2GKak84QkpDC4yla9UYpdkVq7o6.8MyAmiqCxQirpW02n5ZUm3vpOp_Ghh0Pe8-", "title": "BackPage Advertiser Reviews", "site_type": "discussions", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://www.USASexGuide.info/forum/", "spam_score": 0.0, "section_title": "USA Sex Guide ", "site": "usasexguide.info", "site_full": "www.usasexguide.info", "performance_score": 0, "uuid": "2db337d6713a3acc2b5663b07e74ffe8e0728e5e", "published": "2017-04-15T03:16:00.000+03:00", "site_categories": [], "country": "DE", "title_full": "BackPage Advertiser Reviews", "participants_count": 7, "main_image": ""}, "url": "http://omgili.com/ri/jHIAmI4hxg94_2GKak84QkpDC4yla9UYpdkVq7o6.8MyAmiqCxQirpW02n5ZUm3v7gwoMwnJ8K_uKGQOdF7Net1Y5A_t7Sw8", "title": "", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:25:20.000+03:00", "language": "english", "entities": {"locations": [], "persons": [], "organizations": []}, "rating": null, "highlightText": "", "ord_in_thread": 2, "uuid": "a5f9fea86b9b4746c525cab87f48ca8f78e0ae54", "published": "2017-04-15T03:16:00.000+03:00", "author": "SteamyDream", "text": "Well I decided to take the plunge with Paris Love. I'd seen the posts from senior members talking about her being pushy, rude etc. But given the overwhelmingly positive reviews on the other site and the fact that her body is incredible I couldn't resist.\nShe was responsive over text and showed up right on time. She seemed friendly enough on arrival, had a little chit chat but when she politely declined a drink I figured I'd assume the clock is ticking so I initiated the business. All downhill from there. Her body is definitely awesome but it just doesn't make up for the lackluster performance. CBJ was ok, but just ok. I have no idea who is writing the reviews that say she gives hall of fame head. I felt a lot of teeth and it was pretty mechanical.\nI asked her to get on top which she clearly wasn't happy about, saying \"I'm not good at it\" but she obliged. Maybe 2 minutes passed and she demanded we do something else. She hopped up on my bed and started shaking her ass, telling me to pound her hard blah blah blah like she's some kind of nympho. That got me momentarily excited but I quickly realized it was just talk. After like 10 minutes she says she can't take any more and goes \"you've got to cum,\" and said no when I asked about a round 2. I told her she's not keeping the donation for a full hour in that case, and she said it was fine to adjust it to the 30 minute amount. We weren't even near 30, so we continued for a little but after her complaining about touching the V during mish and refusing to do lazy dog, I just finished in doggy after maybe 20 minutes. So basically I got a QV for $. 75. Not exactly a bargain. I'm still in my twenties so I don't doubt that I've got more energy than many hobbyists, but I pretty much always do a full hour and have never had a provider demand I stop early before. Plus I was actually taking it easy on her, specifically because I'd read the feedback from seniors here and wanted to take extra care not to piss her off.\nShe wasn't overtly rude, but definitely pushy and demanding. I'd say it was false sincerity. She clearly thinks very highly of herself. I can see her being the woman in the restaurant berating her waiter for allowing her water glass to fall below half full, or screaming in to her cell phone on a crowded airplane.\nI have no idea how she has so many good reviews out there. Her average rating on the other site is like the same as Nellie's if not better...what planet are we on again? But that'll teach me to ignore the warnings of senior members here. With her attitude and all of her rules, she's not worth $$ for an hour much less $$$. Needless to say, I will not repeat.\nOh and to see Paris I flaked on an appointment with Kai the Hawaiian who I've been wanting to see, so I'm probably blocked by her now. Smh. You live and you learn."}]