[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:22:11.000+03:00", "author": "", "entities": {"persons": [{"name": "jim", "sentiment": "neutral"}, {"name": "an garda siochana", "sentiment": "none"}, {"name": "jim o’brien", "sentiment": "none"}, {"name": "madeleine mccann", "sentiment": "none"}, {"name": "brit", "sentiment": "none"}, {"name": "chanice bowen", "sentiment": "none"}, {"name": "o’brien", "sentiment": "none"}, {"name": "kim jong-un", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}, {"name": "mr o’brien", "sentiment": "none"}, {"name": "austin reed", "sentiment": "none"}, {"name": "michael doyle", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "berkeley", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "clondalkin", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "asda", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "karren brady benefit", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "irish sun", "sentiment": "none"}]}, "text": "parking mad Man tells of shock at receiving letter from cops about an 11-year-old parking fine \nJim O’Brien, 42 was baffled to receive the letter about a fine for parking on a double yellow line in December 2006 By Michael Doyle 15th April 2017, 7:00 am Updated: 16th April 2017, 3:10 am Click to share on Facebook (Opens in new window) Comments A MAN has told of his shock at receiving a letter from cops saying they are going to court on his behalf to quash an 11-year-old parking fine. \nJim O’Brien, 42, said he was baffled when it arrived yesterday. 2 Jim O’Brien holds up the parking fine 11 years later \nThe letter told him police were appealing a fine for parking on a double yellow line on December 14, 2006. \nBut Mr O’Brien, from Clondalkin, Dublin, said the most bizarre thing was he has no recollection of the “offence”. \nHe told the Irish Sun: “I’m trying to contact them but no one’s picking up the phones and I got an automated response to my email saying someone would be in touch within three months. MOST READ IN NEWS pop legend 'rape' probe Cops probe Brit pop star over 'rape' of 14-year-old virgin who claims she was plied with champagne and pinned down on hotel bed IVF SHOCK Married couple struggling to conceive discover they are biological TWINS during IVF FAILURE TO LAUNCH North Korea attempts ballistic missile launch but it explodes 'almost immediately' in embarrassing blow for Kim Jong-un just hours after military display of missiles 'that could nuke America' 'I NEED HELP' Naked boy, 3, found wandering streets covered in faeces and begs stranger 'can I come with you?' ARE YOU THE LUCKY WINNER? Winning Lotto numbers for Saturday 15 April 2017 £3.4million jackpot 'he wants to squeeze every penny' Cop who led hunt for Madeleine McCann vows to 'clean out' her parents by suing them for damaging his reputation UPPING THE ANTE Dramatic footage shows colossal explosions as Putin drops 'new type of bomb' in Syria airstrikes Nazi gold hunters held Brit crew caught looking for German WW2 'gold ship' wreck in Atlantic ocean sparks diplomatic row STRIPPED OF A JOB Care workers who were exposed by The Sun for stripping and performing online sex shows forced out of their jobs BRIT STRENGTH Dramatic moment huge truck is destroyed after crashing into anti-terror bollard built in Britain THIN BREW LINE Eight police officers pictured relaxing in the sun with tea and bacon sarnies for 45 minutes during their shift 'i eat bad children' Horrific clip shows gran dressing up as witch alter-ego to terrify her seven-year-old granddaughter who she also tortured TRAVELLER TURF WAR Mum who suffered seven years of 'hell' at the hands of Travellers fears 'Dale Farm II' is now being built on her doorstep PARKING APP BUG Personal details of thousands of UK drivers revealed in 'huge data breach' of car parking app WORMING ITS WAY IN Mum's horror as Asda home delivery includes 'snake' taped to the side of chocolate cake ROYAL TRUMP-BLE Shocking footage shows pro and anti-Trump demonstrators fighting in huge brawl at Berkeley rally JOGGER MURDER ARREST Man arrested over rape and murder of Google manager, 27, eight months after she was killed and set on FIRE while running in woods near her mum’s home, according to US reports KARREN BRADY Benefit fraud is a crime - we must make cheats like Chanice Bowen who conned system of £22k feel guilty Suited and Booted Austin Reed to cut 1,000 jobs as 116-yr-old men’s store shuts up shop on high street FAILURE TO LAUNCH North Korea's 'attempt to fire ballistic missile FAILS' following threats to 'pulverise' the US \n“I don’t know whether I’m due a refund or what but I don’t remember this incident at all. If a number of parking fines were wrong I had no idea they went back so far with them — this was 2006. \n“The only thing I can think of was I used to work as a courier delivering medical products and such back then so maybe it has something to do with that.” 2 Jim O’Brien received the parking fine 11 years after the offence took place \nThe letter says: “I’m writing to you following a review conducted by An Garda Siochana (Irish police force) of prosecutions taken in respect of Fixed Charge Offences. \n“It has been identified that the correct procedures were not followed by An Garda Siochana in respect of the court conviction imposed on you on 14/12/2006 in relation to Double Yellow Lines-Driver-Parking. \n“Subject to your consent, An Garda Siochana will commence a process of appealing the conviction on your behalf.” \nIt asks the recipient to fill out an enclosed form and return it in a self-addressed envelope. It also apologises and says it will do everything possible to redress the issue as quickly as possible. \nA police spokesman said yesterday that if anyone has an issue with their fixed charge notices they should contact FCN.Helpline@garda.ie. ", "url": "http://omgili.com/ri/.wHSUbtEfZQD1RVKFqxhqwVEBNS8V3Eltt2HvhKeSebwf2bPyItbiWfgGFU3QA3fxwli1SLmLka4uPZf91eeAAZAgDrd1kdb2Z2lIxxlEBGV0cUcySdNhVMU0i.n1TaCXmi_v.MxURs1lySY5IJFP9ZmEAREaIKRktXPmiXOkjY-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:22:11.000+03:00", "language": "english", "title": "Man tells of shock at receiving letter from cops about an 11-year-old parking fine", "thread": {"title_full": "Man tells of shock at receiving letter from cops about an 11-year-old parking fine", "site_full": "www.thesun.co.uk", "site": "thesun.co.uk", "site_section": "", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "news", "spam_score": 0.004, "domain_rank": 2180, "replies_count": 0, "site_categories": [], "country": "GB", "section_title": "", "url": "http://omgili.com/ri/.wHSUbtEfZQD1RVKFqxhqwVEBNS8V3Eltt2HvhKeSebwf2bPyItbiWfgGFU3QA3fxwli1SLmLka4uPZf91eeAAZAgDrd1kdb2Z2lIxxlEBGV0cUcySdNhVMU0i.n1TaCXmi_v.MxURs1lySY5IJFP9ZmEAREaIKRktXPmiXOkjY-", "published": "2017-04-16T11:22:11.000+03:00", "title": "Man tells of shock at receiving letter from cops about an 11-year-old parking fine", "uuid": "02b06ee63adca6273df485266ef4e025471dd0d8", "main_image": "https://www.thesun.co.uk/wp-content/uploads/2017/04/pjimage-522.jpg?strip=all&#038;quality=100&#038;w=750&#038;h=500&#038;crop=1"}, "uuid": "02b06ee63adca6273df485266ef4e025471dd0d8", "ord_in_thread": 0}]