[{"uuid": "0ac9235bc3d66f1d4ec0fe53440420bd7a9b2f35", "url": "http://omgili.com/ri/7aBdisT0NOpL65S9fMbJsK2DAMptMyzPH2wjeWj9UsEFY9i8IMgqPbypj_l8bOYvsT0EH.5_7jk-", "title": "Commercial Manager/Business Development/Sales Manager", "author": "", "rating": null, "published": "2017-04-18T19:16:00.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "aml", "sentiment": "none"}, {"name": "consult hyperion", "sentiment": "none"}, {"name": "private health", "sentiment": "none"}, {"name": "associates", "sentiment": "none"}, {"name": "nfc", "sentiment": "none"}, {"name": "permanent health", "sentiment": "none"}], "locations": [{"name": "south east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "persons": [{"name": "mould", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "0ac9235bc3d66f1d4ec0fe53440420bd7a9b2f35", "url": "http://omgili.com/ri/7aBdisT0NOpL65S9fMbJsK2DAMptMyzPH2wjeWj9UsEFY9i8IMgqPbypj_l8bOYvsT0EH.5_7jk-", "site_full": "salesprorecruitment.co.uk", "title": "Commercial Manager/Business Development/Sales Manager", "site_section": "http://salesprorecruitment.co.uk/rss/", "domain_rank": null, "published": "2017-04-18T19:16:00.000+03:00", "title_full": "Commercial Manager/Business Development/Sales Manager", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "Rss", "site_type": "blogs", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "GB", "performance_score": 0, "main_image": "http://salesprorecruitment.co.uk/files/pictures/jobg8_logo_17706_f8443c06b5_1.png", "site": "salesprorecruitment.co.uk"}, "external_links": [], "language": "english", "text": "Job ID: 21658 Job Description \nConsult Hyperion is the world's leading retail payments consultancy. With a client base ranging from the international payment schemes, through the leading payment card issuers, transit operators, mobile network operators, retailers and their suppliers, we have been instrumental in the design and implementation of a range of innovative payment solutions. We provide specialist consultancy skills alongside software development and compliance testing capability; this enables us to support product development from idea to deployment. We specialise in financial and identity transactions over secure networks and currently provide business and technical expertise in contactless and NFC enabled payments, card transactions, mobile and electronic money, stored value transactions and transit ticketing over the full range of customer contact channels. The Role: We are currently looking for a Commercial Manager, to join our successful sales team. Reporting to the Sales Director, you will be responsible for the commercial relationship between Consult Hyperion and an existing key account and for the development of new accounts. This role will include, but not be limited to:- Taking responsibility for an existing key account and growing the revenue by identifying new areas of activity. Working with a lead consultant in an existing project team to identify any new opportunities and bringing additional resources into the project if and when required. Working with the Sales Director to identify new business areas as they develop. Working with the Associate Manager to identify new opportunities for Associates (independent contractors) and managing any issues which may arise between placed Associates and the team within the client that they are working with. The commercial relationship between the Consult Hyperion and the Associate will be the Associate Manager's responsibility. You will be expected to be able to:- Converse with your clients around the opportunities presented by the technology they are considering using and the products and services that they are designing. Understand the product/service development process, the role that Consult Hyperion can play as Client's Friend and using this knowledge to develop and get the client's agreement on the format of potential projects prior to writing a commercial offer and statement of work. Use account planning techniques to make contact with the key stakeholders within your accounts, to ensure support for any proposal you submit. Review and obtain agreement on Master Service Agreements and work with the client and Consult Hyperion's management team to ensure our compliance with those agreements. Requirements: Technically Aware Understand and be able to discuss the changing payments market, the role of the mobile phone, tablet and identity within retail payments, including the features, benefits and barriers of alternative solutions. Understand at a high level the bodies and standards which govern the deployment of retail payment services in Europe and North America. Understand the current processes behind the life cycle management of payment cards, bank accounts and acquiring agreements with all sizes of merchant, both remote and face to face. Market Aware Understand and be able to discuss the current drivers for the migration towards deployment of services on NFC-enabled mobile phones and tablets, as well as the adoption of mPOS devices and tablets at the POS. Have a working knowledge of the compliance requirements for new payment applications, in particular those imposed by the Payment Schemes, PCI as well as KYC and AML. Be able to debate the issue of who owns personal data and the opportunity to monetise it at all stages of the value chain. \nDegree Not necessarily a business or marketing discipline. \nIndustrial Experience: 8+ years of commercial experience, ideally spent in a retail payments company, their suppliers or in IT solutions sales. \nPractical Experience: Bid management and tender preparation. Negotiation of, and monitoring of and adherence to, Master Service Agreements Following leads and helping to close business generated by marketing activities such as exhibitions and seminars. Working trade fairs and conferences, using them to generate new sales leads. Sales forecasting. Good communication skills (both written & verbal) Self-motivation & commitment Willingness to learn, apply your own initiative and have your personal contribution recognised and rewarded. \nTeam Worker Desire to be an integral part of a successful sales and marketing team with the understanding that more can be achieved by working as a team Willingness to travel As this is a client facing role you will be expected to spend a significant portion of your time out of the office. For the most part this will be within the South East of England. Travel abroad and within the UK, for specific sales opportunities may be required from time to time. Benefits include: Great opportunity to:- Expand your career prospects by working for globally recognised thought leaders and technical experts within the field of retail payments, identity and transit. Work with the latest technology and influence how this will be adopted and used by global organisations. Mould the role to meet your own personal objectives. Contact with a broad mix of clients from blue chip to niche technology organisations. 25 Days Holiday per year rising with years of service Insurance (Life, Private Health, Permanent Health) Non contributory pension", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:55.000+03:00"}]