[{"entities": {"organizations": [{"name": "sierra club", "sentiment": "negative"}, {"name": "interior department", "sentiment": "none"}], "locations": [{"name": "santa barbara", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}, {"name": "reagan center", "sentiment": "none"}], "persons": [{"name": "zinke", "sentiment": "negative"}, {"name": "ryan zinke", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}]}, "uuid": "0e90fcec5c22faf78182b117fa9e49ad0e1d7f9b", "highlightText": "", "title": "Sierra Club and Others to Protest Secretary Zinke’s Speech", "thread": {"site": "wn.com", "country": "GB", "participants_count": 1, "site_full": "article.wn.com", "section_title": "WN.com - Politics News", "uuid": "0e90fcec5c22faf78182b117fa9e49ad0e1d7f9b", "site_section": "http://rss.wn.com/English/keyword/politics", "domain_rank": 5594, "main_image": "", "performance_score": 0, "published": "2017-04-13T03:00:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZQOY2Vu62HdS2fx3k67ipt6upNUj_7ZtN5LB1izMGkGaP1OqkQja1H6v01CL2MruI3W5n1alHGBT7mD0fnOZOxTBQsKghAQi.vjif8D3sBddOLGQzuZ68Bw2yZ6djdD2M0-", "title_full": "Sierra Club and Others to Protest Secretary Zinke’s Speech - Worldnews.com", "title": "Sierra Club and Others to Protest Secretary Zinke’s Speech", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-13T03:00:00.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZQOY2Vu62HdS2fx3k67ipt6upNUj_7ZtN5LB1izMGkGaP1OqkQja1H6v01CL2MruI3W5n1alHGBT7mD0fnOZOxTBQsKghAQi.vjif8D3sBddOLGQzuZ68Bw2yZ6djdD2M0-", "ord_in_thread": 0, "crawled": "2017-04-16T23:01:33.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "wn.com", "text": "Sierra Club and Others to Protest Secretary Zinke’s Speech Posted , 2017-04-16 Santa Barbara , CA-- On Monday, April 17, the Sierra Club and other local organizations will protest Secretary of the Interior Ryan Zinke 's speech at the Reagan Center . \nSince taking office, Donald Trump's Interior Department has repeatedly sought to destroy publicly-owned lands for fossil fuel development. The Secretary   Environmental groups seeing an uptick in volunteers, interest \nThey are calling, emailing, showing up at meetings, donating money and offering to lobby legislators in support of measures aimed at promoting renewable energy in place of burning fossil fuels. Trump, for his part, has made good on his campaign promises vowing to “end the war on coal” by rolling back measures enacted by the Obama administration aimed at curbing greenhouse gas ... US halts plan to transfer Montana bison management to tribe \nMISSOULA, Mont. U.S. Interior Secretary Ryan Zinke has reversed plans to give management of Montana's National Bison Range to the Confederated Salish and Kootenai Tribes, saying that he is committed to not selling or transferring public lands. Zinke, a former Montana congressman, told the Missoulian (http://bit.ly/2p0PCNt ) in an email that the tribes would still play a ... Scott Pruitt hails era of environmental deregulation in speech at coal mine \nThe EPA administrator declared an end to the governments ‘war’ on coal in a speech to miners – an agenda that has been bitterly opposed by agency staff @olliemilman @olliemilman Scott Pruitt, the US Environmental Protection Agency (EPA) administrator, heralded a new era of environmental deregulation ... Dems are always invited to give commencement speeches \nThe class of 2017 can count on all the traditional trappings of college commencement: caps and gowns, “Pomp and Circumstance,” and a heaping helping of left-wing politics. Academia’s longstanding liberal bias has only hardened after last November’s election sent Donald Trump to the White House, a Post review of more than 200 colleges’ commencement plans reveals. “It is a ... Sen. Cruz Questions Sierra Club President Aaron Mair on Climate Change published: 06 Oct 2015 Sen. Cruz Questions Sierra Club President Aaron Mair on Climate Change Sen. Cruz Questions Sierra Club President Aaron Mair on Climate Change Sen. Cruz Questions Sierra Club President Aaron Mair on Climate Change published: 06 Oct 2015 The Sierra Club: About Us published: 07 Feb 2014 The Sierra Club: About Us The Sierra Club: About Us published: 07 Feb 2014 views: 19719 \nhttp://sierraclub.org Welcome to the Sierra Club, the largest and most effective grassroots environmental organization in the U.S. Join us! - Founded by legendary conservationist John Muir in 1892, the Sierra Club is now the nation\\'s largest and most influential grassroots environmental organization -- with more than two million members and supporters. Our successes range from protecting millions of acres of wilderness to helping pass the Clean Air Act, Clean Water Act, and Endangered Species Act. More recently, we\\'ve made history by leading the charge to address climate disruption by moving away from the dirty fossil fuels and toward a clean energy economy. Visit us here: Facebook: https://www.facebook.com/SierraClub Twitter: https://twitter.com/sierraclub Instagram: https://instagram.com/sierraclub... The Sierra Club: About Us published: 07 Feb 2014 views: 19719 \nhttp://sierraclub.org Welcome to the Sierra Club, the largest and most effective grassroots environmental organization in the U.S. Join us! - Founded by legendary conservationist John Muir in 1892, the Sierra Club is now the nation\\'s largest and most influential grassroots environmental organization -- with more than two million members and supporters. Our successes range from protecting millions of acres of wilderness to helping pass the Clean Air Act, Clean Water Act, and Endangered Species Act. More recently, we\\'ve made history by leading the charge to address climate disruption by moving away from the dirty fossil fuels and toward a clean energy economy. Visit us here: Facebook: https://www.facebook.com/SierraClub Twitter: https://twitter.com/sierraclub Instagram: https://instagram.com/sierraclub... Tucker to Sierra Club dir: Why take on abortion, xenophobia? published: 03 Feb 2017 Tucker to Sierra Club dir: Why take on abortion, xenophobia? Tucker to Sierra Club dir: Why take on abortion, xenophobia? published: 03 Feb 2017 views: 8397 \nTucker takes on executive director of The Sierra Club over their taking on causes that don\\'t seem to be directly tied to the environment #Tucker... Tucker to Sierra Club dir: Why take on abortion, xenophobia? published: 03 Feb 2017 views: 8397 \nTucker takes on executive director of The Sierra Club over their taking on causes that don\\'t seem to be directly tied to the environment #Tucker... Debate: Alex Epstein (CIP) vs. Bruce Nilles (Sierra Club) published: 23 Apr 2013 Debate: Alex Epstein (CIP) vs. Bruce Nilles (Sierra Club) Debate: Alex Epstein (CIP) vs. Bruce Nilles (Sierra Club) published: 23 Apr 2013 views: 24482 \nThis debate took place at Stanford University on April 16, 2013. For more info on Center for Industrial Progress and Alex Epstein, go to www.industrialprogress.com www.alexepstein.com... Debate: Alex Epstein (CIP) vs. Bruce Nilles (Sierra Club) published: 23 Apr 2013 views: 24482 \nThis debate took place at Stanford University on April 16, 2013. For more info on Center for Industrial Progress and Alex Epstein, go to www.industrialprogress.com www.alexepstein.com... Ted Cruz demolishes Sierra Club president on global warming hoax published: 08 Oct 2015 Ted Cruz demolishes Sierra Club president on global warming hoax Ted Cruz demolishes Sierra Club president on global warming hoax published: 08 Oct 2015 views: 25857 \nPlease join the great news site of the Jewish Task Force: http://jtf.org JTF\\'s Facebook page: https://www.facebook.com/pages/Jewish-Task-Force-JTF/460701807304711 אנא הצטרפו לאתר שלנו בעברית: http://hayamin.org תורה בראשית במדבר דברים ויקרא שמות נביאים יהושע שופטים מלכים שמואל ירמיהו ישעיהו יחזקאל תרי עשר חמש מגילות איכה אסתר קהלת רות שיר השירים כתובים איוב דברי הימים דניאל משלי נחמיה אזרא תהילים תנ\\'\\'ך דוד המלך שלמה משה רבנו אברהם יצחק יעקב אדם נח משנה זרעים מועד נשים נזיקין קדשים טהרות קדושים הלכה הלכות מסכת מסכתות משניות תלמוד בבלי ירושלמי גמרא אמוראים תנאים סבוראים גאונים ראשונים אחרונים רבנים ישיבה ישיבות יהודה שומרון עזה ירושלים רמת הגולן ארץ ישראל השלמה חברון יצחר איתמר בית אל שמעון הצדיק גוש קטיף עמונה מאחזים גירוש נוער הגבעות תג מחיר הצפון הגליל הדרום הנגב סיני ימית התישבות ישובים התנחלות מתנחלים חיים בן פסח תנועת הימין האמיתי הרב מאיר כהנא כהניסטים ליכוד ישראל ביתנו נתניהו ליברמן משה יעלון פייגלין יש עתיד יאיר לפיד הבית היהודי נפתלי בנט כנסת בחירות ש\\'\\'ס המפד\\'\\'ל יהדות התורה אגודה לבני שרים ממשלה צה\\'\\'ל צבא חיילים קרבות מלחמה הצבעה קולות תעמולה תקשורת תשקורת שמאל קיצוני איראן גרעין מצרים סוריה לבנון ירדן טורקיה פת\\'\\'ח אש\\'\\'ף חיזבאללה חמאס קוראן חדית ערבים מוסלמים סונים שיעים שיעה מוחמד אל קאעידה איסלאם ערפאת אבו מאזן מחמוד עבאס מחבלים טרוריסטים רוצחים נאצים אנטישמיים שואה היטלר גרמניה אירופה האו\\'\\'מ האיחוד האירופי Chaim Ben Pesach Jewish Task Force Jews for Cruz Ted Cruz Scott Walker Marco Rubio Hillary Clinton Israel Zionism Judaism settlements Rabbi Meir Kahane Kahanists Judea Samaria Torah Carly Fiorina Joe Biden Bernie Sanders... Ted Cruz demolishes Sierra Club president on global warming hoax published: 08 Oct 2015 views: 25857 \nPlease join the great news site of the Jewish Task Force: http://jtf.org JTF\\'s Facebook page: https://www.facebook.com/pages/Jewish-Task-Force-JTF/460701807304711 אנא הצטרפו לאתר שלנו בעברית: http://hayamin.org תורה בראשית במדבר דברים ויקרא שמות נביאים יהושע שופטים מלכים שמואל ירמיהו ישעיהו יחזקאל תרי עשר חמש מגילות איכה אסתר קהלת רות שיר השירים כתובים איוב דברי הימים דניאל משלי נחמיה אזרא תהילים תנ\\'\\'ך דוד המלך שלמה משה רבנו אברהם יצחק יעקב אדם נח משנה זרעים מועד נשים נזיקין קדשים טהרות קדושים הלכה הלכות מסכת מסכתות משניות תלמוד בבלי ירושלמי גמרא אמוראים תנאים סבוראים גאונים ראשונים אחרונים רבנים ישיבה ישיבות יהודה שומרון עזה ירושלים רמת הגולן ארץ ישראל השלמה חברון יצחר איתמר בית אל שמעון הצדיק גוש קטיף עמונה מאחזים גירוש נוער הגבעות תג מחיר הצפון הגליל הדרום הנגב סיני ימית התישבות ישובים התנחלות מתנחלים חיים בן פסח תנועת הימין האמיתי הרב מאיר כהנא כהניסטים ליכוד ישראל ביתנו נתניהו ליברמן משה יעלון פייגלין יש עתיד יאיר לפיד הבית היהודי נפתלי בנט כנסת בחירות ש\\'\\'ס המפד\\'\\'ל יהדות התורה אגודה לבני שרים ממשלה צה\\'\\'ל צבא חיילים קרבות מלחמה הצבעה קולות תעמולה תקשורת תשקורת שמאל קיצוני איראן גרעין מצרים סוריה לבנון ירדן טורקיה פת\\'\\'ח אש\\'\\'ף חיזבאללה חמאס קוראן חדית ערבים מוסלמים סונים שיעים שיעה מוחמד אל קאעידה איסלאם ערפאת אבו מאזן מחמוד עבאס מחבלים טרוריסטים רוצחים נאצים אנטישמיים שואה היטלר גרמניה אירופה האו\\'\\'מ האיחוד האירופי Chaim Ben Pesach Jewish Task Force Jews for Cruz Ted Cruz Scott Walker Marco Rubio Hillary Clinton Israel Zionism Judaism settlements Rabbi Meir Kahane Kahanists Judea Samaria Torah Carly Fiorina Joe Biden Bernie Sanders..."}]