[{"entities": {"persons": [{"sentiment": "none", "name": "mooky"}, {"sentiment": "none", "name": "mr boo"}, {"sentiment": "none", "name": "merlin"}], "organizations": [{"sentiment": "none", "name": "blackpool tower circus"}], "locations": [{"sentiment": "none", "name": "blackpool"}, {"sentiment": "none", "name": "blackpool tower"}, {"sentiment": "none", "name": "merlin annual pass"}]}, "text": "Posted on April 18, 2017 | Leave a comment \nOver the Easter break, the small boy and I headed off to Blackpool for a couple of days of seaside fun. We had a bit of a check list of things we wanted to see and do while we were there, but mainly we wanted to have fun and chill out a bit. First on our holiday agenda was a trip to the Blackpool Tower Circus. \nI’d heard very good things about the Blackpool Tower Circus. Virtually everyone we told that we were planning a trip to Blackpool said that it was well worth seeing. I have very vague memories of going when I was a child, but that was about 800 years ago and things have probably changed since then. \nWe had been told be friends to visit the Blackpool Tower early and pre-book our tickets. You can pay an extra £5.99 on top of your ticket to sit on one of the front few rows if you like. If you do this you get drinks and snacks included and a chance that some of the performers will chat to you. Sadly these tickets were fully booked, so we got a pair of tickets in the stalls instead. \nAn adult ticket is £13 and a child is £10.50. We are Merlin Annual Pass holders, the ticket price is covered by our Merlin Passes, so we just showed our Merlin cards at the box office and we were issued our tickets. \nYou’re advised to arrive a good half an hour before the show starts. Tickets are unreserved so you have to find your own seats. We sat around 5 rows from the front and we had a great view. If you’re in a large group you might struggle to find seats together, so do go early. \nBefore the show and during the interval you can join the performers in the circus ring to buy lights and tricks, learn to spin plates or have your face painted like a clown (for a small additional cost). There is a bar at the back where you can buy drinks and snacks too. \nThe Blackpool Tower Circus has been in residence in the Tower since 1894. We visited the circus on 5th April which was only the 5th day of their 2017 season. We felt pretty honoured to be seeing it all so early in the season. \nThe approach down the winding corridors to the circus ring is filled with memorabilia and exhibits. We felt a bit pushed past it all by the crowds keen to get to their seats. This was a bit of a shame and I’d very much like to go another day and have the time to take it all in. \nThe circus ring itself is in the round, meaning wherever you’re sitting you should get a good view. The current circus design was completed in 1900 and it is remarkable. It’s beautiful and baroque with padded velvet seats. There is room for several hundred people to enjoy the show but you still feel you’re close to the performers. \nPhotography is not permitted once the show has started, so I wasn’t able to take any photos of the performance. However, the two hour long show, with additional interval was both breathtaking and hilarious. \nThe glue which holds the show together are the clowns Mooky and Mr Boo. Mooky the Clown is the hilarious and cheeky funny guy which everyone loves and Mr Boo is his straight man. They’re brilliant and they were very much the highlight for my six year old. Mooky the Clown is a Blackpool Tower Circus legend and has been clowning around in Blackpool since 1992. \nThe whole show was incredibly good. With acrobats, an amazing tightrope walker, trapeze artists, a fantastic live band and a troupe of beautiful dancers. There were several eye-watering acrobatic feats, my favourite being the neon clad trapeze artists and the Chinese tightrope walker. The circus is filled with amazing acts from all over the world and is genuinely incredible. \nThe finale of the circus show is the dancing fountains. The circus ring is lowered and filled with water and beautiful acrobats twirl and swirl on a Roman themed carousel of sorts. It’s an awesome sight. The Blackpool Tower Circus is one of only four circus rings left in the world that can do this. \nWe felt it was excellent value for money, especially with our Merlin Annual Passes. We would definitely consider the £5.99 VIP seating upgrade next time though. The circus itself was awe inspiring. The show is two hours long with an interval and it’s packed with fantastic performers and performances. The small boy is still raving about the clowns and I’m keen to go back and watch it all again. Always a good sign. For more information about The Blackpool Tower Circus and to book tickets visit the Blackpool Tower website . I’m a Merlin Annual Pass Blogger Ambassador. I have been given a Merlin Annual Pass to do this review with my family. I wasn’t paid to write this post. Share this:", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "1db0c7270ac0da1f952cd05ee704a0a26203c6b4", "rating": null, "highlightTitle": "", "title": "Days Out: The Blackpool Tower Circus", "thread": {"country": "GB", "site": "hodgepodgedays.co.uk", "replies_count": 0, "title_full": "Days Out: The Blackpool Tower Circus", "site_categories": [], "performance_score": 0, "section_title": "HodgePodgeDays", "domain_rank": null, "uuid": "1db0c7270ac0da1f952cd05ee704a0a26203c6b4", "main_image": "http://hodgepodgedays.co.uk/wp-content/uploads/2017/04/20170406_105208.jpg", "site_type": "blogs", "title": "Days Out: The Blackpool Tower Circus", "spam_score": 0.0, "site_section": "http://hodgepodgedays.co.uk/feed", "url": "http://omgili.com/ri/uBQNNiLKiWaF2woGv9YttPd97cuZIa7.s3uYb3TDFciZCKqbF7cCgNyyXgDpVjC9X40cgDedE9cTwZVb7fezmw--", "participants_count": 1, "site_full": "hodgepodgedays.co.uk", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:25:37.000+03:00"}, "crawled": "2017-04-18T11:25:37.000+03:00", "url": "http://omgili.com/ri/uBQNNiLKiWaF2woGv9YttPd97cuZIa7.s3uYb3TDFciZCKqbF7cCgNyyXgDpVjC9X40cgDedE9cTwZVb7fezmw--", "highlightText": "", "published": "2017-04-18T11:25:37.000+03:00", "author": "HodgePodgeDays"}]