[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:16:15.000+03:00", "author": "Bernadette McNulty", "entities": {"persons": [{"name": "omeara", "sentiment": "positive"}, {"name": "beth ditto", "sentiment": "positive"}, {"name": "george michael", "sentiment": "none"}, {"name": "elizabeth taylor", "sentiment": "none"}, {"name": "bonnie tyler", "sentiment": "none"}, {"name": "dolly parton", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}], "organizations": [{"name": "heavy cross", "sentiment": "none"}, {"name": "nme", "sentiment": "none"}]}, "text": "I f ever there was a good time for a “fat, feminist lesbian from Arkansas” to return to the fray of pop music, it feels like now. This was how Beth Ditto used to disarmingly describe herself in her mid-00s heyday when, as lead singer of the band Gossip, she pushed herself, and her body, to the forefront of attention, appearing naked on the covers of NME and Love magazine to challenge the norms of what a woman should look like.\nSo powerful were those visual statements that, coupled with Ditto’s forays into fashion design, as well as the diminishing sales of the band’s records as they swerved away from blistering garage blues into sugary pop, they made it easy to forget that she was a singer of some talent.\nWith her first solo record, Fake Sugar , set to be released this summer, the 36-year-old’s intimate London gig is a reminder that it was her voice, rather than her body, that made her stand out. Addressing her absence, she declares: “Gossip is over. It was a good run, but we’re here, we’re queer, we’re weird, but my mother loves me.”\nCrammed on a tiny stage with her four-piece band, the night feels more like a homecoming party than a showcase for her new material. Ditto has said this is her southern record, and opener Oh My God kicks in with a funk-rock beat as she channels the mid-80s power vocals of Bonnie Tyler, complete with a front-of-stage electric fan to give her the perfect windswept look. Her once angular bob grown out, she looks like a grunge version of Cleopatra-era Elizabeth Taylor, her gold lamé T-shirt dress embellished with a target in the centre.\nBut as the sound softens, it’s her voice and emotions that become the focus. On In and Out and Fake Sugar, she closes her eyes and draws out the tender trill in her voice, giving her the air of a heartbroken Nashville queen. And like Dolly Parton, Ditto alternates between infectiously warm, wisecracking comic and soul-baring torch singer. She seems to be on first-name terms with half of the adoring audience, who at one point demand that she sing some George Michael. Game as ever, off the cuff she delivers an a cappella snatch of Careless Whisper more moving than any of the tributes delivered at the Grammys or Brits.\nFacebook Twitter Pinterest Watch the video for Beth Ditto’s new single Fire.\nDips into the Gossip back catalogue are judicious. The slashing guitars of Heavy Cross and high-energy electropop of Love Long Distance are a reminder of how electrifying they sounded in their pomp. After the latter, Ditto is gracious enough to admit: “I miss Gossip all the time. I’m not trying to steal these songs.”\nNot that she has mellowed completely. As an encore, 2006’s Standing in the Way of Control feels even more like an anthem for smiling defiance, the crowd hollering back to Ditto the communal refrain, “I’m doing this for you”, with joyous abandon. “I was 23 when I wrote that song and I can’t believe it’s more relevant than ever,” she declares. “We got too comfortable. But I’m glad everyone’s awake now.”\nTopics Pop and rock The Observer Punk live music ", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_njnmhMw67pA208b..J16JpXsaeqikuVhBzvo7jhN253Jg5UFwCU.1rx0TAHEpQZeqLros7St7KTGUpxDsR.Q7FvNdlCmqkauwSGvrprzDj_xyWTHB5miIUQ--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:16:15.000+03:00", "language": "english", "title": "Beth Ditto review – a joyous comeback", "thread": {"title_full": "Beth Ditto review – a joyous comeback", "site_full": "www.theguardian.com", "site": "theguardian.com", "site_section": "http://www.guardian.co.uk/rssfeed/0,,39,00.xml", "performance_score": 0, "social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "facebook": {"likes": 18, "shares": 18, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": 170, "replies_count": 0, "site_categories": [], "country": "GB", "section_title": "Music | The Guardian", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_njnmhMw67pA208b..J16JpXsaeqikuVhBzvo7jhN253Jg5UFwCU.1rx0TAHEpQZeqLros7St7KTGUpxDsR.Q7FvNdlCmqkauwSGvrprzDj_xyWTHB5miIUQ--", "published": "2017-04-16T11:16:15.000+03:00", "title": "Beth Ditto review – a joyous comeback", "uuid": "2428970d2f2915621be37b96ce61866e6b64e153", "main_image": "https://i.guim.co.uk/img/media/8e826ee0cc06a12bd5ad5a60335f7e18ebcdfa1a/0_495_4397_2638/master/4397.jpg?w=1200&amp;h=630&amp;q=55&amp;auto=format&amp;usm=12&amp;fit=crop&amp;crop=faces%2Centropy&amp;bm=normal&amp;ba=bottom%2Cleft&amp;blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&amp;s=786c9a9f4415409288ef9109521f82af"}, "uuid": "2428970d2f2915621be37b96ce61866e6b64e153", "ord_in_thread": 0}]