[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:11:29.000+03:00", "author": "Mark Kermode, Observer film critic", "entities": {"persons": [{"name": "sarah waters", "sentiment": "negative"}, {"name": "lady hideko", "sentiment": "none"}, {"name": "kim tae-ri", "sentiment": "none"}, {"name": "tamako", "sentiment": "none"}, {"name": "kim min-hee", "sentiment": "none"}, {"name": "rebecca", "sentiment": "none"}, {"name": "cho young-wuk", "sentiment": "none"}, {"name": "sook-hee", "sentiment": "none"}, {"name": "fujiwara", "sentiment": "none"}, {"name": "abdellatif kechiche", "sentiment": "none"}, {"name": "kouzuki", "sentiment": "none"}, {"name": "park", "sentiment": "none"}, {"name": "hideko", "sentiment": "none"}, {"name": "chung chung-hoon", "sentiment": "none"}, {"name": "julie maroh", "sentiment": "none"}], "locations": [{"name": "victorian england", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}], "organizations": [{"name": "park chan-wook", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}]}, "text": "T here are giddy pleasures to be found in this rip-roaringly ripe erotic thriller/melodrama from Oldboy director Park Chan-wook. Inspired by Sarah Waters’s 2002 novel Fingersmith , The Handmaiden is a playfully provocative tale of seduction, desire and deceit. Slyly undermining stereotypes of fall guys and femmes fatales (this is more Bound than Basic Instinct ), Park’s film takes great delight in wrong-footing its audience, peeling away layers of mesmerising misdirection with delicious cinematic sleight of hand. As the serpentine narrative spirals back and forth upon itself, we witness the same events from multiple perspectives, each one more revealing than the last.\nIn Waters’s novel ( adapted as a BBC mini-series in 2005 ), an accomplished pickpocket is plucked from a Dickensian den to work in an upmarket home where she plays a key role in a scheme to separate a young heiress from her fortune. Park transfers the story from Victorian England to 1930s Korea under Japanese colonial rule. Here, Sook-hee (Kim Tae-ri) is enlisted by elegant conman “Count” Fujiwara (Ha Jung-woo) to serve at the home of Japanese heiress Lady Hideko (Kim Min-hee).\nRidiculous male spectators are left frantically fanning their red faces and squirming awkwardly in their seats\nVariously named “Tamako” and “Okju”, the mercurial Sook-hee must ensure that the naive Hideko falls in love with Fujiwara, enabling him to elope with her before swiftly committing the poor innocent to an asylum. His partner in crime will share the spoils, robbing Hideko’s Uncle Kouzuki of the handsome fortune he planned to inherit. Yet few of these characters are entirely what they seem, with role-playing, recitation, and unexpected reversals lurking at every corner, leaving us wondering just who exactly is “naive, and a bit foolish”.\nThe house in which this labyrinthine psychodrama plays out is a strange and mysterious hybrid, part western gothic mansion (there are shades of both The Haunting and Rebecca in its shadowy facade), part palatial Japanese residence. Within its lavishly sinister corridors we find rooms within rooms, spaces between the public and the private, the liminal and the subliminal. In one corridor, a symbolic snake stands guard, pointedly marking “the bounds of knowledge”. Down in the basement, something tentacular writhes, pulsating to the perverse rhythms of a library of Sadean pornographic writings. Meanwhile, out in the rolling grounds, the spectre of a dead aunt haunts the branches of the cherry trees, causing one inhabitant to wonder: “Did the big house make her go mad?”\nAfter the Hitchcockian twists and skin-prickling Freudian symbolism of his first English-language feature Stoker , Park returns to the grand theatricality of his “Vengeance Trilogy” ( Sympathy for Mr Vengeance , Oldboy , Lady Vengeance ) with this fugue-like romp, which is by turns bitingly wry and pleasingly ribald. There’s a tactile fetishism to the ornate set designs, rich furnishings and lavish costumes (“all these buttons for my amusement”), while a profusion of shoes clutter the living space of a lady who, ironically, has nowhere to go.\nSarah Waters: ‘The Handmaiden turns pornography into a spectacle – but it's true to my novel' Read more\nCinematographer Chung Chung-hoon’s widescreen frame makes the most of this artefact-laden visual feast, while Cho Young-wuk’s score swoops and surges its way around the action, amplifying Park’s maximalist aesthetic.\nWhile Abdellatif Kechiche’s Blue Is the Warmest Colour was criticised by source author Julie Maroh for its porn-inflected “display of so-called lesbian sex”, The Handmaiden has been enthusiastically embraced by Sarah Waters as a valid interpretation of the subversive sexuality of her novel. In a recent Guardian interview she praised Park’s film for remaining “very faithful to the idea that the women are appropriating a very male pornographic tradition to find their own way of exploring their desires” while simultaneously deconstructing those traditions. In one arrestingly weird scene, a theatrical reading from a work of allegedly erotic literature is illustrated with the aid of a giant marionette, providing an absurdist tableau which leaves its ridiculous male spectators frantically fanning their red faces and squirming awkwardly in their seats.\n“Tell me, what is it that men want, at night?” Hideko asks innocently, a question to which The Handmaiden offers a piercingly satirical response. Just as the narrative plays with ideas of national colonialism, so the film’s female protagonists strive to find a space of their own, beyond the boundaries of stories told by men.\nAs for Park, he clearly relishes the opportunity to tie his audience up in knots, engaging them in a carefully choreographed game of cat-and-mouse, which his well-chosen cast play to a T. Despite the daunting running time, the film flies by in a breathless whirl of cinematic exuberance.\nFacebook Twitter Pinterest Topics Thriller Mark Kermode's film of the week Park Chan-wook Sarah Waters Film adaptations Sexuality ", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_noY1di9e.CNqx4I_nT6CmARjwDEFptCDBIeT3fAX9P_Nf6wJ7xXH3.jv10hucWLvsQg7b83gug8O51EaDJSeqN6k0phvUXxa3L4z8rXbbAyQWDwVUUIKXJA--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:11:29.000+03:00", "language": "english", "title": "The Handmaiden review – a ripe, erotic tale", "thread": {"title_full": "The Handmaiden review – a ripe, erotic tale", "site_full": "www.theguardian.com", "site": "theguardian.com", "site_section": "http://www.guardian.co.uk/rssfeed/0,,16,00.xml", "performance_score": 4, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 409, "shares": 410, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "news", "spam_score": 0.0, "domain_rank": 170, "replies_count": 0, "site_categories": [], "country": "GB", "section_title": "Film | The Guardian", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_noY1di9e.CNqx4I_nT6CmARjwDEFptCDBIeT3fAX9P_Nf6wJ7xXH3.jv10hucWLvsQg7b83gug8O51EaDJSeqN6k0phvUXxa3L4z8rXbbAyQWDwVUUIKXJA--", "published": "2017-04-16T11:11:29.000+03:00", "title": "The Handmaiden review – a ripe, erotic tale", "uuid": "560656ad45410bea154599252a2724e2ce39210d", "main_image": "https://i.guim.co.uk/img/media/134cea3810fdade9bd2c6813c243bb9225f8f3c5/238_128_3033_1820/master/3033.jpg?w=1200&amp;h=630&amp;q=55&amp;auto=format&amp;usm=12&amp;fit=crop&amp;crop=faces%2Centropy&amp;bm=normal&amp;ba=bottom%2Cleft&amp;blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&amp;s=9f761d3914ceeb3eed16939339886624"}, "uuid": "560656ad45410bea154599252a2724e2ce39210d", "ord_in_thread": 0}]