[{"entities": {"organizations": [{"name": "google", "sentiment": "none"}], "locations": [{"name": "cambridge", "sentiment": "none"}], "persons": [{"name": "miles -  ran", "sentiment": "none"}, {"name": "bloglovin", "sentiment": "none"}, {"name": "phillip", "sentiment": "none"}, {"name": "phillips", "sentiment": "none"}]}, "uuid": "7832b062e81c42404da52b6c421d9b1fc7db51c5", "highlightText": "", "title": "Training Diary #2", "thread": {"site": "laurafat2fit.co.uk", "country": "GB", "participants_count": 1, "site_full": "www.laurafat2fit.co.uk", "section_title": "Laura: Fat 2 Fit", "uuid": "7832b062e81c42404da52b6c421d9b1fc7db51c5", "site_section": "http://www.laurafat2fit.co.uk/", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T23:42:28.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_rxWti.z9ZbCcrpBFm4q.lRgSyHci3vU_F_KD195xg4TG.Eph6igxJzJSCi0yEnwT.3vJNZkFXUg--", "title_full": "Training Diary #2", "title": "Training Diary #2", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T23:42:28.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_rxWti.z9ZbCcrpBFm4q.lRgSyHci3vU_F_KD195xg4TG.Eph6igxJzJSCi0yEnwT.3vJNZkFXUg--", "ord_in_thread": 0, "crawled": "2017-04-16T23:42:28.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Laura @ Laura : Fat 2 Fit (noreply@blogger.com)", "text": "W e're back for another Training Diary! Incase you're new here or new to these posts.. I basically recap my training for the week, what runs, swims, cycles or whatever else I've been up to during the week.  Whilst I'm at it, Happy Easter! I hope you're enjoying the long weekend! :)\n\nAnyway! If you wanna hear about how my training went this week, keep on reading!\n\nMONDAY  - SWIM - 675m\nI don't want to dwell on this one too much. I actually can't remember what happened in the lesson cause I was too focused on the jumping in that I mentioned last year. Long Story short, I didn't jump in again, I was feeling pretty upset post-swim. I'm over it now, Im taking a break from it and I'll revisit it another time.\n\nTUESDAY  - RUN - 6.2 Miles\nI didn't have a car on this day, Phillip had taken the car for the day. I'd gotten a lift into work and brought my running kit with me so I could run home from work. There's a lovely route all the way back to the house along the river and I havent done the route in quite a while.\nPace was pretty casual at 10:23min/mi - I stopped to take a couple of pictures along the river on the way home.\n\nWEDNESDAY  - REST\n\nTHURSDAY  - REST - Unplanned - had a cinema date night on Weds and we got back really late. I slept in.. and wasn't feeling at all motivated to workout when I got home from work.\n\nFRIDAY  - RUN - 4.22 Miles -  Ran with Phillips mum for the first time in ages! It was a pretty social run, we talked for the majority of the run.. ended up managing 9:41 min/mi with negative splits which was pretty great!\nSATURDAY  - REST - Unplanned - Typically do parkrun or some sort of run on a Saturday - I had also planned on the first Open Water Swim of the season. Neither went to plan. parkrun in Cambridge is in the same location as OWS so during OWS season, we typically swim in the morning until 8:40-50 and then do parkrun straight after.\n\nUnfortunately, Phillip and his mum bailed on me and they decided it was too cold. Much to my disappointment as it's not really worthwhile cost wise for me to travel there and swim by myself.. so I had to sit it out.\n\nSUNDAY  - RUN 4 Miles - CYCLE 8.32 Miles -  Did 4 miles in the morning since I'd skipped my Sat run. Not much to really report.. It was mostly tracks with a mile off-road on a field which slowed my pace. Ended up with 10:18 min/mi.\n\nIn the afternoon, Phillip was watching Formula1. It's not my cup of tea so I took myself off for a quick cycle. It was actually pretty freezing, even with a long sleeved top on. I did get to try out my Quadlock Mount * that I got sent, which so far is great and SO convenient(review coming in the near future)!\nOn the way back from the cycle.. there were some utter douchebag motorists. Riding a bike around cars is SO scary.  You've absolutely no idea what a motorist is gonna do. Sadly, people are in too much of a rush these days and I've seen so many times on the road where people are too eager to just get past cyclists. I had a van who looked like he'd stopped on the road leading to the main road I was cycling on.. who then proceeded to pull out in front of me instead of waiting. Another car that overtook me and then signalled to turn into a road, cutting me off. Then a car coming out from the same turning tried to come out before waiting for me to pass the turning.\n\nUnbelievable. I'll be taking my GoPro out with me on all rides as a sort of dashcam incase anything happened. A positive to the whole situation? I'm learning to use my cleats more and Im a lot more comfortable with them.\n\n--\n\nNot what I expected from training this week. Not as good as last week. I wanted to get in an exta swim which I was hoping to do with Open Water Swimming but no dice. Also could have gone cycling during the week.. but I've oddly not wanted to go out by myself until today.. so hopefully now I've done it I can go out again.\n\nIf I could at least keep to the 2, 2, 2 rule, I'll be happy!\n\nIn other exciting news. I officially signed up for Great North Swim for this year, so I'll be working on getting my mile swimming times down and trying to get in more front crawl instead of breast stroke during the open water swims.\n\nQuestion: How are you spending the Long Easter Weekend? Do you cycle? If so do you find it scary cycling on the roads with cars? \nN.B * I was sent these items to review, but as always, all opinions are my own. \nLike this post? Follow me on Bloglovin'  OR  Subscribe for Email Updates Other places to find me: **  Twitter  **  Instagram  **  Pinterest  **  Facebook  **  Google+  **  Youtube  ** "}]