[{"entities": {"persons": [], "organizations": [], "locations": []}, "text": "DrHarvey12 said: ↑ Hmm - I would probably go for a BK XXLS 400 over a PB -1000. I think the BK model will be comparable to the 10\" PB 1000 in terms of depth and better in terms of musicality.\nNot too sure which PB 1000 review you have seen. However the SVS subs are very well regarded and they don't make a \"bad\" sub.\nThanks for the details about your setup. Seems good!\nWith regards to the WAF of both the BK & SVS models I would rate the BK models higher. The wood finishes can look really smart and the downward firing models don't even look too much like a speaker at all.\nIn fact this is where the BK Monolith's actually do a fairly good job of disguising themselves. They are so big if you add some nice cut (strengthened & edges rounded) glass to the top they can actually look like a nicely finished end table.\nWith regards to the Antimode I found a owners thread of sorts:\nViews on Anti-Mode 8033 Part 2...\nIt's part 2 but you could go back and read part 1 as well if you have LOTS of time on your hands.\nIt may answer some of your queries about it though from \"consumers\". Click to expand... Agreeing here, XXL400 does look like a furniture in DF version. But 70/30 % movies i would go straight with Monolith (20£ price dif to XXL400). Sadly this is too big for Speed. For 470£ i don`t think anything can touch it on that price in HT performance. Quite funny when you look the prices of some speaker manufacturers subs, they ask even more and it would be whole different experience with Monolith. But compromises needs to be made in living rooms some times.\nHaving heard one of my friend PB1000 with Antimode i just got to say it offers lot of performance for the price. Room is rather small, but the trick here was finding the best spot for sub and then add Antimode, result was amazing. Such a tight quality bass and it pressuresed the room nicely when needed. When you hear this kind of setup and see people saying \"oh no that subwoofer is too big for the room\", it makes me laugh.. As AudioVisualOnline Dan said it`s all about setting it up correctly in room. More tweaking is probably needed, but the end result put`s smile on your face. Little off-topic, but my experience with SVS.\nSadly the prices did go up with SVS in UK, same as with XTZ. But PB1000 is still quite cheap @ 519£. Forum favourite XTZ 12.17 costing 599£. I think the idea with SVS has been the maximum HT performance with small amount of $. That doesn`t leave too much for the cosmetic side. It digs low, 18-177hz +-3db when measured, so about same as Monolith DF. The digital DSP amp seems to be great and SVS has the best warranty in the business. 5year for amp! There is so many reviews for PB1000, i don`t know which one Speed has read. But this has some CEA numbers to proof it really has great performance;\nFrom a measurement standpoint, this is the most impressive <$500 sub I've encountered.\nReview: SVS PB-1000 subwoofer Measurements\nAnyway for basic living rooms with neighbours and nagging wife i can understand that P12/XXL400 offers enough performance for most people and great WAF. I think it depends how serious one is and when pushed something like Monolith/PB1000 can really make difference with movies.", "ord_in_thread": 6, "language": "english", "external_links": ["http://www.soundandvision.com/content/review-svs-pb-1000-subwoofer-measurements"], "uuid": "7f10a55ecb5193a9b39db44107ae2238a96f5ec6", "rating": null, "highlightTitle": "", "title": "", "thread": {"country": "GB", "site": "avforums.com", "replies_count": 6, "title_full": "Question - Bk xxl400 or M plus | AVForums", "site_categories": [], "performance_score": 0, "section_title": "Subwoofers | AVForums", "domain_rank": 10709, "uuid": "3b5448e3558f9471156e4eb902a58f8c97e0776a", "main_image": "https://static.avforums.com/data/avatars/m/594/594351.jpg?1401737693", "site_type": "discussions", "title": "Question - Bk xxl400 or M plus", "spam_score": 0.0, "site_section": "https://www.avforums.com/forums/subwoofers.127/", "url": "http://omgili.com/ri/.wHSUbtEfZTqAY0p_pThMNXYjTfiRMt4Wa_4D_DSKPKrDerPFzZzKpf8ePCLI.28qIPSoe63_Tu7I_yw9dirEw--", "participants_count": 6, "site_full": "www.avforums.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-17T10:01:00.000+03:00"}, "crawled": "2017-04-18T11:25:27.000+03:00", "url": "http://omgili.com/ri/.wHSUbtEfZTqAY0p_pThMNXYjTfiRMt4Wa_4D_DSKPKrDerPFzZzKpf8ePCLI.28qIPSoe63_TuI6IWuN16cpFHODrXuZ9n9", "highlightText": "", "published": "2017-04-18T10:56:00.000+03:00", "author": "@UEG"}]