[{"rating": null, "external_links": [], "crawled": "2017-04-16T09:14:36.000+03:00", "author": "The Door Industry Journal (noreply@blogger.com)", "entities": {"persons": [{"name": "cavalier", "sentiment": "none"}, {"name": "goodridge", "sentiment": "none"}, {"name": "novas", "sentiment": "none"}, {"name": "griffin", "sentiment": "none"}], "locations": [{"name": "santa pod raceway", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "santa pod", "sentiment": "none"}], "organizations": [{"name": "paypal", "sentiment": "none"}, {"name": "cavaliers", "sentiment": "none"}, {"name": "vauxhall", "sentiment": "none"}, {"name": "door industry journal", "sentiment": "none"}, {"name": "rockingham motor speedway", "sentiment": "none"}, {"name": "chevrolet", "sentiment": "none"}, {"name": "santa pod", "sentiment": "none"}, {"name": "dj pied piper", "sentiment": "none"}, {"name": "northants", "sentiment": "none"}, {"name": "avalon innovations llp company", "sentiment": "none"}]}, "text": "\n\nA special 25th birthday display to celebrate the silver anniversary of the Cavalier Turbo will be one of the big draws at this year’s Performance Vauxhall Show, which takes place at Santa Pod Raceway, Beds, on June 11, 2017. \n\nThe hot Cavalier stood out from the \"repmobile\" crowd with its 204bhp C20LET turbocharged engine, four-wheel-drive and Chevrolet Corvette-derived six-speed gearbox when it made its debut in 1992, but with just 49 left registered on the UK’s roads according to howmanyleft.co.uk , it’s now one of the rarest and most cherished of 1990s performance saloons.\n\n\nAt least 10 of the surviving examples will be on display at the show, from immaculately preserved standard variants to the wildly modified.\n\nThe Cavalier feature will be just one part of the ultimate show for fans of hot Vauxhalls, sponsored by Apex Performance and Goodridge , which regularly attracts over 10,000 visitors to the famous drag strip.\n\nWith on-strip action, including the chance for owners to enter their own Vauxhalls in a VX-only ‘Run What Ya Brung’, Santa Pod will be spilling over with Griffin greats, be them retro Novas, Chevettes, Cavaliers and Astras, or more modern VX220s, Monaros and VXRs.\n\nAs well as the drag strip action, PVS promises a host of other features including an Autotest, entrance photography, a lively retail village for the latest parts, mods and memorabilia, a show and shine, and some of the best and busiest club displays going.  \nThe show itself takes place on the Sunday, but many fans making their annual pilgrimage love to make a weekend of it, so this year PVS is putting on some live evening entertainment, in the form of DJ Pied Piper and MC DT, the sound behind the famous Ayia Nappa hit ‘Do You Really Like it?” \nCamping is available at the show on the Saturday evening, and that’s where the fun really begins. Camping costs £25 per person if booked in advance, with a late night bar and Santa Pod’s funfair in action all evening.\n\nAn early bird offer also applies to show day tickets - £18 (plus booking fee), as opposed to £23 on the gate. To buy tickets, visit www.performancevauxhallshow.co.uk \n\nFor the first time in 2017, there will be a second Performance Vauxhall Show later in the year, which takes place at Rockingham Motor Speedway, Northants, on October 15. A special double discount package is on offer for Vauxhall clubs that want to attend both. \nSocial Media: \nTwitter: https://twitter.com/PV_Show   \nFacebook: https://www.facebook.com/PerformanceVauxhall   \nWebsite:  \nwww.performancevauxhallshow.co.uk   \n\n\n\n\n\n\nScroll down to read more articles like this which have been published recently \n\nWhy not Sign-up to Receive these Articles by Email each Day \nEnter your email address:\n\n\nDelivered by FeedBurner \n\n* Read more current and archived articles on our dedicated website * \nLow Cost and Free Publicity - Your company can easily benefit from some publicity like this in return for a contribution towards our layout costs (£35 to £55 plus VAT), payable via PayPal or credit card   or receive the service absolutely free of charge if you advertise (see below).\n\nWe post articles up to twice a day and never delete them - we only archive them each year so that they continue to remain visible to search engines.\n\nTo have your story published - just send us your news item, logo and image(s) and we will review the material, make any necessary changes to the wording / wordcount and then advise you when it will be published.\n\nIf you take display advertising or product and literature features in our printed and online publications, you will qualify for regular free postings on this blog while you continue to advertise with us.\n\nFor details on features and advertising rates please contact us or visit our website .\n\nDoor Industry Journal is a trading style of Avalon Innovations LLP Company Registration No. 06807833 \nReturn to The Door Industry Journal Website ", "url": "http://omgili.com/ri/_0JOtn.4SConF9mdv12jyJzYQAfDulVWG1HPBfggGIUVOUPfCPBgbQvoiG7TnXbKoQj0.eY1Vmj.QHJucNQu3Uc_XnRq17Gyw_AB8ixt8DWomBmBEfiaSg--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T09:14:36.000+03:00", "language": "english", "title": "Celebrating the Cavalier with Attitude", "thread": {"title_full": "Celebrating the Cavalier with Attitude", "site_full": "blog.doorindustryjournal.co.uk", "site": "doorindustryjournal.co.uk", "site_section": "http://blog.doorindustryjournal.co.uk/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "GB", "section_title": "The Door Industry Journal", "url": "http://omgili.com/ri/_0JOtn.4SConF9mdv12jyJzYQAfDulVWG1HPBfggGIUVOUPfCPBgbQvoiG7TnXbKoQj0.eY1Vmj.QHJucNQu3Uc_XnRq17Gyw_AB8ixt8DWomBmBEfiaSg--", "published": "2017-04-16T09:14:36.000+03:00", "title": "Celebrating the Cavalier with Attitude", "uuid": "8d0bb7190d7e0d853e5d8ccad04d586381123e84", "main_image": null}, "uuid": "8d0bb7190d7e0d853e5d8ccad04d586381123e84", "ord_in_thread": 0}]