[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:16:13.000+03:00", "author": "Bernadette McNulty", "entities": {"persons": [{"name": "gorillaz", "sentiment": "none"}, {"name": "yukimi nagano", "sentiment": "none"}, {"name": "patrik berger", "sentiment": "none"}, {"name": "lewis", "sentiment": "none"}, {"name": "jam", "sentiment": "none"}, {"name": "james ford", "sentiment": "none"}, {"name": "max martin", "sentiment": "none"}, {"name": "alexander o’neal", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}, {"name": "gothenburg", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "stockholm", "sentiment": "none"}, {"name": "nagano", "sentiment": "none"}], "organizations": [{"name": "ritual union", "sentiment": "none"}, {"name": "volvo", "sentiment": "none"}, {"name": "california gurls katy perry", "sentiment": "none"}, {"name": "de la soul", "sentiment": "none"}]}, "text": "T he worst thing a reviewer has said about Little Dragon is that they make the kind of music you hear in Urban Outfitters. The second worst thing is that they were the band that almost made it.\nIt’s true that the Swedish four-piece’s breakthrough album six years ago, Ritual Union , may have been the fashionable synthpop you’d hear while shopping for cut-off denims and retro cushions. It’s also true that the follow-up, 2014’s Nabuma Rubberband , while it was nominated for a Grammy and attracted polite critical applause and decent enough sales, was hardly their moment in the sun. And yet this fifth album, Season High , is so warm and dreamily upbeat that you might need to wear those denim cut-offs just to listen to it.\nThere was always a futuristic shimmer of perfection to Little Dragon’s sound, but in the past it was often dragged back by an undercurrent of unease, a shadowy dissatisfaction in their skittering, nervous rhythms and lead singer Yukimi Nagano’s mournfully soulful voice. Songs like Paris nagged at you like an itch. Shaped by their rainy home town, Gothenburg, Little Dragon seemed to be shade-dwelling plants compared to the assembly line of shiny, durable Volvo pop coming out of Stockholm and the school of Max Martin .\nWhile they haven’t gone the full California Gurls Katy Perry, Season High is the sound of Little Dragon kicking back and enjoying themselves rather than struggling to be seen as serious musicians. After 20 years together, the band have wisely drafted in producers James Ford and Patrik Berger to adjudicate and eliminate their tendency to overthink things in the studio.\nThe sound of unashamed pleasure and escapism is sometimes startling. Nagano has never been afraid to play on the ninja-cartoon image of her Japanese heritage, a persona that proved the perfect fit for collaborations with Gorillaz, De La Soul and SBTRKT. Nonetheless, opener Celebrate and Should I are decked in the cheesiest oriental synth sounds you could find on a vintage Roland TR-808 drum machine, the kind prominently featured in their beloved early 80s Minneapolis sound of Prince and Jam and Lewis .\nFacebook Twitter Pinterest Vinyl Cut: Little Dragon go record shopping with the Guardian\nThe shoulder-padded, flat-top Afro vibe saturates the first half of the album; I almost expected Prince contemporary Alexander O’Neal to pop up, freshly oiled and besuited, on the languid, dope-haze ballad High , rolling another one, as Nagano requests. The beats toughen up with the second half bangers Strobe Light and Push, on an album that lyrically does what it says on the tin. Mind-altering substances aside, it’s the exquisite smoky intimacy of Nagano’s voice that stops the album from becoming a total sugar rush, especially on the childlike romanticism of Butterflies and Gravity.\nThe zeitgeist may have passed them by, but Little Dragon sound like they are having too much fun to care.\nTopics Little Dragon The Observer Electronic music Pop and rock album ", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_njnmhMw67pA208b..J16Jpae5OEiUKxiUKRWhqD6UgbLq.qzPIJOL8j78G_A1kf8hXL_WnwbiLDfbtoVnvmRLfw98T_Pi8S0xT4yqZKmEjeHgFNFokV4VNQ--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:16:13.000+03:00", "language": "english", "title": "Little Dragon: Season High review – an overdue day in pop’s sun", "thread": {"title_full": "Little Dragon: Season High review – an overdue day in pop’s sun", "site_full": "www.theguardian.com", "site": "theguardian.com", "site_section": "http://www.guardian.co.uk/rssfeed/0,,39,00.xml", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": 170, "replies_count": 0, "site_categories": [], "country": "GB", "section_title": "Music | The Guardian", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_njnmhMw67pA208b..J16Jpae5OEiUKxiUKRWhqD6UgbLq.qzPIJOL8j78G_A1kf8hXL_WnwbiLDfbtoVnvmRLfw98T_Pi8S0xT4yqZKmEjeHgFNFokV4VNQ--", "published": "2017-04-16T11:16:13.000+03:00", "title": "Little Dragon: Season High review – an overdue day in pop’s sun", "uuid": "8fe97f0217d4285240ac2260466d2e14fd817d55", "main_image": "https://i.guim.co.uk/img/media/e0d604ef27bef1caf851c08944f1dc4e06779cc0/165_191_3235_1941/master/3235.jpg?w=1200&amp;h=630&amp;q=55&amp;auto=format&amp;usm=12&amp;fit=crop&amp;crop=faces%2Centropy&amp;bm=normal&amp;ba=bottom%2Cleft&amp;blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&amp;s=c048efd960842b60dd85980b48b4a05c"}, "uuid": "8fe97f0217d4285240ac2260466d2e14fd817d55", "ord_in_thread": 0}]