[{"uuid": "a914af60eb034225f271d68046fea64af68d61c9", "url": "http://omgili.com/ri/jHIAmI4hxg9zyAJG5.4.gvyXRjkSForEUlqkwp1Xw.ck2mcdgt8gWAZ9IfgTWIoCmlw9y9Q1qt8VKoRqr21WtqwJayyBWeJLYyHIEc8JqjpcnEfV0bSGVXeRSZFsCpScRqXgQNGZwHqtGPa4e3Ikxw--", "title": "Facebook killer shoots himself during police chase", "author": "", "rating": null, "published": "2017-04-18T23:24:25.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "facebook", "sentiment": "none"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "psp", "sentiment": "none"}, {"name": "pa state police", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}], "locations": [{"name": "fairmount", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "erie county", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "persons": [{"name": "mike householder/ap", "sentiment": "none"}, {"name": "steve stephens", "sentiment": "none"}, {"name": "godwin", "sentiment": "none"}, {"name": "debbie godwin", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "matt rourke/ap", "sentiment": "none"}, {"name": "stephens", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}, {"name": "robert godwin sr", "sentiment": "none"}, {"name": "mr godwin", "sentiment": "none"}, {"name": "calvin williams", "sentiment": "none"}, {"name": "robert godwin", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "a914af60eb034225f271d68046fea64af68d61c9", "url": "http://omgili.com/ri/jHIAmI4hxg9zyAJG5.4.gvyXRjkSForEUlqkwp1Xw.ck2mcdgt8gWAZ9IfgTWIoCmlw9y9Q1qt8VKoRqr21WtqwJayyBWeJLYyHIEc8JqjpcnEfV0bSGVXeRSZFsCpScRqXgQNGZwHqtGPa4e3Ikxw--", "site_full": "www.falmouthpacket.co.uk", "title": "Facebook killer shoots himself during police chase", "site_section": "http://falmouthpacket.co.uk//uk_national_news/rss/", "domain_rank": null, "published": "2017-04-18T23:24:25.000+03:00", "title_full": "Facebook killer shoots himself during police chase", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "Falmouth Packet | National News", "site_type": "blogs", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "GB", "performance_score": 0, "main_image": "http://www.falmouthpacket.co.uk/resources/images/6246166/", "site": "falmouthpacket.co.uk"}, "external_links": [], "language": "english", "text": "Have you got a local story, picture or video you would like to send to us? Send it to us now for a chance to get published. Services Facebook killer shoots himself during police chase Facebook killer shoots himself during police chase \nA man who randomly killed a 74-year-old in Ohio and posted video of the crime on Facebook has fatally shot himself in his car during a police chase in Pennsylvania. \nSteve Stephens’s death ended a multi-state manhunt less than 48 hours after it began. \nActing on a tip, Pennsylvania state police spotted Stephens, 37, leaving a McDonald’s in Erie and went after him, bumping his car to try to get it to stop, authorities said. \nSteve Stephens (Cleveland Police via AP) \nHe shot himself in the head as the car spun out of control, police said. \n“This started with one tragedy and ended with another person taking their own life,” said Cleveland police chief Calvin Williams. \n“We would have liked to have brought Steve in peacefully and really talked to him about why this happened.” Steve Stephens was spotted this morning by PSP members in Erie County. After a brief pursuit, Stephens shot and killed himself. \n— PA State Police (@PAStatePolice) April 18, 2017 \nStephens, a job counsellor who worked with teenagers and young people, was wanted on murder charges over the shooting of Robert Godwin Sr. \nThe 74-year-old former foundry worker and father of 10 was picking up aluminium cans on Sunday when he was gunned down in Cleveland. \nThe chilling video was posted on Facebook for three hours before it was taken down, drawing criticism of the social network and renewing questions about how responsibly it polices objectionable material. \nAt a Silicon Valley conference on Tuesday, Facebook chief executive Mark Zuckerberg briefly addressed the Cleveland case, saying Facebook has “a lot of work to do” and “we will keep doing all we can to prevent tragedies like this”. \nA makeshift memorial sits along a fence near where Robert Godwin Sr was killed in Cleveland (Mike Householder/AP) \nPolice would not speculate on what was behind the killing, but in the video and other footage he posted, Stephens talked about losing everything he had to gambling and having trouble with his girlfriend. He said he “just snapped”. \nOne of Mr Godwin’s daughters, Debbie Godwin, said she wished Stephens had been captured. \n“I’m not happy he’s dead at all, not at all. If you did it, you have to face your crime,” she said. \nAn armour police vehicle drives through Fairmount park in Philadelphia as the manhunt widened (Matt Rourke/AP) \nThe break in the case came when police received a tip that Stephens’s car was in the McDonald’s car park in Erie, in the north-western corner of the state, about 100 miles east of Cleveland, authorities said. \nThe chase lasted two miles before Stephens took his own life, police said. \nFacebook said it removed the video of the shooting 23 minutes after learning of it. \nThe company has since announced it is launching a review for reporting harmful content. \n“This is something that should not have been shared around the world. Period,” Cleveland’s police chief said. \nRobert Godwin Sr (Facebook/AP) Godwin did not seem to recognise the name. \nIn the video, Stephens told Mr Godwin the name of his girlfriend and said: “She’s the reason that this is about to happen to you.” \nMr Godwin did not seem to recognise the name. \nInvestigators said that Mr Godwin was the only victim so far linked to Stephens, despite his claim on Facebook that he killed more than a dozen people.", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:25.000+03:00"}]