[{"rating": null, "external_links": [], "crawled": "2017-04-16T08:34:10.000+03:00", "author": "Eleanor Morgan", "entities": {"persons": [{"name": "hansen", "sentiment": "none"}, {"name": "neil rankin", "sentiment": "none"}, {"name": "lyle", "sentiment": "none"}, {"name": "darren wong", "sentiment": "none"}, {"name": "rankin", "sentiment": "none"}, {"name": "pål hansen", "sentiment": "none"}, {"name": "james lowe", "sentiment": "none"}, {"name": "bao", "sentiment": "none"}, {"name": "damascene", "sentiment": "none"}, {"name": "lowe", "sentiment": "none"}, {"name": "eleanor morgan", "sentiment": "none"}, {"name": "fah sundravorakul", "sentiment": "none"}, {"name": "john rowland", "sentiment": "none"}], "locations": [{"name": "bangkok", "sentiment": "none"}, {"name": "yamagoya", "sentiment": "none"}, {"name": "soho", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}, {"name": "far east", "sentiment": "none"}, {"name": "smorgasburg", "sentiment": "none"}], "organizations": [{"name": "instagram", "sentiment": "none"}, {"name": "observer  sundravorakul", "sentiment": "none"}, {"name": "borough market", "sentiment": "none"}]}, "text": "O n the website for Temper , chef Neil Rankin’s loud and smoky barbecue restaurant in Soho, are lots of hashtags and emojis: “#moneyshot” and “#banging” caption a picture of their glistening Sunday roast beef, along with the heart-eyes emoji. “Wood, smoke, fire, meat. We got it all,” they purr. “#hotstuff #werereadyforyou.”\nReady to both give you Damascene moments with charred meats and for you to hashtag your experience and induce other people to go there. And what’s wrong with that?\nWe use Instagram now to plan where we’re going to eat next and what we’re going to eat when we get there. There’s still cynicism about this, but it’s marketing gold dust. With such a shift in how we navigate our appetites, you wonder: would any chef admit to creating food specifically for Instagram?\nRankin wouldn’t. “Instagram is a great way of publicising your business, but I’ve never intentionally made food for it. Most of my food is pretty basic in terms of presentation. You’re probably doing something wrong if you’re relying on Instagram to fill your restaurant.” He’d prefer to attract attention with the “quality” of his flavours rather than the photogenic appeal of “some tarted up iconic dish that fails to deliver”.\nSunday roast with a smokey twist. Fantastic British meat, great drinks and service again @temperlondon #sundayroast #britishbeef #yorkshirepudding\nA post shared by John Rowland (@rowland.jw) on Apr 2, 2017 at 6:59am PDT\nJames Lowe, head chef and owner of Lyle’s in east London – a restaurant known for its simple, elegant presentation – offers equally unminced words. “Do I create dishes specifically for Instagram? No. Am I aware of what people tend to ’gram? Yes. Do we use that knowledge to create something more ’grammable? No. I know places that have a great feed, but the food is rubbish. I call it ‘cooking for pictures’.”\nLowe stresses “the most important thing for any dish is how it tastes”, but in some cultures looks are incredibly important. Across the Far East, even the presentation of street food can be a high priority. The photogenic nature of something like bao – steamed buns found in many Chinese cuisines – is incidental. However, when the Taiwanese street-food outfit Bao found a bricks and mortar home in 2015, a permanent queue formed once people started ’gramming one dish: the fried chicken gua bao. Queues remain because people return for more.\nLooks and taste colliding in this way was a happy accident for Bao’s owners, and other small businesses who have found Instagram success with one iconic product. The novelty factor could wear off quickly if the pleasure of eating doesn’t match the pleasure of looking. But sometimes Instagram fame is unpredictable. Sometimes the pleasure comes not from the beauty of a perfectly precise colour palette, but instead in seeing something so squidgy and bulbous it makes you laugh, like the doughnuts from Bread Ahead , a bakery stall in London’s Borough Market, which are now both the business’s main selling point and something for which people pilgrimage from afar, all due to Instagram.\n'Do-Nut' say NO to that.\nA post shared by MAO🥀 (@teemaomao) on Jan 9, 2017 at 5:42am PST\nWhat if you’re a food business and don’t want to wait for your happy accident, though? Can you get ’gram notoriety with a dish that prioritises beauty over taste?\nIt appears so. Last year, New Yorkers started ’gramming a see-through dessert that looked like a breast implant. The “raindrop cake”, created by Darren Wong and sold at the Smorgasburg food market in Brooklyn , prompted headlines such as “This Dessert Looks Just Like a Blob of Water and I Can’t Look Away”, but “tasteless” was a common review. At $8 (£6.90) it seemed, in more ways than one, a bit of a transparent gimmick. And now it’s coming to the UK.\nBangkok restaurateur Fah Sundravorakul is putting it on the menu at the London ramen pop-up Yamagoya next month. I was invited to try one. God, but it looks stunning – like some sort of deep sea creature; gently trembling beside crushed peanut powder and brown-sugar syrup. Piercing it feels monstrous. Taste wise, it’s… well, it’s sweet, cold gloop that liquefies in the warmth of your mouth – quite exciting, but only the subtlest of flavours come from the powder and syrup. It’s too weird to be a gustatory joy, but I immediately take a picture and wonder when I’ll be able to post it. Is this the point?\nFacebook Twitter Pinterest Jelly beautiful: the ‘raindrop cake’. Photograph: Pål Hansen for the Observer\nSundravorakul prefers to give some context on the dish first. “It’s not from Brooklyn,” he says. “It has been very popular in Japan for a few years.” The “cake” is a mizu shingen mochi , or water mochi – a jelly-like dish made from water sourced in the southern Japanese Alps, which Sundravorakul has shipped over. The Japanese “enjoy the cool texture” and the “challenge to your senses”. That it loses its agar-set form after 30 minutes makes it an ephemeral experience – much like Instagram. Sundravorakul won’t directly admit he’s bringing the dish here for ’gram potential, but will say: “We are aware of how powerful social media is.” We stare at the cake, now melting, for some time.\nLowe believes that creating a dish specifically for Instagram is “dishonest”. It’s hard to disagree. If you’re paying for something that looks magical but tastes like a trick, something is wrong. Or is it? Critics wonder what’s being lost as food becomes social currency for the digital age, but if it’s a luxury people can still afford, can we really make critical judgments about the ways in which it provides them with fleeting pleasures? Now, if you’ll excuse me, I need to choose which filter to use: Lark or Lo-Fi.\nTopics Food & drink The Observer Instagram Chefs Restaurants features ", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nxRVSxDLeMLrhzhN2Ks1oMV2gpY2N2dZPrxrsRduZ9ATy9afHCn.tDVXWSadiBtqURIt6NiRGyMJN_RXZ.xaTs.ZQiOaBtXxj", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T08:34:10.000+03:00", "language": "english", "title": "Food that looks good enough to… Instagram", "thread": {"title_full": "Food that looks good enough to… Instagram", "site_full": "www.theguardian.com", "site": "theguardian.com", "site_section": "http://www.guardian.co.uk/rssfeed/0,,13,00.xml", "performance_score": 2, "social": {"gplus": {"shares": 3}, "pinterest": {"shares": 1}, "facebook": {"likes": 200, "shares": 200, "comments": 0}, "linkedin": {"shares": 11}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": 170, "replies_count": 0, "site_categories": [], "country": "GB", "section_title": "The Guardian", "url": "http://omgili.com/ri/.wHSUbtEfZSJlbPFf2vcZQ7DQwnenE_nxRVSxDLeMLrhzhN2Ks1oMV2gpY2N2dZPrxrsRduZ9ATy9afHCn.tDVXWSadiBtqURIt6NiRGyMJN_RXZ.xaTs.ZQiOaBtXxj", "published": "2017-04-16T08:34:10.000+03:00", "title": "Food that looks good enough to… Instagram", "uuid": "b77df9dcaab9b29ce6215b3a1f8e72508d5fcf67", "main_image": "https://i.guim.co.uk/img/media/f705509b78eff090e0abfd7ea37ee6b9523cf615/0_711_7680_4610/master/7680.jpg?w=1200&amp;h=630&amp;q=55&amp;auto=format&amp;usm=12&amp;fit=crop&amp;crop=faces%2Centropy&amp;bm=normal&amp;ba=bottom%2Cleft&amp;blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&amp;s=a6fe38a45b34b8fcf0a837c40db1c315"}, "uuid": "b77df9dcaab9b29ce6215b3a1f8e72508d5fcf67", "ord_in_thread": 0}]