[{"thread": {"domain_rank": 1796, "replies_count": 0, "url": "http://omgili.com/ri/jHIAmI4hxg9tg3EPzeyP.7Q90lS9K7avr3.60qhp3w.uLKNK488dNTTxBk24q.nfJBXv0ex5G.9UCcmvwh5ylS45.x66_ttuhhUtpbkvpQ35MIn8QE5IrNKK_Gc27q.C", "title": "Bentley Bentayga diesel review -Is it the ultimate luxury SUV?", "site_type": "news", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"comments": 0, "shares": 8, "likes": 8}}, "site_section": "http://express.co.uk//posts/rss/24/cars", "spam_score": 0.0, "section_title": "Daily Express :: Cars Feed", "site": "express.co.uk", "site_full": "www.express.co.uk", "performance_score": 0, "uuid": "b8497bc838ef3b28e30d224418e81e55b4d1226f", "published": "2017-04-17T11:27:01.000+03:00", "site_categories": [], "country": "GB", "title_full": "Bentley Bentayga diesel review -Is it the ultimate luxury SUV?", "participants_count": 0, "main_image": "http://cdn.images.express.co.uk/img/dynamic/24/750x445/792776.jpg"}, "url": "http://omgili.com/ri/jHIAmI4hxg9tg3EPzeyP.7Q90lS9K7avr3.60qhp3w.uLKNK488dNTTxBk24q.nfJBXv0ex5G.9UCcmvwh5ylS45.x66_ttuhhUtpbkvpQ35MIn8QE5IrNKK_Gc27q.C", "title": "Bentley Bentayga diesel review -Is it the ultimate luxury SUV?", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:27:01.000+03:00", "language": "english", "entities": {"locations": [{"name": "crewe", "sentiment": "none"}, {"name": "breitling tourbillon", "sentiment": "none"}], "persons": [{"name": "bentley bentayga", "sentiment": "negative"}, {"name": "bentaygas", "sentiment": "none"}, {"name": "bentayga", "sentiment": "none"}, {"name": "bentley", "sentiment": "none"}], "organizations": []}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "b8497bc838ef3b28e30d224418e81e55b4d1226f", "published": "2017-04-17T11:27:01.000+03:00", "author": "", "text": "1 of 19 Bentley Bentayga 2017 \nYes it’s fast, fearsomely so on occasion especially mid-range, but the SQ7 can often feel too keen to leap up the road like an eager puppy constantly pulling at a lead. Thankfully, though, Bentley has been able to develop the engine individually for more refi nement to remove those issues, something that’s immediately obvious. \nDon’t get us wrong, this is still a very rapid car when you flex your right ankle, but at the same time, that overeagerness has been dialled out from the engine, instead just offering a solid and constant surge of power rather than anything too peaky and urgent. \nThe result is progress that feels far more refined and far more, well, Bentley-like. Crucially too, while there’s a little diesel rattle when standing alongside the car outside, once you’re ensconced inside, there’s no hint of what’s under the bonnet and any passengers would certainly be none the wiser. \nThere’s a lot to like about this diesel Bentayga. Yes the ride can be a little fidgety at times, but that’s to be expected for a car of this weight running on 21in wheels and tyres. \nHowever, the biggest compliment you can probably pay it is that it feels no different to the petrol model. Despite its size and dimensions, it feels like it shrinks around you when driving with enthusiasm, with plenty of grip and confidence to be had. Fair enough, very few owners are likely to drive their Bentaygas anywhere near its limitations (either on or off-road). \nBut the reality is that it’s far more capable than many will ever imagine and it retains a noticeable degree of sportiness. In conjunction with the arrival of this diesel is also the option for a pair of small extra seats in the boot, although they will only ever be suitable for children. \nYet Bentley still expects about 15 per cent of buyers to tick that box on both this diesel and the petrol. And then there’s also the unmistakable gorgeousness of the rest of the Bentley’s interior. \nIt may not look or feel the most high-tech on the market, but the wood, leather and handcrafted detailing is exquisite. It is also quite satisfying that even tiny details such as the contrast colour stitching around the rim of the steering wheel has been finished by hand rather than a clever robot. PH The Bentayga diesel will cost drivers £135,800 \nSome things are still best done the old-fashioned way and the expertise in every element is clear. Of course, that doesn’t come cheap. Despite a saving of £25,000 over the petrol-engined version, our particular Bentayga test car boasted an eye-watering £61,400 of options. \nEven that hand-stitching around the steering wheel we mentioned will set you back a further £165. On the first Bentaygas produced last year, Bentley estimated that the average spend on options would be between £50,000-£70,000 and that shows no signs of abating with this diesel either. \nEven the ultimate optional extra, the hand-made Breitling Tourbillon clock in the dashboard costing £150,000 is restricted by how many Breitling can build, rather than by how many people want them. \nThat this new diesel version of the Bentayga will increase the car’s popularity worldwide is not in doubt. And whatever your current views on diesel cars, the fact is that for the Bentayga, the future of Bentley and all of those 4,000 workers in Crewe, that’s only good news. \nPH The engine under the bonnet produces a 0 to 60mph time of 4.6 seconds and 168mph top speed LOGBOOK LOWDOWN "}]