[{"entities": {"locations": [{"name": "eu", "sentiment": "none"}, {"name": "heathrow", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "bsria", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "wsp | parsons brinckerhoff", "sentiment": "none"}], "persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "mark naysmith", "sentiment": "none"}, {"name": "mark farmer", "sentiment": "none"}, {"name": "lewis johnston", "sentiment": "none"}, {"name": "julia evans", "sentiment": "none"}]}, "ord_in_thread": 0, "thread": {"site_full": "www.netmagmedia.co.uk", "site_section": "http://www.netmagmedia.co.uk/feed", "domain_rank": null, "replies_count": 0, "country": "GB", "section_title": "netMAGmedia Ltd", "title": "Industry reacts to Election announcement", "title_full": "Industry reacts to Election announcement", "published": "2017-04-18T21:46:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg.uMj_Qa.Vf.R4myIJSuYjIuiQzIW_ikUvTku3kgOghprWgfArbgs8n4aRi1830wqf2waESMpzDatpltg33DSc5e_GQr7i_qSI-", "site": "netmagmedia.co.uk", "main_image": "", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.0, "uuid": "cc3f65904aecb5c5cd303430c99a13d59e53e54d", "site_type": "news"}, "title": "Industry reacts to Election announcement", "published": "2017-04-18T21:46:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg.uMj_Qa.Vf.R4myIJSuYjIuiQzIW_ikUvTku3kgOghprWgfArbgs8n4aRi1830wqf2waESMpzDatpltg33DSc5e_GQr7i_qSI-", "author": "Roseanne Field", "crawled": "2017-04-19T08:38:38.000+03:00", "language": "english", "text": "Tuesday, 18th April 2017 Industry reacts to Election announcement \nConstruction industry bodies have reacted to the news that Theresa May plans to call a general election on 8 June. Mark Farmer, author of the government-commissioned Farmer Review of the UK’s skills shortage and CEO of Cast Consultancy, said: \n“Whatever the outcome of this Election, the construction skills gap will remain as will the impact of Brexit. In the campaign to come, I hope to see some serious solutions on offer as part of the main parties’ manifestos that adequately reflect the importance of the construction industry’s welfare and future modernisation as part of its contribution to UK plc. We need to also preferably see a reasonable level of cross party consensus on a coherent and comprehensive skills and innovation agenda that is not interrupted by endless political turmoil!” Lewis Johnston, RICS Parliamentary Affairs Manager, said: \n“The motivation for calling an Election is clear. With a working majority of just 17, the Government’s freedom of action is restrained and understandably the Prime Minister wants a stronger mandate as she embarks on the EU Exit Negotiations. The real question is how the economy will react to yet another political rollercoaster ride. Since the EU referendum last summer, our market surveys across the residential, commercial and construction sectors show we have largely moved on from initial negative reactions but uncertainty continues to cloud the outlook and weigh on market sentiment. Today’s decision does very little to change that prognosis in the near term, and if anything we are likely to see continuing deferral of major investment and hiring plans. \n“Whilst Theresa May’s stated intention this morning was to provide greater clarity and stability by calling a General Election, in the immediate term the move inevitably puts a question mark over policy and creates further uncertainty across the built environment. It is now the responsibility of all parties to set out clear policy proposals across land, property, construction and infrastructure to ensure the UK can deliver the homes, infrastructure, factories, offices and major building projects it needs to thrive.” Mark Naysmith, UK CEO at WSP | Parsons Brinckerhoff, said: \n“Recent uncertainty has knocked confidence, particularly in the private sector where investment has stalled and project start-ups delayed. So a new government with a clear mandate should hopefully create a more stable environment that reinvigorates confidence. \n“With momentum building behind high speed rail, Heathrow, highways and other infrastructure investments, a snap Election presents the opportunity for the next government to build a strong mandate for speeding up the delivery of these vital long term projects. We would like to see firm manifesto commitments to these schemes, as well as a determined, clear pledge for producing more of the construction and STEM skills we need for delivery. \n“In the context of Brexit and the nascent Industrial Strategy, any future government needs to take a joined-up approach so that we can talk about the link between infrastructure investment and economic growth at a higher level. Whilst infrastructure delivery is supported by all main political parties in some form, 80% of the construction industry believes that the public doesn’t understand the role it plays in enabling growth. We’ll therefore be looking for parties to explain at a national and regional level why pro-infrastructure policies are good for UK plc, for productivity and for local housing, services and jobs.” Julia Evans, BSRIA Chief Executive, said: \n“BSRIA welcomes today’s announcement that there will be a snap General Election. \n“The specific benefits for the construction industry remain to be seen, but it will allow the most wonderful platform for the Prime Minister to lay out her strategy to the electorate. It will be a strategy that will not be debated in parliament – as it properly should be – but it will be played out at the political hustings in the coming seven weeks. \n“There has been much chaos and mixed-messages surrounding Brexit since June last year so we trust this announcement will bring much-needed clarity and order in the Brexit debate and beyond. \n“Before all the detailed talks begin with the EU and Government sets out its vision and objections for Brexit legislation, such a General Election will demonstrate determination ‘to get the job done’. A stronger negotiating position will win the best deal on Brexit. \n“Industry needs strong leadership to avoid a disruptive cliff-edge. Indeed, as we move forward, we must not lose sight of the fact that it is crucial that the construction industry’s voice is heard in the Brexit deliberations. What is evident is that the ‘construction industry is open for business’. \n“Whoever forms the next Government needs to build a robust partnership between industry and Government that looks to future.”", "external_links": [], "highlightTitle": "", "uuid": "cc3f65904aecb5c5cd303430c99a13d59e53e54d", "highlightText": "", "rating": null}]