[{"entities": {"persons": [{"sentiment": "none", "name": "jr."}, {"sentiment": "none", "name": "meera joshi"}, {"sentiment": "none", "name": "travis kalanick"}, {"sentiment": "none", "name": "jim conigliaro"}, {"sentiment": "none", "name": "lyft"}], "organizations": [{"sentiment": "none", "name": "machinists union"}, {"sentiment": "none", "name": "new york times"}, {"sentiment": "none", "name": "nyt"}, {"sentiment": "none", "name": "independent drivers guild"}, {"sentiment": "none", "name": "limousine commission"}, {"sentiment": "none", "name": "reuters  idg"}, {"sentiment": "none", "name": "tlc"}, {"sentiment": "none", "name": "idg"}, {"sentiment": "none", "name": "federal trade commission"}], "locations": [{"sentiment": "none", "name": "new york city"}, {"sentiment": "none", "name": "new york"}, {"sentiment": "none", "name": "america"}, {"sentiment": "none", "name": "us"}]}, "text": "New York City may force Uber to add driver tipping option to its app Unlike New York City's taxis and rival service Lyft, Uber does not offer tipping via credit cards. Close What does the Uber tribunal ruling mean for the gig economy? Wochit \nRegulators in New York City are pursuing a rule that would require ride-hailing services such as Uber to offer an in-app tipping option. On Monday (17 April), New York's Taxi and Limousine Commission (TLC) announced a proposal which would require car services that accept only credit cards to allow passengers to tip the driver using their card, the New York Times first reported. \nUnlike New York City's taxis and rival service Lyft, Uber does not offer tipping via credit cards. As per Uber's current policies, tipping is not included in the tip fare and is not \"expected or required.\" \n\"This rule proposal will be an important first step to improve earning potential in the for-hire vehicle industry, but it is just one piece of a more comprehensive effort to improve the economic well-being of drivers,\" New York City's taxi commissioner Meera Joshi said in a statement to NYT. \nThe TLC's move stems from a petition from the Independent Drivers Guild, a union-backed association that advocates for over 45,000 for-hire vehicle drivers in New York. \n\"Uber has been stubbornly unwilling to give our riders an easy option to tip,\" the petition reads. \"As a result, New York's working drivers are losing thousands of dollars we need for vehicle upkeep and supporting our families in one of the most expensive cities in America.\" \nThe petition, which has garnered over 11,000 signatures so far, argued that Uber makes the issue worse by telling riders that \"tips are not expected.\" \nUber said it looks forward to reviewing the tipping proposal. \n\"Uber is always striving to offer the best earning opportunity for drivers and we are constantly working to improve the driver experience,\" Uber said in a statement to multiple media outlets. \"That's why, in New York City, we partnered with the Machinists Union to make sure current and future Uber NYC drivers have a stronger voice and launched a series of new tools and support policies for drivers.\" \nThe proposal is expected to be formally introduced by July followed by a public hearing. New York City officials are moving to require Uber to offer an in-app tipping option. Reuters \nIDG estimates that the rule, if passed, could mean an additional $300m (£238m) per year for ride-hail drivers in the city. \n\"The exploitation of ride-hail drivers must end and this is an important first step,\" IDG founder Jim Conigliaro, Jr. said in a statement. \"Drivers have long been denied access to the kinds of benefits and labor protections many workers take for granted, such as paid sick leave or the minimum wage. \n\"As a result, New York City's professional drivers have traditionally depended on gratuities for a substantial portion of their income. Cuts to driver pay across the ride-hail industry has made tipping income more important than ever.\" \nThe Guild first raised the issue to Uber in June last year after a survey of its membership cited tipping as a key issue. After Uber resisted, IDG launched a tipping campaign including an online petition and social media ads. \nLast month, Lyft said its drivers across the US earned over $200m (£159.08m) in tips since the feature was first introduced in 2012. \nIn January, Uber agreed to pay $20m to settle allegations from the Federal Trade Commission that it misled drivers about potential earnings and vehicle financing. \nUber has been hit with a series of damaging scandals since the beginning of the year including sexual harassment allegations, a lawsuit from Alphabet's Waymo and an embarrassing video that showed CEO Travis Kalanick berating an Uber driver over falling fares. \nLast month, top Uber executives pledged to improve relations with drivers whilst working to clean up its image and get the firm back on track. More Technology news: ", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "cc637483d5344580ca9a19845145dd48916d0cfa", "rating": null, "highlightTitle": "", "title": "New York City may force Uber to add driver tipping option to its app", "thread": {"country": "GB", "site": "ibtimes.co.uk", "replies_count": 0, "title_full": "New York City may force Uber to add driver tipping option to its app", "site_categories": [], "performance_score": 0, "section_title": "IBTimes.co.uk : Top News", "domain_rank": 1778, "uuid": "cc637483d5344580ca9a19845145dd48916d0cfa", "main_image": "http://d.ibtimes.co.uk/en/full/1605492/uber-app-based-taxi-company.jpg", "site_type": "blogs", "title": "New York City may force Uber to add driver tipping option to its app", "spam_score": 0.0, "site_section": "http://www.ibtimes.co.uk/rss/feed", "url": "http://omgili.com/ri/jHIAmI4hxg_PiFE8RGgjV0Q5HJVwhzQX.KxoAx3DBfJnoQGG8dWaO1ZGG4Jm6Z6HTI9.VeA6DEZeTgHz.WuvCc7adWBN0Xdh28Hcdp4YOZpFhJfoJbrTZA1dGm_qe08f", "participants_count": 0, "site_full": "www.ibtimes.co.uk", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 1, "comments": 0, "shares": 1}, "gplus": {"shares": 2}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:26:49.000+03:00"}, "crawled": "2017-04-18T11:26:49.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_PiFE8RGgjV0Q5HJVwhzQX.KxoAx3DBfJnoQGG8dWaO1ZGG4Jm6Z6HTI9.VeA6DEZeTgHz.WuvCc7adWBN0Xdh28Hcdp4YOZpFhJfoJbrTZA1dGm_qe08f", "highlightText": "", "published": "2017-04-18T11:26:49.000+03:00", "author": ""}]