[{"entities": {"locations": [], "organizations": [], "persons": []}, "ord_in_thread": 0, "thread": {"site_full": "www.detailingworld.co.uk", "site_section": "http://www.detailingworld.co.uk/forum/forumdisplay.php?f=138", "domain_rank": 77279, "replies_count": 0, "country": "GB", "section_title": "Manufacturers and Private Label Brands - Detailing World", "title": "Detailingworld\u0099 Review \u0096 Cartec Sample Kit", "title_full": "Detailingworld\u0099 Review \u0096 Cartec Sample Kit - Detailing World", "published": "2017-04-19T01:46:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8gtrG_INPyGttYsP.yCSf1XHVXhYXefTokEoI9Fo92Mo74gtRfwbPGADFirPKpFNdO6h2iqp4gMQ--", "site": "detailingworld.co.uk", "main_image": "", "site_categories": [], "social": {"gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "comments": 0, "likes": 0}, "pinterest": {"shares": 0}}, "participants_count": 1, "performance_score": 0, "spam_score": 0.5, "uuid": "f5ddc84585237500220d15ec1229a2dafd117b1c", "site_type": "discussions"}, "title": "Detailingworld\u0099 Review \u0096 Cartec Sample Kit", "published": "2017-04-19T01:46:00.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8gtrG_INPyGttYsP.yCSf1XHVXhYXefTokEoI9Fo92Mo74gtRfwbPGADFirPKpFNdO6h2iqp4gMQ--", "author": "Hereisphilly", "crawled": "2017-04-19T08:39:14.000+03:00", "language": "english", "text": "Detailingworld\u0099 Review \u0096 Cartec Sample Kit\nIntroduction\nBig thanks to Dan for sending this massive sample kit through for review, apologies if this has been long in the pipeline\nFor those of you who don't know about Cartec (myself included), this is what Dan had to say\nCartec was started by Johan in his garage in The Netherlands. He first made Perfect Polish (which isn't in the kit unfortunately) and from there has been growing astronomically up to today, where it's exported to over 50 countries worldwide. They now have their own labs and testing facilities alongside the production facility where all the products are rigorously tested.\nCartec UK are the U.K. importers of Cartec products, we've been at the helm for three years. It was previously imported into the U.K. but the old importer sadly passed away around 5 years ago. Since taking over, me and my colleague James have been working out of our warehouse and offices near Colchester, Essex to build the brand in the industry, and as of 2017 introduce Cartec to the retail market as the products are incredible.\nTheir website can be found at https://www.cartecretail.co.uk/ along with the complete range\nThe Products\nAll the samples were provided in 200ml clear little bottles, with the correct lids / triggers for the products that needed them. The branding is clear and all the instructions are printed on the bottles so no problem in knowing exactly how to use each one\nThe Manufacturer says:\nThis awesome kit contains a 200ml sample of some of our most popular products, allowing you to have a play and get a feel of our range without having to commit to bigger sizes!\nThe kit includes:\nIron Wash 200ml\nWheel Cleaner Acid Free 200ml\nSplash Shampoo 200ml\nGlass Cleaner 200ml\nGold Wax 200ml\nTyre Care 200ml\nDash Fresh 200ml\nMotor Fresh 200ml\nTar & Glue Remover 200ml\nFast Glaze 200ml\nThe Method\nThis is going to be a bit of a long one, as there is alot to cover, so bear with me\nI was fortunate to have enough time to use all the products in one go, so this will a review of the sample kit and the individual products within, all rolled into one long mini detail\nWheel Cleaner\nWhile it might not have a fancy name, Wheel Cleaner Acid Free is a highly concentrated and effective wheel cleaner that strips brake dust, road grime and dirt build up from all types of wheels quickly and safely.\nBMW approved in the UK, we're confident in saying that Wheel Cleaner Ac﻿id Free is one of, if not the best acid free wheel cleaners on the planet.\nDilutable up to 1:10 (product:water) depending on how dirty your wheels are, Wheel Cleaner Acid Free is the quick, easy and safe way to get your wheels looking like new.\nNow my wheels weren't bad by any means so this was one of the products I couldn't test to its full potential, but it made light work of the small amount of brake dust that was present. It didn't have a bad smell and seemed to make quick work at the dilution present in the bottle\nA couple of before and after shots, not much else to see but it did a good job\nSplash Shampoo\nNice sweet smelling thin liquid in the bottle\nNow on the back it said the dilution ration was 1:100. As I live in a very hard water area and always wash with 20l of water, that mean the whole bottle got used for this one wash!\nSplash Shampoo is a highly concentrated shampoo with a extremely high wax content, designed to leave a great layer of protection and a brilliant shine after every wash.\nWhether you're using Splash Shampoo with a wash mitt and bucket, or applying using a Snow Foam Lance, it cleans, waxes and protects your vehicle in one easy application, leaving behind an extreme water beading finish that repels water to stop those annoying water marks!\nThe shampoo foamed up really well and made masses of suds in the bucket\nWith pretty good transfer to the panel as well\nNice and slick underneath the wash pad, so overall a very enjoyable experience\nRinsed off and the water behaviour was different that what would normally see from my current LSP\nFor me the beading was definitely reduced as if the wax left behind by the shampoo is worse than my LSP, but then this is to be expected and something I normally experience with wax fortified shampoos. This would be better than nothing for unprotected cars in a valet environment, or something used as a maintenance wash in the depths of winter\nIron Wash\nNext up the fallout remover, which smells like pretty much all fallout removers i.e not great, but comes with the nature of what they do\nI found the thumb trigger a bit of pain when using this due to the sheer number of actions on the trigger, but this is the nature when dealing with small sample bottles.\nIron Wash is a pH Neutral Fallout Remover and Wheel Cleaner.\nDeveloped to be extremely fast, while still being super safe, Iron Wash can be used on bodywork, wheels, glass and plastic to remove any metal particles or contaminants quickly and efficiently.\npH Neutral formulation, making it safe for all surfaces.\nClings to the surface to ensure all contaminants are removed, doesn't run straight off like other products.\nExcellent cleaning power, cleans quickly and efficiently.\nThe liquid although thin, foamed up a surprising amount from the trigger and this made it dwell extremely long on the paintwork, which in my eyes increases the work time of the fallout remover\nApplied to wheels too and then agitated to foam up, which created some pretty awesome suds, clinging the product for ages to the wheel\nYou can see the product working in both the above picture and after rinsing off\nTested with my go-to fallout remover after and no bleeding happened, which confirms this works well. I ended up using the whole 200ml with some serious hand ache after, but managed to cover all wheels and half the bodywork\nTar & Glue Remover\nNot much to say about this one other than it looks and smells like nearly all tar removers, clear and horrible!\nCartec's Tar & Glue Remover is a super strength formula that melts tar and glue without any agitation!\nSimply spray onto affected area and watch the contaminants melt away, then wipe any excess off a clean microfibre towel.\nThis was one of the products I feel could have benefited by being supplied with a trigger head, but I suspect this might have been omitted due to tar remover having a tendency to rot the seals\nAs only a flip top was provided, I opted to squirt a bit onto an MF towel and locally dab the identified tar. Again not much to say other than it works!\nFast Glaze\nDespite the name, this product isnt a glaze but in a fact a QD / spray wax. The instructions on the label didn't give much away, but the website description is more forthcoming\nCartec Fast Glaze is a quick detail spray wax, designed for quickly and easily removing fresh contaminants and dirt safely by creating a barrier of protection between them and the painted surface.\nPerfect for track days, road trips, or after some temperamental weather, Fast Glaze is the quick and easy way to make your car look like it has just been detailed when you're running low on time and need your car looking its best!\nUsing as a spray sealant and not as a glaze, I lightly spritzed onto a panel and proceeded to spread / buff with one cloth, and then removed with another\nQDs are notoriously difficult to photo, so not much to see here, but no issues to report. It spreads easily, no grabbing, and then also removes easily with next to no smearing or hazing when done\nGold wax\nSupplied with a flip top lid, this milky liquid had a very slight suspension in it, so needed a bit of a shake before use\nGold Wax is a liquid hard wax, designed to be used on new paint work or after paint rectification.\nIt's special formulation of unique waxes gives the finish and durability of a hard wax, while being a liquid, meaning it is easier to apply and remove in a shorter amount of time.\nLeaves an extremely deep gloss, that lasts and lasts.\nI applied with a foam applicator with overlapping circles, which was really easy and the product spread well.\nWhen contacting he panel it immediately started to haze and cure off\nBut buffed off very well with no dusting, which can often be the case with these fast curing products, leaving a nice shine and slick finish\nTyre Care\nSilicone based dressing with all the characteristic markers of being a very thin, almost oily type liquid\nTyre Care is a versatile tyre and plastic renovator, which leaves the treated surface with an excellent shine.\nUnlike other tyre slicks, it doesn't leave behind the oily, stickiness, meaning that it won't run or go streaky in the rain, or flick down the side of the vehicle when driven off.\nContains silicone.\nApplied using an applicator, which I find best as overspray can be minimised\nThe tyres were degreased during the wash stage, so a good clean base was ready for the dressing\nEveryone has their own opinions on tyre dressing appearance, so I'll let the pictures do the talking, but if you like a wet look, this is definitely a contender\nAfter a minute or so the dressing was dry to the touch, so this should help cut down on sling if the tyre isn't overloaded on application\nMotor Fresh\nCompletely Silicone free, Motor Fresh is simple to apply and leaves a stunning, like new finish every time.\nSimply apply Motor Fresh to visible areas of the engine with a Cartec Heavy Duty Trigger Sprayer after cleaning, then leave to dry. No need to buff off excess or clean up spills or runs!\nI was running out of time so unfortunately didn't manage to test on my engine bay, so substituted for my back wiper\nDue to the light it was hard to take pictures well, but the product applied well and did look smeary to start with. As time went on however, it dried off and the smears started to fade, leaving a nice OEM dressed look.\nGlass Cleaner\n﻿﻿Cartec's Glass Cleaner is a revolutionary product which cuts down glass cleaning and drying times.\nA highly concentrated glass cleaning liquid which dissolves road grime and contaminants. Excellent for industrial and domestic use. Streak free formulation.\nThis was one of my standout products of the whole range. I'm usually very fussy with glass cleaners as they can be too smeary or flash off too quickly to be of any use, and then the cloth just becomes really grabby\nThis glass cleaner however had the right balance between the two and just seemed to munch through water spots and smearing with ease. You almost don't need a second cloth as one swipe is almost perfect, but a second pass brings it up great\nDash fresh\nCartec's Dash Fresh is a unique interior dressing that when applied leaves your dashboard with a luxurious satin finish.\nLeaves dashboard and interior panels like new, not super shiny or greasy, sticky residue.\nSilicone Free formula so safe for use in bodyshops.\nCleans and protects in one step, leaving a long lasting durable finish.\nVery pleasurable to use interior dressing. Smelt fresh when used, and with minimal effort cleaned and dressed in one go. I really like the OEM finish as its not blingy or anything, just matt and clean\nPrice\nThe sample pack costs £24.95 and can be bought from here\nhttps://www.cartecretail.co.uk/colle...tec-sample-kit\nIndividually the prices are as follows\nWheel cleaner: 1l = £14.95, 5l = £39.95\nSplash shampoo: 1l = £14.95, 5l = £34.95\nIron Wash: 1l = £19.95, 5l = £44.95\nTar & glue remover: 1l = £14.95, 5l = £39.95\nFast glaze: 1l = £17.95, 5l = £44.95\nGold wax: 1l = £24.95\nTyre care: 1l = £17.95, 5l = £44.95\nMotor Fresh: 1l = £17.95, 5l = £44.95\nGlass cleaner: : 1l = £12.95, 5l = £29.95\nDash fresh: 1l = £17.95, 5l = £44.95\nWould I use it again?\nWould I use the sample kit again? As I've already used it and made my judgements on my favourite products, probably not, as I would just buy them individually now\nBut as someone who doesn't know much about the Cartec brand and wants to try it out, the sample kit is great value, with some of the products lasting ages so I can definitely recommend the sample kit.\nIts also a great way to experience a broad spectrum of products that will cover all the basic areas of a car detail for relatively minimal outlay\nConclusion\nThis is a bit of a tricky conclusion to write, so I'll just go through and comment about each of the products and my thoughts, as the sample kit as a whole has its place and does not really compete with full size products\nWhat I can say is that all the products in the kit were very easy to use and produced good and sometimes great results. Not a single bad one amongst the lot\nFrom the top\nWheel cleaner\nEffective on my lightly soiled wheels, I'd like to think it works well on tougher ones. Good dilution ratio for lightly soiled wheels and in 5l the price is pretty good\nSplash\nGreat performing shampoo if you want one with wax additives. Cleans well, sudsy and slick when used. For me the dilution ratio lets is down as you have to use alot of product, which knocks it down on value. Price is good but not when you factor in the amount used\nIron Wash\nA surprising fallout remover in a sea of relatively the same type of product. Foams up nicely, clings great, doesn't smell the worst and performs well, really like this one. Quite well price too for 5l\nTar & glue remover\nVery little to say about this other than it works as expected, which is enough for most people. So so on price when compared to the competition\nFast Glaze\nMisleading name aside (which could be a translation thing), this is good performing QD that's well priced, so yeah I like this one\nGold Wax\nLovely liquid wax to use, no issues at all. Sample size is perfect as you really use very little, and per ml is cheaper than buying the full 1l. Thumbs up on this one\nTyre Care\nIf you like your wet look tyre dressings, this is one to take a good look at. Very very easy to apply with no sling, cures fast. Amazing price too for the volume, some brands are nearly the same price for half the volume\nMotor Fresh\nFrom the little I used, it was a well performing and easy to use water based dressing that I will be putting to use in the engine bay when I have time. I like the no-buff aspect which will be great for hard to reach areas. Will test on tyres too. Average price, shame it doesn't dilute to make it stretch even further\nGlass Cleaner\nPick of the bunch for me, one of the best I have used. Great performance, streak and smear free, dream to use. Very well priced especially at 5l\nDash Fresh\nLovely to use interior dressing leaving a clean, fresh, OEM look that I really like. Will definitely be keeping this little bottle in the glove box for emergencies. Very good price too in both sizes\nThanks for reading if you made it this far!\n\"Detailingworld\u0099 reviewer has followed the Manufacturers Instructions and accepts no responsibility to any circumstances arising from any member using these products or following this test \" PH Dodo Wax Purple Haze", "external_links": ["http://i.imgur.com/lVhrAOw.jpg", "http://i.imgur.com/oQZ6DjY.jpg", "http://i.imgur.com/ZejBD4e.jpg", "http://i.imgur.com/XDIxKyh.jpg", "http://i.imgur.com/8L6pK5h.jpg", "http://i.imgur.com/a0Cc7cK.jpg", "http://i.imgur.com/1mKbxGr.jpg", "https://www.cartecretail.co.uk/", "http://i.imgur.com/jQuRqwj.jpg", "http://i.imgur.com/2BhdjgZ.jpg", "http://i.imgur.com/ab49XRp.jpg", "http://i.imgur.com/ic1Dlmf.jpg", "http://i.imgur.com/OCI6NCo.jpg", "http://i.imgur.com/2SOhHGp.jpg", "http://i.imgur.com/AtbpFRZ.jpg", "http://i.imgur.com/AKsdyFd.jpg", "http://i.imgur.com/HIf0cF5.jpg", "http://i.imgur.com/hfpw87R.jpg", "http://i.imgur.com/0kniBDS.jpg", "http://i.imgur.com/1hQefae.jpg", "http://i.imgur.com/ezzXdyh.jpg", "http://i.imgur.com/BH8GO2j.jpg", "http://i.imgur.com/BJySHo2.jpg", "http://i.imgur.com/aZ0LPZ0.jpg", "http://i.imgur.com/nDoMb12.jpg", "http://i.imgur.com/kqvsbJD.jpg", "http://i.imgur.com/LptP7ys.jpg", "http://i.imgur.com/0mhWbMO.jpg", "http://i.imgur.com/S92tVVW.jpg", "http://i.imgur.com/p2txk8h.jpg", "http://i.imgur.com/AzNRezs.jpg", "http://i.imgur.com/AaGIOl9.jpg", "http://i.imgur.com/RkeMO4l.jpg", "http://i.imgur.com/RL1HgAV.jpg", "http://i.imgur.com/nGSVqgd.jpg", "http://i.imgur.com/L2JPzBw.jpg", "http://i.imgur.com/hxtb4wP.jpg", "http://i.imgur.com/ofvpl1F.jpg", "http://i.imgur.com/dfN3b38.jpg", "http://i.imgur.com/7lez4g3.jpg", "http://i.imgur.com/sQ8QFe6.jpg", "http://www.dodojuice.com/visuals/tn_djphJarTop.gif", "http://i.imgur.com/AeLVyLB.jpg", "http://i.imgur.com/7s0oIv7.jpg", "http://i.imgur.com/vJ8ToRm.jpg", "http://i.imgur.com/qIIXLna.jpg", "http://i.imgur.com/pp1054U.jpg", "http://i.imgur.com/Ierd76n.jpg", "http://i.imgur.com/IaexiiT.jpg", "http://i.imgur.com/ADnEcDi.jpg", "http://i.imgur.com/kHWbSe9.jpg", "https://www.cartecretail.co.uk/collections/dressings-finishing/products/cartec-sample-kit"], "highlightTitle": "", "uuid": "f5ddc84585237500220d15ec1229a2dafd117b1c", "highlightText": "", "rating": null}]