[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:14:57.000+03:00", "author": "", "entities": {"persons": [{"name": "prince of abu dhabi", "sentiment": "none"}, {"name": "abdulnaser al rashedi", "sentiment": "none"}, {"name": "mohamed bin zayed al nahyan", "sentiment": "none"}, {"name": "sheikh zayed bin sultan al nahyan", "sentiment": "none"}, {"name": "al ain", "sentiment": "none"}, {"name": "abu dhabi", "sentiment": "none"}, {"name": "khalifa bin zayed al nahyan", "sentiment": "none"}], "locations": [{"name": "abu dhabi city", "sentiment": "none"}, {"name": "al ain region", "sentiment": "none"}, {"name": "dhafra", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "al dhafra", "sentiment": "none"}, {"name": "emirate", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}, {"name": "abu dhabi", "sentiment": "none"}], "organizations": [{"name": "uae armed forces", "sentiment": "none"}, {"name": "abu dhabi  seven-week", "sentiment": "none"}, {"name": "abu dhabi awards organising committee", "sentiment": "none"}, {"name": "committee", "sentiment": "none"}]}, "text": "Celebrate the Good Amongst Us: Nominations Open for Abu Dhabi Awards 2017 16 April, 2017 Call for nominations to recognise unsung heroes from across the Emirate of Abu Dhabi \nSeven-week nomination period to run from Sunday 16 April to Saturday 3 June \nAbu Dhabi, Sunday 16 April, 2017Abu Dhabi Awards, a Government initiative that honours individuals who have selflessly dedicated themselves to helping others and contributed to the development of the Emirate of Abu Dhabi, are calling for nominations for its 2017 edition. As the Emirate’s highest civilian honour that can be given to anyone who has made a positive impact on Abu Dhabi, the Awards celebrate goodness and strive to inspire a community of good deeds within the Emirate. For the 2017 edition, the nomination period will run from Sunday 16 April to Saturday 3 June. \nKeen to preserve the legacy of this nation's late founding father, Sheikh Zayed bin Sultan Al Nahyan, the Abu Dhabi Awards were established in 2005 upon the directive of His Highness Sheikh Khalifa bin Zayed Al Nahyan, President of the United Arab Emirates. Held under the guidance and patronage of His Highness Sheikh Mohamed bin Zayed Al Nahyan, Crown Prince of Abu Dhabi and Deputy Supreme Commander of the UAE Armed Forces, the prestigious Abu Dhabi Awards encourage the citizens and residents of Abu Dhabi to nominate people who have undertaken a good deed that has benefited the community whether in Al Ain region, Al Dhafra region or Abu Dhabi city. Nominees can include Abu Dhabi citizens, residents and non-residents as well as those who live overseas, as long as they have contributed to the development of the Emirate of Abu Dhabi. \nThis year it’s even easier to nominate, with several ways for people to have their say: \n\nVia the Facebook page www.facebook.com/abudhabiawards Advertisement 8 In-mall stands and 40 collection centres across the Capital, Al Ain and the Al Dhafra region \nVia the call centre on 800 3331 \nSpeaking at the launch of this year’s edition, Mr. Abdulnaser Al Rashedi, member of the Abu Dhabi Awards Organising Committee, said: “We encourage everyone to nominate those who have selflessly dedicated themselves to helping others and inspired the community of Abu Dhabi city, Al Ain region or Al Dhafra region.” \n“One nomination is all it takes to recognise this act of giving. We hope that people from across the Emirate will join with us to nominate and recognise the good amongst us”. \nSince their inception in 2005, the Abu Dhabi Awards have recognised 71 unsung heroes who have made a positive impact on society in the Emirate. Nominations total almost a quarter of a million to date, representing 135 nationalities. The contributions from past Award recipients have covered several different areas; from medical research and lifetime achievements to overseas humanitarian relief and the preservation of UAE and Abu Dhabi culture and history. \nOnce the nomination period closes, all entries will be evaluated by the Abu Dhabi Awards Organising Committee, comprising leading dignitaries, officials and senior industry figures, who will produce a shortlist of the most qualified candidates. The Committee then further examines each of these nominations, while creating a detailed study on the work and contribution of each of the individuals. Following a rigorous review process the recipients will be selected and announced at the official Abu Dhabi Awards ceremony in early 2018. \n-Ends- \nFor more information, please contact: Shahd Bargouthyd: +971 4 237 8072 | m: +971 551042726 e: \nAbout the Abu Dhabi Awards Established in 2005 under the guidance and patronage of His Highness Sheikh Mohamed bin Zayed Al Nahyan, Crown Prince of Abu Dhabi and Deputy Supreme Commander of the UAE Armed Forces, the Abu Dhabi Awards have been celebrating the good in people for more than a decade. Its mandate is to honour those individuals who have selflessly dedicated themselves to helping others, thus contributing to the development Emirate of Abu Dhabi. An Abu Dhabi Award is the highest civilian honour in Abu Dhabi. \n© Press Release 2017  ", "url": "http://omgili.com/ri/jHIAmI4hxg8x7Ww4tkcOW6rxAQ.gUHHIj20_PZHRoLraWGLYNruYNJt3EDzMrHjolH0bCGlnQ2BhSRp_qdFaTsR6OXLpOJtfdN0ii0DFYFfxPXMBLioOLxqqeK0MgRY2oo3a2k4zyFUW2ds.fj6EGorUDHX16nynVejjef6uZ0McYP5vG4rbJw--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T08:00:00.000+03:00", "language": "english", "title": "Celebrate the Good Amongst Us: Nominations Open for Abu Dhabi Awards 2017", "thread": {"title_full": "Celebrate the Good Amongst Us: Nominations Open for Abu Dhabi Awards 2017", "site_full": "www.zawya.com", "site": "zawya.com", "site_section": "http://www.zawya.com/rss/pr.cfm?section=2", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "news", "spam_score": 0.0, "domain_rank": 20555, "replies_count": 0, "site_categories": [], "country": "AE", "section_title": "Zawya.com - Press Releases - Companies News", "url": "http://omgili.com/ri/jHIAmI4hxg8x7Ww4tkcOW6rxAQ.gUHHIj20_PZHRoLraWGLYNruYNJt3EDzMrHjolH0bCGlnQ2BhSRp_qdFaTsR6OXLpOJtfdN0ii0DFYFfxPXMBLioOLxqqeK0MgRY2oo3a2k4zyFUW2ds.fj6EGorUDHX16nynVejjef6uZ0McYP5vG4rbJw--", "published": "2017-04-16T08:00:00.000+03:00", "title": "Celebrate the Good Amongst Us: Nominations Open for Abu Dhabi Awards 2017", "uuid": "75c1dcf6c727d41b5a5623135ed2fa0ca8874dbb", "main_image": "https://images.zawya.com/pr/images/2017/mage1_2017_04_15.jpg"}, "uuid": "75c1dcf6c727d41b5a5623135ed2fa0ca8874dbb", "ord_in_thread": 0}]