[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:19:52.000+03:00", "author": "", "entities": {"persons": [], "locations": [], "organizations": []}, "text": "Seamless Middle East to open its doors on 1 May 2017 16 April, 2017 The large-scale conference will be held Under the Patronage of His Highness Lieutenant-General Sheikh Saif bin Zayed Al Nahyan Deputy Prime Minister, Minister of Interior \nBuilding on 17 years of experience, the event comprises three specialist conferences: Seamless Payments, Seamless Ecommerce and Seamless Retail \nDubai, United Arab Emirates, 16 April 2016 Seamless – the region’s most extensive technology and solution exhibition for the ecommerce, retail and payment industries – is set to open its doors on 1-2 May 2017 at the Dubai International Convention and Exhibition Centre. The large-scale conference is a seamless continuity from the Middle East’s largest and longest running conference of 17 years – Cards & Payments Middle East. \nRecently partnering with the Arab Federation for e-Commerce, the League of Arab States and the Council of Arab Economy Unity, Seamless Middle East 2017 will be held Under the Patronage of His Highness Lieutenant-General Sheikh Saif bin Zayed Al Nahyan Deputy Prime Minister and Minister of Interior, and will bring together 10,000 attendees of the worlds entrepreneurs and innovators from across the ecommerce, retail and payment industries. \nThe exhibition will welcome international, regional and local organizations, including high profile official spokespeople from several Arab states with a view to exchange experiences, discuss best practices and review the industry’s current and future trends. \nSeamless Middle East 2017 comprises of three specialist conferences: Seamless Payments will bring together the entire payments ecosystem to discuss, debate and evaluate alternative payment strategies and technologies in today’s rapidly changing payments landscape.\nSeamless Ecommerce is the region's leading ecommerce event for those wanting to grow and develop their business in the digital world, as Ecommerce is fast becoming a crucial component in every business strategy. Advertisement Seamless Retail will enable retailers to adapt, grow and thrive in this new world of connected commerce, accelerating retail with new ideas, exciting innovations and cutting edge technology.\n-Ends-This year’s Seamless conferences will host key regional speakers, including: \n\nAmaanie Hakim, Head of Smart Services Business Line, Oberthur Technologies Middle East FZE \nMarwan Elnakat, Director Digital Banking, Gemalto \nMary Ghobrial, Chief Commercial Officer, Souq.com, UAE \nNisreen Shocair, President, Virgin Megastore Middle East \nNabil Ibenbrahim, Regional Director for Middle East and Asia, HPS \nGlobal experts include: \n\nRainer Basler, Global Head of Consulting Practice, Giesecke And Devrient \nMr Martin Barthel, Global Head of Global Retail & eCommerce Strategy, Facebook \nHaytham El Maayergi, Global Head of Transactional Banking, Abu Dhabi Islamic Bank \nKamaljeet Rastogi, Global Head business development, Mobile Financial Solutions, Mahindra Comviva \nCarey Kolaja, Global Chief Product Officer, Citi Fintech \nRob Frohwein, CEO & Co-Founder, Kabbage \nSid Jatia, VP, Omnichannel Digital, Under Armour, USA \nSamantha Starmer, VP Global Digital Experiences, Ralph Lauren, USA \nLars Silberbauer, Senior Global Director of Social Media & Video, LEGO Group \nFor more information, please view the full agenda here:", "url": "http://omgili.com/ri/jHIAmI4hxg8x7Ww4tkcOW6rxAQ.gUHHIj20_PZHRoLpR_AovBOS7mIcYk0CMZCXkSq7uNrvx1UwLL4pD0U8ZgGMjywAVNqGHn_1YefFWZBJZIcnUkvRQ_IoG7oOHRoD_7pKCqf8svmDcY0e0kYBmUg--", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:19:52.000+03:00", "language": "english", "title": "Seamless Middle East to open its doors on 1 May 2017", "thread": {"title_full": "Seamless Middle East to open its doors on 1 May 2017", "site_full": "www.zawya.com", "site": "zawya.com", "site_section": "http://www.zawya.com/rss/pr.cfm?section=2", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "news", "spam_score": 0.0, "domain_rank": 20555, "replies_count": 0, "site_categories": [], "country": "AE", "section_title": "Zawya.com - Press Releases - Companies News", "url": "http://omgili.com/ri/jHIAmI4hxg8x7Ww4tkcOW6rxAQ.gUHHIj20_PZHRoLpR_AovBOS7mIcYk0CMZCXkSq7uNrvx1UwLL4pD0U8ZgGMjywAVNqGHn_1YefFWZBJZIcnUkvRQ_IoG7oOHRoD_7pKCqf8svmDcY0e0kYBmUg--", "published": "2017-04-16T11:19:52.000+03:00", "title": "Seamless Middle East to open its doors on 1 May 2017", "uuid": "f50974bdf9d918a5eec200577aaafcc2b13c9a32", "main_image": "http://www.zawya.com/resources/img/zawya-logo-en-social.png"}, "uuid": "f50974bdf9d918a5eec200577aaafcc2b13c9a32", "ord_in_thread": 0}]