[{"rating": null, "external_links": [], "crawled": "2017-04-16T11:11:55.000+03:00", "author": "Dianne E. Butts", "entities": {"persons": [{"name": "dianne", "sentiment": "none"}, {"name": "jonathan cahn", "sentiment": "none"}], "locations": [], "organizations": [{"name": "facebook", "sentiment": "none"}, {"name": "youtube", "sentiment": "none"}]}, "text": "Gleaning New Writing Projects from What You've Planted and Harvested in the Past Gleanings! This month \"Gleanings\" is on my mind. There's a reason for that. On my other blog I've been studying and writing about the \"Shemitah.\" I'm currently reading a nonfiction book about it titled The Mystery of the Shemitah by Jonathan Cahn. I know what you're thinking: \"What the heck is the Shemitah?!\" I'm so glad you ask. The Shemitah is a year-event and also a day-event. The Shemitah is the 7th year in a 7-year cycle on the Jewish/Hebrew calendar. And for those Jewish people following the Old Testament regulations, they let the land rest through the 7th year or the Shemitah year. Just as in the weekly calendar God instructed one day of rest per 7-day week, in the same pattern He instructed them to let the land rest through the seventh year in a 7-year \"week\" of years, Of course this also meant the people would rest through that year because they did not work the land. But they still had to eat, right? What do they eat? Whatever grew. On its own. The gleanings. They still had to do some work because they had to go out and gather the gleanings, but they do not work the land and all the land belongs to all the people to glean wherever they want to. The whole Shemitah is really an exercise in faith. The Jewish people had to believe that God would provide for them during that year...and the next until they planted and another harvest came in. The last day of the Shemitah year is also an event. At the end of this day, all the debts are forgiven. It's a national financial re-set. Whoever owes money is set free from that debt. And whoever is owed money releases it. It's an object lesson of how the Lord God releases the sin-debt of those who trust in Him and He gives us rest. The word shemitah translated means \"the Lord's release.\" Did you know we are currently living in a Shemitah year? As a matter of fact, because the Jewish calendar begins in the fall of the year (last September) we are almost half way through the Shemitah year, which will end Sunday, September 13, 2015. The exact mid-point of this Shemitah year is March 20th , so it seems appropriate to talk about the Shemitah and gleanings this month. (Plus, I only just now thought about applying this to my writing.) Gleanings for Writers Okay, I know what you're thinking: \"Enough with the Bible lesson. What does that have to do with us as writers?\" My study of the Shemitah caused \"gleanings\" to be on my mind. Suddenly I realized I already am gleaning in my writing. ( Tweet that! ) But it also gave me an awesome idea to glean another project from my past writing. ( Tweet that! ) Let me explain, and then we'll toss around some ideas for how you might glean new writing projects from what you've already planted and harvested in the past. ( Tweet that! ) Turn Gleanings into E-Books When I thought about gleaning in my writing, I realized I already am gleaning with my series of \"Getting Published\" e-books I'm releasing. You've already seen two of my titles that have released. Glean from a Pamphlet The first e-book I made, \"How to Get Published,\" was gleaned from a pamphlet I wrote back in 2003, printed on 11 x 17 paper, folded as multi-page pamphlets, and sold at writers conferences. I took the same information, updated it, and released it as a Kindle book last year. It continues to sell well on Kindle. only $.99 Cutting the Passive Voice Glean from an Article The second e-book, \"Cutting the Passive Voice,\" came out a few months ago. The information for this little Kindle book was gleaned from an article I wrote back in the '90s. It was published a few times in small Christian writer's magazines. It's still good and helpful information and I wanted to share it with more writers and make it available to a much larger audience. I still owned all the rights to it, so I renewed and refreshed it, added a little more information, and formatted it into a Kindle book. It's been selling quite well since its release, which is exciting and encourages me to do more. Glean from a Workshop You Teach You may remember I ask through a survey which e-book you'd like me to create next and I gave three options. Here are the results so far: Ten Tools for Marketing Your Book - 83% of votes The Shape of Story: How to Shape your Novel's Story to Make a Great Screenplay - 17% of votes Query Letters: How to Write the Query (and Cover) Letter You Dread to Magazine Editors and Book Publishers - 8% of votes You can vote for more than one which is why they add up to more than 100%. For the first two I will glean material from workshops I teach on those topics. The project on Query Letters I will glean from another pamphlet I wrote back in 2003. Pre-Order now! Glean from a Blog While I waited for the survey results to come it, I've been working on another e-book. Book Signings: How to Set Up Your In-Store Author Event and What to Do While You're There! contains a ton of information I gleaned from three different posts on this blog. While the material is already available for free here on the blog, I feel there's value in gathering it all together into one product for easy access instead of the reader having to hop around searching on this blog. Besides, I'm sure there are a lot of readers who don't even realize this information is available here so they don't know to go searching for it. Plus, readers can keep the e-book handy on their e-reader for easy reference when needed. Furthermore, I believe the e-book will reach a whole new audience of authors who can use the information but who don't even know about this blog. Therefore it may even bring new readers to the blog. This e-book isn't completely ready to go at this date, but it is available for pre-order right now. That means you can order it and you will receive it as soon as it releases. What has me especially excited right now is that while I was thinking about the Shemitah, and while I suddenly thought to apply \"gleanings\" to my writing, I realized I have a TON of information on my other blog about the Shemitah, the current tetrad of lunar eclipses (being called the \"Blood Moons\"), the 7 Feasts of the Lord on which these eclipses are falling, the solar eclipse on March 20 at the mid-point of the Shemitah year, and so much more along with the spiritual and prophetic meaning of it all. Again, all this information is spattered through many posts over the past year on my Bible Prophecies Fulfilled blog . So why not gather all of that information into an e-book?! Again, this is a ton of writing and research I have already completed. I can organize all this information for easy reading in one place so readers can find it easily and keep it on their e-reader for easy access. I can reach a whole new audience. This will give me another income stream. And I can bring readers to my blog who don't know about it right now. Why didn't I think of this e-book before?! You can bet I'll be at work on it to get it out as soon as I can. What Do You Have to Glean? So the question for you is, what material do you have that's already written that you could re-purpose into a Kindle e-book and share with the world? ( Tweet that! ) And it doesn't have to be material that has already been published. What about that project of your heart that never got published? You can make your material available on platforms other than Kindle through Smashwords.com . I learned how to format for Kindle by printing out their instructions. It's not that hard. In fact, I put those printed instructions in page-protectors and in a small notebook and I refer to them and walk through them step by step whenever I'm making a new Kindle book. Turn Gleanings into Videos If you follow my other blog, you saw in my December posts that I created videos for my posts for the Christmas Advent season . What material can you glean that you can turn into videos? You can take your writing material and tell it to your laptop's camera, edit it on YouTube.com, and upload it to YouTube. Then you can share that video on your blog, your web site, on Facebook, and probably other places I haven't thought of. When you say it in video, you reach an entirely new audience. Many people don't want to read. They want to see and hear. So glean material from your books, articles, blogs, and more and make a video. Even if you're only reading your article or a section of a book! I've been asked to make some of my Bible Prophecy Fulfilled blog posts into videos by just reading them. I haven't got that far yet but I'd like to. That way busy people can hear me read my own blog posts while they are busily doing something else. It works. It's a whole new audience. What material do you have that would make a great video or series of short videos? Turn Gleanings into Articles Perhaps all writers have an abundance of material we've gathered and researched for writing projects. What work have you already done that you can glean articles from? Or, can you take some material you've put into articles and create other material from it, such as an e-book or series of blog posts? Can you take your fiction and make it into a series of short stories for your blog or a series of short e-books? ( Tweet that! ) Turn Gleanings into Books and More We've talked about gleaning material you've written and creating e-books. But what about print books? Do you have an abundance of material you can gather together and have enough for a print book? ( Tweet that! ) You could add more material, if you want. Update it. Freshen it. What can you add? Maybe add an appendix, list, or chart. For my new Book Signings e-book I added a list I use when preparing for an in-a-bookstore book signing. That list is material that I haven't published before. It's not on this blog. So it's added value to the e-book. For the e-book on the Blood Moons and all that related information, I think I'll add a Leader's Guide to the back of the book. That will be new material I will need to create, but it will help readers share the incredibly important information in the book. It will make it easier to lead a discussion with a group of interested people. Maybe you can glean from stories you've written and use them to create a screenplay or take your nonfiction and make a documentary. The ideas truly are endless. Renew and Release Take a fresh look at the material you've already produced. Take a special look at the unpublished material you've created that has never found a home to be published in. Review it. Glean from it. Renew and refresh it. Reuse it. Re-purpose it. Then release it to accomplish that purpose for which it was created. May your gleanings of new writing projects from what you've already planted and harvested in the past provide you with an abundant blessing of new products, new readers benefiting from your work, and new income streams! Posted by ", "url": "http://omgili.com/ri/.wHSUbtEfZTXAynb8Ooe9SjeTcSq7k99yn5_Yrsk3n_fFln3NgKLoVJgypefyGhsgrNYpsBxBOZVBTJnT6NLmJIc2zWqcJeEYDhnakMRsAcMa1I_6jdFfIhyGGExOCn1", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T11:11:55.000+03:00", "language": "english", "title": "Dianne E. Butts About Writing: Gleaning New Writing Projects from What You've Planted and Harvested in the Past", "thread": {"title_full": "Dianne E. Butts About Writing: Gleaning New Writing Projects from What You've Planted and Harvested in the Past", "site_full": "buttsaboutwriting.blogspot.com", "site": "blogspot.com", "site_section": "", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 0, "site_type": "blogs", "spam_score": 0.965, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "IL", "section_title": "", "url": "http://omgili.com/ri/.wHSUbtEfZTXAynb8Ooe9SjeTcSq7k99yn5_Yrsk3n_fFln3NgKLoVJgypefyGhsgrNYpsBxBOZVBTJnT6NLmJIc2zWqcJeEYDhnakMRsAcMa1I_6jdFfIhyGGExOCn1", "published": "2017-04-16T11:11:55.000+03:00", "title": "Dianne E. Butts About Writing: Gleaning New Writing Projects from What You've Planted and Harvested in the Past", "uuid": "f9bd230491d78105cf2f60a5b05562f4ed03044b", "main_image": ""}, "uuid": "f9bd230491d78105cf2f60a5b05562f4ed03044b", "ord_in_thread": 0}]