[{"entities": {"persons": [{"sentiment": "negative", "name": "ka"}, {"sentiment": "none", "name": "minami funakoshi"}, {"sentiment": "none", "name": "donald trump"}, {"sentiment": "none", "name": "david lawder"}, {"sentiment": "none", "name": "abe"}, {"sentiment": "none", "name": "kiyoshi takenaka"}, {"sentiment": "none", "name": "pence"}, {"sentiment": "none", "name": "wilbur ross"}, {"sentiment": "none", "name": "hiroshige seko"}, {"sentiment": "none", "name": "tetsushi kajimoto"}, {"sentiment": "none", "name": "trump"}, {"sentiment": "none", "name": "barack obama"}, {"sentiment": "none", "name": "shinzo abe"}, {"sentiment": "none", "name": "paul tait"}, {"sentiment": "none", "name": "taro aso"}, {"sentiment": "none", "name": "hyunjoo jin"}, {"sentiment": "none", "name": "linda sieg"}, {"sentiment": "none", "name": "ross"}, {"sentiment": "none", "name": "aso"}, {"sentiment": "none", "name": "roberta rampton"}, {"sentiment": "none", "name": "leika kihara"}], "organizations": [{"sentiment": "none", "name": "u.s. commerce"}, {"sentiment": "none", "name": "fta"}, {"sentiment": "none", "name": "treasury department"}, {"sentiment": "none", "name": "tpp"}, {"sentiment": "none", "name": "korea automobile manufacturers association"}, {"sentiment": "none", "name": "subaru"}, {"sentiment": "none", "name": "toyota"}, {"sentiment": "none", "name": "white house"}, {"sentiment": "none", "name": "reuters"}, {"sentiment": "none", "name": "u.s. treasury department"}, {"sentiment": "none", "name": "honda"}, {"sentiment": "none", "name": "trump"}], "locations": [{"sentiment": "none", "name": "u.s."}, {"sentiment": "none", "name": "japan"}, {"sentiment": "none", "name": "tokyo"}, {"sentiment": "none", "name": "indiana"}, {"sentiment": "none", "name": "united states"}, {"sentiment": "none", "name": "seoul"}, {"sentiment": "none", "name": "washington"}, {"sentiment": "none", "name": "south"}, {"sentiment": "none", "name": "washington"}, {"sentiment": "none", "name": "south korea"}, {"sentiment": "none", "name": "atsugi"}, {"sentiment": "none", "name": "tokyo"}, {"sentiment": "none", "name": "asia"}, {"sentiment": "none", "name": "seoul"}, {"sentiment": "none", "name": "china"}, {"sentiment": "none", "name": "jakarta"}, {"sentiment": "none", "name": "america"}, {"sentiment": "none", "name": "north"}, {"sentiment": "none", "name": "australia"}, {"sentiment": "none", "name": "sydney"}]}, "text": "U.S. VP Pence kicks off Japan talks, both sides seek \"near term\" results U.S. Vice   and his wife Karen arrive at Atsugi naval air base in Ayase By Roberta Rampton and Minami Funakoshi TOKYO (Reuters) - U.S. Vice   on Tuesday kicked off talks with Japan that the White House hopes will open doors for U.S. goods and attract infrastructure investment, putting Tokyo on notice that Washington wants results soon. Pence first joined a working lunch with Prime Minister Shinzo Abe before meeting Deputy Prime Minister Taro Aso for economic talks. U.S. President Donald Trump and Abe arranged the talks between their deputies at a Washington summit in February, soon after Trump took office. \"When President Trump agreed to this dialogue, he envisioned this as a mechanism for enhancing bilateral commercial relations between the United States and Japan, and achieving results in the near future. And I share that vision and impatience,\" Pence told Aso at the start of the talks, comments that could be construed as a warning to Tokyo not to use the dialogue to kick touchy topics down the road. Aso in turn said U.S.-Japan trade friction, which soured ties in the 1980s and 1990s, was a thing of the distant past and the allies were now entering an era of cooperation. In a statement after the talks, the two sides said they had agreed the dialogue should produce \"concrete results in the near term\" adding that they had \"discussed specific sectors where improved commercial relations will promote mutual economic benefits and job creation in both countries\". Earlier, U.S. Commerce Secretary Wilbur Ross met Japan's trade minister, Hiroshige Seko. Ross, seen as more hardline on trade, told reporters Washington was eager to increase trade ties with Tokyo through a two-way agreement. Pence landed in Tokyo from South Korea after a trip that included a visit to the heavily fortified border separating the North and South. He described the U.S.-Japan alliance as the \"cornerstone\" of regional security. Pence's 10-day tour of Asia is aimed at emphasising that U.S. President Donald Trump wants to boost U.S. trade in the region even though Trump has abandoned the 12-nation Trans-Pacific Partnership (TPP) trade pact. Advocates for the TPP, negotiated by former President Barack Obama and supported by Abe, said it would have opened markets for American exports. U.S. business groups supported the deal but U.S. labour unions argued it would hurt American workers. Trump campaigned for office on an \"America First\" platform, saying he would boost U.S. manufacturing jobs and shrink the country's trade deficit with countries like Japan. Trump also vowed to renegotiate existing regional trade deals to focus on bilateral agreements. Tokyo is wary of a two-way free trade agreement (FTA), fearing it would boost pressure to open up politically sensitive sectors such as agriculture. \"It’s a little bit early to say just what forms things will take but we are certainly eager to increase our trade relationships with Japan and to do so in the form of an agreement,\" Ross said when asked about a possible FTA. TRADE IMBALANCES Japan had a $69 billion trade surplus with the United States last year, the U.S. Treasury Department said, expressing concern over what it called the \"persistence\" of the imbalance. Japanese officials counter that Tokyo accounts for a much smaller chunk of America's deficit than in the past, while China's imbalance is much bigger. Trump has complained that Japan keeps its currency artificially low, although a Treasury Department report last week did not label Japan a currency manipulator. The issue was not expected to be raised in talks on Tuesday. Pence said in Seoul earlier on Tuesday the Trump administration would review and reform a 5-year-old free trade agreement with South Korea. The Korea Automobile Manufacturers Association expressed concern about any review of the pact, which removed tariffs on auto trade between the two countries. Trump and Abe agreed in February to have Pence and Aso, who is also Japan's finance minister, open an economic dialogue. The two sides were expected to agree on principles and a process for further detailed discussions between ministries. \"Obviously, the first high-level talk is not going to have an immediate resolution of anything but I think we have a reasonable path forward,\" Ross said. Aso told reporters before the talks he would not discuss any bilateral free trade deal with Pence. The White House adviser said Tuesday's talks would not prescribe a free-trade deal but talks might eventually lead to such negotiations. Pence developed ties with Japanese business and political leaders as governor of Indiana, a state that is home to Subaru <7270.T>, Honda <7267.T> and Toyota <7203.T> plants, and about 260 Japanese companies employing about 60,000 residents. \"To some extent, we want to do for the United States what we did for Indiana,\" the White House adviser said. The Trump administration wants to attract more foreign direct investment, hoping to lure some with a $1 trillion plan to rebuild U.S. roads, bridges and other infrastructure. Pence will take that message to upcoming stops this week in Jakarta and Sydney. While no immediate announcements are expected from Tokyo, the White House expects a \"handful\" of investment announcements while Pence is in Australia at the weekend, the adviser said. He is due to meet corporate leaders at each of his stops. (Additional writing by Linda Sieg; Additional reporting by Kiyoshi Takenaka, Leika Kihara and Tetsushi Kajimoto in TOKYO, Hyunjoo Jin in SEOUL and David Lawder in WASHINGTON; Editing by Paul Tait) First Published: 2017-04-18 03:24:33 Updated 2017-04-18 09:59:30©  ", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "119128e1ae4024486bba40d50f912f1e41cb115a", "rating": null, "highlightTitle": "", "title": "U.S. VP Pence kicks off Japan talks, both sides seek \"near term\" results", "thread": {"country": "ZA", "site": "sharenet.co.za", "replies_count": 0, "title_full": "U.S. VP Pence kicks off Japan talks, both sides seek \"near term\" results", "site_categories": [], "performance_score": 0, "section_title": "Sharenet News Headlines", "domain_rank": 35993, "uuid": "119128e1ae4024486bba40d50f912f1e41cb115a", "main_image": "", "site_type": "news", "title": "U.S. VP Pence kicks off Japan talks, both sides seek \"near term\" results", "spam_score": 0.0, "site_section": "http://feeds.feedburner.com/sharenet_news_usbiz", "url": "http://omgili.com/ri/jHIAmI4hxg_M0urUz87kpJvxMC8V2U5CPRj7IHWXZN40b1Y7qflCGx9RSJ3dnCkMji1kkysA2e5BLLIJ7pV9.HRX3TjPJUu5oMHf8Fn.UQAYXxMLr7csUegkQ2v1Mbpz0TlGn506zpkX_j_92U4YpVHmjWjbqEk4b0uM7.uNajyL6iktu3PRog--", "participants_count": 0, "site_full": "www.sharenet.co.za", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:26:25.000+03:00"}, "crawled": "2017-04-18T11:26:25.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_M0urUz87kpJvxMC8V2U5CPRj7IHWXZN40b1Y7qflCGx9RSJ3dnCkMji1kkysA2e5BLLIJ7pV9.HRX3TjPJUu5oMHf8Fn.UQAYXxMLr7csUegkQ2v1Mbpz0TlGn506zpkX_j_92U4YpVHmjWjbqEk4b0uM7.uNajyL6iktu3PRog--", "highlightText": "", "published": "2017-04-18T11:26:25.000+03:00", "author": ""}]