[{"uuid": "075079cf60f0277d39fdbc457924bd3b1925bcce", "url": "http://omgili.com/ri/uBQNNiLKiWY9BjpXldpiUcFRFlAp7gK.r_aRZ0CAWY16T093a4_O22RO40JgDYAP7hnVHWvAsDG8XoAEzP2YXhXwLydm5Vv8i6AOL.NytFnOd2NnBUCdMv2lNJ8mDZZa3HXGJnjkbVM-", "title": "Facebook killer Steve Stephens found dead", "author": "", "rating": null, "published": "2017-04-18T23:24:14.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "pennsylvania state police", "sentiment": "none"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "nbc chicago", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "cleveland police", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}], "locations": [{"name": "pa.", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "erie", "sentiment": "none"}, {"name": "columbus", "sentiment": "none"}, {"name": "toledo", "sentiment": "none"}, {"name": "cincinnati", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "buffalo rd.", "sentiment": "none"}, {"name": "erie county", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "penn.", "sentiment": "none"}], "persons": [{"name": "steve stephens", "sentiment": "none"}, {"name": "dake kang", "sentiment": "none"}, {"name": "stephens", "sentiment": "none"}, {"name": "delano massey", "sentiment": "none"}, {"name": "erie", "sentiment": "none"}, {"name": "kantele franko", "sentiment": "none"}, {"name": "robert godwin sr.", "sentiment": "none"}, {"name": "john seewer", "sentiment": "none"}, {"name": "michael rubinkam", "sentiment": "none"}, {"name": "dan sewell", "sentiment": "none"}, {"name": "calvin williams", "sentiment": "none"}, {"name": "matt wright fox", "sentiment": "none"}, {"name": "godwin", "sentiment": "none"}, {"name": "debbie godwin", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "mark zuckerberg", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "075079cf60f0277d39fdbc457924bd3b1925bcce", "url": "http://omgili.com/ri/uBQNNiLKiWY9BjpXldpiUcFRFlAp7gK.r_aRZ0CAWY16T093a4_O22RO40JgDYAP7hnVHWvAsDG8XoAEzP2YXhXwLydm5Vv8i6AOL.NytFnOd2NnBUCdMv2lNJ8mDZZa3HXGJnjkbVM-", "site_full": "http", "title": "Facebook killer Steve Stephens found dead", "site_section": "http://www.stcatharinesstandard.ca/rss.xml", "domain_rank": null, "published": "2017-04-18T23:24:14.000+03:00", "title_full": "Facebook killer Steve Stephens found dead", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "Home Stories", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "CA", "performance_score": 0, "main_image": "http://storage.stcatharinesstandard.ca/v1/dynamic_resize/sws_path/suns-prod-images/1297946366016_ORIGINAL.jpg?quality=80&size=320x&stmp=1492531399797", "site": "http"}, "external_links": [], "language": "english", "text": "Man allegedly posted video of shooting: Police \nERIE, Pa. — The man who randomly gunned down a Cleveland retiree and posted video of the crime on Facebook killed himself Tuesday during a police chase in Pennsylvania that began when a McDonald’s drive-thru attendant recognized him. \nIt marked a violent end to the nearly 48-hour multistate manhunt for Steve Stephens, whose case brought another round of criticism down on Facebook over how responsibly it polices objectionable material posted by users. \nActing on a tip from the McDonald’s, state troopers spotted Stephens leaving the restaurant in Erie and went after him, bumping his car to try to get it to stop, authorities said. He shot himself in the head after the car spun and came to a stop, police said. \n“This started with one tragedy and ended with another person taking their own life,” said Cleveland Police Chief Calvin Williams. “We would have liked to have brought Steve in peacefully and really talked to him about why this happened.” AirTracker5 above the scene where the manhunt for Steve Stephens ended in Erie County, Penn. pic.twitter.com/FdFbQA9nY1 — News 5 Cleveland (@WEWS) April 18, 2017 \nStephens, a 37-year-old job counsellor who worked with young people, was wanted on murder charges in the killing of Robert Godwin Sr., 74, a former foundry worker and father of 10 who was picking up aluminum cans on Sunday when he was shot. \nThe chilling video was on Facebook for three hours before it was taken down. It was just the latest instance of crime footage being shared on social media. \nAt a Silicon Valley conference Tuesday, Facebook CEO Mark Zuckerberg briefly addressed the Cleveland case, saying Facebook has “a lot of work to do” and “we will keep doing all we can to prevent tragedies like this.” Scene on Buffalo Rd. in Erie where manhunt for Facebook killer Steve Stephens ended in his suicide pic.twitter.com/KXq95r6Gpm — Matt Wright Fox 8 (@mattwrighttv) April 18, 2017 \nPolice would not speculate on what triggered the killing, but in the video and other footage he posted, Stephens talked about having trouble with his girlfriend and losing everything he had to gambling. He said he “just snapped.” \nOne of Godwin’s daughters, Debbie Godwin, said she wished Stephens had been captured. \n“I’m not happy he’s dead at all, not at all. If you did it, you have to face your crime,” she said. PHOTOS: Where the manhunt for Steve Stephens ended https://t.co/vNKMgJGi3v pic.twitter.com/Tia4FOZwkr — News 5 Cleveland (@WEWS) April 18, 2017 \nThe break in the case came when police received a tip that Stephens was at the McDonald’s in Erie, in far western Pennsylvania about 100 miles east of Cleveland, where he ordered a 20-piece Chicken McNuggets and fries. \nThe drive-thru attendant thought she recognized Stephens and called state police, restaurant owner Thomas DuCharme Jr. told the Erie Times-News. State Police Maj. William Teper Jr. would say only that the tip came from a “concerned citizen.” \nThe McDonald’s employees tried to “buy some time for the cops” by telling Stephens his fries were delayed, but he said he had no time to wait and drove off, according to DuCharme. \nPolice picked up the trail in a chase that lasted 2 miles before Stephens took his own life, authorities said. \"As the officers approached that vehicle, Steve Stephens took his own life\": Cleveland police chief https://t.co/vAJG9CjMLV pic.twitter.com/yCMZMBSN7m — NBC Chicago (@nbcchicago) April 18, 2017 \nGail Wheeler, of Erie, said she was stopped at a light at the McDonald’s when Stephens came “whipping out” of the parking lot, nearly hitting her. She said state troopers weren’t far behind. \nWheeler said she followed the chase and saw a trooper clip Stephens’ rear bumper. His car did a half-turn and came to rest against the curb, and she heard a gunshot, she said. She then saw officers approach the car. \nThe officer closest to the car “just shook his head,” she said. “They had their guns out, but when he shook his head, they lowered their guns.” \nPolice said it wasn’t clear whether Stephens had any help while he was on the run or where he had been and that investigators will try to retrace his steps. Stephens’ cellphone had been tracked Sunday afternoon near Erie, officials said on Monday. \nFacebook said it removed the video of the shooting 23 minutes after learning of it. The company has since announced it is launching a review for reporting harmful content. \n“This is something that should not have been shared around the world. Period,” Cleveland’s police chief said. \nIn the video, Stephens told Godwin the name of his girlfriend and said, “She’s the reason that this is about to happen to you.” Godwin did not seem to recognize the name. \nThe woman, Joy Lane, told WJW-TV in Cleveland that she last talked with Stephens on Saturday night, when he told her he had quit his job and was moving out of state. \nInvestigators said that Godwin was the only victim so far linked to Stephens, despite his claim on Facebook that he killed over a dozen people. \nDetectives spoke with the suspect on Sunday by cellphone and tried to persuade him to surrender, police said. Within a day, authorities expanded the search nationwide and offered a $50,000 reward for information leading to his capture. \nAssociated Press reporters Michael Rubinkam in Pennsylvania; Dake Kang and Delano Massey in Cleveland; Kantele Franko in Columbus; John Seewer in Toledo; and Dan Sewell in Cincinnati contributed to this report. Gillispie reported from Cleveland. Featured Businesses", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:14.000+03:00"}]