[{"rating": null, "external_links": [], "crawled": "2017-04-16T10:44:46.000+03:00", "author": "Brian Cormier", "entities": {"persons": [{"name": "robyn mccallum", "sentiment": "none"}, {"name": "heather pelletier", "sentiment": "none"}, {"name": "michelle", "sentiment": "none"}, {"name": "julianne maclean", "sentiment": "none"}, {"name": "anne-marie leger", "sentiment": "none"}, {"name": "inger laidley great", "sentiment": "none"}, {"name": "ian comeau", "sentiment": "none"}, {"name": "shirley smallwood", "sentiment": "none"}, {"name": "walt forsey", "sentiment": "none"}, {"name": "terry leger", "sentiment": "none"}, {"name": "ray gallant", "sentiment": "none"}, {"name": "everette doiron", "sentiment": "none"}, {"name": "chantel gaudet", "sentiment": "none"}, {"name": "kelley", "sentiment": "none"}, {"name": "leonard cohen", "sentiment": "none"}, {"name": "maureen craig mcintosh", "sentiment": "none"}, {"name": "joanne murray", "sentiment": "none"}, {"name": "kelley mooney", "sentiment": "none"}, {"name": "dave barry", "sentiment": "none"}, {"name": "mélanie thébeau-leblanc", "sentiment": "none"}, {"name": "mooney", "sentiment": "none"}, {"name": "jacques allard", "sentiment": "none"}, {"name": "marilyn this", "sentiment": "none"}, {"name": "denise levasseur", "sentiment": "none"}, {"name": "david hawkins brian", "sentiment": "none"}, {"name": "marc julien", "sentiment": "none"}, {"name": "brian", "sentiment": "none"}, {"name": "karan wood", "sentiment": "none"}, {"name": "dollard bourgeois", "sentiment": "none"}, {"name": "collins", "sentiment": "none"}, {"name": "shirley long", "sentiment": "none"}, {"name": "pam whittaker", "sentiment": "none"}, {"name": "sean", "sentiment": "none"}, {"name": "dianne baker", "sentiment": "none"}, {"name": "jeanne wood", "sentiment": "none"}, {"name": "mark kenney", "sentiment": "none"}, {"name": "valarie higgins", "sentiment": "none"}, {"name": "eva pistone", "sentiment": "none"}, {"name": "courtney smith", "sentiment": "none"}, {"name": "franny vautour", "sentiment": "none"}, {"name": "monique mellon hi brian", "sentiment": "none"}, {"name": "gordon kirkland", "sentiment": "none"}, {"name": "janice bannister", "sentiment": "none"}, {"name": "ray hiltz", "sentiment": "none"}, {"name": "laura hare", "sentiment": "none"}, {"name": "jacques allard hey brian", "sentiment": "none"}, {"name": "dan chiasson", "sentiment": "none"}, {"name": "maria vautour", "sentiment": "none"}, {"name": "terry tower", "sentiment": "none"}, {"name": "paul chiasson", "sentiment": "none"}, {"name": "kathleen soucoup", "sentiment": "none"}, {"name": "rena", "sentiment": "none"}, {"name": "guy charlebois", "sentiment": "none"}, {"name": "amy winehouse", "sentiment": "none"}, {"name": "karen white brian", "sentiment": "none"}, {"name": "janice babineau", "sentiment": "none"}, {"name": "orin isaacs", "sentiment": "none"}, {"name": "margaret foget just", "sentiment": "none"}, {"name": "james peddigrew congratulations", "sentiment": "none"}, {"name": "kathleen mulholland", "sentiment": "none"}, {"name": "romeo", "sentiment": "none"}, {"name": "eileen malone", "sentiment": "none"}, {"name": "barbara", "sentiment": "none"}, {"name": "rita duplessis", "sentiment": "none"}, {"name": "carmel higgins", "sentiment": "none"}, {"name": "darren mccabe", "sentiment": "none"}, {"name": "paul melanson", "sentiment": "none"}], "locations": [{"name": "new brunswick", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "campbellton", "sentiment": "none"}, {"name": "lewisville", "sentiment": "none"}], "organizations": [{"name": "times", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "youtube", "sentiment": "none"}, {"name": "times & transcript", "sentiment": "none"}, {"name": "bathurst high school", "sentiment": "none"}]}, "text": "Testimonials I read your article regarding bullies and your stories reminded me of my son… Thanks for caring! Hump Day Reader I am just sending you a small note to tell you how my sister and I love your column even though they are not often enough. It’s nice to see someone else have what we think is the same problems in daily life as we do and laugh at it. Keep up the good work. Looking forward to your next one. Denise LeVasseur My brother forwarded (your) YouTube (video) of Kelley Mooney singing Leonard Cohen’s Hallelujah. I still have goosebumps. Inger Laidley Great article on Amy Winehouse. I am a huge fan of hers and was heartbroken by the news of her death. No one should rejoice in the death of someone just because they struggled with addiction and were made out to be a fool by the tabloids… Good job. Courtney Smith Great article! Sad, funny, melancholic, pensive… all bases covered! Hump Day Reader I just wanted to tell you that I really enjoyed your (YouTube) tribute to the Boys in Red, as they will forever been known. It was a very emotional and inspiring. Darren McCabe I always enjoy your review and comments on social media. I enjoy the Facebook feedback, your YouTube selection, etc. Awesome job. Jacques Allard Just a brief   Your story made me hysterical and your candour and objectivity are astounding. Kathleen Mulholland Just wanted to let you know that I absolutely love your column!!! Franny Vautour I just wanted to say how it amazes me when you capture the human condition — one of thinking we have plenty of time to get our work done. Love your columns and the newsletter. Valarie Higgins Thank you for the amazing article that appeared in today’s Times & Transcript. You did a wonderful job at not only describing your task at hand, but for also describing Sean (Collins) as being so very present… which he is! Shirley Smallwood I want to congratulate you on your video tribute to the seven Bathurst High School basketball players and to Mrs. Lord. It is a tragedy that affects everyone in NB, Canada and around the world. Ian Comeau - Campbellton Fire Department My husband and I were profoundly touched by your article entitled ‘A mother’s walk to freedom.’… The sad part of this story is that it is not a unique situation… suffice it to say that newspaper articles such as this one must make all your work worthwhile. Angela Bourgeois Totally powerfully and wonderfully written… For the first time in I can’t remember how long, it brought me utterly to gut-wrenching tears and I don’t even know any of the families who were going through this horrific time. You are truly a gifted journalist. Pam Whittaker If you don’t already receive it, I’m recommending Brian’s newsletter to you. It’s nicely designed and really well written with lots of useful and helpful information in each edition, especially if you live in New Brunswick and are interested in social media and communications. David Hawkins Brian, just wanted to tell you that you’re doing a wonderful job with your column every Wednesday. I always look forward to it. I know there’s a lot of stuff that you invent, but you always make me laugh. Just wanted to let you know that you have a fan. Rose Trites I just wanted to let you know how much I enjoy your column in the paper. Wish it was in every day! Everette Doiron In one fell swoop, your article has conveyed more constructive chiropractic information about my profession than perhaps years of paid national advertising could hope to achieve. Dr. Mark Kenney As   I read your column regularly in the (Times & Transcript) and enjoy it tremendously. Guy Charlebois The best line I’ve heard this year: ‘The graveyard is full of people who wish they would have just had a cold.’ I’ll remember your words when I want to complain about my minor aches and pains. Walt Forsey I read you columns and articles and I find your writing very fair and well balanced. James Small Just a short note to say I LOVED your column today! Literally laughing out loud in my office. Karan Wood I had tears running down my cheeks. Your storytelling and choice of descriptive words are excellent. Keep up the good work. That should be award-winning material. Dan Chiasson Not sure how you pull it off each week, but I like your newsletter! Marc Julien I recently saw (your) YouTube video of Kelley (Mooney) singing Hallelujah and thought it to be absolutely beautiful. I was so very impressed. James Peddigrew Congratulations on this good article. Helps to be reminded of that (even) when a lot of people around us seem to be victims and feeling guilty, things are going well for us. Maria Vautour I just read your column, and it made my day. Keep up the good work. You’re a fantastic writer. Hump Day Reader I read your column today —‘Not everyone gets enthused about the Christmas holiday.’ You must be a very compassionate and caring person to write such an article at this time of the year. As I sat to read the morning paper, it made my heart feel good that others do care. Eva Pistone I read   Absolutely, love the style (of your newsletter) and the adding of value that you are doing, Brian! Maureen Craig McIntosh Just wanted to tell you I enjoyed your morning column immensely! Kathleen Soucoup I just wanted to congratulate you on that excellent article in Wednesday’s Times and Transcript. By the time I finished reading about uncle Romeo and aunt Barbara, I had a lump in my throat and a tear in my eye. Not an easy thing to do to this 73-year-old! Hump Day Reader I really enjoy your weekly newsletters. Great, quick reads that inspire or affirm. I often forward along an article if I think someone else will find inspiration or affirmation in it. Joanne Murray I love your column, especially when you talk about your relatives. Monique Mellon Hi Brian! Always enjoy your columns but particularly enjoyed your reminiscence of small-town Lewisville, a grand place to live. Have many friend from there. Thanks for bringing forward many old memories long forgotten. Eileen Malone Just wanted to say I enjoy reading your newsletter every week. I especially like the list of different links to websites. Mélanie Thébeau-LeBlanc I read your article ‘Again New Brunswick weeps for its children,’ and I was completely moved and comforted. I brought the newspaper to my high school and shared it with all my friends, and we just found so much comfort and touching phrases to hold close during this insanely crazy time. Robyn McCallum I always enjoy your review and comments on social media. I enjoy the Facebook feedback, your YouTube selection… awesome job. Jacques Allard Hey Brian, just read your article on Canadian reality TV. I read it with a smile on my face because I agree with you. Orin Isaacs - former musical director and bandleader on Canadian Idol Just wanted to let you know that your column on losing a friend to cancer was very touching and an eye-opener for those of us who sometimes forget to tell those we love how we feel about them when they are still alive. I had tears in my eyes. Dollard Bourgeois (Your) Wednesday article was great, as usual. My wife has been reading your articles for a long time. Thank you. Ray Gallant That’s quite the story. Talk about wearing your heart on your sleeve. Kudos! Paul Melanson I’m enjoying your (American Idol) column so much this year I though I’d let you know. Everything you say is pretty well spot on. Marilyn This is the first time I actually write an e-mail to comment on anyone’s articles. Just a quick thanks for all of your articles… Have a great day and keep up the fabulous work. Chantel Gaudet I have followed and enjoyed your column for quite some time now. I remember the column you wrote about your Dad and it brought back so many memories of my Dad and his illness. Then reading the column today brought back all those memories even more. Janice Bannister Never in my life did I think I would send a note to anyone connected with the newspaper or any other publication… I enjoy your column very, very much… Thank you for doing what you do. It is so appreciated. Heather Pelletier I read your column on (being a) walking pharmacy today. LOVED IT!!! Thanks for the great laughs… With all the horrible news events constantly being reported, it is so nice to look forward to a funny spin on the day-to-day stuff. I can’t wait for the next column! Michelle I   usually fold the paper up and put it into the office recycling bin and shake my head. Today, on the other hand, I laughed out loud and faxed a copy over to a friend. I’m still laughing. Thank you! Hump Day Reader I loved every word and laughed out loud… USA Today bestselling author Julianne MacLean Just a quick note to thank you for your great column in today’s Times & Transcript. Thanks for putting into words what so many of think and feel on the topic. Terry Leger I want to tell you how much I enjoy your column… your humility and sense of humour. You are one columnist who can make me laugh out loud every time! Keep it up! You are right up there with Gordon Kirkland and Dave Barry. Carmel Higgins (Your newsletter) is very well done, Brian. Taking notes. Ray Hiltz I have been reading your column for as long as you started and just wanted to share for example today’s column about ‘Trying to make sense of Christmas songs.’ It made me laugh so hard that I had tears in my eyes. It was so very funny!! Rita Duplessis Never miss your weekly column in the (Times &) Transcript. Love your subtle way of humorously — how should I put it — sharing life’s ups and downs… how to laugh at ourselves… and a few of life lessons thrown in. Rena I just wanted to let you know how much I enjoy your columns. You just crack me up! Your latest column regarding job interviews had me laughing out loud! I love your sense of humour! Keep up the good work! Laughter is the best medicine! Janice Babineau I   Just wanted to drop you a quick line let you know what a great job you do on your newsletters. Very informative. I like that you cover a wide range of local and global topics. I always find something to take away and learn from. Thanks! Brent Arbeau Love your columns! Laughed out loud this a.m. Shirley Long Your article made my day. Thank you. Hump Day Reader Just wanted to write and tell you how much I enjoyed your story about your furry friend. It is so true what you say about the walks. You better be ready to go every day once you have a dog. Laura Hare I just finished reading your piece in the paper ‘Assuming the absolute worst whenever a doctor is involved,’ and it made me laugh out loud a bunch of times! Just wanted to say thank you for that. It felt great!! Karen White Brian, I read your column in today’s paper, ‘Even a winter lover is now longing for spring,’ and I laughed all the way through it! You made my day! Jeanne Wood I, like you, am a huge American Idol fan. I just finished reading your summary of last night’s show and want to compliment you on such an in-depth detailed report. Keep up the great reporting. Terry Tower I’ve read every one of your columns… I’ve enjoyed them all and had many a chuckle. Hump Day Reader My husband and I both roared with laughter over your column today, Brian. It was so us! Margaret Foget Just finished reading your column and I am still laughing. Keep it up. Love reading it on Wednesday. Aldea Thanks   Just wanted to let you know how much I enjoy reading your newspaper column in the Times & Transcript. Always good for a chuckle mixed in with deep thought. Anne-Marie Leger I love your dry, satirical no-nonsense honest writing! You make me laugh! Hump Day Reader Keep on writing those great columns. Dianne Baker Just a note to let you know that I thoroughly enjoyed your column ‘Hold off on those…’ Your have lots of talent and remind me of Dave Barry… I can truly say that you are one great humour writer. Paul Chiasson", "url": "http://omgili.com/ri/jHIAmI4hxg8jLTaUS_iO5h3Nn8gz_CsCv8r47EUswj6EOA0eU81VO_CMRX1RmtJhFni1GxuMRYU-", "highlightText": "", "highlightTitle": "", "published": "2017-04-16T08:54:00.000+03:00", "language": "english", "title": "Happy Easter!", "thread": {"title_full": "Happy Easter!", "site_full": "www.briancormier.com", "site": "briancormier.com", "site_section": "http://www.briancormier.com/feed/", "performance_score": 0, "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "linkedin": {"shares": 0}, "vk": {"shares": 0}, "stumbledupon": {"shares": 0}}, "participants_count": 1, "site_type": "blogs", "spam_score": 0.0, "domain_rank": null, "replies_count": 0, "site_categories": [], "country": "CA", "section_title": "Brian Cormier", "url": "http://omgili.com/ri/jHIAmI4hxg8jLTaUS_iO5h3Nn8gz_CsCv8r47EUswj6EOA0eU81VO_CMRX1RmtJhFni1GxuMRYU-", "published": "2017-04-16T08:54:00.000+03:00", "title": "Happy Easter!", "uuid": "0a5fd71410bd62f20fc2886e3fa7939dee0affaf", "main_image": ""}, "uuid": "0a5fd71410bd62f20fc2886e3fa7939dee0affaf", "ord_in_thread": 0}]