[{"uuid": "23a6478e0a2fe299d0fec3675dbe942924d1e83f", "url": "http://omgili.com/ri/jHIAmI4hxg9HmE2nZSOF8wm0limXahF8ycjlkYUhPv7iLMdvzyPI_WrrtkP4wmmfCOYyYpRx9Lak8wfbxF6RUhlqr83e2jln_2Ag0lKx_rIdlPIPkNiFJBZ91Zl1Yd6t", "title": "Trial into fatal crash in 2013 begins in Welland", "author": "", "rating": null, "published": "2017-04-18T23:24:12.000+03:00", "highlightText": "", "entities": {"organizations": [], "locations": [], "persons": []}, "highlightTitle": "", "thread": {"uuid": "23a6478e0a2fe299d0fec3675dbe942924d1e83f", "url": "http://omgili.com/ri/jHIAmI4hxg9HmE2nZSOF8wm0limXahF8ycjlkYUhPv7iLMdvzyPI_WrrtkP4wmmfCOYyYpRx9Lak8wfbxF6RUhlqr83e2jln_2Ag0lKx_rIdlPIPkNiFJBZ91Zl1Yd6t", "site_full": "www.niagarafallsreview.ca", "title": "Trial into fatal crash in 2013 begins in Welland", "site_section": "http://www.stcatharinesstandard.ca/rss.xml", "domain_rank": null, "published": "2017-04-18T23:24:12.000+03:00", "title_full": "Trial into fatal crash in 2013 begins in Welland", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "Home Stories", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "CA", "performance_score": 0, "main_image": "http://storage.stcatharinesstandard.ca/v1/dynamic_resize/sws_path/suns-prod-images/1297456095476_ORIGINAL.jpg?quality=80&size=320x&stmp=1376861511351", "site": "niagarafallsreview.ca"}, "external_links": [], "language": "english", "text": "\nBy Alison Langley , Niagara Falls Review Tuesday, April 18, 2017 4:08:23 EDT PM Niagara Falls resident Rie Motomitsu was killed on her way to work in 2013. (Facebook Image) Change text size for the story Print \nReport an error \nA Niagara Regional Police officer tried his best to comfort a seriously injured woman he felt was about to die following a two-vehicle crash in Niagara Falls, court heard Tuesday. \n\"She was in her last moment's of life,\" Const. Kris Hamilton testified Tuesday in a Superior Court of Justice in Welland. \n\"I stayed with her. I encouraged her to breathe and to think of her loved ones.\" \nLess than 15 minutes later, 33-year-old Rie Motomitsu succumbed to her injuries. \nKenneth Mitchell, 68, has pleaded not guilty to dangerous driving causing death in connection with the Aug. 18, 2013 crash that claimed Motomitsu's life. \nIn his opening statement to Judge Linda Walters, assistant Crown attorney Andrew Brown said the evidence will show Mitchell caused the crash on Falls Avenue at the Victoria Avenue exit. \nBrown conceded the case \"is very difficult,\" and added Motomitsu would likely have been charged with offence under the Highway Traffic Act had she survived the crash. \nCourt heard Motomitsu was driving down Falls Avenue towards the Victoria Avenue exit around 8:45 a.m. when the front left corner of Mitchell's pick up truck came into contact with the right rear corner of her vehicle. \nThe woman's car rotated out of control, mounted a curb and collided with a light standard. \nBrown said experts will testify that both vehicles were driving between 75 and 90 kilometres an hour, well in excess of the posted speed limit, at the time of the crash. \nMotomitsu's husband Adam Hyde described his wife of almost eight years as a \"very cautious driver,\" who didn't appear to be in a hurry when she left for work that morning. \nHe testified he went to a yard to check out the mangled wreckage of the vehicle several weeks after the fatal crash. \nInside the car he found a police report with Mitchell's name and phone number. Mitchell had yet to be charged with a crime in connection with incident. \n\"I decided to contact Mr. Mitchell,\" Hyde told court. \"The main purpose was just for closure. I wanted to understand how the crash occurred.\" \n\"I was not angry with him. I was not upset. I asked him to help me understand, give a clear picture, of what transpired that day.\" \nHe said Mitchell sounded upset at first and told him, \"People should learn how to drive more carefully on that road.\" \n\"He seemed somewhat complacent with what transpired that day,\" Hyde said. \"I thought he may have been experiencing emotional trauma of his own.\" \nUnder cross examination by defence counsel George Walker, Hyde conceded he originally believed his wife had caused the crash. \n\"Yes, but that was just my speculation,\" the widower said. \nBrown said the defendant has 19 previous \"motor vehicle incidents and/or collisions\" many of which involved lane changes. \nA number of people involved in previous collisions involving Mitchell are expected to testify. \nThe trial continues Wednesday. ", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:12.000+03:00"}]