[{"entities": {"organizations": [{"name": "gm", "sentiment": "none"}, {"name": "world cup young stars", "sentiment": "none"}, {"name": "honda center", "sentiment": "none"}, {"name": "ducks", "sentiment": "none"}, {"name": "bouma simply can", "sentiment": "none"}, {"name": "ducks pk", "sentiment": "none"}, {"name": "maple leafs", "sentiment": "none"}, {"name": "nhl", "sentiment": "none"}, {"name": "hamilton", "sentiment": "none"}, {"name": "pacific division", "sentiment": "none"}, {"name": "m.i.a.", "sentiment": "none"}, {"name": "oilers", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "chicago blackhawks", "sentiment": "none"}], "locations": [{"name": "anaheim", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "calgary", "sentiment": "none"}, {"name": "united centre", "sentiment": "none"}, {"name": "carolina", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "damn nashville", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "winnipeg", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}, {"name": "edmonton", "sentiment": "none"}, {"name": "hamilton", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}, {"name": "east", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "persons": [{"name": "kesler", "sentiment": "none"}, {"name": "lance bouma", "sentiment": "none"}, {"name": "perry", "sentiment": "none"}, {"name": "mikael backlund", "sentiment": "none"}, {"name": "bennett", "sentiment": "none"}, {"name": "clayton stoner", "sentiment": "none"}, {"name": "brad treliving", "sentiment": "none"}, {"name": "kris versteeg", "sentiment": "none"}, {"name": "ferland", "sentiment": "none"}, {"name": "vermette", "sentiment": "none"}, {"name": "thompson", "sentiment": "none"}, {"name": "josh manson", "sentiment": "none"}, {"name": "minesota", "sentiment": "none"}, {"name": "hampus lindholm", "sentiment": "none"}, {"name": "alex chiasson", "sentiment": "none"}, {"name": "sami vatanen", "sentiment": "none"}, {"name": "giordano", "sentiment": "none"}, {"name": "ryan kesler", "sentiment": "none"}, {"name": "al macinnis", "sentiment": "none"}, {"name": "stajan", "sentiment": "none"}, {"name": "patrick eaves", "sentiment": "none"}, {"name": "mark giordano", "sentiment": "none"}, {"name": "korbinian holzer", "sentiment": "none"}, {"name": "treliving", "sentiment": "none"}, {"name": "kevin bieksa", "sentiment": "none"}, {"name": "brian pochmara", "sentiment": "none"}, {"name": "jerry seinfeld", "sentiment": "none"}, {"name": "sam bennett", "sentiment": "none"}, {"name": "michael stone", "sentiment": "none"}, {"name": "brodie", "sentiment": "none"}, {"name": "gaudreau", "sentiment": "none"}, {"name": "tkachuk", "sentiment": "none"}, {"name": "getzlaf", "sentiment": "none"}, {"name": "wagner", "sentiment": "none"}, {"name": "mariano rivera", "sentiment": "none"}, {"name": "matthew tkachuk", "sentiment": "none"}, {"name": "brandon montour", "sentiment": "none"}, {"name": "gulutzan", "sentiment": "none"}, {"name": "backlund", "sentiment": "none"}, {"name": "elliott", "sentiment": "none"}, {"name": "hamilton", "sentiment": "none"}, {"name": "john gibson", "sentiment": "none"}, {"name": "monahan", "sentiment": "none"}, {"name": "sean monahan", "sentiment": "none"}, {"name": "tj brodie", "sentiment": "none"}, {"name": "darren haynes", "sentiment": "none"}, {"name": "bouma", "sentiment": "none"}, {"name": "micheal ferland", "sentiment": "none"}, {"name": "gibson", "sentiment": "none"}, {"name": "fowler", "sentiment": "none"}, {"name": "dougie hamilton", "sentiment": "none"}, {"name": "joe colborne", "sentiment": "none"}, {"name": "ryan getzlaf", "sentiment": "none"}, {"name": "wes mccauley", "sentiment": "none"}, {"name": "lindholm", "sentiment": "none"}, {"name": "jakob silfverberg", "sentiment": "none"}, {"name": "brouwer", "sentiment": "none"}, {"name": "corey perry", "sentiment": "none"}, {"name": "vegas gm george mcphee", "sentiment": "none"}, {"name": "shea theodore", "sentiment": "none"}, {"name": "brian elliott", "sentiment": "none"}, {"name": "simon despres", "sentiment": "none"}]}, "uuid": "271fc9f20e867cdee231715265f8760ced8e45ae", "highlightText": "", "title": "29 Lines About 29 Losses: A List of the Many Reasons Brad Treliving Should be Furious", "thread": {"site": "flamesfrom80feet.ca", "country": "CA", "participants_count": 1, "site_full": "www.flamesfrom80feet.ca", "section_title": "The Calgary Flames - From 80 Feet Above", "uuid": "271fc9f20e867cdee231715265f8760ced8e45ae", "site_section": "http://www.flamesfrom80feet.ca/", "domain_rank": null, "main_image": null, "performance_score": 0, "published": "2017-04-16T23:21:51.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_rgsLDXJjiTxzbOkLGWTsOd9.kOX1G97R4OAsAJBUHu426ZC8CDhH.C27C8fwwcs0u8qK_Q2C98afpdsFNrxk2mxaRgoeTMq9.L8CcACWVpQ--", "title_full": "29 Lines About 29 Losses: A List of the Many Reasons Brad Treliving Should be Furious", "title": "29 Lines About 29 Losses: A List of the Many Reasons Brad Treliving Should be Furious", "site_type": "blogs", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T23:21:51.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg_rgsLDXJjiTxzbOkLGWTsOd9.kOX1G97R4OAsAJBUHu426ZC8CDhH.C27C8fwwcs0u8qK_Q2C98afpdsFNrxk2mxaRgoeTMq9.L8CcACWVpQ--", "ord_in_thread": 0, "crawled": "2017-04-16T23:21:51.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Darren Haynes (noreply@blogger.com)", "text": "Embed from Getty Images \n\nIt should come as no surprise that in the aftermath of another night of Honda Center frustration, Brad Treliving was pissed off.\n\nFlames GM,Brad Treliving, just smashed a chair not 5 feet from me — jonathan davis (@westcoasthky) April 16, 2017 \nHeck, I'm sure plenty of bar stools in Calgary met a similar fate and nobody has more invested in this team than this guy.\n\nFrustrated with the outcome? For sure.\n\nMad about some of the decisions made by the players? Probably.\n\nAngry with the calls that went against his team? Of course.\n\nThere are numerous reasons for the Flames general manager to be incensed after a 29th straight loss in that arena. In fact, here are 29, one for every setback over this decade-plus stretch of futility.\n\n1. The Non-Goal - This one has to top the list. A key moment in the game came midway through the second period when Sam Bennett fights off the check of Korbinian Holzer to get his stick on a centring pass from Kris Versteeg with the puck eventually trickling into the net in the midst of a frenzy of activity in the crease.\n\nNot called a goal initially on the ice, it went to a video review as the puck did end up in the net. After a lengthy review, it was ruled there had been goalie interference either by Alex Chiasson , who during the skirmish had come in and swiped at the puck and in the process, contacted goaltender John Gibson , or by Bennett (it was not clear), and in the view of the officials, Gibson was prevented from being able to make the save. It's that in-between rule where it's not severe enough to be a goaltender interference penalty, but the goal doesn't count either.\n\nIf this sounds familiar, it was two years ago that Bennett also appeared to score in a playoff game against the Ducks, only for that one also to be disallowed. \n\nWhile it's certainly a play we could debate in this space for an article in itself and no doubt it will be a hot topic across Flames nation on Sunday, it was needless to say an awfully tough decision to swallow for Calgary because it was ultimately a subjective call that denied them what would have been the go-ahead goal.\n\nAfter blowing a one-goal lead in game 1, it's hard to believe one of the best teams in the league at keeping leads would have blown a lead again. So yes, that one play was that significant.\n\n2. Elliott's Slow Start - Two goals against on the first six shots. Once again, Calgary falls behind early. Brian Elliott rebounded nicely, shutting the door for exactly 48 and half minutes after that and making 20 consecutive saves in the process -- a handful of dangerous chances thwarted along the way -- but then came that pinball winner off the stick of Ryan Getzlaf , and more so the skate of Lance Bouma .\n\nAgonizing is the fact that with a better start, that fluke goal might have been inconsequential. But instead, it wasn't because of the two that the veteran goalie missed earlier.\n\nThe opening goal by Jakob Silfverberg from off the wing, he has to have that one. While there were others to share in the blame on the second goal, a top NHL goalie can't get beat on a wrap-around like that. He just can't.\n\nCalgary scored the next two, but instead of taking a 2-0 lead, that only tied it 2-2, and you know how things turned out.\n\n3. Hamilton's Bad Decision - Jostling with Corey Perry in the neutral zone as Anaheim heads up ice on a rush and with Dougie Hamilton trying to get back in the play, the defenceman ends up grabbing Perry's stick with his glove.\n\nNo, it wasn't for very long. Yes, it was blatant. Whistled for two minutes for holding the stick at 14:33 of the third period, Calgary goes to the PK for the first time since Matthew Tkachuk 's high-sticking penalty in the first period. The Ducks need only 41 seconds to take advantage.\n\nJust like that, Anaheim leads with less than five minutes remaining. Whether or not it was the right call or a fair call can and will be debated, but what should not be a debate is in that game situation, you simply can't give the official a reason to raise his hand. It was an unnecessary risk in which the team ended up paying a heavy price.\n\n4. Referee's Questionable Decision - Of course, as mad as you are at your player for unnecessarily giving the officials a reason to make a penalty call there, you're equally mad at the referee tandem of Wes McCauley and Brian Pochmara for making that call.\n  \nDid that really need to be a penalty in that moment of a 2-2 game? Was it really that egregious of a foul given all the hijinx that had gone uncalled over the previous period and a half? That part is certainly debatable. Could the referee have also sent off Perry for interference and made it coincidental minors? Absolutely.\n\n5. Hockey Gods Aren't Crazy, They Just Dislike Calgary - Regardless of all the variables leading up to the go-ahead goal, the bottom line is it was a total fluke goal and it really makes one wonder if there really is some sort of curse in that building.\n\nSeriously, a harmless centring pass caroms sharply off Bouma's boot, flutters high in the air in the direction of the net and with Elliott having no idea where the puck had gone, like a centre fielder who loses a fly ball in the bright sun, it lands behind him in the net. To quote Jerry Seinfeld, \"That was one magic loogie.\"\n  \nTo re-enact that goal, you'd probably need to try it at least a couple hundred times and that would be trying to do it on purpose. That's just the kind of sorcery everyone has come to expect in that building where the 'you'll never believe what happened...' lore continues to grow.\n\n6. Too Many Wasted Chances  - It's not like the Flames didn't have chances to bury the Ducks early in the game.\n\n    They had a couple of breakaways, including Gaudreau bursting in off the wing, but failed to convert each. Set-up on a brilliant fake-shot turned slap-pass by Michael Stone , Sean Monahan failed to got all of his stick on the puck and instead of putting the Flames in front, the puck flipped off his stick and went wide.\n  \nTwo guys being paid handsomely to score big goals. Two guys the Flames need to score big goals if they want to prevail as the underdog in this series. Neither was able to deliver.\n\nMonahan has a pair of goals so far and he's been good. But when you lose two one-goal games, it's the goals that you don't score that end up the talking points.\n\n7. Gaudreau Passes up the Shot - That was the game situation. That's why you gave him a six-year, $40.5 million contract in the off-season.\n\nWith the game on the line in the final 30 seconds of regulation, if you could pick one player to have the puck on his tape from 15 feet out, that's the guy you would select.\n\nAfter Hampus Lindholm uncharacteristically coughs the puck up into the slot, Gaudreau gets a grade 'A' chance in a prime shooting spot. But wait. Rather than shoot, he spins around and sends a no-look backhand pass to the side of the net that doesn't connect.\n\nIn game 1, it was Gibson beating Gaudreau in a showdown in the waning seconds by stretching out his pad to stop Gaudreau's backhand as he cut across the crease. In that situation, Gaudreau has to make his World Cup Young Stars teammate beat him a second time.\n\nNo idea why Gaudreau didn't let a shot fly there. — Darren Haynes (@DarrenWHaynes) April 16, 2017 \n\n8. Brouwer's Disappointing Season  - The wait continues and continues.\n\nSafe to say the Flames are still waiting for the 'big game' player to emerge that scored eight times in the playoffs a year ago to get him a $4.5 million paycheque this year. One goal from Brouwer in these first two games sprinkled in anywhere might very well have made the  difference and made this series 1-1 instead of 2-0.\n\nThis isn't a guy that will come out of the line-up. This isn't someone that should come out of the line-up. But a decent fourth liner/penalty killer/net-front power play presence isn't good enough for the pay stipend he's cashing. Expectations are commensurate with what you make for a salary in this business and he's making a lot while not contributing a lot.\n  \nCalgary needs more from him at this point, beyond what he may be contributing off the ice as an alternate captain. Calgary needs way more.\n\nUnfortunately, the fact he opened the playoffs on the fourth line is an indicator of how far his stock has fallen. More and more, you wonder what kind of sweetener it may take -- a top prospect, perhaps -- for Treliving to coax Vegas GM George McPhee into taking in the expansion draft the player he once brought to Washington. Because so far in Calgary, it isn't working out.\n\n9. Brouwer's Disappointing Usage - Late in the season, Micheal Ferland finally got a chance on the top power play unit in place of Brouwer. After all, it made sense as he was already playing at five-on-five with Gaudreau and Monahan.\n\nFor many, it was a move long overdue considering how well Ferland has played. Yet, Gulutzan has reverted to the way things were earlier in the season to begin the playoffs and it's been Brouwer in that role once again.\n\nParticularly perplexing was how it played out in game 1 when Ferland was creating chances all night yet still got passed over when the Flames needed that late goal.\n\nTreliving has been very upfront in his time in Calgary to say that he lets his coaches coach. He assembles the roster, brings in the personnel. How the players are deployed is up to the skipper. They chat every day so you know opinions are exchanged, but ultimately it's the coach's call and it has to be. You can't have a GM meddling. That said, you do wonder how Treliving is viewing his prize July 1 signing.\n\nI think with the GM there's a better understanding of what else he brings to the team, he's around the team all the time and you see things that the rest of us don't, but at that salary, intangibles cannot be your biggest contribution.\n\n10. Undisciplined Dougie - Getting back to Hamilton because he's been in the crosshairs and rightly so, that makes four minor penalties for this series.\n\nWhile it's easy to point to his age -- still a youthful 23 -- and say maybe it's simply the pressure of the Stanley Cup Playoffs getting to a young man, but Ducks blue liners Shea Theodore , Brandon Montour and Lindholm are all younger than Hamilton and have all played fewer NHL games, yet they have played very well. Consistent. Solid.\n\nYou can't harp too much on Hamilton because he was such a key part of the Flames resurgence. When he and Mark Giordano were paired together on Nov. 15 for the first time, that's when Calgary's season took off. But that version of Hamilton is what Calgary badly needs to show up in this series right away. He's too important of a piece.\n\n11. Brodie Snaps at the Wrong Time - You don't see TJ Brodie get mad very often. But sure enough, Kesler -- not surprisingly -- is a guy that does it and it was costly on Saturday night.\n\nBrodie's cross-check to the back of Kesler while he was already down put the Flames back on the penalty kill with less than three minutes remaining in the game. Now down a goal, they were going to have to manufacture a comeback while playing four-against-five. Not good. It may not have fatally killed Calgary's comeback hopes, but it seriously wounded them.\n\nThis feud isn't new.\n\nYou may recall back at the Saddledome on Dec. 29, 2015, after Kesler shot the puck into the empty net after the final buzzer went, Brodie was as furious as I've seen him, shouldering Kesler into the boards afterwards and sparking a small melee.\n\nWas it uncharacteristic? Yes. Was it rare? Yes. But is he still accountable for it? Has to be. It took two big minutes off the clock.\n\n12. Ryan Kesler - Speak of the devil. If you live in Calgary, it's just part of living in this city. You have to have a strong dislike for the Anaheim centre. Presumably the feelings aren't much different for Treliving.\n\nKesler is a monster in the playoffs, an absolute force, who owns the Flames. Great at the dot, dangerous with the puck, difficult to play against, a master in getting under the skin of the opposition and that smirk afterwards -- it must drive guys crazy.\n\nThe Flames can only dream that Matthew Tkachuk will one day have a similar type of presence and impact in that coveted but hard-to-fill role of an antagonist that your team and fan base loves, but everybody else hates. \n\n13. Damn Nashville - As we got into the final week of the season, the team that most felt Calgary would match up better against, despite them having the best record in the Western Conference, despite their three Stanley Cups in the last seven years, was the Chicago Blackhawks.\n\nAs if he was doing all he could to facilitate that match-up, Gulutzan sat out the likes of Mikael Backlund , Mark Giordano and Kris Versteeg for the Flames regular season finale too. A win by Nashville in Winnipeg on that Saturday, as the Predators pursued third place in the Central, combined with a Calgary loss, would have resulted in the Flames travelling to Illinois instead. To save you looking it up, the last time Calgary won in the United Centre was last October. No curse to be found in that arena and that alone was a reason to crave that match-up.\n\nBut instead, the Predators found out during their game that third place and a match-up with Minesota was no longer within reach after the Blues clinched it with a win over Carolina. Shortly after in real time, Nashville promptly gave up two goals in the last half of the third period -- the final one shorthanded with 45 seconds left -- to lose 2-1 to Winnipeg in regulation and draw Chicago instead of Anaheim.\n\nIn case you haven't noticed, the Predators just took a 2-0 series lead winning twice in Chicago and not giving up a goal. Safe to say the Flames wish they played at 7 pm Central time last night.\n\n14. History Says You're Screwed - Sure, they played well. Yes, if they can only eliminate some mistakes they can defeat the Ducks. But the bottom line is the team has to win four of the next five to win the series and the odds of that are not good.\n\nIn fact, in franchise history, Calgary has never overcome a 2-0 deficit. They've been in that situation nine times and are 0-9. Sure, all streaks must come to an end eventually, but where have I heard that before! Until it happens, hard to expect it to happen.\n\n15. Oilers Won - You know the salt in the wound for the front office especially is that the Oilers and their fancy, new rink that they're not shy to flaunt in front of Calgary, did win their game 2, then won again on Sunday night to take a 2-1 lead.\n\nThree hours up the highway from Calgary, Edmonton's fanbase is going nuts, the entire city has turned orange. It's bedlam and in a good way. Meanwhile, the Flames return to what's now the second-oldest arena in the NHL, and while there is plenty of colour in our city too -- most of the red today is people's faces. So much anger. So much frustration.\n\nLosing in the first round will sting a lot less for the underdog Flames if the favourite Oilers lose too, but we'll have to wait and see on that -- and I have my doubts it will happen. If Edmonton gets on a roll, expect the C of Red in Calgary to really grow, and I'm not talking about the size of the crowd at the Saddledome.\n\n16. The Runt of Canada's Litter - Not only did Edmonton win, but so did Ottawa, Toronto and Montreal -- all of them overcoming a 1-0 deficit. Of Canada's post-season participants, only the Flames are heading to game 3 down 2-0 in the series and that must drive the front office crazy.\n \nTreliving can see the hype going on in Alberta's provincial capital, out East with the Maple Leafs as they arrive home, the exhileration in Montreal with the Habs surging in front 2-1 in its series.\n   \nWhen you see the impact those game 2 (and game 3) wins have had in those markets, on those teams, you yearn to keep up with them and do the same. Failing to do so must leave a pit in his stomach. Instead of a jubilant Sunday in Calgary, a real buzz around town, there's a lot of anger and frustration. You know what sells tickets, jersey and merchandise? Not that.\n\n17. So Many Blown Opportunities to End 'It' - Despite how often they adamantly say they don't pay attention to the streak and to them, it's just a another game against Anaheim, I don't believe it.\n\nIf you're a player, how can you not wonder to yourself what it's going to take to win there. Going back to the last regular season game in Honda Center in which they dominated and took a lead in the first period, that's three times in a span of 12 days they've had a great opportunity to win there and remove that oversized mental baggage, and each time they've blown it.\n\nSo often, teams talk about confidence and players talk about confidence and they always emphasize how important it is. Well, how can this team have any confidence whatsoever that they're going to win in a building they've lost in 29 times in a row? They say they're not thinking about it and while that's the correct and expected answer publicly, I call bull shit. Until they win there, it will always be a distraction no matter how vehemently the players try to deny it.\n\n18. That Line Change - Yes, it happened two nights ago but that dreadful wholesale line change by the Bennett-Versteeg-Chiasson line and Bartkowski-Engelland D pairing that cost the Flames the lead in game 1, it must still stick in the craw of the GM. Heck, it will be an agonizing memory 20 years from now.\n\n19. Wrong Guy Shooting - One of the attributes we heard about Stone when he arrived a couple weeks prior to the trade deadline was he had a heavy shot. Reportedly, he can really rip a slapshot. I say \"reportedly\" in that we've rarely seen it. Too often, it ends up being Brodie taking the shots and that's definitely not his forte.\n\nBy all means, make No. 7 the quarterback on the power play. Let Brodie be the puck mover on that pairing that heads up ice with the puck, but when you do get set-up at five-on-five in their zone, it should be Brodie getting it to Stone, not vice versa. Brodie's shots are like a guy flinging a frisbee and Gibson, who looks like a guy that has spent time catching frisbees on So-Cal beaches, is having little trouble repelling them.\n\nLast year in Arizona when Stone had a solid season, he averaged nearly three minutes per game on the power play. In his 21 games with Calgary, he's played a little over six minutes total on the man advantage. It's too late in the season to change the power play but having a guy that can bomb a shot from the blue line -- like Al MacInnis in the glory days -- is an ingredient absent from that first power play unit.\n\n20. Tkachuk Double Minor - It didn't hurt the team. In fact, it ultimately ended up helping them.\n\nTkachuk's double-minor for accidentally high-sticking Patrick Eaves in the beard put the Flames down a man with two minutes to go in the first period of a game they already trailed 2-0. Instead, Backlund's shorthanded goal 22 seconds into the penalty started Calgary's comeback.\n\nYet, it still had to irritate Treliving that a four-minute high-sticking call was given instead of a two-minute penalty. There was no blood, it was accidental and it's not like Eaves was injured. Heck, he remained on the ice to start the power play. Didn't even miss a shift. That's got to be irritating.\n\n21. Squandered Comebacks - Despite everything they're up against -- that building, playing a very good team that has won the Pacific Division five years in a row, falling behind each game to a team that during the regular season was 33-7-5 -- 7th best in the NHL -- when scoring first, the Flames deserve full credit for each time, staying the course and eventually erasing their early deficit.\n\nIn game 1, it was overcoming a 1-0 hole just 52 seconds in. In game 2, it was rallying back from a 2-0 deficit less than seven minutes in.\n\nBut the kick to the groin is that in both instances, all that work in battling back, all that energy expelled, all went for naught as after getting the game back to even or even briefly taking the lead in game 1, they gave it away again.\n\nThe worst part, they served Anaheim the knock-out blows on a platter on both nights. A bad line change and that unnecessary goaltender interference penalty by Bouma in game 1. An ill-timed penalty by Hamilton in game 2. Just like that, they were chasing the game again and you're only going to come back against a tough team like Anaheim so often.\n\n22. Can't Win the Opening 40 Minutes - The Flames don't even have to win a three-period game. They've shown all season that they just need to win the first two periods. That's it.\n\nIt's like Calgary has Mariano Rivera in the bullpen yet he's out there doing nothing but eating sunflower seeds so far because the team can't get him a lead.\n\nNo team in the regular season was better at locking down a lead after two periods than the Flames, who went 33-0-1 in that scenario for a .971 winning percentage. The one overtime loss was in the third game of the season. After that, they successfully converted 33 second period leads in a row.\n\nBut this series, bad starts have been costly as it's resulted in them chasing a deficit, not protecting a lead. In game 1, they trailed 3-2 after two periods. Despite opportunities to take the lead on Saturday, it was 2-2 after 40 minutes.\n\n23. Schooled at the Dot - Not only have they been chasing the game, they've also been chasing the puck. After two games, the Flames have the worst face-off percentage in the playoffs at 39.0 percent. Most of the time it goes like this: Puck is down, Ducks have it, Calgary is forced to defend.\n   \nNot a single Ducks player is below 50 percent:\nWagner, 8-3, 72.7% Getzlaf, 24-10, 70.6% Vermette, 19-13, 59.4% Thompson, 11-8, 57.9% Kesler, 25-21, 54.4% As you might expect, not one Flames player is above 50 percent:\nBrouwer, 7-9, 43.8% Bennett, 10-15, 40.0% Backlund, 18-29, 38.3% Monahan, 13-21, 38.2% Stajan, 6-12, 33.3% \nBrouwer's odd presence at the top of Calgary's list speaks to why he's still the guy on the power play over Ferland. As a right-shot, he's fared the best of any Flames center against the Ducks predominantly-right group of pivots. It's like a baseball match-up, only the opposite. If you're not having success lefty versus righty, try righty versus righty.\n\nIt raises the question of how can you get better in this area? Does the centre need to go for a tie-up and you ask for more from your wingers? It's an area that is hurting Calgary and they need to find a way of being better in this area.\n\n24. Can't Take Advantage of Depleted Ducks Blue Line - Nearly $16 million worth of defencemen were missing from Anaheim's blue line in game 2. Wow.\n\nNever mind the $7 million absent in Simon Despres and Clayton Stoner , both on LTIR, the Ducks were missing an additional $8.9 million worth of experience from the back end on Saturday night with Sami Vatanen (upper body) a late scratch, joining the already-injured Cam Fowler (lower body). That's two of their top three players in ice time this season M.I.A.\n\nYet with 21-year-old Shea Theodore in the line-up and logging 20-plus minutes, 29-year-old journeyman Korbinian Holzer pressed into action, Calgary still could not take advantage. Lindholm played over 26 minutes to anchor the blue line and they got enough out of aging Kevin Bieksa , young  Brandon Montour and just-getting-going  Josh Manson .\n\nA big-time wasted opportunity.\n\n25. Bouma Simply Cannot Score - You know Treliving has learned from the Bouma situation two summers ago, not to overpay for one-hit wonders. You saw that in the treatment of Joe Colborne last off-season.\n\nBut again, that doesn't make it any easier to accept.\n\nThis is guy making north of $2 million who simply has lost his scoring touch altogether. Did he ever have a scoring touch to begin with? That's the key question and it's looking increasingly like the answer is probably not and that's at the root of this.\n\nBecause the Flames' chances of winning would go up if he could finish off some of the chances he gets.\n   \nIn the second period, shortly after Monahan had tied it 2-2, Bouma gets the puck in a scramble with Gibson down and out in the crease. Just roof it, or even elevate it at all and the Flames lead.\n\nInstead, he shovels it into Gibson's glove.\n\nIn another chance, Brouwer's hot shot isn't handled by Gibson but the rebound goes right past Bouma as he heads to the net. Had he anticipated the rebound better, stick down and ready, maybe he buries it instead.\n\nBouma's been fine as a fourth liner but that would be if he was making $750,000. At the freight he's earning, you need more. Still one more year to go on that deal also.\n\n26. General Player Usage - As much as the fourth line was bringing energy and all that, there was still far too much of that line in a must-win game.\n\nThey're rarely going to score. It's time to ride your horses that have and will . Every game in this series has been gruelling, no denying that, but there's been no overtime and the team had four days off prior to the series beginning. For a guy like Backlund, he had six days off prior.\n   \nIn a must-win game like last night, don't you need to go with the core guys that got you there a bit more? That's the 3M line, that's the Monahan line. Gulutzan is using his fourth line like he's preparing for a long series but that spread-out ice time will have no long-term benefit if the Flames are swept in four games.\n\n \n27. Chasing the Game, Again  - The degree of difficulty of winning is so high when you're constantly chasing the game. Giving up the first goal of the game has been a chronic issue with this team all season and that hasn't changed in the post-season.\n\nThe Flames have shown an ability to bounce back and they settled in to the game nicely again last night, carrying the play big time after the halfway point in the first period. But they've got to find a way to be better prepared -- both as a team, and individually (i.e. Elliott), -- to get through the first 10 minutes at 0-0. Do that and the odds of winning go up exponentially.\n\n \n28. Series is Slipping Out of Your Control  - There is no doubt the Flames can outplay Anaheim in four of the next five games. They have the personnel to be able to do that. They have shown they can do that. The first two games have been that close.\n\nBu t now what they're up against is how often do you outplay a team and still lose? It happens quite a bit. Now, not only do you need to be very good, but you also have to have some luck because often, the best team doesn't always win. Calgary is in a situation where they essentially have to play four perfect games.\n \nGibson has the ability to steal a game and they can't let that happen. Getzlaf has the ability to win a game on his own and they can't let that happen.\n\nThey're going to have to play nearly flawless hockey plus get help from above to pull this series out. That's asking a lot from the hockey gods, who evidently aren't big fans of you.\n\n29. Snowing in Calgary - And after all that, with so many things to stew about, then you've got to leave the palm trees and sunshine of California and return to Calgary, where snow has covered your car while you were away.\n\nChances are, like so many of us fools, Treliving already put the snow brush in the garage too, so he's out there with his sleeve pulled down and shivering fingers, sweeping off the windshield. Lovely. Just wonderful.\n\nBy the way, have you liked  Flames From 80 Feet on Facebook  yet? Do so now! It's another way to be alerted to new Calgary stories I've written, other articles from my colleagues I enjoyed and I'll also sometimes use that space to weigh in on the news of the day. \n\n\n\n\nRecent Flames Reading: \nFive Regrets: What Flames Would Want to Do Different Next Time After Game 1 Loss  - Dissecting the five main reasons Calgary dropped the season opener. Five guys, who had they had an opportunity to do things differently, surely would have chosen to do so. (April 14, 2017) Ducks-Flames Playoff Primer: Five Compelling Battles That Could Decide the Series  - From the Flames PP versus the Ducks PK to the battle in net, to the Ducks experience at centre versus the Flames youth, five key battles to keep an eye on. (April 11, 2017) Rewind and Reflect: Revisiting my Original Eight Keys to Making the Playoffs  - In an interesting exercise, I revisited the eight factors identified as key at the start of the season. How did they turn out and did they make a difference. I evaluate each one. (April 8, 2017) It's About Time: Giordano Eagerly Ancitipates His First Playoff Action in 10 Years  - Due to being hurt twice, and once being M.I.A. in Russia, it's stunning that Mark Giordano has only played four career playoff games. He's pumped to finally play in some more. (April 1, 2017) He's Back: Now Over 200 pts, Rejuvenated Gaudreau Makes Flames a Formidable Foe  - After digging through old media guides and tattered newspapers, I do my best to put Gaudreau's season and recent stirling play into historical context. (March 27, 2017)  "}]