[{"entities": {"persons": [{"sentiment": "none", "name": "waki"}, {"sentiment": "none", "name": "shiness"}, {"sentiment": "none", "name": "kickstarter"}, {"sentiment": "none", "name": "john-paul jones"}, {"sentiment": "none", "name": "poki"}, {"sentiment": "none", "name": "enigami"}], "organizations": [{"sentiment": "none", "name": "sony"}, {"sentiment": "none", "name": "aaa"}, {"sentiment": "none", "name": "shiness"}, {"sentiment": "none", "name": "enigami"}, {"sentiment": "none", "name": "jrpg"}], "locations": [{"sentiment": "none", "name": "kayenne"}, {"sentiment": "none", "name": "shiness"}, {"sentiment": "none", "name": "poki"}, {"sentiment": "none", "name": "kingdom hearts"}]}, "text": "Shiness: The Lightning Kingdom Review - PS4 Shiness: The Lightning Kingdom Review - PS4 French studio Enigami channels classic JRPGs in this vibrant offering on PS4, PC, and Xbox One. Find out how Shiness: The Lightning Kingdom shapes up on Sony's console in our review. By John-Paul Jones on 18 April 2017 Even in its earliest released screenshots, there was something pleasantly infectious about Shiness: The Lightning Kingdom . Whether it was the retina strokingly wide gamut of colours, the fluffy protagonists or just the sheer, wide-eyed anime spectacle of it all, it was clear that indie developer Enigami was onto something rather special. Now with the finished product in our hands, it's refreshing to discover that such early promise has been delivered upon, even if the end result remains a little rough around the edges. A loving homage to the JRPGs of the past Cast as Chado and Poki, members of the Waki, which are essentially a race of bipedal dogs with extra cuteness to spare, Shiness begins with our furry heroes having crash-landed their makeshift airship into an idyllic-looking, if seemingly foreboding forest. From here, both the narrative and the world expands grandly outward as we discover that a nihilistic elemental force known as the Dark Shi has seeped into reality and it's up to our raucous duo, and the new friends that they make along the way, to put a stop to this evil before it's too late. Ostensibly, while the plot in Shiness is regurgitated JRPG fluff at its finest, there is still plenty of entertainment to be had with the cast of characters and the numerous fantastical events that unfurl around them. Most of all, the setting proves to be especially intriguing, taking place in a world that has been shattered into a series of colourful elemental islands, Shiness is certainly not lacking in imaginatively realised realms for the player to traipse about in during its substantial duration. Keeping things very much in line with its Japanese influences, cutscenes and story transitions are presented as a series of stylish animated manga panels, which also add further layers to its modish aesthetic. Beyond the obvious visual kinship with earlier titles such as Eternal Sonata , and even more recent Cyberconnect 2's Naruto Shippuden Ultimate Ninja Storm series, Shiness plays very much like a combination of the those two genre examples, meshing real-time combat and exploration with just enough depth to keep even the most stalwart JRPG veterans happy. Starting with the exploration side of things, Chado, Poki and their extended party of friends traverse the world of Shiness from the third-person, as a roving camera provides effortless control over their exploratory pursuits. Luckily, 'effortless' is just what you'll need, too, since Shiness doesn't just have the player idly wandering about, but also indulging in a touch of platforming and puzzle solving as well. A world away from the annoying, player-hostile camera seen in the Kingdom Hearts games, leaping about the place in Shiness actually proves to be both an enjoyable and easily accomplished feat as the perspective never proves to be a detriment to the on-screen section. In regards to the puzzles you'll come across, Shiness tasks the player with using the various elemental abilities of each character to solve its myriad of conundrums in a number of different ways. Chado, for example, can channel his earthly elemental powers to fashion boulders out of thin air, using them to weigh down pressure pads, while later addition to the group, Kayenne, has telekinetic powers that allow him to move particular objects into place. By themselves, these abilities are largely unremarkable and don't lend themselves to especially brain tickling problems. Later in the game however, puzzles require that the player combines all of them to proceed and in doing so makes the exploration side of Shiness far more interesting than it would otherwise be; especially when it comes to using these abilities to unearth secrets from previously missed or inaccessible areas. The elemental powers that the protagonists wield in Shiness also extends to the manner in which they use them to smack enemies in the face, too. Split between melee and ranged combat styles, each character can open up a can on their foes with the elemental masteries that they have at their disposal, with opposing elements, water against fire enemies for instance, dealing far more damage than they otherwise would. Sure enough, while it may seem like JRPG Combat 101 on the surface, there is a little more depth to it than that. First off, these ranged elemental attacks cannot be used endlessly, since each time one is used the corresponding element resource is reduced, necessitating the employ of either finite items, or, a period of meditation to replenish these powers. Where things get all 'Catch 22' however, is that while meditating you can not only still be attacked (the combat is in real-time after all), but meditation can only resupply the element you're short on if the colour of the arena you are fighting in matches it (water is blue, earth is brown/gold and so on). As such, when combat actually happens, it takes places within a dome of ever changing colours which not only acts as an indicator for replenishing your elemental powers, but also provides tangible physical boundaries to the contests of violence that unfold within it. While it's true that your elemental powers cannot be used ad infinitum, your fists and feet thankfully can and it's here that Shiness feels much more akin to the Naruto Ultimate Ninja Storm games as the player chains together combinations of flashy looking melee strikes to defeat their foe. Here, the all-important Tension meter is key to your success. Replenished by both landing attacks on your foe and getting hit by them in turn, players can time a Tension-sapping parry at the time their opponent launches an attack; either reflecting their ranged elemental attack back at them, or, leaving them open to a counter. Another use of Tension is the QTE-powered Hyper Attacks that it enables when the latter has been maxed out, allowing the player to deal considerable amounts of elemental damage, assuming the correct button commands have been inputted. Most notably, in both cases Tension encourages the player to consider tactical use of it; prioritising parries or Hyper attacks depending on the enemies that are in front of them, though fortunately only one enemy can ever attack you at a single time. Sitting atop the ranged and melee combat of Shiness is the support and mastery system, which in turn make the face-smacking portions of Enigami's inaugural effort far more deceptively deep than they initially appear, as while the player can only have one active fighter at any one time, the other members of the party can be used in support roles, either healing or buffing the active fighter accordingly. The mastery system, on the other hand, allows each member of the group to use collectible scrolls called Disciplines to specialise in a range of different elemental attacks, which not only give stat boosts and new attacks for your characters, but also provide the robust backbone to the progression system that Shiness holds at its core. A few flaws hold it back from greatness Shiness: The Lightning Kingdom then, is quite the prospect: a passionately crafted effort which manages to invigorate the action JRPG of yesteryear with surprising efficacy and a strong degree of considered quality. Unfortunately, it is however not without its fair share of flaws that keep it just shy of greatness. Of these detractions, the most obvious is that Shiness doesn't really do anything we haven't seen before. Indeed, large parts of its design crib liberally from similar titles both past and present, and while developer Enigami has made no secret of wearing such influences on its sleeve, the sum still remains a game that is far more content to look to the path that has already been trodden in lieu of striking out on new and potentially innovative ground on its own. Another issue that sticks out more than it should is the quality of the writing. While the narrative is pretty much as straightforward as you can get, of which that shouldn't be a problem by itself, the dialogue certainly leaves a lot to be desired as it frequently errs towards the overly hammy and, very occasionally, the downright cringeworthy. After all, there's only so many over-the-top dramatic laughing villain tropes you can take before your eyes roll painfully into the back of your skull. Elsewhere, while there's no doubt that Shiness boasts some great art direction and an assortment of lush, vibrant worlds for the player to navigate, it's clear that the budget the studio had (lest we forget, Shiness did begin life on Kickstarter after all), only managed to stretch so far. Built upon the distinctly wrinkly foundations of Unreal Engine 3 , Shiness has a collection of visual glitches that irritate throughout. Whether that's character models occasionally clipping through the scenery, the odd floating object that shouldn't be floating, or jerky and abrupt transitions between combat and exploration, it's clear that though Shiness punches way above its belt, it still doesn't quite boast the level of polish typified by its more expensive and more established AAA counterparts. In Summary A real callback to an earlier era where JRPG's on PlayStation weren't afraid to indulge in explosive colour palettes and equally brash doses of action spectacle, Shiness does enough right that fans of that time will find themselves well served by what developer Enigami has wrought here. Shiness: The Lightning Kingdom Review by John-Paul Jones -The Final Word- An indie adventure with far Eastern inspirations that does a great job of masquerading as a big budget spectacular, Shiness will delight those looking for a fix of action RPG goodness with one eye on the classics of yore. Colorful anime-style visuals", "ord_in_thread": 0, "language": "english", "external_links": [], "uuid": "27e297e76d61db3cb5e3f8f92f4b41fb63c391a7", "rating": null, "highlightTitle": "", "title": "Shiness: The Lightning Kingdom Review - PS4", "thread": {"country": "CA", "site": "psu.com", "replies_count": 0, "title_full": "Shiness: The Lightning Kingdom Review - PS4", "site_categories": [], "performance_score": 0, "section_title": "Latest News - PSU.com", "domain_rank": 75673, "uuid": "27e297e76d61db3cb5e3f8f92f4b41fb63c391a7", "main_image": "http://media.psu.com/media/articles/17-04-18-04-00_0_large_shiness_ps4news1.jpg", "site_type": "news", "title": "Shiness: The Lightning Kingdom Review - PS4", "spam_score": 0.0, "site_section": "http://feeds.feedburner.com/PlayStationUniverse", "url": "http://omgili.com/ri/jHIAmI4hxg8WHeI5TPDYN2qZGvySVynOXmXrc26v._PaWD9UdD_.fn0gVQJe87gS5LNHjzw9iumAwFIOeDYqwxAovYG88yVGoV6_N00fQB4-", "participants_count": 0, "site_full": "www.psu.com", "social": {"linkedin": {"shares": 0}, "vk": {"shares": 0}, "facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "stumbledupon": {"shares": 0}, "pinterest": {"shares": 0}}, "published": "2017-04-18T11:25:26.000+03:00"}, "crawled": "2017-04-18T11:25:26.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg8WHeI5TPDYN2qZGvySVynOXmXrc26v._PaWD9UdD_.fn0gVQJe87gS5LNHjzw9iumAwFIOeDYqwxAovYG88yVGoV6_N00fQB4-", "highlightText": "", "published": "2017-04-18T11:25:26.000+03:00", "author": ""}]