[{"thread": {"domain_rank": null, "replies_count": 0, "url": "http://omgili.com/ri/.wHSUbtEfZRBhehhEp6TO8qbyNx3KrAZhgNabgNweT8OSxW6QRP4vs0PUkOLfNrlxeRqxgykEuc-", "title": "Vi-Slim Metab Awake", "site_type": "blogs", "social": {"pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"comments": 0, "shares": 0, "likes": 0}}, "site_section": "http://www.dietpillswatchdog.com/feed", "spam_score": 0.0, "section_title": "Diet Pills Watchdog", "site": "dietpillswatchdog.com", "site_full": "www.dietpillswatchdog.com", "performance_score": 0, "uuid": "4cbf0abeb1c792cbf27d39174f6436be2374ebb9", "published": "2017-04-17T11:27:05.000+03:00", "site_categories": [], "country": "CA", "title_full": "Vi-Slim Metab Awake", "participants_count": 1, "main_image": "https://dpwd2-watchdogreviews.netdna-ssl.com/wp-content/uploads/2017/04/Vi-Slim-Metab-Awake.jpeg"}, "url": "http://omgili.com/ri/.wHSUbtEfZRBhehhEp6TO8qbyNx3KrAZhgNabgNweT8OSxW6QRP4vs0PUkOLfNrlxeRqxgykEuc-", "title": "Vi-Slim Metab Awake", "highlightTitle": "", "external_links": [], "crawled": "2017-04-17T11:27:05.000+03:00", "language": "english", "entities": {"locations": [{"name": "usa", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "persons": [{"name": "vi-slim", "sentiment": "none"}, {"name": "rachel butler  rachel", "sentiment": "none"}, {"name": "rachel", "sentiment": "none"}, {"name": "evodia", "sentiment": "none"}], "organizations": [{"name": "buy vi-slim metab awake review  vi-slim metab awake", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "southern investigative reporting foundation", "sentiment": "none"}, {"name": "yerba mate", "sentiment": "none"}]}, "rating": null, "highlightText": "", "ord_in_thread": 0, "uuid": "4cbf0abeb1c792cbf27d39174f6436be2374ebb9", "published": "2017-04-17T11:27:05.000+03:00", "author": "Rachel", "text": "Where to Buy Vi-Slim Metab Awake Review \nVi-Slim Metab Awake is a metabolism boosting weight loss aid that contains several ingredients that are natural sources of caffeine. It is intended to be used alongside other products from the ViSalus range, including meal replacement shakes. Vi-Slim Metab Awake Facts 30 capsules per bottle Contains unknown quantity of caffeine \nVi-Slim Metab Awake is manufactured by ViSalus, a Multi-Level Marketing company who are based in the USA. The company can be contacted using the information found on their official website. Customers are likely to be encouraged to contact their own distributer to deal with any issues first, rather than being able to deal with customer service directly. How to Take Vi-Slim Metab Awake \nThe directions for use (according to one distributer) are as follows: “Take 1 to 2 tablets, once to twice per day. Do not exceed 4 tablets per day. Taking more than the maximum will not add additional benefits. If you experience gas, or stomach rumbling, this is normal. However, if you want, you can build up to the 4 tablets per day starting with 1 tablet twice per day for a week, then moving to 4 tablets.” \nViSalus state that their mission is “Taking the weight off the world one person at a time. 10 lbs. at a time.” They add, “With good nutrition as our foundation and a powerful social network as our mobilizer, we’re committed to working together, as a company and a community, to provide a real solution to the global obesity epidemic.” \nSouthern Investigative Reporting Foundation investigated ViSalus and their business model, concluding that there was a high probability that investors will lose their money in the distributer scheme. Vi-Slim Metab Awake Concerns: Conflicting information about returns policy Expensive supplement! Multi-level marketing company No individual ingredient quantities provided \nAt the time of writing, there were large sections of the ViSalus website (visalus.com and vi.com) that were not working, either leading to an error notice, or redirecting to a completely unrelated website’s error page. What Does Vi-Slim Metab Awake Claim To Do? \nThe manufacturers of Vi-Slim Metab Awake describe their supplement and its supposed benefits as follows: \nHelp boost your metabolism with Vi-Slim. Our proprietary formula was designed to aid your body in metabolizing fats and carbs. Combined with a healthy diet and exercise, Vi-Slim helps support the body’s fat-burning process and may help promote lean muscle mass with no added caffeine. \nVi-Slim is a blend of herbs, some of which have been used for thousands of years, as well as Chromium and Cocoa extract—all of this in one tablet (taken once a day) to help support metabolism, and help maintain healthy blood sugar levels already within normal range. Does Vi-Slim Metab Awake Work? \nThere is clinical evidence to support the use of yerba mate and green tea to boost calorie burn (through both an increased metabolic rate and increased thermogenesis) and to aid with a small increase in the consumer’s rate of weight loss. \nHowever, Evodia reduces the effectiveness of caffeine; whilst this lowers the chances of side effects from the caffeine content, it also reduces the effectiveness of the product. The manufacturers also fail to state how much caffeine can be found in each tablet of Vi-Slim Metab Awake. \nOverall, we believe that Vi-Slim Metab Awake is a mild weight loss aid at best; its effects would be completely and easily counteracted by overeating. What Are The Ingredients of Vi-Slim Metab Awake? \nThe ingredients found in Vi-Slim Metab Awake are detailed below. No individual ingredient quantities are provided as the product consists of a proprietary formula. Each capsules contains 450 mg of the proprietary formula. \nHerbal Blend 450 mg Cocoa Extract (Theobroma Cacao) (Fruit): Theobroma Cacao contains a mild stimulant called Theobromine. Theobromine is thought to be a much milder stimulant than caffeine, and is unlikely to have any significant impact upon weight loss. Source: http://en.wikipedia.org/wiki/Theobromine Green Tea Extract (Camellia Sinensis) (Leaf): Green tea is high in a group of antioxidants called catechins, as well as being a natural source of caffeine. Studies have suggested that catechins increase thermogenesis in the body, whilst caffeine increases energy expenditure by boosting the metabolism slightly for few hours. Source: http://ajcn.nutrition.org/content/70/6/1040.full Coleus Extract (Coleus Forskohlii) (Leaf): A plant belonging to the mint family that is thought to boost the metabolism. However, the clinical trials performed using this ingredient have shown no weight loss, even when the participants’ lean muscle mass increased and fat mass decreased. Source: http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2129145/ Yerba Mate Extract (Ilex Paraguariensis) (Leaf): There is diverse clinical evidence to support the use of this plant for weight loss, as it stimulates the central nervous system and increases the metabolic rate. It is also a source of caffeine, and so should increase energy levels. Read our full investigation for more information. Source: http://www.dietpillswatchdog.com/does-yerba-mate-work-yes-it-does/ Evodiamine Extract (Evodia Fructus) (Fruit): Evodiamine is extracted from a plant called Evodia. Evodia is thought by some to be a thermogenic weight loss aid. Clinical evidence is sparse, and no research has been conducted in humans. Studies in rats also show that it reduces the effectiveness of caffeine, and causes caffeine to break down much quicker. Does Vi-Slim Metab Awake Have Any Side Effects? \nThere are several ingredients found in Vi-Slim Metab Awake that could cause a range of side effects. \nGreen Tea and Yerba Mate are both sources of naturally occurring caffeine, but the amount of caffeine found in each tablet of Vi-Slim Metab Awake is not revealed by the manufacturer. Side effects associated with caffeine include headaches, increased urination, jitteriness, dehydration, increased blood pressure, heart palpitations and problems sleeping. Green tea can also cause constipation. \nTheobroma Cacao is similar in structure to caffeine, but is not as strong; it might cause similar side effects to caffeine. \nEvodiamine is under-researched, but appears to slow down blood clotting, and so should not be taken in the two weeks before surgery, or whilst recovering from surgery. As it also appears to cause caffeine to break down in the body faster, it could shorten the period of time that caffeine is effective in the body, and help to minimize the effects of caffeine (especially interrupted sleep patterns from taking it too late at night). \nCaution: Not suitable for pregnant or breastfeeding women. Not suitable for anyone under the age of 18. Stop taking this supplement at least two weeks before any scheduled surgery. Not suitable for anyone who is sensitive to caffeine and other stimulant ingredients. Not suitable for anyone with cardiac-related health issues, including but not limited to high blood pressure. Are There Any Customer Reviews For Vi-Slim Metab Awake? \nThere are numerous customer reviews for this product on Amazon, where the product is sold. Customer reviews are mixed, but well over half of the reviews are positive. Two different reviewers claimed that they received bottles that only contained 15/16 capsules instead of the 30 advertised. \nI have tried so many pills before to help with my appetite and metabolism and I have to say that this product is amazing. One it’s affordable. Two there is no jitters or side effects. Three it curves your cravings and when you do eat you get full quicker! Four you only have to take it once a day. I would definitely recommend this product to someone who suffers from consuming a lot of food daily and has a slow metabolism. \nIt was okay?? The weight didn’t fall off, and I exercised for two weeks in the morning after taking this. I combined it with the vi-shape and saw little to no results. Maybe a pound or two, but nothing like what the reviews had said. Maybe a stricter diet plan would work, but this didn’t do anything and I only have a few pills left. \nI could tell no difference. No added energy. No weight loss. I even bought another bottle thinking that maybe I just needed to give it more time. I’m half way finished with the second bottle and still have seen no results. \nThe product is a total waste of money. Fat burner what a joke. The only way to lose weight is to step back from the table, watch your calorie intake and exercise. I repeat exercise There are no quick fixes. \nSaw no change in energy or metabolism. As far as I’m concerned, it was money wasted. Will not purchase it again. \nThis is great and works well with the shake. Lost weight, nails are hard and strong. Losing and feeling fabulous. Does Vi-Slim Metab Awake Offer a Money-Back Guarantee? \nAlthough ViSalus claim to offer a 90 day money back guarantee, their terms and conditions suggest that Vi-Slim Metab Awake is not covered by this guarantee. Instead, orders made through ViSalus distributers are covered by the returns policy below: \nViSalus stands behind all of its product offerings and will accept a return of products that are not to our customer’s satisfaction including products which the customer cannot utilize due to medical reasons using the following guidelines: \n1. Exchanges for the same product will be made for products that may have been damaged in transit. 2. Products which have been purchased for the first time and don’t meet our customer’s satisfaction can be returned within 30 days of delivery for a full refund less shipping and handling. 3. Returns of all other product must be made within 30 days of delivery of product orders in order to receive a refund for the value of the saleable product returned. 4. Returns of all salable products made more than 30 days from the delivery date will be eligible for product credit towards other ViSalus products and are subject to a 10% restocking fee. 5. Packages returned due to unsuccessful deliveries (i.e. 3 delivery attempts, customer moved, customer gave incorrect or incomplete address) may be subject to additional shipping and handling charges to have the product resent. 6. Commissions of any type that are paid to Distributors on products that are ultimately returned to ViSalus for refund will be deducted from future Commission payments. \nThe returns policies of third party retailers, such as Amazon, may vary. Where Can I Buy Vi-Slim Metab Awake? \nThere are numerous distributor websites where customers can purchase this supplement. The product is also available direct from distributors who may not have websites. One online distributor sells a single bottle of Vi-Slim Metab Awake for $63.99 through the sampletheshakes.com. Delivery charges also apply. Customers can choose between an auto-ship option that delivers a new order monthly, or can order a one-time delivery. \nVi-Slim Metab Awake can be purchased from Amazon. A single bottle containing 30 tablets costs $39.99, with free standard shipping. Customers who have Amazon Prime can get free two day shipping on their order. #1 Consumer Choice 2017: Phentaslim Phentaslim \nThousands of customers have cut the fat with this fast and powerful thermogenic fat burner. Can suppress appetite, boost energy levels and elevate mood without the jitters. Over 100,000 satisfied customers Manufactured in a GMP facility 60-day money-back guarantee < Click here to Read our Full Review > \nAbout the Author: Rachel Butler \nRachel likes getting to the bottom of everything that is put in front of her, which comes from her background in law. Whenever there is anything tricky to look at, Rachel is always the first port of call. \nHer weekends are spent either cycling or walking, then topped off by indulging her love of chocolate as a reward for her hard work. \nDisclaimer: Our reviews and investigations are based on extensive research from the information publicly available to us and consumers at the time of first publishing the post. Information is based on our personal opinion and whilst we endeavour to ensure information is up-to-date, manufacturers do from time to time change their products and future research may disagree with our findings. If you feel any of the information is inaccurate, please contact us and we will review the information provided. Leave a Reply Your email address will not be published. Required fields are marked * Comment"}]