[{"uuid": "5ded9ef321d984ce527a469a09a0922ce34064f7", "url": "http://omgili.com/ri/jHIAmI4hxg9HmE2nZSOF8wm0limXahF8ycjlkYUhPv7iLMdvzyPI_et9s4LmfXAV2Kq.9lHh2dngJoPp3rhAj1ibMFIj5hMcSMSox8A44L7ChMe7FMX_mr_EEFAzHuIN", "title": "Niagara College to sell Niagara Falls campus", "author": "", "rating": null, "published": "2017-04-18T23:24:13.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "edt pm niagara college", "sentiment": "none"}, {"name": "niagara college", "sentiment": "none"}, {"name": "niagara falls", "sentiment": "none"}, {"name": "niagara falls review", "sentiment": "none"}, {"name": "ryerson university", "sentiment": "none"}], "locations": [{"name": "niagara-on-the-lake", "sentiment": "none"}, {"name": "welland", "sentiment": "none"}, {"name": "niagara falls", "sentiment": "none"}, {"name": "dunn street", "sentiment": "none"}], "persons": [{"name": "john law", "sentiment": "none"}, {"name": "diodati", "sentiment": "none"}, {"name": "susan mcconnell", "sentiment": "none"}, {"name": "serge felicetti", "sentiment": "none"}, {"name": "jim diodati", "sentiment": "none"}, {"name": "patterson", "sentiment": "none"}, {"name": "ken todd", "sentiment": "none"}, {"name": "dan patterson", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "5ded9ef321d984ce527a469a09a0922ce34064f7", "url": "http://omgili.com/ri/jHIAmI4hxg9HmE2nZSOF8wm0limXahF8ycjlkYUhPv7iLMdvzyPI_et9s4LmfXAV2Kq.9lHh2dngJoPp3rhAj1ibMFIj5hMcSMSox8A44L7ChMe7FMX_mr_EEFAzHuIN", "site_full": "www.niagarafallsreview.ca", "title": "Niagara College to sell Niagara Falls campus", "site_section": "http://www.stcatharinesstandard.ca/rss.xml", "domain_rank": null, "published": "2017-04-18T23:24:13.000+03:00", "title_full": "Niagara College to sell Niagara Falls campus", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "Home Stories", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "CA", "performance_score": 0, "main_image": "http://storage.stcatharinesstandard.ca/v1/dynamic_resize/sws_path/suns-prod-images/1297946441458_ORIGINAL.jpg?quality=80&size=320x&stmp=1492542727571", "site": "niagarafallsreview.ca"}, "external_links": [], "language": "english", "text": "\nBy John Law , Niagara Falls Review Tuesday, April 18, 2017 4:21:51 EDT PM Niagara College will close and sell its Niagara Falls campus on Dunn Street once current classes are complete. PHOTO: Harley Davidson / Special to Niagara Falls Review Change text size for the story Print \nReport an error \nNiagara College has announced it will be selling its Niagara Falls property and moving its programs to the Welland and Niagara-on-the-Lake campuses. \nIn a release issued Tuesday, college president Dan Patterson said the decision coincides with $65 million in redevelopment projects slated for the Welland and Niagara-on-the-Lake locations. \n“We felt the timing is right for this move,” he said. “This creates an opportunity to move the programs that operated in Niagara Falls to the Welland and Niagara-on-the-Lake campuses, while providing the best possible facilities for teaching and learning. \n“While this decision is driven primarily by our commitment to our students, it also makes financial sense at a time when sound fiscal management is more important than ever. Especially as new and improved spaces become available at our full-service Welland and Niagara-on-the-Lake campuses.” \nThe Niagara Falls campus on Dunn Street was home to hairstyling, hospitality and tourism management, and international business management programs. It has about 70 students and 30 staff. \nNiagara College media adviser Susan McConnell said current classes will not be interrupted. \n“The closure’s going to happen when the classes are finished, and it’s a one-year program. So we’re not moving anybody in the middle of a program.” \nIn an e-mail to Niagara Falls Mayor Jim Diodati sent Monday, Patterson said no jobs will be affected by the decision. \nDiodati said he was told of the college’s decision during a meeting with Niagara College April 7, along with Chief Administrative Officer Ken Todd and Director of Business Development Serge Felicetti. He shared the news in an e-mail to councillors Tuesday morning. \n“Even with this news, I want to let you know that our discussion focused on keeping connected with Niagara College and including Niagara Falls in the college’s future plans, but in a more meaningful way than in the past,” he wrote. \nHe also urged the college to “reinvest” the sale of the property back into Niagara Falls. \nWhen reached Tuesday, Diodati said the college would continue discussing ways to partner with the city’s plans for a downtown education incubator and business hub. \n“We want to create an educational concept that commercializes/supports entrepreneurial ideas, that will lead to a concept of creating jobs and attracting investment,” he said. \nHe maintains that plans for a Ryerson University presence downtown are still alive, despite the university’s proposal for federal grant funding being turned down last year. \n", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:13.000+03:00"}]