[{"uuid": "628786c9819692f375b52cd98a97b9df62e6f4e6", "url": "http://omgili.com/ri/jHIAmI4hxg.87ohzHzuPF5JUjseHnBTJLp0fEy7O9.ouqCW91yh._FXVn2usd.5cGM7oLQCbP64-", "title": "Brian Boynton, Counselor to Obama Administration Attorney General, Joins WilmerHale", "author": "", "rating": null, "published": "2017-04-17T22:56:00.000+03:00", "highlightText": "", "entities": {"organizations": [], "locations": [], "persons": []}, "highlightTitle": "", "thread": {"uuid": "628786c9819692f375b52cd98a97b9df62e6f4e6", "url": "http://omgili.com/ri/jHIAmI4hxg.87ohzHzuPF5JUjseHnBTJLp0fEy7O9.ouqCW91yh._FXVn2usd.5cGM7oLQCbP64-", "site_full": "www.marketwired.com", "title": "Brian Boynton, Counselor to Obama Administration Attorney General, Joins WilmerHale", "site_section": "http://feeds.mwnewsroom.com/fb/MW-Washington--1-/rss", "domain_rank": 21499, "published": "2017-04-17T22:56:00.000+03:00", "title_full": "Brian Boynton, Counselor to Obama Administration Attorney General, Joins WilmerHale", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "MW-Washington", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "CA", "performance_score": 0, "main_image": "http://www.marketwire.com/library/MwGo/2017/4/17/11G135971/WilmerHale_Color_Logo-ee9e09c31e7cbb829d5cd1e25fbe0b11.jpg", "site": "marketwired.com"}, "external_links": [], "language": "english", "text": "April 17, 2017 10:56 ET Brian Boynton, Counselor to Obama Administration Attorney General, Joins WilmerHale \nWASHINGTON, DC --(Marketwired - April 17, 2017) - WilmerHale is pleased to announce that Brian Boynton has returned to the firm as a partner following his service in the U.S. Department of Justice. \nMr. Boynton will be a member of the firm's Government and Regulatory Litigation Group and will be based in Washington, D.C. \nUntil earlier this year, Mr. Boynton served as a counselor to Attorney General Loretta Lynch. In that role, he helped the attorney general oversee the department's vast legal portfolio, including civil and Supreme Court litigation, antitrust and immigration matters, and litigation involving financial institutions. \nHe was involved in coordinating the Civil Division's defense of some of the most high-profile and significant matters before the department, including challenges to the Affordable Care Act, the Obama administration's immigration actions, agency guidance relating to gender identity discrimination and other administrative agency actions. \nBefore his role as a counselor to the attorney general, Mr. Boynton was a deputy assistant attorney general in the Office of Legal Counsel, the federal post he assumed when he left the WilmerHale partnership in 2014. At the OLC, Mr. Boynton provided advice to the White House and Executive Branch agencies on a wide range of complex constitutional, statutory and administrative law questions, and he was one of the leaders of the team that analyzed the constitutionality of proposed and enacted legislation. \n\"We enthusiastically welcome Brian back to the firm,\" said Robert Novick, a WilmerHale co-managing partner. \"During his previous time at WilmerHale, Brian earned a well-deserved reputation for his exceptional judgment and analytical ability. He is a versatile and superb litigator -- a brilliant lawyer who will serve clients across a wide range of areas, including the Administrative Procedure Act, breach of contract, antitrust, the False Claims Act, lending discrimination, the Lanham Act and electronic surveillance matters. He's not only a great lawyer but an outstanding colleague and mentor as well.\" \nOf his return to the firm, Mr. Boynton said, \"I am thrilled to be back at WilmerHale. I greatly value the firm's collegiality, respect for public service, commitment to providing exceptional client service and desire to take on the most complex and challenging matters. I very much look forward to working with this extraordinary group of lawyers and colleagues.\" \nMr. Boynton graduated summa cum laude from Dartmouth College in 1997 with a degree in economics. In 2000, he graduated Order of the Coif from Stanford Law School, where he was a notes editor of the Stanford Law Review. Before joining WilmerHale in 2002, Mr. Boynton served as a law clerk to then-Chief Judge Douglas Ginsburg of the United States Court of Appeals for the D.C. Circuit and to Judge Vaughn Walker of the United States District Court for the Northern District of California. \nAbout Wilmer Cutler Pickering Hale and Dorr LLP \nWilmerHale provides legal representation across a comprehensive range of practice areas that are critical to the success of its clients. The law firm's leading Intellectual Property, Litigation/Controversy, Regulatory and Government Affairs, Securities, and Transactional Departments participate in some of the highest-profile legal and policy matters. With a staunch commitment to public service, the firm is renowned as a leader in pro bono representation. WilmerHale is 1,000 lawyers strong with 12 offices in the United States, Europe and Asia. For more information, please visit www.wilmerhale.com .", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:43.000+03:00"}]