[{"uuid": "c7aa8ab52a41c3e4e8702a20781c75603c485ead", "url": "http://omgili.com/ri/jHIAmI4hxg9HmE2nZSOF8wm0limXahF8ycjlkYUhPv7iLMdvzyPI_et9s4LmfXAV50c2KVECgYon8TE.gfpjLGJPonDj0SsEwuB9fVyRapfxBMk3VTREExx4PcpNF_kys5Ezhga9m_U-", "title": "Niagara home prices see significant first-quarter growth", "author": "", "rating": null, "published": "2017-04-18T23:24:08.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "niagara falls review", "sentiment": "none"}, {"name": "royal lepage", "sentiment": "none"}, {"name": "greater toronto area", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "atlantic canada", "sentiment": "none"}, {"name": "alberta", "sentiment": "none"}, {"name": "windsor", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "quebec", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "oshawa", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "niagara", "sentiment": "none"}, {"name": "st. catharines", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "golden horseshoe", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "persons": [{"name": "ray spiteri", "sentiment": "none"}, {"name": "brad johnstone", "sentiment": "none"}, {"name": "phil soper", "sentiment": "none"}, {"name": "royal lepage", "sentiment": "none"}, {"name": "soper", "sentiment": "none"}, {"name": "barrie", "sentiment": "none"}, {"name": "johnstone", "sentiment": "none"}, {"name": "lepage", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "c7aa8ab52a41c3e4e8702a20781c75603c485ead", "url": "http://omgili.com/ri/jHIAmI4hxg9HmE2nZSOF8wm0limXahF8ycjlkYUhPv7iLMdvzyPI_et9s4LmfXAV50c2KVECgYon8TE.gfpjLGJPonDj0SsEwuB9fVyRapfxBMk3VTREExx4PcpNF_kys5Ezhga9m_U-", "site_full": "www.niagarafallsreview.ca", "title": "Niagara home prices see significant first-quarter growth", "site_section": "http://www.stcatharinesstandard.ca/rss.xml", "domain_rank": null, "published": "2017-04-18T23:24:08.000+03:00", "title_full": "Niagara home prices see significant first-quarter growth", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "Home Stories", "site_type": "news", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "CA", "performance_score": 0, "main_image": "http://storage.stcatharinesstandard.ca/v1/dynamic_resize/sws_path/suns-prod-images/1297946463929_ORIGINAL.jpg?quality=80&size=320x&stmp=1492546433555", "site": "niagarafallsreview.ca"}, "external_links": [], "language": "english", "text": "\nBy Ray Spiteri , Niagara Falls Review Tuesday, April 18, 2017 4:13:52 EDT PM According to the Royal LePage house price survey released Tuesday, April 18, 2017, the aggregate price of a home in the Niagara region grew significantly in the first quarter of 2017, rising by 15.7 per cent year-over-year to $326,545. (HARLEY DAVIDSON/SPECIAL TO THE REVIEW/POSTMEDIA NETWORK) Change text size for the story Print \nReport an error \nHome prices in the Niagara region saw double-digit growth in the first quarter of 2017, according to a house price survey released Tuesday by Royal LePage. The survey found the aggregate price of a home in the region rose by 15.7 per cent year-over-year to $326,545. When broken out by housing type, the median price of a two-storey home and bungalow climbed 14.4 per cent and 17.5 per cent year-over-year to $344,929 and $304,739, respectively.“Prospective homeowners increasingly flocked to Niagara and St. Catharines during the first quarter, placing significant upward pressure on house prices within the region,” said Brad Johnstone, broker of record for Royal LePage’s Niagara real estate centre.“The region’s affordability and high quality of life has attracted a great deal of attention from young families and first-time buyers in particular, who have been priced out of many other markets across southern Ontario.” He said Niagara has been growing for the last 10 years, but not to this extent.“Obviously we’ve got lots of exposure and we’re closing that gap on other markets, sort of that one-hour drive to (Greater Toronto Area), if you will. You look at Barrie, Kitchener-Waterloo, London and Oshawa, those markets still continue to have typically a higher average sale price than we do, but we’re closing the gap drastically.” Johnstone said a lot of sellers are adjusting to the market.“They’re saying I used to list my house and you’d get me an offer, and then we would go and look, and we’re actually recommending now that we go out and find the house and buy it first, and then we list theirs because it’s such a sellers market that buyers are at sort of the seller’s whim.” He said investors and retirees from across the province and abroad are also purchasing property in Niagara due to its close proximity to the GTA.“The region’s supply simply isn’t built to handle this amount of demand.” But Johnstone said unlike some areas throughout Ontario that are “land squeezed,” there’s available land in Niagara.“Our builders are stepping up,” he said, adding he recently spoke to a company that does a lot of foundation work that have had to add three more crews just to keep up with new home construction.“Niagara builders … build a great product. They’re not builders that build to code, they build really great product, and a lot of them are selling out. I think you’d be hard pressed to find a new home that you could close on in 2017 right now.” Nationally, Canada’s residential real-estate market also saw substantial price growth in the first quarter of 2017, increasing 12.6 per cent year-over-year to $574,103. The price of a two-storey home rose 13.9 per cent year-over-year to $681,728, and the price of a bungalow increased 11 per cent to $490,018. During the same period, the price of a condominium increased 8.9 per cent to $372,638. While the majority of housing markets in Canada posted modest gains, price appreciation across much of Ontario significantly outpaced the rest of the country. Meanwhile, the pace of year-over-year home-price appreciation in greater Vancouver was noticeably lower than the historic highs seen in 2016.“For the first time in several years, real-estate markets in Vancouver and Toronto are headed in opposite directions,” said Phil Soper, Royal LePage’s president and chief executive officer.“The Vancouver market stalled, as confused consumers took to the sidelines after a series of uncoordinated moves by all three levels of government. With its housing shortage becoming more acute, Toronto easily stepped forward to assume the title of Canada’s most overheated real-estate market.” Significant home-price appreciation, caused by market dynamics similar to those that have driven housing activity in the GTA, is being seen across the entire Golden Horseshoe region of south-central Ontario, and as far away as Windsor and London in southwestern Ontario. The torrid pace of home-price appreciation in much of Ontario contributed almost half of the national aggregate home-price increase in the first quarter, with the rest of Canadian appreciating by a healthy, but much lower, 6.4 per cent year-over-year when excluding all Ontario-based regions.“The overall Canadian market is healthier in 2017 than it has been in years, yet the downside risks are greater, too,” said Soper.“Our economy, which has recovered nicely from the 2014 oil crisis, is sadly dependent on moves by an unpredictable U.S. federal government and can be swayed by unforeseen global events, such as fallout from Europe’s restructuring. Still, housing activity is strong and prices are rising at a healthy mid-single-digit rate across the land. The trend in Alberta, Quebec and Atlantic Canada is particularly encouraging. Our concerns with the state of Canadian real estate begin and end in Toronto and Vancouver.” ", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:08.000+03:00"}]