[{"entities": {"organizations": [{"name": "8th u.s. circuit court of appeals", "sentiment": "none"}], "locations": [{"name": "arkansas", "sentiment": "none"}, {"name": "little rock", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "ark.", "sentiment": "none"}], "persons": [{"name": "kristine baker", "sentiment": "none"}, {"name": "baker", "sentiment": "none"}]}, "uuid": "da94dca7633d3a884c2c256a862edb7d83243362", "highlightText": "", "title": "Arkansas inmates ask appeals court to review part of ruling", "thread": {"site": "metronews.ca", "country": "CA", "participants_count": 1, "site_full": "www.metronews.ca", "section_title": "METRO NEWS | NEWS", "uuid": "da94dca7633d3a884c2c256a862edb7d83243362", "site_section": "http://www.metronews.ca/feeds.articles.news.rss", "domain_rank": 37932, "main_image": "http://www.metronews.ca/etc/designs/thestar/images/apple-touch.png", "performance_score": 0, "published": "2017-04-16T23:13:27.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg.iukx.1bvM7k3sm_pKFn98RozwXUxnNgOidMGd916cRzbM352SPVlQzhC_aQSRjFQdYHxIcuvnHKZzI71mzS6XB4bxg.YRQ57t_ZT1oSXDhAd_VuM0iZse0VsEZZSMCsBPN4FVP6hEjQ--", "title_full": "Arkansas inmates ask appeals court to review part of ruling", "title": "Arkansas inmates ask appeals court to review part of ruling", "site_type": "news", "social": {"stumbledupon": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "pinterest": {"shares": 0}, "gplus": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}}, "spam_score": 0.0, "site_categories": [], "replies_count": 0}, "language": "english", "published": "2017-04-16T23:13:27.000+03:00", "url": "http://omgili.com/ri/jHIAmI4hxg.iukx.1bvM7k3sm_pKFn98RozwXUxnNgOidMGd916cRzbM352SPVlQzhC_aQSRjFQdYHxIcuvnHKZzI71mzS6XB4bxg.YRQ57t_ZT1oSXDhAd_VuM0iZse0VsEZZSMCsBPN4FVP6hEjQ--", "ord_in_thread": 0, "crawled": "2017-04-16T23:13:27.000+03:00", "rating": null, "external_links": [], "highlightTitle": "", "author": "Staff - The Associated Press", "text": "Arkansas inmates scheduled for execution ask court to review Share on Facebook Share via Email Print This 2010 photo provided by the U.S District Court of Eastern District of Arkansas shows U.S. District Judge Kristine Baker. Baker, dealt another blow Saturday, April 15, 2017, to Arkansas' unprecedented plan to execute eight inmates in an 11-day period, saying the men have the right to challenge a drug protocol that could expose them to \"severe pain.\" (Dixie Knight Photography/U.S. District Court for the Eastern District of Arkansas via AP) By: Staff The Associated Press Published on LITTLE ROCK, Ark. — Arkansas inmates who had been set for execution in a series of double executions this month said Sunday that a federal appeals court should take up their claim that the compressed timetable would violate \"evolving standards of decency.\" U.S. District Judge Kristine Baker granted the inmates stays of execution on Saturday, but she rejected their arguments that too little time between executions violated their constitutional rights. Arkansas originally planned to execute eight inmates between Monday and April 27. Lawyers for the state appealed immediately with the hope of beginning the executions Monday. In its filing Sunday, the inmates' legal team said the 8th U.S. Circuit Court of Appeals should review Baker's decision to reject part of their arguments. The lawyers said it was wrong that Baker to say that the inmates \"did not establish a significant possibility of success on the merits on their claim that the compressed execution schedule is contrary to the evolving standards of decency.\" Baker had said that while the Supreme Court has made reference to evolving standards, particularly when \"punishments are so disproportionate as to be cruel and unusual,\" the Arkansas death row inmates were unlikely to prevail. The attorney general's office says it will respond to the filing after full arguments are put before the appeals court. A different federal judge has issued a stay for one of the eight condemned prisoners and the state Supreme Court has issued one for another inmate. The six remaining executions are on hold because of Baker's order and because a state circuit judge in Little Rock ordered the state to not use a lethal injection drug until questions are settled on how the state obtained it. That judge, Pulaski County Circuit Judge Wendell Griffen, has come under fire for taking part in anti-death penalty protests the same day after issuing his order stopping the use of the drug. Arkansas has asked that the state Supreme Court to reverse its decision halting the execution of Bruce Earl Ward, which was set for Monday. If it fails there, it can appeal to the U.S. Supreme Court. The state is also seeking to overturn Griffen's order regarding the state's supply of vecuronium bromide. The 8th Circuit could take up the appeal of Baker's order at any time. Any decision there would likely also be appealed to the U.S. Supreme Editors' Picks "}]