[{"uuid": "4149fe1e87440289fe4666e146e6570abefaf0e9", "url": "http://omgili.com/ri/.wHSUbtEfZQ_hzoWR1peZpdJYmMLmt8w6QiCoyNwU6F.XfDtzgcJ.Lz63LnmmXGGR7w8RttRlbJpwcGSM48qcw--", "title": "14 West of the Agora Companies: Graphic Design Specialist", "author": "", "rating": null, "published": "2017-04-18T23:24:57.000+03:00", "highlightText": "", "entities": {"organizations": [{"name": "agora financial / laissez faire / health", "sentiment": "none"}, {"name": "iris", "sentiment": "none"}, {"name": "css", "sentiment": "none"}, {"name": "customer service", "sentiment": "none"}, {"name": "agora financial", "sentiment": "none"}, {"name": "mainstream media", "sentiment": "none"}, {"name": "foundation", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "beltway", "sentiment": "none"}, {"name": "lower manhattan", "sentiment": "none"}], "persons": [{"name": "williams", "sentiment": "none"}, {"name": "illustrator", "sentiment": "none"}, {"name": "sam rayburn", "sentiment": "none"}, {"name": "wall street-washington", "sentiment": "none"}, {"name": "robert williams", "sentiment": "none"}]}, "highlightTitle": "", "thread": {"uuid": "4149fe1e87440289fe4666e146e6570abefaf0e9", "url": "http://omgili.com/ri/.wHSUbtEfZQ_hzoWR1peZpdJYmMLmt8w6QiCoyNwU6F.XfDtzgcJ.Lz63LnmmXGGR7w8RttRlbJpwcGSM48qcw--", "site_full": "authenticjobs.com", "title": "14 West of the Agora Companies: Graphic Design Specialist", "site_section": "http://authjo.bz/feeds/", "domain_rank": 75600, "published": "2017-04-18T23:24:57.000+03:00", "title_full": "14 West of the Agora Companies: Graphic Design Specialist", "participants_count": 0, "replies_count": 0, "spam_score": 0.0, "section_title": "AuthenticJobs.com Job Listings - All Listings", "site_type": "blogs", "social": {"vk": {"shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "stumbledupon": {"shares": 0}, "facebook": {"shares": 0, "likes": 0, "comments": 0}, "linkedin": {"shares": 0}}, "site_categories": [], "country": "BZ", "performance_score": 0, "main_image": "", "site": "authenticjobs.com"}, "external_links": [], "language": "english", "text": "Posted Yesterday   \nThe Graphic Design Specialist is responsible for designing and building sales letter landing pages using HTML and CSS to acquire subscribers. Additionally, they are responsible for conceptualizing, producing, managing, and optimizing graphic assets for use across landing pages, sales funnels, and ads. The person in this role works closely with the copywriter to conceptualize the graphic assets for landing pages and the layout of the page, and then implements these designs in our proprietary content hosting software according to best practices within the timeline of the project. \nBeyond designing, building, and testing the functionality of these pages, the person in this role collaborates closely with copywriters, designers, marketers, and web developers to conceptualize and build new front-end code variations for A/B and multivariate testing to enhance the user experience and drive an increase in sales. The ideal person for this role sees themselves primarily as a designer, but also a front-end developer and couples their skills with Adobe Illustrator and Photoshop with their working knowledge of HTML and CSS to implement their designs and seek to perpetually optimize the elements used across promotions. \nThe long-term goal of every Graphic Design Specialist is to join an idea franchise and work more closely with a specific division and their teams within Agora Financial, whether that’s Income, Technology, Macro Investing, etc. Responsibilities Seek to beat the “control” design elements for promos including order forms. Proactively collaborate with copywriters, developers, and/or video producers to define the message and specs for the graphic design and web development elements in a project. Master the use of our primary system to build landing pages. Design multiple iterations of design elements to optimize clarity and persuasiveness. Seek out feedback from copywriter, team members, and legal reviewers for graphic assets in a timely manner in order to allow for revisions and re-iterations. Deliver final assets to team members in a timely manner. Review and provide feedback regarding sales funnel pages. Manage an up-to-date and secure archive of all assets that is accessible to team members. Research and implement persuasion techniques to enhance designs. Proactively re-iterate control designs for a/b or multivariate testing. Proactively learn how to leverage other languages to streamline the development of pages as well as expand functionality and capability. Deliver projects in a timely manner in order to allow for feedback collection, testing, and revisions within the timeline of the project. Research and implement persuasion techniques to enhance designs. Seek to learn how to analyze testing data in order to draw insights for further optimization. Proactively seek to optimize current control designs. Stay abreast of best practices to improve UI/UX, streamline workflow, or test potential drivers of sales. Qualifications Photoshop, Illustrator, Indesign, Sublime/Atom/Dreamweaver, Foundation, using FTPs, CSS, and HTML. \nExpectations Become versed in all Agora Financial / Laissez Faire / Health division product lines and “control” promotions. Learn personnel and work flows. Specifically existing team and direct contacts in other. departments: Marketing, Copy, Web Development, and Customer Service. Learn naming conventions, storage of assets, and project management tools for the production of promos. Learn systems to build promos: IRIS, Wordpress. \nAbout Wall Street Daily \n“Truth” is hard to come by in nearly all facets of life. It’s particularly elusive when it comes to the Wall Street-Washington, D.C.-Mainstream Media nexus. The Masters, Stewards, and Heralds of Empire are allied in entertaining defense of the power elite in Lower Manhattan, inside the Beltway, and within the Mainstream Media. \nAround Wall Street Daily , “truth” is the way we do business. It’s the cornerstone supporting the investing philosophy of Founder and Publisher Robert Williams. \nAs Congressman Sam Rayburn of Texas once put it, “A jackass can burn down a barn, but it takes a carpenter to build one.” So Williams has assembled a hand-picked team of analysts and editors to research, write, and curate content that will shed light on the highly complex and often shadowy global financial and economic system. \nThis is a tough-minded team of data-driven decision-makers battle-hardened by working in the trenches during some of the most trying times in global market history. \nThe information we deliver will break your habit of following outdated ideas about wealth and wake you up to a new paradigm. Opportunity exists at all times – and we help you find the right markets. So at Wall Street Daily the Bull Market never ends. Our approach to analyzing markets includes finance, economics, and politics as well as history and psychology. We look at the market from the long and the short side and provide ideas to profit in both directions.", "ord_in_thread": 0, "crawled": "2017-04-18T23:24:57.000+03:00"}]